{"chunk_id": "DOC0034__00000", "doc_id": "DOC0034", "chunk_index": 0, "text": "Evaluation of released and pre-released upland rice (Oryza sativa L.) for drought\ntolerance at germination and early seedling stage\n\nAYO JOASH JOSHUA\nS21B26/027\n\nA FINAL YEAR RESEARCH PROJECT DISSERTATION SUBMITTED TO THE FACULTY OF\nAGRICULTURAL SCIENCE IN PARTIAL FULFILMENT OF THE REQUIREMENT FOR THE\nAWARD OF A BACHELOR OF AGRICULTURAL SCIENCE AND ENTREPRENEURSHIP AT\nUGANDA CHRISTIAN UNIVERSITY\n\nAPRIL 2025\n\nABSTRACT\nIn this study, evaluation of the effect of drought on germination and early seedling\ntraits, targeting both released and pre-released upland rice varieties for genotype\nidentification suitable to rainfed conditions in Uganda. Considering the susceptibility of\nupland rice to water stress at early growing stages, particularly in regions with low and\nerratic rainfall, this study was also designed to provide more information for breeding\nprograms, as well as policies aimed at promoting robust rice cultivation in these regions.\nThe study which was carried out at Uganda’s National Crops Resources Research\nInstitute (NaCRRI) applied a Split Plot arrangement under a Completely Randomized\nDesign evaluating fifteen rice genotypes at 5 levels of simulated drought stress using\nPolyethylene Glycol 6000 (PEG-6000) concentrations of: 0%, 5%, 10%, 15%, and 20%.\nGermination metrics (percentage, velocity index, mean germination time, and\nsynchrony) as well as early seedling parameters (shoot length, root length, fresh weight,\ndry weight, and drought injury scores) were evaluated. All germination and seedling\nperformance indices were significantly reduced by increasing PEG concentrations, with\nPEG 20 having the most adverse effect on plants. Under extreme stress, the released\nvarieties such as NamChe-5 had higher germination percentages (33.33%), the fastest\nmean germination time (4.88 days), the highest germination velocity index (3.28), and\nretained superior seedling dry weight (0.87 mg) and root length (2.47 cm), confirming\nits strong drought tolerance. However, some of these lines like UP-25(45) which were\npre-released compared with released top cultivars demonstrated better performance,\nindicating their potential for varietal release in near future. While the drought-sensitive\ncontrol IR64 demonstrated significantly lower responses in all parameters. The results\ndemonstrate that early-generation screening can identify lines that outperform in\ndrought environments, and pre-released genotypes offer potential for reducing yield\nlosses in Uganda's rainfed upland rice production systems. It is, therefore, critical to\nincorporate early-stage drought tolerance in breeding programs for sustainable rice\nproduction under climate variability.\n\ni\n\nDECLARATION\nI, AYO JOASH JOSHUA, declare that this Research Dissertation is submitted to the Faculty\nof Agricultural Sciences of Uganda Christian University Mukono is my original work.\nTherefore, it has never been submitted, documented, or communicated in any way to\nany academic institution in exchange for a degree or other educational credentials.\n\nii", "word_count": 426, "start_char": 0, "end_char": 3037}
{"chunk_id": "DOC0034__00001", "doc_id": "DOC0034", "chunk_index": 1, "text": "herefore, it has never been submitted, documented, or communicated in any way to\nany academic institution in exchange for a degree or other educational credentials.\n\nii\n\nAPPROVAL\nThis is to endorse that AYO JOASH JOSHUA has finalised his final year research and design\nproject under the supervision of the project supervisor and that the report has been\nsubmitted with the approval of the academic supervisor.\n\nMs. MILDRED JULIAN NAKANWAGI\n\niii\n\nTable Of Contents\nDECLARATION ...................................................................................... i\nAPPROVAL ......................................................................................... ii\nLIST OF TABLES .................................................................................... v\nLIST OF FIGURES ................................................................................. vi\nABBREVIATIONS .................................................................................. vii\nCHAPTER ONE ...................................................................................... 1\n1.1 INTRODUCTION ............................................................................. 1\n1.2 BACKGROUND .............................................................................. 1\n1.3 PROBLEM STATEMENT ..................................................................... 2\n1.4 PURPOSE OF STUDY ....................................................................... 3\n1.5 MAIN OBJECTIVE ........................................................................... 3\n1.6 SPECIFIC OBJECTIVES ..................................................................... 3\n1.7 HYPOTHESIS ................................................................................ 3\n1.8 JUSTIFICATION ............................................................................. 4\n1.9 SIGNIFICANCE ............................................................................... 4\n1.10 CONCEPTUAL FRAMEWORK OF THE STUDY ......................................... 5\nCHAPTER TWO ..................................................................................... 6\nLITERATURE REVIEW ........................................................................... 6\n2.1 Taxonomy, Botany and Agronomic practices of Rice ............................. 6\n2.4 Visual Scoring .......................................................................... 12\n2.5 Drought Tolerance Mechanisms in Upland rice .................................. 12\nCHAPTER THREE ................................................................................. 16\nMETHODOLOGY ............................................................................... 16\n\niv\n\n3.1 Study 1: Effect of drought on germination rates of the upland rice\nvarieties. .................................................................................... 16\n3.2 Study 2: Effect of drought on early seedling stage of the upland rice\nvarieties. .................................................................................... 19\nChapter 4 ......................................................................................... 21\nResults .......................................................................................... 21\n4.1 Mean Germination Time (MGT) ....................................................... 21\n4.2 Germination Percentage (GP) ......................................................... 22\n4.3 Germination Velocity Index (GVI) .................................................... 24\n4.4 Germination Synchrony ................................................................ 25\n4.5 Seedling Drought Stress Score ........................................................ 27\n4.6 Seedling Fresh Weight .................................................................. 28\n4.7 Seedling Dry Weight ..................................................................... 29\n4.8 Seedling Root Length ................................................................... 30\n4.9 Total Seedling Length (Shoot + Root Length) ...................................... 32\nChapter 5 ......................................................................................... 34\n5.1 Discussion for objective 1 ............................................................. 34\n5.2 Discussion for objective 2 ............................................................. 35\nChapter 6 ......................................................................................... 37\n6.1 Conclusion ................................................................................ 37\n6.2 Recommendations ....................................................................... 37\nAPPENDIX ...................................................................................... 39\nREFERENCES ................................................................................... 52\n\nv", "word_count": 322, "start_char": 2869, "end_char": 7740}
{"chunk_id": "DOC0034__00002", "doc_id": "DOC0034", "chunk_index": 2, "text": "LIST OF TABLES\nTable 1 Mean Germination Time under different drought stress levels .................. 21\nTable 2 Germination Percentage under varied levels of PEG .............................. 23\nTable 3 Germination Velocity Index of rice varieties under varied drought stress ..... 24\nTable 4 Germination Synchrony of Rice varieties under varied drought stress levels . 26\nTable 5 Seedling Drought Score of Rice varieties under varied drought stress levels .. 27\nTable 6 Seedling Fresh Weight of Rice varieties under varied drought stress levels .. 28\nTable 7 Seedling Dry Weight of Rice varieties under varied drought stress levels ..... 29\nTable 8 Seedling Root Length of Rice varieties under varied drought stress levels .... 31\nTable 9 Total Seedling Length of Rice varieties under varied drought stress levels .... 32\nTable 10 The Released and Pre-released rice varieties .................................... 40\nTable 11 Standard Evaluation System (SES) for rice (IRRI, 2021) ......................... 40\n\nvi\n\nLIST OF FIGURES\nFigure 1 The Conceptual framework of the study............................................. 5\nFigure 2 Confirmation letter from NaCCRI ................................................... 39\nFigure 3 Mean Germination Time under different drought stress levels ................. 41\nFigure 4 Germination Percentage under varied levels of PEG ............................. 41\nFigure 5 Germination Velocity Index of rice varieties under varied drought stress .... 42\nFigure 6 Germination Synchrony of Rice varieties under varied drought stress levels 43\nFigure 7 Seedling Drought Score of Rice varieties under varied drought stress levels 44\nFigure 8 Seedling Fresh Weight of Rice varieties under varied drought stress levels .. 44\nFigure 9 Seedling Dry Weight of Rice varieties under varied drought stress levels .... 45\nFigure 10 Seedling Root Length of Rice varieties under varied drought stress levels . 45\nFigure 11 Total Seedling Length of Rice varieties under varied drought stress levels . 46\nFigure 12Model of the Plant Growth chamber ............................................... 47\nFigure 13 Polyethylene Glycol 6000 ........................................................... 47\nFigure 14 Counting seeds in the Growth Chamber .......................................... 48\nFigure 15 Working in a Biosafety Cabinet in the Lab ....................................... 48\nFigure 16 Weighing the PEG for dissolution .................................................. 49\nFigure 17 Seedling in a Petri dish .............................................................. 49\nFigure 18 Project timeline ...................................................................... 51\n\nvii\n\nABBREVIATIONS\nIRRI\nInternational Rice Research Institute\nNaCRRI\nNational Crops Resources Research Institute\nGVI\nGermination Velocity Index\nMGT\nMean Germination Time\nGS\nGermination Synchrony\nGP\nGermination Percentage\nMAS\nMarker-assisted selection\nSES\nStandard Evaluation System\nPEG\nPolyethylene glycol\nQTL\nQuantitative Trait Locus\nCRD\nComplete Randomised Design\nNERICA\nNew Rice for Africa\nMT\nMetric Tonne\nmg\nmilligram\n\nCHAPTER ONE", "word_count": 415, "start_char": 7740, "end_char": 10883}
{"chunk_id": "DOC0034__00003", "doc_id": "DOC0034", "chunk_index": 3, "text": "1.1 INTRODUCTION\n1.2 BACKGROUND\nRice (Oryza sativa L.) is a very important food crop worldwide, feeding more than half\nof the global population (FAO, 2020). It becomes 50%–80% of daily energy intake for\naround 3 billion people, and an important source of several nutrients/micronutrients–\nenergy, fibre, proteins, vitamins (Ndikuryayo et al., 2023). Estimate data of the world\nrice production in 2019 are about 756 million metric tons cultivated in 164 million\nhectares, ranking rice as the third most produced agricultural crop after sugarcane and\nmaize (Ndikuryayo et al., 2023). Africa generated about 37.9 million metric tons from\nan area of 17.2 million hectares (FAO, 2021).\nIn the East Africa n region, Tanzania is leading in production and consumption, whereas\nKenya and Uganda come in next, and all the other countries have production shortage\nand inflow of imports (Lamo et al., 2025). There are three main production systems of\nrice in Uganda, upland (rainfed), rainfed lowland and irrigated wetland; where upland\nsystem contributes almost 40% of the national production (Samudin 2023). Domestic\nproduction is about 730,000 metric tonnes but consumption is about 1,220,000 metric\ntonnes. This gap has been compensated by imports, which cost the country\napproximately USD60 million per year (FAO, 2023). The crop has showed a low yield in\nthe site and, to increase local production of rice, several improved upland rice varieties\nhave been released in the country including NERICA (New Rice for Africa) and “NamChe”\nvarieties (Lamo et al, 2025). These cultivars have traits which make them favourable\nto farmers, namely substantially greater yields and improved stress tolerance.\nDrought stress is an important abiotic factor limiting the production of upland rice in\nUganda (Malemba et al., 2017) and the crop has been reported to be highly susceptible\nto water stress during early seedling development, during the vegetative stage, and at\nanthesis (reproductive) stage (Roy et al., 2021). Breeding and screening efforts so far", "word_count": 316, "start_char": 10883, "end_char": 12921}
{"chunk_id": "DOC0034__00004", "doc_id": "DOC0034", "chunk_index": 4, "text": "rought stress is an important abiotic factor limiting the production of upland rice in\nUganda (Malemba et al., 2017) and the crop has been reported to be highly susceptible\nto water stress during early seedling development, during the vegetative stage, and at\nanthesis (reproductive) stage (Roy et al., 2021).B\n\nreeding and screening efforts so far\n\nhave focused on vegetative and reproductive stages, but erratic rainfall patterns are a\nreality in many locations, with frequent failures to establish successful crops due to\ninadequate rainfall (Made et al., 2022). Weakened during germination and the\nformative stage of the seedling, this vulnerability plays a significant role in the failure\nof crops (Obura & Lamo, 2024). We know that rice varieties that can withstand early\nwater stress usually have better rooting systems, better osmotic adjustment, better\nwater use efficiency and better activation of stress specific genes, which all of them\nlead to a vigorous crop establishment and finally high yield (Ndikuryayo et al., 2022).\nInsufficient water supplied during the seedling period, on the other hand, reduces stand\nuniformity that will cause serious yield loss (Roy et al. 2021). Thus, identification of\nthese drought tolerant genotypes at these early growth stages is a valuable approach\nto improving rice production under rainfed conditions significantly (Ndikuryayo et al.,\n2023)\n\n1.3 PROBLEM STATEMENT\n\nUpland rice varieties grown without irrigation are particularly susceptible to drought\nstress in the germination and early seedling stages—a sensitivity that could reduce yield\nby as much as 50% (Langangmeilu et al., 2023). As nearly 40% of Uganda's rice-growing\narea depends on rainfed agriculture, these areas are highly vulnerable to water deficit\n(Hong et al., 2021). Climate change has increased climate variability which has led to\nboth severe and extreme drought periods resulting in a drop in rice production (Uganda\nBureau of Statistics, 2023) that can indeed threaten food security in 2023. Prior efforts\nhad been undertaken such as releasing drought resistant varieties like NERICA and\nagronomic improvement (Lamo et al., 2025) Nonetheless, there is a knowledge gap\nrelated to the germination and early seedling drought tolerance of released and prerelease upland rice varieties as most previous work has been done on a later growth\nstage (Roy et al., 2021). Filling this gap will allow for more drought resilient\n\nidentification, breeding strategies, and ultimately support sustainable livelihoods for\nUgandan rice farmers.", "word_count": 386, "start_char": 12573, "end_char": 15126}
{"chunk_id": "DOC0034__00005", "doc_id": "DOC0034", "chunk_index": 5, "text": "illing this gap will allow for more drought resilient\n\nidentification, breeding strategies, and ultimately support sustainable livelihoods for\nUgandan rice farmers.\n\n1.4 PURPOSE OF STUDY\nDespite the above-described studies, few released, and pre-release upland rice (Oryza\nsativa L.) varieties have been evaluated with respect to their capacity for drought\ntolerance during the germination and early seedling phase to identify those with\nsuperior resistance. It aims also to develop essential information for breeding programs\nfocused on increasing drought resistance in upland rice, which can benefit food\nsecurity in Uganda in the long run (Domingo et al., 2023).\n\n1.5 MAIN OBJECTIVE\nThe main research objective was to identify upland rice genotypes with significant\ndrought tolerance that can be incorporated into breeding programs in Uganda.\n\n1.6 SPECIFIC OBJECTIVES\n1. To assess germination parameters of released and pre-released upland rice\nvarieties under controlled drought conditions.\n2. To evaluate the early seedling growth parameters of the rice varieties under\ncontrolled drought conditions.\n\n1.7 HYPOTHESIS\n1. There is no significant difference in the germination parameters among released\nand pre-released upland rice varieties under controlled drought conditions.\n2. There is no significant difference in the early seedling growth parameters among\nreleased and pre-released rice varieties under controlled drought conditions.\n\n1.8 JUSTIFICATION\nThe increasing severity and frequency of droughts in Uganda pose a significant threat\nto rice production and national food security (UBOS, 2023) that makes this research\ntimely and critical. As upland rice is predominantly rainfed, it is particularly vulnerable\nto erratic rainfall and extended dry periods. Choosing rice varieties tolerant to water\ndeficit leading to crop establishment critical events, i.e. germination and early\nseedling development, is proposed among these success factors particularly to retain\nestablishment in marginal areas with variable distribution of rainfall (Langangmeilu et\nal., 2023; Samudin, 2023). Improving tolerance to drought by this time would be a\ntargeted response to impending climate pressures: If this fast-growing and faster early\nstages would be better at coping with stress later in life, they could cope with what\nlies ahead better as they grow. The initial growth response to limited water has yet to\nbe fully explored, despite earlier studies that have largely concentrated on later\ndevelopmental events (Roy et al., 2021). This study aims to bridge this gap by providing\ncritical information on drought resilience in early-generation materials, which can be\nused to inform breeding and management strategies for upland rice systems exposed to\ndrought.", "word_count": 399, "start_char": 14962, "end_char": 17725}
{"chunk_id": "DOC0034__00006", "doc_id": "DOC0034", "chunk_index": 6, "text": "his study aims to bridge this gap by providing\ncritical information on drought resilience in early-generation materials, which can be\nused to inform breeding and management strategies for upland rice systems exposed to\ndrought.\n\n1.9 SIGNIFICANCE\nThis research intends to serve several parties. Ugandan rice farmers will receive access\nto drought - resistant cultivars that improve crop establishment and grain yield under\nwater-limited conditions. Using the discoveries of drought-response traits will enable\nplant-breeders to use the advanced techniques of breeding programs, he added. The\nagricultural extension services and policymakers will access evidence-based\ninformation for the dissemination of sustainable agricultural practices, as well as the\nacademic and scientific communities through improved methodologies and deeper\n\nunderstanding of plant stress physiology with potential applications to other crops and\nregions (Domingo et al., 2023; Shah et al., 2024)\n\n1.10 CONCEPTUAL FRAMEWORK OF THE STUDY\n\nFigure 1 The Conceptual framework of the study\n\nCHAPTER TWO\nLITERATURE REVIEW", "word_count": 152, "start_char": 17498, "end_char": 18588}
{"chunk_id": "DOC0034__00007", "doc_id": "DOC0034", "chunk_index": 7, "text": "2.1 Taxonomy, Botany and Agronomic practices of Rice\nRice is a member of the Poaceae family. Taxonomically, it belongs to Kingdom Plantae,\nPhylum Tracheophyta, Class Liliopsida, Order Poales, Family Poaceae, Genus Oryza\n(Kush 1997). Rice crops are primarily of the Oryza sativa (Asia) and Oryza glaberrima\n(West Africa) species (Zhang et al., 2022). 80% of all genetic material in Triticeae are\ncommon, however, which indicates that although there may be differences in genetic\naspects, environmental adaptation, and a few aspects of agronomy, Triticeae is\nprimarily grown for the grain (Zhang et al., 2022). It is characterized as an annual grass\nwith a fibrous root system and long narrow leaves that are arranged alternately on a\nhollow stem (Kumar et al., 2020). The flowering structure is a terminal panicle that\ncan be bearing many spikelets and each one contains one to three florets per florets\nthat is self-pollinating. The edible seed vary between cultivars in shape, size, and\nquality (Samudin, 2023).\nRice is grown in a variety of ecosystems, each necessitating specific management\npractices. They include irrigated lowland paddies, rainfed lowlands, upland (aerobic)\nfields and deep-water or flood-prone areas. Successful management of soil fertility,\nwater, pests, and diseases, and better varieties through breeding are also needed for\nthese environments (Shah et al., 2024). In irrigated lowlands, continuous flooding is\nkept by either continuous water supply or controlled irrigation schedules, whereas for\nupland rice, no standing water is present, which means that water conservation\ntechniques and drought-resistant varieties are vital (Ndikuryayo et al., 2023).\nHowever, lowland rice production in Uganda and comparable tropical countries is\nfocused on irrigated or wetland areas including valley bottoms or riverbanks, since\navailability of abundant water places highland rice under high plant cover and ensures\nhigh yield. While many cultivars of Oryza sativa do well here, high water demands,", "word_count": 302, "start_char": 18588, "end_char": 20604}
{"chunk_id": "DOC0034__00008", "doc_id": "DOC0034", "chunk_index": 8, "text": "owever, lowland rice production in Uganda and comparable tropical countries is\nfocused on irrigated or wetland areas including valley bottoms or riverbanks, since\navailability of abundant water places highland rice under high plant cover and ensures\nhigh yield.W\n\nhile many cultivars of Oryza sativa do well here, high water demands,\n\ncostly irrigation infrastructure, soil salinity, and weed infestations in paddies present\nchallenges (Zhang et al., 2023). Moreover, regular flooding can increase how much\nmethane is released, causing environmental problems. Drought stress during critical\ngrowth stages may occur in rainfed lowland rice, which depends on the natural rainfall\nto stay flooded.\nSimilarly, upland rice—grown on well-drained, non-flooded soils that are often on\nmountains and plateaus—relies entirely on rainfall and is typically grown by\nsmallholder farmers as a replacement for traditional cereals. In Asian NERICAs (New\nRice for Africa), interspecific hybrids between O. sativa and O. glaberrima, their\ngenetically interrelatedness optimizes upland rice potential, combining high yield\npotential with durability and drought tolerance. Uganda, with its varied topography,\nbenefits from both available NERICAs and improved upland varieties under rainfed\nproduction conditions that lead to high yield (Ndikuryayo et al., 2022).\nPerennial rice is a recent breakthrough production in rice cultivation. While traditional\nannual types have to be planted again every season, perennial rice grows back with the\nsame root system in successive seasons, thereby lowering labour and input costs of land\npreparation and planting. Some perennial lines, derived through hybridization between\nannual rice and its wild perennial relatives, have been harvested for 4–8 consecutive\nseasons with little loss in yield, hypothesized to provide savings of up to 60% in labour\nand requiring less seed and fertilizer (Zhang et al., 2023). Uganda is testing perennial\nrice varieties on an experimental basis, which may provide the added benefit of saving\nlabour while also improving the health of the soil by maintaining continuous ground\ncover. When the climate is changing at an unprecedented pace, the addition of\ninnovations perennially in rice, along with improved agronomic practices, becomes\nessential to ensure food security and environmental resilience, notwithstanding the\nthreats made by broad seating, disease resistance, and competitive performance.\nTwo cultivars of NamChe, developed through national breeding programs with support\nfrom AfricaRice, are widely grown in Northern Uganda with yields ranging from 3000–\n4000 kg/ha under rainfed upland production systems (Hong et al., 2021). They are", "word_count": 389, "start_char": 20271, "end_char": 22972}
{"chunk_id": "DOC0034__00009", "doc_id": "DOC0034", "chunk_index": 9, "text": "wo cultivars of NamChe, developed through national breeding programs with support\nfrom AfricaRice, are widely grown in Northern Uganda with yields ranging from 3000–\n4000 kg/ha under rainfed upland production systems (Hong et al., 2021).T\n\nhey are\n\nappreciated for their drought tolerance, yield potential, and mild aroma suitable for\nlocal market demands (Hong et al., 2021). On the other hand, some NERICA varieties\nhave good drought resistance, whereas others are sensitive to stress and susceptible\nto foliar diseases. The accuracies of both released and emerging cultivars are still\ncarried out for the farmers for high yielding, drought resistant options.\nOngoing challenges to rice production such as water scarcity, irregular rainfall,\ndeclining soil fertility, and pest and disease pressures have spurred the development of\nintegrated management and breeding innovations. To mitigate these problems, better\nwater management practices like controlled irrigation and soil moisture conservation,\nas well as nutrient management implementing the use of organic amendments and\ntargeted fertiliser regimes have been adopted (Shah et al., 2024). Simultaneously,\nNERICA and NamChe series-focused breeding programs for drought-tolerant and\ndisease-resistant cultivars have substantially improved crop adaptability under harsh\nconditions (Hong et al., 2021; Ndikuryayo et al., 2022).\n\n2.2 Drought Stress and Its Effects on Upland rice\nHowever, lack of water at germination and early seedling establishment competes for\ncrop establishment and subsequently leads to the full establishment of the yield.\nDrought impedes key physiological processes ranging from water uptake and cell\ndivision to metabolism that lead to morphological differences like delayed or reduced\ngermination, stunted growth in seedlings, and decreased accumulation of biomass\n(Dong et al., 2025). Such as a deficit of water can negatively impact on seed imbibition,\nresulting in ineffectiveness germination and inconsistency emergence (Hem et al.,\n2021). In the seedling phase, the shortage of water reduces cell extension and growth\nresulting in reduced shoots and root, smaller leaf area and reduced photosynthetic\ncapacity. Also, decreased transpiration in such conditions would negatively impact\nnutrient uptake, adding another layer of growth limitation (Made et al., 2022). In", "word_count": 334, "start_char": 22725, "end_char": 25075}
{"chunk_id": "DOC0034__00010", "doc_id": "DOC0034", "chunk_index": 10, "text": "n the seedling phase, the shortage of water reduces cell extension and growth\nresulting in reduced shoots and root, smaller leaf area and reduced photosynthetic\ncapacity.A\n\nlso, decreased transpiration in such conditions would negatively impact\nnutrient uptake, adding another layer of growth limitation (Made et al., 2022).I\n\nn\n\nsevere situations, drought after germination can lead to seedling death, threatening\nstand establishment.\nIn upland rice systems where fields are not intentionally flooded maintaining sufficient\nsoil moisture is an ongoing struggle. Even short dry periods can be stressful, with lasting\nimpacts that contribute to incomplete recovery when it rains again. The yield\nreductions due to drought can differ significantly depending on the severity and\nduration of the stress and might range from 30% to 80%. Upland rice varieties, such as\nsome of the select NERICAs, or improved lines developed in-country with inherent\ndrought tolerance (Lamo et al., 2025; Ndikuryayo et al., 2023), suffer less from stress\nthan do the sensitive lines—experiencing yield reductions of approximately 20–40%\nunder stress (vs yield reductions > 60% for sensitive lines) (Ndikuryayo et al., 2022).\nFor example, climate studies in East Africa have found that early-season drought stress\ncan reduce yields of moderately tolerant genotypes by 35–50% and of highly susceptible\nones by more than 70%.\nRice plants also have mechanisms to resist drought at the cellular level. The main\nresponse involved is osmolyte accumulation, for example proline, soluble sugars,\nglycine betaine, which serves to maintain turgor by reducing osmotic potential and\nprotecting cellular structure (Dong et al., 2025). Also, rice boosts its antioxidative\nprotectors by increasing the levels of the enzyme’s superoxide dismutase, catalase, and\nperoxidases that diminish the harm by the reactive oxygen species produced under\nstress (Dong et al., 2025; Nagai et al., 2024). Phytohormone alterations, especially\nelevated levels of abscisic acid (ABA), induce stomatal closure to reduce water loss\nand stimulate stress-responsive genes. Changes in membrane lipid composition also\nhelp stabilize cell membranes under drought stress (Dong et al., 2025).\nMorphological adaptations are another important aspect in drought tolerance and it\nplays a pivotal role. The extensive root system, for instance, allows upland rice\ngenotypes to access moisture from deeper soil layers in dryland environments, where\nthe topsoil dries quickly (Zheng, 2025) rules. Drought tolerance in rice is a complex\ntrait that includes efficient water uptake, conservative water use, osmotic adjustment,", "word_count": 388, "start_char": 24747, "end_char": 27396}
{"chunk_id": "DOC0034__00011", "doc_id": "DOC0034", "chunk_index": 11, "text": "he extensive root system, for instance, allows upland rice\ngenotypes to access moisture from deeper soil layers in dryland environments, where\nthe topsoil dries quickly (Zheng, 2025) rules.D\n\nrought tolerance in rice is a complex\ntrait that includes efficient water uptake, conservative water use, osmotic adjustment,\n\nreactive oxygen species detoxification, hormonal regulation, and growth plasticity\n(Zheng, 2025). It is hence critical to evaluate drought tolerance during germination and\nearly seedling growth, as failure to establish in these life stages can preclude\nsuccessful establishment of the crop (Dong et al., 2025).\nMorpho-physiological indices including germination percentage, Germination Velocity\nIndex (GVI), seedling shoot and root lengths and biomass accumulation, are employed\nin quantifying drought responses (Nagai et al., 2024). For example, one can compute a\ndrought susceptibility index by comparing germination percentages under varying levels\nof stress and those under optimal conditions, while a high GVI under drought suggests\na rapid and robust germination response to the limitations imposed by water availability\n(Islam et al., 2018). The plant is incapable of recovering its total number of tillers and\nbiomass after just a short period of drought lasting of 10–14 days after sowing which\nhas been demonstrated to cause large concomitant declines in yield (Ndikuryayo et al.,\n2022). By contrast, some varieties escape drought damage by entering a quiescent state\nduring early stress, allowing them to mend rapidly in the event of a moisture pulse.\n\n2.3 Polyethylene Glycol Induced Osmotic Stress\nSimulating Controlled drought conditions that mimic drought stress allow us to better\nunderstand plant responses to abiotic stress in much more detail compared to in-field\nstudies, enable screening of large numbers of genotypes so that genotypes with more\ndrought-tolerant traits can be selected (Kadir et al. 2023). One common approach for\nthis is the induction of osmotic stress via polyethylene glycol (PEG). Poly Ethylene\nGlycol (PEG) acting as an inert polymer with high molar mass contents when they\ndissolve in water, the result of this solvent-attached dry state, in fact, declines the\nsolution's water potential, for example, drought stress applied without toxicity reaction\nsince it could not be taken up by the plants due to its high molecular weight such that\nthe PEG entry into plants is significantly lower than the water (Islam et al., 2018; Made\net al., 2022).", "word_count": 378, "start_char": 27079, "end_char": 29585}
{"chunk_id": "DOC0034__00012", "doc_id": "DOC0034", "chunk_index": 12, "text": "Peg-induced stress for inducing appearance of autophagy. These can be done easily in\npetri dishes, germination trays or hydroponic systems, where equal stress conditions\ncan be provided across all samples (Purbajanti et al., 2019). The ability to fine-tune\nthe PEG concentration allows researchers to establish a desired osmotic potential (e.g.,\n−0.5 MPa to replicate moderate drought), something that is difficult to accomplish in\nfield conditions because of soil heterogeneity and weather changes. PEG enables highthroughput screening of many genotypes under uniformly controlled conditions, making\nit a valuable tool for early-generation selection in breeding programs (Goraguddi et al.,\n2023).\nHowever, PEG-induced stress does not accurately reflect the complex nature of field\ndrought in which water deficits emerge gradually and are dependent on soil properties\nand microenvironmental conditions. Although PEG treatments are most effective\nduring early growth stages, PEG is less appropriate for mimicking drought during later\ndevelopmental periods. In fact, natural drought is a complex of wet periods to dry and\nre-wet cycles, which only cause relative stress unlike PEG, which applies continuous\nstress. Nevertheless, data demonstrates that genotypes of rice with good performance\nin PEG-induced stress also establish better under field conditions that include dry\nsowing (Purbajanti et al., 2019).\nPEG-induced osmotic stress will be applied in this experimentation to simulate drought\nduring germination and early seedling growth. Utilized known concentrations (additive\nof 15% or 20% PEG-6000) will be used for consistent water stress environment. Seeds\nwill be placed on damp filter paper or onto agar media, saturated the with PEG solution\nor water (the control), and the differences in germination rates recorded\nsystematically (Goraguddi et al., 2023). Likewise, young seedlings will be grown in\nnutrient solutions with PEG and measured for root and shoot growth. PEG-mediated\nosmotic stress, in conjunction with other screening techniques serves as a quick and\nreproducible method to determine the drought tolerance profiles of genotypes\n(Gaurana-Nuñez, 2024).", "word_count": 312, "start_char": 29585, "end_char": 31761}
{"chunk_id": "DOC0034__00013", "doc_id": "DOC0034", "chunk_index": 13, "text": "ikewise, young seedlings will be grown in\nnutrient solutions with PEG and measured for root and shoot growth.P\n\nEG-mediated\nosmotic stress, in conjunction with other screening techniques serves as a quick and\nreproducible method to determine the drought tolerance profiles of genotypes\n(Gaurana-Nuñez, 2024).\n\n2.4 Visual Scoring\nVisual scoring Visual scoring allows a rapid and qualitative measure of plant response\nto drought through the study of the expressed symptoms. Drought stress symptoms in\nrice and other crops are normally characterized by rolling, drying, wilting of leaves,\nand general reduction in vigour and greenness (Islam et al., 2018). The International\nRice Research Institute (IRRI) has developed a Standard Evaluation System (SES) that\nemploys a numerical scale (generally from 0 to 9), with lower values reflecting few\nsymptoms and higher numbers indicating more intense stress.\nDrought stress is monitored periodically from visual assessments under controlled\nconditions. For instance, during the seedling stage, leaf rolling may be rated from 1\n(fully turgid, no rolling) to 5 (full rolling). Leaf drying usually is expressed either as\nproportion of affected area or categorical score with respect to degree of dehydration.\nWhile wilting is more subjectively scored by the loss of turgor, visual scoring can be\nparticularly advantageous in field trials where complex measurements such as direct\nwater potential are impractical. As it is a qualitative subject, these evaluations require\nstandardization with appropriate training and reference images (Islam et al., 2018).\nToday, computer vision and machine learning methods are widely used to complement\ntraditional visual scoring through conversion of digitalised images of tissues into\nquantitative stress parameters. The shifts in leaf colour, angles and overall plant size\ncan be quantitatively assessed and converted into stress scores. Although moderate\nresponses, such as leaf rolling, can be adaptive, nuanced responses (e.g. severe leaf\ndrying) indicate damage, so visual scoring systems usually give special emphasis to\nstress-indicating symptoms (Awasthi et al., 2019).\n\n2.5 Drought Tolerance Mechanisms in Upland rice\nUpland rice genotypes possess several adaptive mechanisms to cope with the waterlimited conditions. Full elucidation of these mechanisms is important for breeding", "word_count": 342, "start_char": 31453, "end_char": 33818}
{"chunk_id": "DOC0034__00014", "doc_id": "DOC0034", "chunk_index": 14, "text": "ull elucidation of these mechanisms is important for breeding\n\nprograms that want to enhance drought tolerance (Ndikuryayo et al., 2023; Shah et al.,\n2024). For dry conditions, there are broad plant responses that include traits of escape,\navoidance, tolerance, and recovery, and the range is primarily focused on avoidance\nand within-tolerance mechanisms for upland rice.\nOn the level of morphology, crucial traits in drought avoidance are the development of\na deep root system. Drought-tolerant varieties of rice typically develop larger and\ndeeper root systems, enabling access to moisture in subsoil layers—an important trait\nfor crops in upland settings, where soil at the surface can dry out quickly (Zheng, 2025).\nStomatal regulation is also important; drought-tolerant plants tend to close stomata\nearlier or more effectively to minimize water loss at the expense of replication\n(growth) and photosynthesis (Kadir et al., 2023). Osmotic adjustment, which is driven\nby osmolyte accumulation, e.g. proline and soluble sugars, assists in retaining water\nand maintaining turgor in cells at low external water potential (Made et al., 2022).\nAt both the biochemical and molecular levels, rice activates numerous droughtresponsive genes and pathways. Hormonal signals, especially in the case of abscisic acid\n(ABA), and the involvement of transcription factors like DREB are crucial in controlling\nthese responses. Aquaporins, which facilitate water transport, and protective proteins,\nsuch as late embryogenesis abundant (LEA) proteins, also help cells be more resilient.\nUpregulation of antioxidant enzymes such as superoxide dismutase and catalase also\ncounters oxidative stress (Aggarwal et al., 2025; Dong et al., 2025). New strategies,\nincluding seed priming and leaf-plication of silicon or silica nanoparticles are effective\nfor inducing drought tolerance by modulating redox signalling and fortifying cell walls\n(Kang et al., 2025).\nSeveral QTL mappings and genome-wide association studies have demonstrated the\nfirst identified regions in the rice genome that contribute to drought tolerance.\nImportantly, the QTLs like the qDTY loci have been introgressed into popular cultivars,\nimproving drought performance without sacrificing yields under favourable conditions\n(Srividya et al., 2011). NERICA varieties are a great example of how genetic diversity is\nput to good use, leading to the combining of advantageous traits of both O. sativa and\n\nO. glaberrima leading to early vigour, competitive ability against weeds and superior\ndrought resilience. Another important trait seen in some tolerant genotypes was the\nability to recover from drought after plants can grow new leaves once the stress is\nremoved (Kadir et al., 2023).", "word_count": 401, "start_char": 33757, "end_char": 36495}
{"chunk_id": "DOC0034__00015", "doc_id": "DOC0034", "chunk_index": 15, "text": "nother important trait seen in some tolerant genotypes was the\nability to recover from drought after plants can grow new leaves once the stress is\nremoved (Kadir et al., 2023).\n\n2.6 Strategies for incorporating drought tolerance into rice breeding programs\nDrought tolerance, especially for upland rice systems, is a major target of breeding\nprograms aimed at rainfed ecosystems. Divergent approaches are used to introduce\ndrought-resilient traits into new rice varieties. Dedicated methods, including\nlaboratory germination assays utilizing PEG-induced stress and seedling vigour testing\nunder unirrigated conditions, have been established to identify cultivars that can\nquickly and robustly take their establishment under early drought conditions (Siddique\net al., 2023). These approaches seek to maintain stable yield with minimal trade-offs\nsuch as low yield under optimal conditions; for example, the drought susceptibility\nindex (DSI) is an indicator commonly used by breeders when selecting for lines\nassociated with minimal yield loss under stress.\nAspects of these strategies are supported through collaborative work on the\ninternational stage, which encompasses organizations such as IRRI and AfricaRice that\ncan promote sharing of promising germplasm and multi-location testing. Such\npartnerships are vital to developing climate-resilient rice varieties — a requirement for\nglobal food security as the threat of water scarcity looms (Ndikuryayo et al., 2023).\nDrought tolerance improvement in rice through breeding is complex but still feasible\nby taking advantage of traditional and novel genomic and phenotyping technologies.\nDiverse germplasm was evaluated, hybridization strategies, marker-assisted selection\nand genomic selection were employed, biotechnological advances were made, and\nparticipatory breeding approaches were adopted in the development of drought\nresistant upland rice with yield stability. This work, and its extensive testing in the\n\nfield, has far reaching consequences in that it helps separate genetic make-up from the\nresponse of a plant to its environment, providing greater assurance that rice, the staple\nmost consumed by hundreds of millions, remains dependable and productive in regions\nthat are likely to experience ever-water-scarcer conditions (Ambikabathy et al., 2019).\n\nCHAPTER THREE\nMETHODOLOGY\n\n3.1 Study 1: Effect of drought on germination rates of the upland rice varieties.\n3.1.1 Study location\nThe experiment was done in a seed laboratory of NaCRRI located at Namulonge, Wakiso\nDistrict approximately 25 km northwest of Kampala. Namulonge is located within\nUganda’s central Agro-ecological zone, which is characterized by tropical, equatorial\nclimatic conditions with bimodal rainfall and an annual average precipitation of\nbetween 1,000 and 1,500 mm. The region’s typical temperature of 20°C to 28°C and\nenvironmental context found in the laboratory under a more controlled condition\nprovide the relevant field condition under which upland rice is grown and therefore,\nthe significance and applicability of the experimental results to the agronomic practices\nfound in Uganda.", "word_count": 443, "start_char": 36319, "end_char": 39450}
{"chunk_id": "DOC0034__00016", "doc_id": "DOC0034", "chunk_index": 16, "text": "he region’s typical temperature of 20°C to 28°C and\nenvironmental context found in the laboratory under a more controlled condition\nprovide the relevant field condition under which upland rice is grown and therefore,\nthe significance and applicability of the experimental results to the agronomic practices\nfound in Uganda.\n\n3.1.2 Planting materials\nThe study will use fifteen rice genotypes that will be sourced from the rice breeding\nprogram at National Crops Resources Research Institute (NaCRRI). The seeds we\nharvested in January 2025 and stored at a temperature of 40C in the Cereals seed bank.\nThe experiment has a susceptible check which is IR64 (Cruz et al., 2018). Within the\nNERICA series, NERICA-4 (released in 2002) is recognised for its early vigor and stable\nyield under rainfed conditions, establishing it as a benchmark for upland performance\n(Somado et al., 2008). NERICA-1 and NERICA-10, introduced in 2007, share a number of\ntraits yet display subtle differences in maturation and stress adaptability (Somado et\nal., 2008). NERICA-6, released in 2014, has attracted attention for its superior grain\nquality and competitive biomass production under stress conditions. The NARIC series—\ncomprising NARIC-1 and NARIC-2, released in 2002- exhibit intermediate drought\ntolerance with moderate biomass accumulation. The NamChe group, consisting of five\nvarieties (NamChe-1 through NamChe-5) developed via marker-assisted selection at\n\nNaCRRI and released in 2013, underscores the diversity of adaptive traits. NamChe-5\nexhibits a superior root system under drought stress, while NamChe-1 and NamChe-4\nmaintain moderate tolerance and consistent seedling vigour (Hong et al., 2021). In\ncontrast, the IR64 variety, representing lowland rice, is a susceptible check due to its\npoor performance under drought stress despite its high-yield potential in irrigated\nsystems (Cruz et al., 2018). The Pre-released from NaCRRI, 18(18)G, UP-15(45), and UP-\n25(45) demonstrate promising germination rates, early growth stability, and visual\nindicators of stress tolerance, with UP-25(45)", "word_count": 304, "start_char": 39127, "end_char": 41214}
{"chunk_id": "DOC0034__00017", "doc_id": "DOC0034", "chunk_index": 17, "text": "n\ncontrast, the IR64 variety, representing lowland rice, is a susceptible check due to its\npoor performance under drought stress despite its high-yield potential in irrigated\nsystems (Cruz et al., 2018).T\n\nhe Pre-released from NaCRRI, 18(18)G, UP-15(45), and UP-\n25(45) demonstrate promising germination rates, early growth stability, and visual\nindicators of stress tolerance, with UP-25(45)\n\n3.1.3 Experimental design\nThe design arrangement of the study was Split Plot arrangement in Completely\nRandomized. It allows for the two independent variables to be tested within this\nexperiment. The primary independent variable (main plot) was Polyethylene glycol\n6000 (PEG-6000) in various concentrations. The adding subplots were the 15 rice\nvarieties stated in 3.1. It had been repeated three times. The PEG-6000 concentrations\nwere prepared as i.e. 0% (control), 5%, 10%, 15%, and 20% by dissolving stipulated\namounts of polyethylene glycol 6000 in 100ml of distilled water (Goraguddi et al., 2023).\nRice Seeds were sterilized by soaking in a 70% ethanol solution for 2 minutes followed\nby distilled water rinse. 10 millilitres of the different PEG-6000 concentrations was\nadded to 10-cm sterile Petri dishes lined with two layers of Whatman paper, and 50\nseeds from each genotype were placed in these dishes. The set-up was maintained in a\nplant growth chamber at a constant temperature of 25±0.5°C and relative humidity of\n80±1% for 7 days on Petri dishes (Islam et al., 2018).\n\n3.1.4 Data collection\nSeed were considered germinated with radicle protrusion of more than 2 mm, and\ngermination count was done after every 24 hours. Germination percentage,\nGermination Velocity Index and Mean Germination Time were calculated using the\nformulas below.\nGermination percentage =\nNumber of germinated seeds\nTotal numbers of seeds\n× 100\n\nGermination Velocity Index = ∑\nN1\nT1 +\nN2\nT2 + ⋯+\nNn\nTn ,\nWhere: N is number of seed germinated on day 1, day 2 and last germination day\nrespectively (Bore et al. 2023).\nT1, T2, and Tn are first, second and last day of germination respectively.\n\nMean Germination Time = MGT= ∑N∗T/∑N\nGermination Synchrony\nCUG=\n∑\nNi\nk\ni=1\n∑\n(T−TI)2 Ni\nk\ni=1\n\nWhere T is the mean germination time, Ti is the time from the start of the experiment\nto the ith interval, Ni is the number of seeds germinated in the ith time interval and k\nis the total number of time intervals (Bore et al. 2023).\n\n3.1.5 Data Analysis\nData analysis was performed using R 4.4.3 and Microsoft Excel 365. Descriptive statistics\nincluded mean, standard deviation, and median. Two-way ANOVA was conducted to\nassess effects of genotype (G), PEG concentration (P), and their interaction (G × P).", "word_count": 433, "start_char": 40822, "end_char": 43501}
{"chunk_id": "DOC0034__00018", "doc_id": "DOC0034", "chunk_index": 18, "text": "escriptive statistics\nincluded mean, standard deviation, and median.T\n\nwo-way ANOVA was conducted to\nassess effects of genotype (G), PEG concentration (P), and their interaction (G × P).\n\nLSD test at p < 0.05 determined significance. Shapiro-Wilk and Levene’s tests verified\nassumptions of normality and variance homogeneity (Karanjit et al., 2024).\n\n3.2 Study 2: Effect of drought on early seedling stage of the upland rice varieties.\n3.2.1 Study location\nThe experiment was conducted in the seed laboratory at National Crops Resources\nResearch Institute (NaCRRI) in Namulonge, Wakiso district in Uganda. (3.1.1)\n3.2.2 Planting materials\nThe study used fifteen rice genotypes that were sourced from the rice breeding program\nat National Crops Resources Research Institute (NaCRRI). The same upland rice varieties\nin 3.1.2 were used materials were used in 3.1.2.\n3.2.3 Experimental design\nThe study used Split Plot design in Completely Randomized design. The main plot was\nPolyethylene glycol 6000 (PEG-6000) of different concentrations. The subplot was rice\nvarieties stated in 3.1. The layout was replicated three times. Polyethylene glycol 6000\nconcentrations. Rice Seeds were surface sterilized with a 70% ethanol solution for 2\nminutes and rinsed with distilled water. Fifty seeds from each genotype were placed in\nsterilized Petri dishes lined with two layers of Whatman paper and moistened with 10\nml of the specified concentration of PEG-6000 solution (Sharma, P., & Kumar, S. 2023).\nTwo hundred twenty five Petri dishes were incubated in a growth chamber at a constant\ntemperature of 25±0.5°C and relative humidity of 80±1% (Islam et al., 2018). The\nexperiment was extended to 14 days to assess seedling responses (Samudin, 2023). The\nexperimental design was the same as that in 3.1.3.\n3.2.4 Data collection\nOn the 14th day, seedling parameters were measured under controlled conditions to\nevaluate the impact of drought stress. 15 seedlings were sampled from each\nexperimental unit. Seedling length (from root tip to shoot tip) was recorded using a\nfoot ruler. The fresh weight of the seedlings was also taken using an analytical weighing", "word_count": 330, "start_char": 43315, "end_char": 45463}
{"chunk_id": "DOC0034__00019", "doc_id": "DOC0034", "chunk_index": 19, "text": "eedling length (from root tip to shoot tip) was recorded using a\nfoot ruler.T\n\nhe fresh weight of the seedlings was also taken using an analytical weighing\n\nscale (MODEL SPX222). Biomass accumulation was quantified by drying 15 seedlings from\neach experimental unit in a laboratory oven (Model EDS-LE-10931) for 48 hours at 70°C.\nDrought score was assessed visually through the Standard Evaluation System (SES) for\nrice developed by the International Rice Research Institute (IRRI et al., 2021) (IRRI,\n2021) (see Appendix Table 12). Drought stress symptoms on seedlings were rated on a\nscale of 0(no visible symptoms) to 9(complete death of seedlings) according to the SES\nscore. Medium scores correlate with leaf rolling and tip drying. For example, a score\nof 1 means a little rolling and drying, while a 5 means half the leaves are brown, dry\nand fully rolled. Seedlings showing total desiccation and death receive the highest\nscore (9). Again, this visual scoring protocol permitted rapid, standardized assessment\nof physiological drought responses in plants and was well suited to complement\nquantitative data, such as seedling biomass and elongation metrics collected during the\ntrial.\n\n3.2.5 Data Analysis\n\nData analysis was similar to that of Study 1. Two-way ANOVA was used to determine\nmain and interaction effects. Data were visualized using Excel 365 charts. LSD (p <\n0.05) determined differences among means.\n\nChapter 4\nResults\nThis chapter explains the performance of both established and candidate upland rice\ncultivars when subjected to varying intensities of PEG-induced drought stress—from a\ncontrol condition (0% PEG) to severe stress (20% PEG). Nine critical parameters were\nexamined to compare the released cultivars with pre-released lines (18(18)G, UP-15(45),\nUP-25(45)) and a drought-sensitive check (IR64).\n4.1 Mean Germination Time (MGT)\n\nMGT, which indicates the speed of seed germination (with lower values denoting faster\ngermination) as shown in Table 3 below, was similar across all genotypes under control\nconditions (PEG 0), averaging around 5 days. Minor variations were observed; for\nexample, NamChe-5 recorded the fastest germination at approximately 4.9 days, while\nNARIC-1 was slower at around 5.5 days. IR64, with an MGT of about 5.3 days,\ndemonstrated moderate germination speed in comparison. Under severe drought (PEG\n20), germination was generally delayed, leading to increased MGT values, though the\ndegree of delay varied. Some released and pre-released lines, such as UP-25(45) which\nshifted marginally from 5.26 to 5.31 days and NERICA-10 from 5.33 to 5.31 days,\nmaintained nearly consistent MGT values under stress.\nTable 1 Mean Germination Time under different drought stress levels\nPEG 0\nPEG 5\n5.25 de\n5.27 abc\n5.16 abc\n5.18 def\n5.36 cde\nIR64\n5.27 d\n5.30 ab\n5.13 abc\n5.31 abcd\n4.91 f\n5.46 a\n5.27 abcd\n5.21 a\n5.30 abcde 5.25 e", "word_count": 450, "start_char": 45308, "end_char": 48183}
{"chunk_id": "DOC0034__00020", "doc_id": "DOC0034", "chunk_index": 20, "text": "able 1 Mean Germination Time under different drought stress levels\nPEG 0\nPEG 5\n5.25 de\n5.27 abc\n5.16 abc\n5.18 def\n5.36 cde\nIR64\n5.27 d\n5.30 ab\n5.13 abc\n5.31 abcd\n4.91 f\n5.46 a\n5.27 abcd\n5.21 a\n5.30 abcde 5.25 e\n\n4.2 Germination Percentage (GP)\nAccording to the results in Table 4 below, Germination Percentage, which quantifies the\nproportion of seeds that successfully germinate, was high under control conditions (PEG\n0) for all genotypes, ranging from approximately 74% to 86%. NamChe-5 achieved the\n5.15 f\n5.26 abcd\n5.07 bc\n5.19 def\n5.23 e\nNamChe-1 5.33 c\n5.18 ab\n5.41 a\n5.63 a\nNamChe-2 5.34 c\n5.08 bc\n5.27 bcde\n5.41 abcde\nNamChe-3 5.28 d\n5.19 d\n5.07 bc\n5.10 f\n5.25 e\nNamChe-4 5.04 g\n5.17 ab\n5.63 ab\nNamChe-5 4.88 h\n5.23 bcd\n5.15 abc\n5.17 ef\n5.40 cde\n5.39 b\n5.29 ab\n5.12 abc\n5.47 abcd\n5.33 c\n5.31 a\n5.18 ab\n5.38 ab\n5.55 abc\n5.31 c\n5.31 a\n5.18ab\n5.51 abcd\nNERICA-10 5.33c\n5.30 ab\n5.14 abc\n5.29 abcde 5.31 de\nUP-15(45) 5.23e\n5.21 cd\n5.03 c\n5.25 bcde\n5.41 bcde\nUP-25(45) 5.26de\n5.23 bcd\n5.09 abc\n5.24 cde\n5.31 de\nCV%\n2.7\n1.1\n1.6\n3.9\nLSD (0.05) 0.06\n0.024\n0.034\n0.046\n0.088\n(Var/PEG/)\n\nhighest GP at 86%, while IR64 recorded the lowest at 74%. Most released upland varieties\nincluding the NamChe, NERICA, and NARIC series surpassed 80% GP under optimal\nconditions, and the pre-released lines were comparably around 79–81%, indicating high\nseed viability generally. Under severe drought (PEG 20), all genotypes experienced\nsignificant declines in GP. IR64 was most affected, reduced to 12.7% implying that nearly\nnine out of ten seeds failed to germinate under stress. While the other varietiesmaintained GP values between 20% and 33%.\n\nTable 2 Germination Percentage under varied levels of PEG\nPEG 0\nPEG 5\n18(18)G 80.00 e\n50.00 cd\n28.00 defg\nIR64\n74.00 g\n67.33 b\n48.00 d\n28.00 f\n12.67 h\nNARIC-1 78.00 f\n79.33 ab\n53.33 b\n30.00 bcd\nNARIC-2 80.00 e\n75.33 ab\n52.67 bc\n36.67 e\n26.00 g\n78.67 ab\n42.67 bc\n82.00 cd\n78.00 ab\n39.3 cde\n27.33 efg\n76.00 ab\n52.67 bc\n39.33 cde\n26.67 fg\n82.00 cd\n78.67 ab\n42.00 bc\n86.00 a\n84.00 a\n64.67 a\n50.66 a\n33.33 a\nNERICA-1 82.00 cd\n77.33 ab\n43.33 b\n30.00 bcd\nNERICA-4 84.00 b\n79.33 ab\n30.67 bc\nNERICA-6 83.33 bc\n80.00 ab\n43.33 b\n31.33 ab\n\nNERICA-\n77.33 ab\n37.33 de\nUP-\n15(45)\n80.66 de\n53.33 b\n40.00 bcde 29.33 bcde\nUP-\n25(45)\n79.33 ef\n49.33 d\n41.33 bc\n28.00 defg\nCV%\n3.5\n11.3\n7.2\n12.2\n16.8\nLSD\n(0.05)\n1.192\n3.702\n1.643\n2.094\n1.981\n1.81e-14/<2e-\n<1.81e-14/<2e-16", "word_count": 447, "start_char": 47973, "end_char": 50359}
{"chunk_id": "DOC0034__00021", "doc_id": "DOC0034", "chunk_index": 21, "text": "4.3 Germination Velocity Index (GVI)\nGVI combines germination speed and uniformity, reflecting early vigour as shown in\nTable 5. NamChe-5 dominated across all stress levels—from 9.90 under PEG 0 to 3.28 at\nPEG 20. NERICA-6 and NERICA-4 also showed robust values under low to moderate stress,\nmaintaining GVI above 5.5 up to PEG 10. IR64's GVI fell drastically to 1.39 at PEG 20%,\nconfirming its sluggish and inconsistent germination. The slow decline of GVI in UP-\n15(45), NamChe-2, and NARIC-1 suggests their seeds maintain metabolic activity longer\nunder dehydration stress. While PEG 0 levels showed a clustered performance, drought\nstress clearly separated the high-performing upland genotypes from the vulnerable IR64.\n\nTable 3 Germination Velocity Index of rice varieties under varied drought stress\nPEG 0\nPEG 5\nNamChe-5 9.90 a\n8.72 a\n6.77 a\n5.27a\n3.28 a\nNamChe-4 9.02 b\n8.07 ab\n5.69 b\n4.21 b\n2.72 cde\nNERICA-4 8.60 c\n8.15 ab\n5.68 b\n2.97 bc\n\nNERICA-6 8.55 cd\n8.21 ab\n5.68 b\n4.34 b\n3.05 ab\n8.49 cd\n7.74 ab\n5.56 b\n3.73 c\n2.64 e\nNamChe-2 8.40 de\n7.98 ab\n5.75 b\n3.99 bc\n2.69 de\nUP-15(45) 8.40 de\n7.99 ab\n5.67 b\n2.88 bcde\n8.29 ef\n7.89 ab\n5.18 c\n4.21 b\n2.79 cde\nNamChe-3 8.27 ef\n7.92 ab\n5.56 b\n2.70 de\nNERICA-1 8.27 ef\n7.99 ab\n5.78 b\n4.34 b\n2.95 bcd\nNERICA-10 8.24 ef\n7.94 ab\n5.65 b\n3.80 c\n2.88 bcde\nNamChe-1 8.19 f\n8.05 ab\n5.60 b\n4.23 b\n2.73 cde\nUP-25(45) 8.19 f\n7.96 ab\n5.21 c\n4.22 b\n2.82 bcde\n7.74 g\n8.25 ab\n5.51 b\n4.11 bc\n2.71 cde\nIR64\n7.67 g\n6.91 b\n5.04 c\n2.81 d\n1.39 f\nCV%\n6.4\n11.3\n7.2\n12.7\n15.4\nLSD (0.05) 0.228\n0.382\n0.173\n0.221\n0.18\n(Var/PEG) <2e-16/<2e-16 <2e-16/<2e-16\n<2e-16/<2e-16 <2e-16/<2e-16\n\n4.4 Germination Synchrony\nSynchrony reflects how uniform germination is within a population; values close to 0.18\nsignify tight clustering of emergence. From Table 6 below, at PEG 0%, NamChe-1 had\nthe highest synchrony (0.180), indicating highly synchronized germination. Under stress,\nsome varieties like NARIC-2 saw increased synchrony (0.207 at PEG 15), possibly due to\nfewer but more coordinated germination events. In contrast, IR64 dropped significantly\nto 0.067 at PEG 20%, suggesting disorganized, staggered germination. NamChe-5 and\n\nNamChe-3 consistently sustained higher synchrony under stress, which is desirable for\nuniform crop establishment.", "word_count": 389, "start_char": 50359, "end_char": 52624}
{"chunk_id": "DOC0034__00022", "doc_id": "DOC0034", "chunk_index": 22, "text": "nder stress,\nsome varieties like NARIC-2 saw increased synchrony (0.207 at PEG 15), possibly due to\nfewer but more coordinated germination events.I\n\nn contrast, IR64 dropped significantly\nto 0.067 at PEG 20%, suggesting disorganized, staggered germination.N\n\namChe-5 and\n\nNamChe-3 consistently sustained higher synchrony under stress, which is desirable for\nuniform crop establishment.\n\nTable 4 Germination Synchrony of Rice varieties under varied drought stress levels\nPEG 0\nPEG 5\n0.187 a\n0.153 a\nIR64\n0.163 d\n0.150 d\n0.067 b\n0.157 a\n0.171 c\n0.183 a\n0.183 ab\n0.207 a\n0.170 a\nNamChe-1\n0.180 a\n0.160 cd\nNamChe-2\n0.162 d\n0.147 a\nNamChe-3\n0.183 ab\n0.187 ab\n0.170 a\nNamChe-4\n0.160 d\n0.150 a\nNamChe-5\n0.176 ab\n0.177 ab\n0.177 bc\n0.173 a\n0.157 cd\n0.150 a\n0.150 d\n0.157 cd\n0.163 a\n0.187 a\n0.167 a\n0.173bc\n0.153 a\nCV%\n3.2\n3.9\n4.5\n9.6\n15.3\nLSD (0.05)\n0.002\n0.003\n0.003\n0.008\n0.014\n<1.81e-14/<2e-16\n<1.81e-14/<2e-\n\n4.5 Seedling Drought Stress Score\nThis score quantifies visible drought symptoms, with higher values indicating greater\ninjury as shown in Table 7 below. IR64 had the worst scores across all PEG levels, rising\nfrom 1.33 at PEG 0 to 8.04 at PEG 20—nearly complete damage. Conversely, upland\nvarieties had low scores under control (e.g., NERICA-4 at 0.20) and moderate increases\nunder stress. Notably, UP-15(45), UP-25(45), and NamChe-5 all scored below 5.5 at PEG\n15, and under 7.3 at PEG 20, outperforming IR64. This confirms visual tolerance and\nhealth under limited water.\nTable 5 Seedling Drought Score of Rice varieties under varied drought stress levels\nPEG 0\nPEG 5\n0.29 de\n1.31 bcdef\n3.13 bcde\n5.04 cd\n7.22 b\nIR64\n1.33 a\n3.67 a\n6.00 a\n8.04 a\n0.49 bcde\n1.02 ef\n2.80 de\n4.80 de\n6.82 de\n0.42 bcde\n1.38 bcd\n2.89 cde\n4.80 de\n6.87 cde\nNamChe-1 0.65 b\n1.49 b\n3.13 bcde\n5.20 bc\n7.13 bcd\nNamChe-2 0.62 bc\n1.24 bcdef\n2.89 de\n5.18 bc\n7.25 b\nNamChe-3 0.46 bcde\n1.35 bcde\n3.09 bcde\n4.91 cde\n6.96 bcde\nNamChe-4 0.29 de\n1.04 def\n2.87 de\n4.98 cd\n6.85 de\nNamChe-5 0.49 bcde\n1.47 bc\n3.16 bcd\n7.00 bcde\n0.27 de\n1.02 ef\n2.82 de\n4.58 e\n6.89 cde\n0.20 e\n1.00 f\n2.93 cde\n5.07 cd\n6.78 e\n0.33 cde\n1.25 bcdef\n2.78 e\n7.04 bcde\nNERICA-10 0.53 bcd\n1.13 cdef\n2.91 cde\n5.11 bcd\n6.85 de\nUP-15(45) 0.69 b\n1.31 bcdef\n3.42 ab\n5.47 b\n7.18 bc\nUP-25(45) 0.71 b\n1.44 bc\n3.27 bc\n7.24 b\nCV%\n60.2\n26.6\n10.2\n7.2\n4.9\n\nLSD (0.05) 0.133\n0.149\n0.132\n0.156\n0.147\n(Var/PEG) <2e-16/<2e-16 <2e-16/<2e-16 <2e-16/<2e-16", "word_count": 430, "start_char": 52239, "end_char": 54614}
{"chunk_id": "DOC0034__00023", "doc_id": "DOC0034", "chunk_index": 23, "text": "4.6 Seedling Fresh Weight\nSeedling fresh weight as shown in Table 8, was measured before drying. Under control\nconditions (PEG 0), upland cultivars accumulated substantial biomass—several lines\nrecorded values between 54 and 57 mg per seedling like NamChe-4 at 56.7 mg, NARIC-\n2 at 55.9 mg, and NamChe-1 at 55.1 mg whereas IR64 had a lower fresh weight of\napproximately 45.7 mg. Under severe drought (PEG 20), fresh weight declined\ndramatically for all genotypes; seedlings that typically weighed between 50 and 56 mg\nunder optimal conditions were reduced to about 1–2 mg, corresponding to a reduction\nof roughly 96–98%.\nTable 6 Seedling Fresh Weight of Rice varieties under varied drought stress levels\nPEG 0\nPEG 5\nNamChe-4\n56.70 a\n34.74 c\n21.64 a\n7.84 a\n55.90 a\n35.95 bc\n20.78 a\n7.35 a\nNamChe-1\n55.14 a\n36.89 abc\n22.07 a\n7.99 a\n1.90 a\n55.11 a\n35.25 bc\n21.26 a\n7.93 a\n1.79 a\n55.09 a\n39.82 a\n20.56 a\n7.79 a\n1.68 a\nNamChe-3\n54.75 a\n39.82 a\n20.86 a\n7.70 a\nNamChe-5\n54.67 a\n36.61 bc\n20.82 a\n7.74 a\n1.92 a\n54.06 a\n37.48 abc\n20.90 a\n7.81 a\n1.89 a\n53.93 a\n36.88 abc\n20.33 a\n8.02 a\n1.90 a\n\n53.92 a\n36.66 bc\n20.08 a\n8.18 a\n1.82 a\n53.87 a\n36.64 bc\n20.43 a\n7.88 a\n1.75 a\n53.45 a\n37.09 abc\n20.26 a\n8.08 a\n1.70 a\n53.39 a\n37.87 ab\n20.34 a\n7.85 a\n1.75 a\nNamChe-2\n53.37 a\n37.09 abc\n20.17 a\n7.49 a\n1.83 a\nIR64\n45.73 b\n30.47 d\n17.09 b\n6.36 b\n1.15 b\nCV%\n5.8\n7.1\n7.8\n7.8\nLSD (0.05)\n1.325\n1.104\n0.679\n0.257\n0.118\n<2.6e-13/<2e-16\n<2.6e-13/<2e-\n\n4.7 Seedling Dry Weight\nSeedling dry weight as shown in Table 9, representing the biomass after drying (and\nthus the accumulated solids), reflected the trends observed for fresh weight. Under\ncontrol conditions (PEG 0), upland varieties produced approximately 10–11 mg of dry\nmatter per seedling, in contrast to IR64, which produced about 8.8 mg. Under 20% PEG,\ndry weight nearly collapsed for all genotypes. The coefficient of variation was less than\n10% which showed that the data was reliable. Upland varieties retained between 0.8\nand 0.95 mg of dry weight, while IR64’s seedlings dropped to around 0.54 mg.\nConsequently, IR64 experienced a biomass reduction of roughly 94%, compared to a 90–\n93% reduction in the upland lines. Statistically, IR64’s dry weight under stress was\nsignificantly lower than that of the upland cultivars.\n\nTable 7 Seedling Dry Weight of Rice varieties under varied drought stress levels\nPEG 0\nPEG 5", "word_count": 429, "start_char": 54614, "end_char": 56968}
{"chunk_id": "DOC0034__00024", "doc_id": "DOC0034", "chunk_index": 24, "text": "onsequently, IR64 experienced a biomass reduction of roughly 94%, compared to a 90–\n93% reduction in the upland lines.S\n\ntatistically, IR64’s dry weight under stress was\nsignificantly lower than that of the upland cultivars.T\n\nable 7 Seedling Dry Weight of Rice varieties under varied drought stress levels\nPEG 0\nPEG 5\n\nNamChe-4 11.34 a\n8.69 c\n6.19 a\n2.61 ab\n0.86 a\n11.18 a\n8.99 bc\n5.94 a\n2.46 b\n0.83 a\nNamChe-1 11.03 a\n9.22 abc\n6.30 a\n2.66 ab\n0.92 a\nUP-25(45) 11.02 a\n8.82 bc\n6.07 a\n2.64 ab\n0.90 a\nNERICA-4 10.84 a\n9.96 a\n5.87 a\n2.60 ab\n0.84 a\nNamChe-3 10.95 a\n9.95 a\n5.96 a\n2.50 b\n0.83 a\nNamChe-5 11.16 a\n9.15 bc\n5.95 a\n2.58 ab\n0.87 a\nUP-15(45) 10.81 a\n9.37 abc\n5.97 a\n2.61 ab\n0.95 a\n10.79 a\n9.22 abc\n5.81 a\n2.67 ab\n0.85 a\nNERICA-10 10.79 a\n9.16 bc\n5.74 a\n2.73 ab\n0.86 a\n10.90 a\n9.16 bc\n5.93 a\n2.87 a\n0.94 a\nNERICA-6 10.82 a\n9.27 abc\n5.79 a\n2.69 ab\n0.85 a\nNERICA-1 10.68 a\n9.47 ab\n5.81 a\n2.62 ab\n0.87 a\nNamChe-2 10.49 a\n9.27 abc\n5.76 a\n2.50 b\n0.92 a\nIR64\n8.82 b\n6.91 d\n4.44 b\n1.74 c\n0.54 b\nCV%\n6.7\n8.5\n9.1\n11.2\n13.6\nLSD (0.05) 0.307\n0.33\n0.226\n0.122\n0.05\n<2e-\n16/<2e-16 <2e-16/<2e-16\n\n4.8 Seedling Root Length\nRoot length is a vital indicator of drought tolerance, as longer roots may access moisture\nfrom deeper soil layers. As shown in Table 10, under control conditions (PEG 0), upland\ncultivars developed substantial root systems, with lengths typically ranging from 8.0 to\n8.3 cm. For instance, NamChe-5 exhibited roots of approximately 8.31 cm, while\nseveral other upland varieties (e.g., NamChe-2, UP-15(45), NARIC-1) ranged from 8.1\nto 8.3 cm, and NamChe-1 slightly less at 7.97 cm. IR64, however, developed\nsignificantly shorter roots (around 7.03 cm), placing it in a lower statistical category.\n\nUnder severe drought (PEG 20), root elongation was considerably hindered across all\ngenotypes; while upland cultivars maintained a relative advantage, with most recording\nroot lengths between 2.3 and 2.5 cm (NamChe-5 at 2.47 cm and UP-15(45) at 2.40 cm).\nIn contrast, IR64’s roots averaged only about 1.53 cm, roughly half the length of those\nin drought-tolerant lines.", "word_count": 381, "start_char": 56650, "end_char": 58728}
{"chunk_id": "DOC0034__00025", "doc_id": "DOC0034", "chunk_index": 25, "text": "nder severe drought (PEG 20), root elongation was considerably hindered across all\ngenotypes; while upland cultivars maintained a relative advantage, with most recording\nroot lengths between 2.3 and 2.5 cm (NamChe-5 at 2.47 cm and UP-15(45) at 2.40 cm).I\n\nn contrast, IR64’s roots averaged only about 1.53 cm, roughly half the length of those\nin drought-tolerant lines.\n\nTable 8 Seedling Root Length of Rice varieties under varied drought stress levels\nPEG 0\nPEG 5\nNamChe-5 8.31 a\n7.20 a\n5.53 a\n2.47 a\nNamChe-2 8.27 ab\n5.53 a\n3.87 abc\n8.27 ab\n7.03 a\n5.47 a\n3.93 a\n8.20 abc\n6.93 ab\n3.73 abc\n8.17 abc\n7.07 a\n8.13 abc\n7.00 ab\n2.47 a\nNamChe-4 8.13 abc\n2.37 a\nNERICA-10 8.13 abc\n7.20 a\n3.87 abc\n8.13 abc\n6.93 ab\n3.90 ab\n8.10 abc\n6.73 b\n8.07 abc\n7.00 ab\n5.47 a\n2.30 a\n8.07 abc\n5.33 a\nNamChe-3 8.0 bc\n7.13 a\n3.67 c\nNamChe-1 7.97 c\n7.03 a\n5.33 a\n3.70 bc\nIR64\n7.03 d\n5.77 c\n4.37 b\n2.90 d\n1.53 b\nCV%\n5.2\n5.8\n7.1\n10.8\nLSD (0.05) 0.137\n0.153\n0.132\n0.113\n0.105\n<2e-\n<2e-\n\n4.9 Total Seedling Length (Shoot + Root Length)\nTable 11 that shows Total seedling length which combines shoot and root lengths,\nprovides measure of early seedling development. Under control conditions (PEG 0),\nupland varieties exhibited total seedling lengths between approximately 11.6 and 12.4\ncm, reflecting growth. At PEG 0, NamChe-5 and NERICA-6 again topped performance\n(>12 cm), while IR64 was consistently the shortest. Under PEG 20, NamChe and UP lines\nmanaged ~4.5–5 cm, whereas IR64 was reduced to barely 3 cm. For example, UP-15\nachieved a total length of 12.43 cm, and 18(18)G measured 12.37 cm, while other\nvarieties such as NERICA-10, NERICA-1, UP-25(45), NamChe-5, NamChe-4, and NERICA-\n4 clustered around 12.0–12.2 cm. IR64, consistently underperformed in this parameter.\nThese differences indicate stronger initial establishment potential among upland\nvarieties.\nTable 9 Total Seedling Length of Rice varieties under varied drought stress levels\nPEG 0\nPEG 5\n12.43 a\n10.50 a\n7.83 a\n5.37 a\n12.37 ab\n10.37 a\n9.40 a\n7.60 ab\nNERICA-10 12.23 ab\n10.30 a\n7.80 a\n5.30 a\n12.17 ab\n10.27 a\n12.13 ab\n10.40 a\n9.17 a\nNamChe-5 12.10 ab\n10.67 a\n9.47 a\n7.70 ab\nNamChe-4 12.03 ab\n10.43 a\n9.20 a\n7.53 abc\n12.03 ab\n10.40 a\n7.77 ab\nNamChe-1 11.97 ab\n10.43 a\n9.37 a\n5.23 a\n11.90 ab\n10.53 a\n7.60 ab\n5.23 a", "word_count": 411, "start_char": 58359, "end_char": 60618}
{"chunk_id": "DOC0034__00026", "doc_id": "DOC0034", "chunk_index": 26, "text": "NamChe-3 11.83 ab\n10.47 a\n9.30 a\n7.57 ab\n11.70 ab\n10.27 a\n9.17 a\n7.20 c\n5.37 a\nNamChe-2 11.67 b\n10.13 a\n9.67 a\n7.83 a\n11.63 b\n9.90 ab\n7.43 bc\nIR64\n10.17 c\n9.17 b\n7.83 b\n6.23 d\n4.40 b\nCV%\n5.4\n5.1\n5.5\n5.6\n5.6\nLSD (0.05) 0.273\n0.224\n0.218\n0.181\n0.125\n<2e-\n<2e-\n<2e-\n\nChapter 5\nThe discussion is structured along important parameters, comparing the performance\nof released and unreleased upland varieties and situating the results in relation to other\nresearch papers.\n5.1 Discussion for objective 1 - To assess germination parameters of released and prereleased upland rice varieties under controlled drought conditions.\nOne of the most sensitive parameters to this stress is the final germination percentage\n(GP) across rice genotypes, indicating the effects of drought stress on germination\ncharacteristics by polyethylene glycol (PEG) treatment. Under the same well-watered\nconditions, GP is generally greater than 80% in GP-susceptible genotypes, yet exposure\nto 20% PEG caused GP to drop significantly to 25–30% in drought-tolerant hotspots and\neven to 12–13% in the sensitive IR64 genotype, in agreement with findings of Islam et\nal. (2018) and (Siddique et al., 2023), who highlighted rice's susceptibility during\ngermination. This trend is consistent with (Sagar et al., 2020), who reported sudden\ncollapses in GP with increasing PEG-induced osmotic stress (–0.9 MPa). Among 210 rice\naccessions evaluated by (Fontonah et al., 2023) PEG stress, GP under PEG stress range\nwas wide, with some lines maintaining approximately 50% GP while others showed near\ncomplete failure (Siddique et al., 2024). This variability emphasizes the genetic\ndiversity in response to drought stress as illustrated by comparing the performance gap\nin NamChe-5 (≈33% GP) and IR64 (≈12–13% GP) and further accentuates the degree of\nsusceptibility of IR64.\nAlthough not specified in some of the datasets, germination vigour and germination\nvigour index (GVI) demonstrated similar trends; PEG stress significantly reduced GVI\nespecially in susceptible genotypes by reducing the rate and synchronicity with which\ngermination occurred. Kawaguchi et al. (2023) provide evidence that drought-tolerant\nlines have higher GVI under drought-induced stress, indicating that rapid early\n\nmetabolic activation occurs in a water deficit condition and is therefore plastic. Finally,\ngermination uniformity, often the silent villain in literature, is paramount for field\nestablishment. Germination dynamics were highly erratic for IR64 at under 20% PEG,\nwhich was in marked contrast to the more synchronized emergence in upland varieties.\nThe consistent responses of the drought tolerant lines may harmonize due to similar\nregulation of hormonal signalling pathways, for example, abscisic acid signalling (as\ndemonstrated by (Evamoni et al, 2023), emphasizing the future exploration of genetic\nand physiologic basis of uniformity under similar stress conditions.", "word_count": 444, "start_char": 60618, "end_char": 63543}
{"chunk_id": "DOC0034__00027", "doc_id": "DOC0034", "chunk_index": 27, "text": "he consistent responses of the drought tolerant lines may harmonize due to similar\nregulation of hormonal signalling pathways, for example, abscisic acid signalling (as\ndemonstrated by (Evamoni et al, 2023), emphasizing the future exploration of genetic\nand physiologic basis of uniformity under similar stress conditions.\n\n5.2 Discussion for objective 2 - To evaluate the early seedling growth parameters of\nthe rice varieties under controlled drought conditions.\n\nAs shown in the PEG-induced drought visual scoring of other genotypes (Pope et al.,\n2024; Samudin, 2023), the stress response upon drought showed highly significant\ngenotypic variation, where sensitive cultivars such as IR64 infected consistently scored\nabove 8 levels (IRRI∼≤ 8 levels aligned with near-lethal stress), whereas moderately\nresilient genotypes including NERICA-4 and NamChe-4 scored much less (around stress\nscores of 6.8). PEG stress significantly inhibited biomass accumulation, with reductions\nin fresh and dry seedling weight of up to 95% in some genotypes. This correlates\n(Sobahan et al., 2022), who explained the biomass decline under 20% PEG by impaired\ncell expansion and photosynthesis because of limited water uptake. Root analysis also\nexposed significant differences; NamChe-5/PEG, a drought-tolerant line under PEG\nstress maintained longer root systems than IR64 which reflects higher capacity of water\nforaging ability. This observation is in contrast to the findings of (Sathyabharathi et\nal., 2022), rooted in that landraces can maintain root elongation under this osmotic\nstress due to their innate tolerance to drought. In contrast, shoot length decreased\nacross all genotypes, highlighting the strong effect that drought imposed on\naboveground growth.\n\nThere were differences in germination metrics, biomass traits, or morphological\nresilience when comparing released and pre-released genotypes. The promising prereleased lines (UP-15(45) and UP-25(45)) out yielded in terms of average performance\nelite lines, NERICA-4 and NamChe-5 (56.02-37.52%) suggest that drought-resisting\nalleles has been introgressed into newly bred materials. That development reflects\n(Pavithran et al., 2024), demonstrating that backcrossed inbred lines enriched for\ndrought QTLs had strong early-stage drought tolerance. In addition, the consistency of\nNERICA-4 performance across various African upland environments (Wade et al., 2019),\nconfirming its reliability, and the capabilities of UP-15(45) and related lines to serve\nas next generation, farmer-preferred, drought-adapted cultivars with enhanced\nagronomic traits.", "word_count": 359, "start_char": 63221, "end_char": 65823}
{"chunk_id": "DOC0034__00028", "doc_id": "DOC0034", "chunk_index": 28, "text": "hat development reflects\n(Pavithran et al., 2024), demonstrating that backcrossed inbred lines enriched for\ndrought QTLs had strong early-stage drought tolerance.I\n\nn addition, the consistency of\nNERICA-4 performance across various African upland environments (Wade et al., 2019),\nconfirming its reliability, and the capabilities of UP-15(45) and related lines to serve\nas next generation, farmer-preferred, drought-adapted cultivars with enhanced\nagronomic traits.\n\nChapter 6\n6.1 Conclusion\nThe results showed that drought significantly reduced germination and seedling\nperformance across all varieties, but with notable differences in tolerance. NamChe-5\nconsistently outperformed all others, demonstrating the highest germination\npercentage (64.67% at PEG 10%, 33.33% at PEG 20%), fastest germination speed (MGT\nof 4.88 days), highest GVI (9.90 at PEG 0), and superior biomass retention under stress.\nPre-released lines like UP-25(45) and UP-15(45) also showed strong performance,\ncomparable to and sometimes better than some released varieties, especially in\nmaintaining root length, seedling mass, and visual drought resilience under severe\nstress levels.\nThe statistical analysis confirmed these trends, leading to the rejection of Hypothesis\nH1, as significant differences were observed among genotypes in germination\nperformance under drought. Similarly, Hypothesis H2 was rejected, showing that early\nseedling growth responses also significantly varied between released and pre-released\nlines. These findings highlight the existence of considerable genetic variability that can\nbe exploited in breeding programs. The drought-susceptible check IR64 performed\npoorest, validating its use as a sensitive control. The study identifies NamChe-5 and UP-\n25(45) as strong candidates for varietal promotion and breeding, offering a pathway to\nimprove\nresilience\nin\nUganda’s\nrainfed\nrice\nproduction\nsystems.\n\n6.2 Recommendations\nThese findings highlight the promise of both released and pre-released upland rice\nvarieties for sustainable crop establishment in water-limited environments, offering a\nviable strategy for reducing drought-induced yield losses and improving food security\nin drought-affected areas. And suggest more studies are carried out in-field for\ngermination and early seedling. I suggest repeating the research from germination and\n\nearly seedlings under drought stress conditions to maturity and yield to determine the\nimpact early drought stress had on yield.\n\nAPPENDIX\n\nFigure 2 Confirmation letter from NaCCRI\n\nTable 10 The Released and Pre-released rice varieties\nNO\nYear of\nrelease Ecology\nNARIC-1 (ITA 257)\nNARIC-2 (ITA 325)\n2007 Upland\n2007 Upland\nNamChe-1 (ARICA-5) (WAB 95-B-B-40-HB)\nNamChe-2 (NM7-8-2-B-P-11-6)\nNamChe-3 (NM7-29-4- B-P-80-8)\nNamChe-4 (ARICA-4) (ART3-11L1P1-B-B-2)\nNamChe-5 (NM7-27-1- B-P-77-6)\nIR 64\nlowland\nUpland", "word_count": 383, "start_char": 65358, "end_char": 68219}
{"chunk_id": "DOC0034__00029", "doc_id": "DOC0034", "chunk_index": 29, "text": "PPENDIX\n\nFigure 2 Confirmation letter from NaCCRI\n\nTable 10 The Released and Pre-released rice varieties\nNO\nYear of\nrelease Ecology\nNARIC-1 (ITA 257)\nNARIC-2 (ITA 325)\n2007 Upland\n2007 Upland\nNamChe-1 (ARICA-5) (WAB 95-B-B-40-HB)\nNamChe-2 (NM7-8-2-B-P-11-6)\nNamChe-3 (NM7-29-4- B-P-80-8)\nNamChe-4 (ARICA-4) (ART3-11L1P1-B-B-2)\nNamChe-5 (NM7-27-1- B-P-77-6)\nIR 64\nlowland\nUpland\n\nTable 11 Standard Evaluation System (SES) for rice (IRRI, 2021)\nDescription\nVisual Score\nNo drought stress symptoms\nSlight leaf rolling and tip drying\nLeaf rolling and tip drying persists to 1/4 length in 25% of\nall leaves (normally the older leaves)\nLeaf rolling and tip drying extended to 1/4 length or\nmore in less than 50% of all leaves\nLeaf tip drying and rolling reached 1/4 length or greater\nin 50% of total leaves, 25% of leaves rolled fully dried\n50% of all brown and dry leaves rolled\n> 50% but < 70% of all leaves fully rolled and dried\nSeventy percent of all leaves fully rolled and dried\nOver 70% of entire leaves tightly rolled and dried\nAll are dead\n\nFigure 3 Mean Germination Time under different drought stress levels\n\nFigure 4 Germination Percentage under varied levels of PEG\n4.40\n4.60\n4.80\n5.00\n5.20\n5.40\n5.60\n5.80\nDays\nMean Germination Time\n%\nGermination percentage\n\nFigure 5 Germination Velocity Index of rice varieties under varied drought stress\n\n0.00\n2.00\n4.00\n6.00\n8.00\n10.00\n12.00\nGermination Velocity Index", "word_count": 226, "start_char": 67842, "end_char": 69255}
