{"chunk_id": "DOC0082__00000", "doc_id": "DOC0082", "chunk_index": 0, "text": "CONSTRAINTS TO UGANDAN SME’s PARTICIPATION IN AGOA\n\nWasswa Katono Isaac*\nMany countries in Africa realize that an outward-oriented development strategy (as\nopposed to protectionism) is the best way to attain economic growth and fight poverty.\nExported growth is anchored on the premise that trade is important for Africa’s\ndevelopment, and recognizes the importance of streamlining trade into overall National\n\nABSTRACT\nMany Small and Medium Enterprises (SMEs) in Uganda have not utilized the opportunities\npresented by AGOA. The objective of this study was to examine the constraints that hinder these\nfirms from utilizing these opportunities. Specifically the study examined the macro constraints\nfacing these firms, with a view to finding solutions to them. A literature review was carried out\nto identify challenges to SME’s participation in AGOA. , followed by a triangulation technique in\nwhich a qualitative study (Focus Discussion Group) involving key stakeholders in this business\nwas done to further identity these constraints and their underlying dimensions. Instrument\ndevelopment was next, followed by a reliability analysis in which the psychometric properties of\nthe instrument were assessed on the basis of Cronbach’s alpha. A quantitative study was then\ndone by administering the refined questionnaire to a group of exporters. Factor Analysis by\npromax (oblimin ) rotation revealed six oblique factors identifying that the most important\nconstraints facing Ugandan SMEs are Lack of middle managers, infrastructure, technology,\nmarketing , inadequate export credit and governance issues. The study calls for\ntechnological transfer from the developed countries to the Less Developed Countries (LDCs) in\naddition to addressing the other barriers. There is also a need for exporters to develop better\nmarketing skills through training .The study implores the government to put policies in place\nthat will enhance the development of SMEs.\n\nComment\n\nKey Words: Exports, Constraints, AGOA, Preferences, Small and Medium Enterprises.\nINTRODUCTION\n\nBusiness Management Review 11(2) pp 28-53 ISSN 0856-2253©July-December 2007 FCM. All rights of\nreproduction in any form reserved.\n* Waswa Katono Isaac: Faculty of Business and Administration, Uganda Christian University\nikatono@ucu.ac.ug\n\nDevelopment plans. Trade increases income through resource reallocation, and since\nmany African countries have relatively large informal sectors, their economies should\ngrow faster to the extent that their exports expand rapidly and become diversified\n(World Bank et al.,2000). To assist developing countries boost their export trade, nonreciprocal trade preferences have long been granted to them by the developed world,\nthe pattern of which reflected past colonial ties in some cases. In 1968, the creation of a\nGeneralized System of Preferences (GSP) was recommended by UNCTAD on the basis\nof non-reciprocity since it was realized that treating unequal countries equally simply\nentrenched inequalities (UNCTAD, 2004).", "word_count": 434, "start_char": 0, "end_char": 3016}
{"chunk_id": "DOC0082__00001", "doc_id": "DOC0082", "chunk_index": 1, "text": "n 1968, the creation of a\nGeneralized System of Preferences (GSP) was recommended by UNCTAD on the basis\nof non-reciprocity since it was realized that treating unequal countries equally simply\nentrenched inequalities (UNCTAD, 2004).\n\nConsequently, the European Union through the Lome convention and the Cotonou\nagreement has extended preferences to African Caribbean and Pacific states (ACP).\nLikewise, the USA has extended most-favoured nation status (MFN) to many countries\nin Africa through the African Growth Opportunity Act (AGOA) which came into force\non 18th\n\nMay 2000. AGOA was intended to benefit small and medium sized\nenterprises (SMEs) as well as large businesses and state-owned firms (Corey, 2006).\nEligible African countries gained liberal access to the US market and the list of\nproducts which they may export to USA, subject to zero import duty under the GSP,\nwas expanded. AGOA applies to more then 6400 items, and as a consequence 98% of\nall US imports from eligible countries were duty free in 2005 (Corey, 2006). Thus\nAGOA has the potential to change the course of relations between Africa and the USA,\nwhile helping millions of people in Africa to prosper.\nHowever, it is debatable whether trade preferences have made a substantive impact in\nterms of enhancing the welfare of recipient countries (Francois et al., 2005).\nDeveloping countries in Asia that were granted the fewest preferences at their inception\nin the 1960’s have grown faster, yet those that were granted the most preferences\n(including Sub Saharan Africa) have failed to increase their per capita incomes or to\ndiversity their exports significantly. In the last 20 years, SSA has recorded the poorest\neconomic performance, has not fully exploited the benefits of globalization and seems\nto have gained little from trade preferences (Kasekende et al., 2002). Therefore such\narrangements are not a guaranteed means of achieving the objectives of African export\nexpansion and diversification (Oyejide, 2005). While stimulating export diversification\nin a few countries, AGOA has fallen short of the potential impetus that preferences\ncould otherwise offer African countries (Brenton and Hoppe, 2004). The expansion of\nUSA-Africa trade is largely due to oil imports from West Africa. Total non-oil trade\nunder AGOA actually declined by 16 % (Corey, 2006). In 2004, the majority of AGOA\neligible countries utilized only up to 2% of the value of trade preferences (Brenton and\nHope, 2004 ). It is now a fact that AGOA’s goal of promoting multi-sector economic", "word_count": 400, "start_char": 2784, "end_char": 5326}
{"chunk_id": "DOC0082__00002", "doc_id": "DOC0082", "chunk_index": 2, "text": "otal non-oil trade\nunder AGOA actually declined by 16 % (Corey, 2006).I\n\nn 2004, the majority of AGOA\neligible countries utilized only up to 2% of the value of trade preferences (Brenton and\nHope, 2004 ).I\n\nt is now a fact that AGOA’s goal of promoting multi-sector economic\n\ngrowth in Africa has just been partially met, and much remains to be done to promote\nAfrica’s entrepreneurs and enhance the capacity of their SMEs (Corey, 2006).\nThe world over, SMEs face immense challenges that limit their capacity to grow and\nexploit opportunities, with particularly smaller and younger firms being more\nvulnerable to export constraints (Katsikeas and Morgan,1994).Compared with\nentrepreneurship, internationalization and small business management, there has been\nless work done on the experiences of SMEs as they grow internationally. Further, the\noverwhelming majority of studies examining export barriers facing SMEs have been\ndone in the USA and Europe, which ports limits the generalizabilty of their findings.\nResearch dealing with export barriers faced by firms in developing countries has been\nlimited (Leonidou, 2004). Studies that have been done on SME exports of developing\ncountries have established that their inability to break through to the export market in\nspite of the preferences is attributed to numerous obstacles that adversely affect their\nperformance and there have been many attempts to cluster these constraints. For\nexample, Beyene (2002) based on empirical data, Tesform and Lutz (2006) through a\nliterature search, Shacfer (2001) as well as Neupert et al (2006) through qualitative\nmethodology attempt to classify the constraints. However, many others studies e.g.\nTodd and Javalgi (2007), Gumede and Rasmussen (2002), make no attempt to classify\nthe export barriers, let alone rank them in order of importance. An important missing\nlink in the literature is that most studies do not rank the constraints (and by implication\nthe interventions) in order of importance yet empirical evidence from the Economic\nCommission For Africa (ECA) shows that policy intervention is required at all levels to\nhelp African SMEs overcome these barriers and prioritizing such interventions is the\nfirst step in this direction (Beyene, 2002). This paper intends to address this gap\nthrough a survey in response to a call from Tesfom and Lutz (2006), who observe that\nthe number of articles addressing export problems of manufacturing firms from\ndeveloping countries has been declining since 1985-1989 and that the trend in the\narticles has changed from problem identification (theory building) to testing the effects\nof export problems. To cover this gap, they call upon researchers to redirect their\nfuture research to barriers encountered by exporters from developing countries and\nrecommend further analysis of export obstacles identified in their study through the\ndevelopment of a questionnaire for a regional survey of SMEs from developing\ncountries. They specifically suggest: “Each obstacle could be posed to respondents as\na potential barrier to exporting... their responses could be along a likert scale (5 or 7\npoints) from “not an obstacle” to “major obstacle”. Responses could be factor\nanalyzed to see if the statistical results match the hypothesized clusters, or whether\nsome new underlying factors emerge from the survey.”", "word_count": 514, "start_char": 5052, "end_char": 8398}
{"chunk_id": "DOC0082__00003", "doc_id": "DOC0082", "chunk_index": 3, "text": "hey specifically suggest: “Each obstacle could be posed to respondents as\na potential barrier to exporting... their responses could be along a likert scale (5 or 7\npoints) from “not an obstacle” to “major obstacle”.R\n\nesponses could be factor\nanalyzed to see if the statistical results match the hypothesized clusters, or whether\nsome new underlying factors emerge from the survey.”\n\nUganda utilized less than 5% of the AGOA preferences in 2004 (Brenton and Hoppe,\n2004) and hence the benefits from AGOA are limited (Uganda Export Promotion\nBoard, 2005). Given that trade matters have only recently been streamlined in the\nNational Development Plan (Mutahunga, 2006), the purpose of this study is to identify,\ncluster and rank the constraints facing Ugandan SMEs in regard to AGOA.\nSpecifically, the study will have the following objectives:\n\n•\nWhat factors mostly constrain Ugandan SMEs participation in AGOA?\n•\nWhat are the underlying dimensions of these factors?\n•\nTo what extent are Ugandan SMEs satisfied with the way the government has\nhandled these constraints?\n\nIt is hoped that the findings from this study will help in further streamlining\ngovernment trade policy and export strategy, so as to further position the country\ncompetitively. The rest of the article is structured as follows. The next section is a\nsynthesis of the extant literature, followed by the methodology that was used to carry\nout the study. The findings of the study are given thereafter, together with a discussion\nof their implications. A conclusion sums up the paper.\nLITERATURE REVIEW\nDefinition and Importance of SMEs\nThere is no universally accepted definition of SMEs in Africa (Beyene, 2000).Even\ndefinitions of other countries lack uniformity, and reflect the relative development of\nthe respective economies. For example, in the USA, small businesses are those with\nless than 500 employees, which figure may represent medium to large enterprises in the\nAfrican context. In India, a small or medium enterprise is an undertaking in which\ninvestment in fixed assets in plant and machinery (owned or leased) does not exceed\n$23 million (Todd and Javalgi, 2007). On the other hand, SMEs are defined as those\nbusiness organizations with less than 100 employees (Macqueen, 2004). Specifically,\nsmall businesses are defined as those that employ 20 people, and medium businesses\nare those that employ 20 or more, but not more than 200 (Freeman and Lawley, 2005).\nThis paper adopts the latter definition.", "word_count": 394, "start_char": 8016, "end_char": 10501}
{"chunk_id": "DOC0082__00004", "doc_id": "DOC0082", "chunk_index": 4, "text": "n the other hand, SMEs are defined as those\nbusiness organizations with less than 100 employees (Macqueen, 2004).S\n\npecifically,\nsmall businesses are defined as those that employ 20 people, and medium businesses\nare those that employ 20 or more, but not more than 200 (Freeman and Lawley, 2005).T\n\nhis paper adopts the latter definition.\n\nSMEs often account for the majority of firms and a substantial proportion of\nemployment in both developed and developing states ( Liedholm and Mead, 1987;\nOECD, 2000; Hallberg, 2001).Were it not for the ability of SMEs to create jobs, the\nmajority of Africans would be unemployed (Corey, 2006). SME are important in that\nthey operate even in the poorest communities which warrants them appropriate support\nirrespective of any other advantages or disadvantages (Haggblade et al., 2002). SMEs\n\ndo not operate in a vacuum hence their activities and impact are influenced by the\ncontext in which they operate. There is a broad range of policy environments and\nbusiness strategies that have a wide spectrum of impacts on them. For instance, market\nfailures disproportionately affect them. Such inequity warrants support (Biggs, 2002;\nBeck et al., 2003). There are strong links between the debates on SMEs versus largescale firms, and the debates on localization versus globalization of trade. SMEs might\nbe in favour of localization and large firms might favour international trade (Macqueen,\n2004).In spite of such skeptical debates, there have been many attempts to enhance the\nexport capacity of African SMEs, because the challenges faced by firms in developing\neconomies compared with developed economies most likely lead to different\nimplications for managers and policy makers in these contexts (Neupert et al., 2006).", "word_count": 274, "start_char": 10164, "end_char": 11922}
{"chunk_id": "DOC0082__00005", "doc_id": "DOC0082", "chunk_index": 5, "text": "International Trade Theory and SMEs in International Trade\nInternational trade theory offers an explanation for the pattern of international trade,\nand the distribution of the gains from trade. While many economists agree about the\nbenefits of liberal trade, many other people are not persuaded by it arguments. The\ntraditional theory of international trade is based on the classical labour cost theory and\nthe neo- classical factor endowment theory (Todaro, 1995). The former emphasizes\ndifferences among nations (Risse 2005, in Hoskyns 2006) through the principle of\ncomparative advantage, arguing that nations should specialize in the export of those\nproducts which they can produce at the lowest relative cost. The latter proposes that\ndifferent products require productive factors in different relative proportions, and that\ncountries have different endowments of factors of production. These theories imply\nthat free international trade would benefit all the nations of the world as well as\nmaximize global output. Todaro however points out that the restrictive and unreal\nassumptions on which these theories are based lead to faulty conclusions about the\nstructure of world trade and the distribution of its benefits, since these assumptions are\nin many ways contrary to the reality in international economic relations between\nnations. Stiglitz and Charlton (2005) concur and further explain that conventional trade\ntheory is flawed because it assumes full employment and no restrictions on resources.\nThis is not the case for many developing countries that suffer from high levels of\nunemployment and limited resources which constrain the gains that can be expected\nfrom trade. In summary, factor endowments and comparative costs are dynamic, and\noften determine the nature and character of international specialization (Todaro\n1995:338). This means that any initial state of unequal resource endowments (e.g.\ntechnology and capital) will tend to be reinforced and exacerbated by trade, reinforcing\nalready unequal trading relationships and distributing the benefits in favour of those\nwho already have, thus perpetuating the physical and human underdevelopment that\ncharacterizes many developing countries. In spite of all this, developing countries are\naware that self-reliance and isolation is not the solution. Todaro suggests a two-\n\npronged approach: negotiate with the first world for removal of tariff and non-tariff\nbarriers, as well as utilize their scarce resources efficiently. The first suggestion has\nresulted in trade preferences which the developing countries have failed to utilize. The\nlatter recommendation has proved difficult to implement because of many policyrelated and other constraints within the micro and macro environment of firms in SSA.\nThe next section scrutinizes the debate on policy-related constraints.", "word_count": 418, "start_char": 11922, "end_char": 14768}
{"chunk_id": "DOC0082__00006", "doc_id": "DOC0082", "chunk_index": 6, "text": "he first suggestion has\nresulted in trade preferences which the developing countries have failed to utilize.T\n\nhe\nlatter recommendation has proved difficult to implement because of many policyrelated and other constraints within the micro and macro environment of firms in SSA.T\n\nhe next section scrutinizes the debate on policy-related constraints.\n\nInstitutional Weaknesses and Protectionism\nIn a very competitive environment, as is the case under globalization, there is\nincreased competition which results in a reduction in the ability of SMEs to control\ntheir development paths (Etmad et al., (2001) in Todd and Javalgi, 2007). In such a\nsituation, there is a need to identify and understand factors that have an impact on\ninternational performance (Kuivalainen et al., (2004) in Todd and Javalgi 2007). This\nsection examines why export performance by many developing countries has been\nbleak.", "word_count": 135, "start_char": 14419, "end_char": 15317}
{"chunk_id": "DOC0082__00007", "doc_id": "DOC0082", "chunk_index": 7, "text": "n such a\nsituation, there is a need to identify and understand factors that have an impact on\ninternational performance (Kuivalainen et al., (2004) in Todd and Javalgi 2007).T\n\nhis\nsection examines why export performance by many developing countries has been\nbleak.\n\nFirst, some researchers argue that foreign protectionism is not responsible for the poor\ntrade and economic performance in SSA (Ng and Yeats in Tupy, 2005). Proponents of\nthis view urge that, while it is true that preferential trade agreements at times include\nrestrictions against LDC exports, e.g. phytosanitary regulations and administrative\ncosts which combine to raise the cost of production in these countries (the ban on fish\nexports from East Africa to Europe in 2005 is an example), domestic conditions in SSA\nare more responsible for the problem. Of particular importance in this regard are\nfactors like political instability, e.g. the war in Northern Uganda that has taken close to\n20 years (Ohtswamah, 2008), plus other governance issues like lack of the rule of law\nand corruption (Zachary ,2008). Second, the dismal performance of SSA in\ninternational trade is explained in terms of trade openness. The argument is that trade\nliberalization enables more efficient allocation of resources to productive uses, and\ncountries with an abundant supply of unskilled labour and low labour costs can expand\nproduction and employment in labour intensive industries (Bigman, 2002). In spite of\nthis, and despite substantial declines in applied and bound tariffs, protectionism is very\nmuch alive and SSA is more guilty of the offence since its average tariffs are more\nthan three times higher than developed country tariffs, making it one of the world’s\nmost protectionist regions (Tupy ,2005 ). He espouses that SSA leaders view imports as\na threat, pay lip service to liberalization and call for greater access to global markets,\nwhile rejecting trade openness in their countries. They do not appreciate the positive\nimpact of foreign competition on stimulating domestic production (e.g. the rise in\neconomic growth of India and South East Asia is partly attributed to an increase in\nproductivity as a result of trade liberalization) and do not realize that the import\nsubstitution model was dismantled because it rewarded inefficiency, undermined\n\ncompetitiveness, bred corruption, penalized consumers, discouraged technological\ntransfer, etc. In short, lack of trade openness has bred incompetence and lack of\ncompetitiveness, thus pushing developing world products out of developed world\nmarkets.", "word_count": 396, "start_char": 15052, "end_char": 17623}
{"chunk_id": "DOC0082__00008", "doc_id": "DOC0082", "chunk_index": 8, "text": "n short, lack of trade openness has bred incompetence and lack of\ncompetitiveness, thus pushing developing world products out of developed world\nmarkets.\n\nThe above arguments are of course challenged by many workers and international\nbodies who underscore the failed experience of many countries in SSA (Bigman,\n2002). For example, Oxfam (a Non-Government Organization) argues for more trade\nreforms in developed markets, while rejecting similar policies in the developing world\n(Tupy, 2005). Particular emphasis is put on trade distortions brought about by\nsubsidies to farmers in first-world countries which continue to account for the drop in\nprices of many such subsidized products, making SSA unable to compete. Stiglitz\nand Charlton (2005) call for caution, pointing out that more successful developing\neconomies like the Asian countries have pursued trade liberalization selectively,\nslowing it down where necessary and introducing complementary policies. Further,\nsince the assumption of full employment in trade theories violates the reality of\nunemployment and underemployment in many developing countries, they may be\njustified in pursuing protectionist strategies in order to ensure sufficient job\nopportunities and also absorb surplus labour in their economies (Todaro, 1995).\n\nSMEs Constraints to Export trade\nApart from the issues of protectionism and liberalization discussed above, many\nresearchers agree that the rapid and sustained growth in Asia and the deficiency of this\nin a large part of Africa reflects weaknesses in domestic policy and institutions, and\nthat the major constraints facing African export diversification and expansion are\nsupply-side constraints (Francois et al., 2005).They argue that domestic reforms are\nurgently required if economic growth in SSA is to become a reality. Since\nentrepreneurship and economic growth are related (Beyene, 2002; Gupta et al., 2004 in\nTodd and Javalgi, 2007), African countries must realize that, to promote growth, they\nshould provide a conducive macro- economic environment in which the private sector\ncan flourish. Such an environment continues to elude many of them because of the\nnumerous constraints within their economies. There have been many attempts by\nvarious scholars to classify the export barriers faced by SMEs in their path to\ninternationalization. Tesar and Trelton (1982) in Neupert et al., (2006) divide them into\nstart–up constraints (e.g. start-up costs, identifying opportunities) and ongoing export\nproblems (e.g. standards and different consumer tastes). Beyene (2002), drawing on\nempirical studies by the ECA, categorized them into policy and regulatory factors,\ninfrastructure, access to finance, lack of non financial support services, and lack of\nsupport services for marketing, while Leonidou (2004) , as well as Tesform and Lutz\n(2006), through a literature search, classify them into internal and external barriers. The", "word_count": 428, "start_char": 17470, "end_char": 20393}
{"chunk_id": "DOC0082__00009", "doc_id": "DOC0082", "chunk_index": 9, "text": "eyene (2002), drawing on\nempirical studies by the ECA, categorized them into policy and regulatory factors,\ninfrastructure, access to finance, lack of non financial support services, and lack of\nsupport services for marketing, while Leonidou (2004) , as well as Tesform and Lutz\n(2006), through a literature search, classify them into internal and external barriers.T\n\nhe\n\ninternal factors (micro environment) are those that apply to individual firms and are\nusually associated with inadequate resources for exporting. They are subdivided into\ncompany capabilities (Katsikeas and Morgan, 1994) and product characteristics (Keng\nand Jiun (1989) in Tesfom and Lutz, 2006). The external forces are those that are not\nunder the control of the individual firms or industry e.g. industry factors, export market\nissues and macro-economic factors. Scharf et al., (2001) in Neupert et al., (2006), using\nqualitative methodology through the critical incident technique, classify these barriers\ninto those relating to initiating export business or ongoing export operations. The table\nbelow is an attempt to summarize these constraints.\n\nTable 1: Export Constraints Facing African SMEs\n\nBesides constraint number 6 (firm level), the table shows the key external forces that\nhinder SSA SMEs in their quest to enter international markets. Empirical studies by\n\nConstraint\nDescription of constraint\nMajor source\nCompetition\nMain competitive strength being in economic\nsectors where international competition is\nintense.\nWorld Bank, 2000 ;\nOyejide, 2005.\nIndustrial\nsophistication\nand technology\nShifting technology plus obsolete technology.\nWorld Bank, 2000.\n\nInfrastructure\ndevelopment\nPoor\ninfrastructure\n(telecommunication,\npower, transport, water, sanitation and finance)\nWorld Bank, 2000.\nBeyene 2002\nPolicy matters\n- Inadequate compensation for exporters\n- Inadequate integration of trade policy in\nnational development plans.\n-\nhostile\ndomestic\npolicy,\nregulatory\nframework.\nWorld Bank, 2000;\nTupy 2005, Francois et al.,\n2004., ECA 2001.\nBrenton and Hoppe, 2006.\nPhytosanitary\nmeasures\nComplex health, safety and environmental\nstandards\nITC,\n2001;\nJaffet\nand\nHenson 2004, Tupy 2005\nFirm level\nProduction and marketing know-how, access\nto finance\nITC, 2001.,Beyene2002,\nLeonidou 2004.Keng and\nJiun 1989, Katsikeas and\nMorgan 1994.\nExports structure\nMajor exports and their distribution\nOyejide 2005; Ng and Yeats\n2004.\nBrenton and Hoppe 2006\nErosion of trade\npreferences.\n\nFrancois et al., 2005\nLow et al 2005\nRules of origin\nDifferences in applicability\nBrenton and Kenzuki 2004\nBrenton and Hoppe 2006", "word_count": 369, "start_char": 20022, "end_char": 22616}
{"chunk_id": "DOC0082__00010", "doc_id": "DOC0082", "chunk_index": 10, "text": "xports structure\nMajor exports and their distribution\nOyejide 2005; Ng and Yeats\n2004.B\n\nrenton and Hoppe 2006\nErosion of trade\npreferences.F\n\nrancois et al., 2005\nLow et al 2005\nRules of origin\nDifferences in applicability\nBrenton and Kenzuki 2004\nBrenton and Hoppe 2006\n\nthe ECA (2001) indicate that policy matters and regulatory restrictions, which include\nissues such as fiscal and monetary policy, regulations that impact the cost of business,\nplus infrastructure, all affect SMEs to a great extent. Other key barriers include\nconditionality phrases in the trade arrangements (tariff and non-tariff barriers) that\nmake it hard for SSA to utilize the preferences offered to them by the first world. In\nfact research by IMF shows that AGOA stands to yield only 19-26% of the benefits\nthat it could have yielded, if it were free and unconditional ( Mattoo et al., 2002 in\nTupy, 2006).\n\nAll these constraints (both internal and external) combine to prevent the SMEs from\nrealizing their full potential as instruments of development. They not only constrain\ntheir growth, but they also push up their transaction costs thus making their products\nless competitive locally and internationally (Beyene, 2000). The next section discusses\nthe impact of some of these constraints on AGOA trade.\nSSA and AGOA\nThere have been many attempts to enhance the export capacity of African SMEs since\nthe launch of the original AGOA in 2000. Consequently four hubs for global\ncompetitiveness have been established in Botswana, Ghana, Kenya and Senegal. Even\nthen, African SMEs continue to lag behind in their ability to enjoy AGOA benefits\n(Corey, 2006) due to a number of factors.", "word_count": 267, "start_char": 22345, "end_char": 24009}
{"chunk_id": "DOC0082__00011", "doc_id": "DOC0082", "chunk_index": 11, "text": "onsequently four hubs for global\ncompetitiveness have been established in Botswana, Ghana, Kenya and Senegal.E\n\nven\nthen, African SMEs continue to lag behind in their ability to enjoy AGOA benefits\n(Corey, 2006) due to a number of factors.\n\nFirstly, it remains a fact that, for certain African countries, US preferences are of little\nor no relevance under the current structure of their exports since there are no or just a\nfew export products that are eligible for the available preferences (Oyejide, 2005). For\nexampla many entrepreneurs are part of agriculture and yet many agricultural products\nare not part of AGOA (Corey, 2006). Even then, most of these agricultural exports are\nin the form of primary commodities and yet this structure is unlikely to change in the\nmedium to short term (Ng and Yeats, 2000). Generally, there are many countries in\nAfrica for whom the amount of exports eligible for preferential access to the US market\ncomprises less then 50% of total exports to the market (see table 2). Only 5 countries\nhave over 90% of their trade to the US covered by trade preferences, namely; Lesotho\n100%, Nigeria 98.4%, Cape Verde 97.7%, Gabon 99.4% and Mauritius 94.5%\n(Oyejide, 2005). Secondly, increased competition in the market for products which\nbenefit from the preferences may inflict losses on African countries that depend heavily\non such products (Oyejide, 2005)\n\nThe predicament facing African countries is further worsened by the fact that more\nthan 900 tariff lines for manufactured products, e.g. textiles and leather, are not covered\nby AGOA. Also excluded are diary products, soft drinks, cocoa, coffee, tea, tobacco,\n\nand nuts. The average tariff on products excluded from AGOA is 30%. As a result,\nAfrican exporters still face substantial tariff escalation (Brenton and Hoppe, 2004). The\nUS subsidy scheme for cotton is also undermining export returns from African\nproducers. It is often asserted that stimulating the textile sector in African countries is a\nkey objective of AGOA, yet textile products from African countries are subjected to\nduties in the US.\n\nTable 2: Value of AGOA Preferences in 2004\n\n0-2%\n2-5%\n5-10 %\n>10 %\nAngola,\nBurkina\nFaso,\nBenin,\nCameroon, Djibouti, Chad, Congo,\nDR Congo, Gabon, Gambia, Ghana,\nGuinea,\nGuinea-Bissau,\nMali,\nMauritania, Niger, Nigeria, Rwanda,\nSao Tome, Senegal, Seychelles,\nSierra Leone, South Africa, Zambia\nEthiopia,\nTanzania,\nUganda\nBotswana,\nMozambique,\nNamibia\nCape\nVerde,\nKenya,\nLesotho,\nMadagascar,\nMalawi,\nMauritius,\nSwaziland\nSource: Brenton and Hoppe 2004.", "word_count": 399, "start_char": 23770, "end_char": 26315}
{"chunk_id": "DOC0082__00012", "doc_id": "DOC0082", "chunk_index": 12, "text": "In Table 2 above, Brenton and Hoppe (2004) show that for the majority of African\nbeneficiaries, the value of preferences is very small or negligible. For 24 of the then 37\nbeneficiaries the value of preferences was less than 2 per cent of the value of exports to\nthe US in 2004. For only 7 countries did the value of preferences exceed 10 percent of\nthe value of exports to the USA.\n\nUganda in the AGOA Market\nSpecifically for Uganda, besides most of the above constraints that apply to most of\nsub-Saharan Africa, the ECA survey (2000) established that the regulatory and policy\nenvironment, poor infrastructure in terms of power (availability and cost) as well as\naccess to finance were key constraints hindering the growth of SMEs. Besides these,\nthe African Competitiveness Report (2005) points out weakness and lack of\ntransparency in tax administration, commercial injustice, cumbersome customs\nprocedures, labour constraints (lack of middle managers), lack of access to market\ninformation and a poor entrepreneurial culture as key constraints affecting Ugandan\nSMEs. Further, UEPB (2005) also adds that little is known about the American market\n\nin terms of consumer behaviour and trade practices and continues to point out that\ninadequate product volumes and the long and arduous certification process are major\nconstraints hindering exports to the USA under AGOA. To this list, Kwesiga (2001)\nadds the lack of foreign domestic investment, lack of export processing zones, and the\ninability of Ugandan businessmen to think globally .These constraints combined make\nthe performance of Ugandan SMEs in the export market very bleak compared with\nother countries like neighbouring Kenya . However in the case of AGOA (a new\nmarket), the situation is worse compared with the European Union for example.\nUgandan exports to the USA are limited, yet both regions offer the country preferences\nas indicated in the table below:\n\nTable 3: Ugandan Exports by Region and Country of Destination (000US$) 2001 -\n2005.\n\nUnited Kingdom\n28,806\n30,015\n33,883\n29,438\n26,831\nGermany, Federal Republic\n12,134\n13,399\n12,024\n17,677\n33,768\nBelgium\n16,085\n21,902\n12,899\n26,685\n33,147\nNetherlands\n52,803\n56,000\n48,955\n57,860\n85,413\nFrance\n4,057\n6,844\n5,116\n22,702\n39,581\nSpain\n7,961\n17,732\n14,526\n13,914\n17,988\nOther\n6,393\n10,495\n13,127\n13,481\n15,979\nUnited States\n6,743\n9,190\n12,693\n15,714\n15,892\nCanada\n1,765\n3,064\n2,094\nOther\nSource: Uganda Exports Promotion Board (2005)", "word_count": 385, "start_char": 26315, "end_char": 28770}
{"chunk_id": "DOC0082__00013", "doc_id": "DOC0082", "chunk_index": 13, "text": "This table indicates that Uganda is yet to fully realize the benefits of AGOA. Total\nUgandan exports to the European Union (Lome and Cotonou preferences) are far\nhigher than those to the USA (AGOA preferences) in the period 2001-2005. Total\nexports to the USA more than doubled in this period but are far less than those of\nindividual countries except France (but only for the first 3 years). All this is in spite of\nthe fact that the Ugandan Head of state was the first African President to embrace\nAGOA, and jointly with the US, Uganda sponsored a seminar in 2002 with the theme\n‘Maximizing Benefits of AGOA” in East Africa (Kwesiga, 2002).\n\nSuch concerns point to the need for a study with an adapted questionnaire suitable for\nthe Uganda export sector and cultural environment. The battery of items in the\nquestionnaire should enable ranking of the importance of the constraints as well as\n\ngauge the respondents’ overall satisfaction with the way the government has handled\nthese constraints. The next section presents the methodology used in the construction of\nthe questionnaire, subsequent data collection and analysis.\nMETHODODOLOGY\nThis section gives an account of the methodology that was used to fulfil the objectives\nof the study. In order to fulfil the first two objectives, the suggestion by Tesfom and\nLutz (2006) was adopted, i.e. the export constraints facing SMEs are factor analyzed\nso as to rank them and also examine their underlying dimensions. The third objective of\nthe study was fulfilled through gauging the perceptions of SMEs about the way the\ngovernment has handled the constraints. The procedure below was followed:\n\nSample and sampling method\nThe study sample consisted of 2 apparel firms, 80 exporters of art crafts (middle men)\n18 exporters of agricultural products, 2 officials from the Ministry of Trade and\nIndustry, 2 from the AGOA country office and 2 officers from the Uganda Export\nPromotion Board. However, only 100 usable questionnaires were collected in all. This\nsample size is adequate according to Barret and Kline (in Kline 2000), who established\nin a study that in factor analysis, the main factors remained clear and unequivocal until\nthe sample dropped below 100. Exporters were identified through the AGOA country\noffice, and the snow balling technique. The snow-balling technique is a sampling\nmethod in which a researcher selects several people from a sampling framework for\ninterview and these people assist the researcher in identifying others to interview\n(Coolican, 2004: 40). Snowballing was used because the AGOA country office is yet\nto establish a directory of exporters. Therefore, respondents were asked to identify\nwho else is engaged in this business while government officials were purposively\nchosen.", "word_count": 444, "start_char": 28770, "end_char": 31538}
{"chunk_id": "DOC0082__00014", "doc_id": "DOC0082", "chunk_index": 14, "text": "nowballing was used because the AGOA country office is yet\nto establish a directory of exporters.T\n\nherefore, respondents were asked to identify\nwho else is engaged in this business while government officials were purposively\nchosen.\n\nVariable construction and validity test\nFirst a review of the extant literature was done to identify the constraints currently\nfacing Ugandan exports to the USA under AGOA. This was followed by a qualitative\nstudy (Focus Group Discussion) that involved four people who are conversant with\nbusiness to the AGOA market, plus conversations with knowledgeable academicians in\nboth international marketing and international trade. This whole effort yielded a total of\n45 likely items for inclusion in the draft questionnaire.\nIn order to establish the face/content validity of these items, they were subjected to a\nreview by two experts, one from UPTOP (Uganda Programme for Trade Opportunities)\nand another from the AGOA country office. They also examined these items for\n\nrelevance, ambiguity and repetitions. This exercise ended up with in 14 items being\ndropped, leaving only 31 which were then included in the final questionnaire; these\nitems were randomized to avoid any cluster effects. The scale in the questionnaire\nwas anchored from ‘1’ not at all, to ‘7’ extremely large extent. Respondents were\nrequested to rate the extent to which each of the items (constraints) affects exports to\nthe AGOA market. A pretest was carried out using 5 exporters, all of whom found no\ndifficulty in answering the questions. Pre-testing provides a statistical basis to shorten\nlong survey instruments without sacrificing their explanatory power since respondents\nmay perceive long instruments as cumbersome and this may contribute to non-response\n(Siekpe, 2005: 38).\n\nThe psychometric properties of the instrument were assessed using SPSS by\nexamining Cronbach’s alpha (α). All items had alpha above 0.7 cut-off recommended\nby Nunnally (1978) and overall α for the whole instrument was 0.8927, which is well\nwithin the range recommended by Nunnally and Bernstein (1994). This shows that the\nmeasure was robust. Following Greenland et al., (2005) factor analysis was then\ncarried out by first constructing a Pearsonian correlation matrix between each pair of\nthe 31 items. Bartlett’s test of sphericity was done to test the null hypothesis that the\nresultant 31x31 correlation matrix was an identity matrix, all diagonal coefficients are\nequal to one, and off diagonal items are zero (those that are not zero are due to chance).\nThe null hypothesis was rejected (χ2", "word_count": 402, "start_char": 31305, "end_char": 33892}
{"chunk_id": "DOC0082__00015", "doc_id": "DOC0082", "chunk_index": 15, "text": "artlett’s test of sphericity was done to test the null hypothesis that the\nresultant 31x31 correlation matrix was an identity matrix, all diagonal coefficients are\nequal to one, and off diagonal items are zero (those that are not zero are due to chance).T\n\nhe null hypothesis was rejected (χ2\n\n= 1203.421, df=465, p=0.000) meaning that factor\nanalysis could proceed. The Kaiser Meyer-Olkin (KMO) test of sampling adequacy\nindicated a coefficient of 0.723, which is interpreted as middling (Kaiser, 1974), further\nreinforcing that factor analysis was appropriate (the closer to 1.0 the better). Maximum\nlikelihood extraction by direct oblimin rotation with Kaiser Normalization yielded 6\noblique factors each with eigen value greater than one and accounting for 57.8% of the\nvariance. A useful factor must account for one unit of variance or have Eigen value >1.\nOblique factors were preferred because they rotate to simple structure and also agree\nmore with psychological theory than do orthogonal factors (Kline, 2005). The factors\nwere subsequently named:\n\nTable 4 : Factors affecting exports to AGOA\nLatent factor\nItem loading at >0.5\nEigen\nvalue\nLoading\nAVE\n√AVE\nΑ\nMiddle\nManagers\nPoor entrepreneurial culture\n\nLack of middle managers\n7.8\n0.561\n\n0.971\n\n0.63\n0.79\n0.70\nInfrastructure\nHigh cost of skilled labour\n\nHigh cost of technology\n\nPoor infrastructure\n2.245\n0.813\n\n0.582\n\n0.783\n0.54\n0.73\n0.7344\nTechnology/\nProduct\ninnovation\nInappropriate Technology\n\nInadequate Product\ninnovation\n\nUnfamiliarity with\nAmerican consumer\nbehaviour\n\nInadequate export Insurance\nschemes\n1.1881\n0.836\n\n0.534\n\n0.545\n\n0.514\n0.38\n0.62\n0.70\nMarketing\nLimited access to market\ninformation\n\nLimited knowledge of\nGlobal best Practices\n\nPoor marketing Skills\n1.740\n0.537\n\n0.836\n\n0.574\n0.44\n0.66\n0.7114\nExport Credit\nUnfamiliarity with\nAmerican Trade Practices\n\nInadequate Export credit\n\nInadequate academic\nResearch\n1.539\n0.643\n\n0.636\n\n0.591\n0.39\n0.62\n0.701\nGovernance\nIssues\nRestrictive Rules of Origin\n\nGovernance issues\n1.298\n0.588\n\n0.567\n0.33\n0.58\n0.60\n\nExtraction method: Maximum likelihood estimation\nRotation method: Oblimin with Kaiser Normalization\n\nThe table above shows the named factors / constructs ( column 1 ) and their\nindicators ( items) in column 2, each with factor loading greater than 0.5. Hair et al.,\n\n2003 (in Barnes 2007) affirm that a measure is loaded significantly on its underlying\nconstruct if its factor loading exceeds 0.5, which is indicative of nomological validity.\nThe table also shows the Average Variance Extracted1", "word_count": 375, "start_char": 33600, "end_char": 36133}
{"chunk_id": "DOC0082__00016", "doc_id": "DOC0082", "chunk_index": 16, "text": "air et al.,\n\n2003 (in Barnes 2007) affirm that a measure is loaded significantly on its underlying\nconstruct if its factor loading exceeds 0.5, which is indicative of nomological validity.T\n\nhe table also shows the Average Variance Extracted1\n\n(AVE) of the different factors,\nwhich is defined as the average variance shared between a construct and its measures\n(Reinartz, Kraft and Hoyer, 2003). A factor should reach 0.5 cut-off recommended by\nFornell and Lacker (1981) for convergent validity, although only 2 factors achieve this\nlevel in this study. However it is not un-common to find measures of an estimated\nmodel with squared loadings below the 0.5 threshold (Sorebo, Christensen and\nEikebrokk, 2004) particularly for newly developed items and scales. Hulland (in\nSorebo et al., 2004) recommends a suitable cut-off value as 0.16 or 0.25. The table\nalso shows that all factors had acceptable reliabilities (0.7 and above) except factor 6\nwith a reliability of 0.6. It has been suggested however that Cronbachs alpha should be\nabove 0.6 for exploratory research and above 0.70 for confirmatory research and that in\nthe case of a scale with two or three items, a coefficient alpha of 0.60 or 0.50 is\nacceptable as a minimum standard (Cortina, 1993). Loewenthal (2001:60) concurs\nwhen she argues that if a scale has a small number of items, it may not be possible to\nget a high reliability value and thus a coefficient of 0.6 may be sufficient. Based on\nthese arguments, factor 6 was not excluded from subsequent analysis. Lastly, since\nthe inter-correlation between pairs of the constructs did not exceed 0.9, the problem of\nmulticollinearity was ignored (Hair et al., 1998).\nNext, the discriminant validity of these factors was examined. Discriminant validity is\na measure of the extent to which constructs (latent factors) are distinct, i.e. they\nshould not correlate so highly as to seem to be measuring the same underlying\ndimension (Siekpe 2005). Discriminant validity can be assessed by examining the\nfactor correlation matrix and AVE. The square root of AVE should exceed the\ncorrelations in the rows and columns for adequate discriminant validity, which\nindicates that more variance is shared between the construct and its indicators than with\nother constructs (Fornell and Lacker in Siekpe, 2005). This is the case in table 5 below.\n\nTable 5: Factor correlation matrix and discriminant validity of factors\n\nΑ\n0.790\n\n0.70\n0.234\n0.729\n\n0.73\n0.379\n0.251\n0.62\n\n0.70\n0.199\n0.132\n0.182\n0.66\n\n0.71\n0.258\n0.331\n0.300\n0.116\n0.62\n\n0.70\n0.210\n0.337\n0.228\n0.153\n0.261\n0.58\n0.60\nSquare root of AVE in bold in the diagonal.", "word_count": 426, "start_char": 35891, "end_char": 38514}
{"chunk_id": "DOC0082__00017", "doc_id": "DOC0082", "chunk_index": 17, "text": "his is the case in table 5 below.T\n\nable 5: Factor correlation matrix and discriminant validity of factors\n\nΑ\n0.790\n\n0.70\n0.234\n0.729\n\n0.73\n0.379\n0.251\n0.62\n\n0.70\n0.199\n0.132\n0.182\n0.66\n\n0.71\n0.258\n0.331\n0.300\n0.116\n0.62\n\n0.70\n0.210\n0.337\n0.228\n0.153\n0.261\n0.58\n0.60\nSquare root of AVE in bold in the diagonal.\n\nAnother approach to assessing discriminant validity is to examine the factor\nreliabilities and the inter-factor correlations. For adequate discriminant validity, the\nreliability coefficients should be greater than the correlation coefficients (Anderson and\nGerbing 1988) in Siekpe (2005) as evidenced above.\n\nSatisfaction with Government efforts to eliminate the constraints\n\nIn order fulfil third objective of the study, i.e. establish whether the government was\ndoing something significant about the elimination of these constraints, the perceptions\nof the SMEs were sought. Respondents were requested to rate the extent to which they\nwere satisfied with the way the government has handled the elimination of these\nconstraints on a 7 point likert scale, ranging from 1 “not at all” to 7 “ strongly\nagree”. This overall question has been used in many satisfaction studies (e.g.\nParasuramman et al 1988). Tables 6 and 7 below present the results.\n\nStatistics\n\nTable 6: To What extent are you satisfied with the way the government has\nhandled the elimination of these constraints?\n\nN\n\nMean\nStd. Deviation\nVariance\nSkewness\nStd. Error or Skewness\nKurtosis\nStd. Error of Kurtosis\n3.32\n1.64\n2.68\n.482\n.241\n-567\n.478\n\nTable: 7: To What extent are you satisfied with the way the government has\nhandled the elimination of these constraints?\n\nFrequency\nValid\nCumulative\nValid Not at All\nSlightly Moderate Extent\nModerate extent\nModerately Large Extent\nLarge Extent\nVery Large Extent\nExtremely Large Extent\nTotal\n13.0\n22.0\n26.0\n14.0\n13.0\n8.0\n4.0\n100.0\n13.0\n22.0\n26.0\n14.0\n13.0\n8.0\n4.0\n100.0\n13.0\n35.0\n61.0\n75.0\n88.0\n96.0\n100.0", "word_count": 307, "start_char": 38204, "end_char": 40133}
{"chunk_id": "DOC0082__00018", "doc_id": "DOC0082", "chunk_index": 18, "text": "requency\nValid\nCumulative\nValid Not at All\nSlightly Moderate Extent\nModerate extent\nModerately Large Extent\nLarge Extent\nVery Large Extent\nExtremely Large Extent\nTotal\n13.0\n22.0\n26.0\n14.0\n13.0\n8.0\n4.0\n100.0\n13.0\n22.0\n26.0\n14.0\n13.0\n8.0\n4.0\n100.0\n13.0\n35.0\n61.0\n75.0\n88.0\n96.0\n100.0\n\nThe tables show the perceptions of the SMEs regarding the government is handling of\nthe constraints .The statistics show that the data is negatively skewed which means that\nmost of the respondents are not satisfied with the way the government is handling the\nconstraints. This is particularly obvious in view of the findings in table 4.\nDISCUSSION\nFirstly, it is imperative to note that many LDCs have little capacity within government\nand the private sector to identify the constraints that hinder SMEs from going\ninternational (Brenton and Hoppe, 2006). Secondly, all the 6 identified factors and\ntheir underlying dimensions are important distinct constraints that hinder Ugandan\nSMEs from accessing the AGOA market. However, Factor analysis reveals (Table 4)\nthat lack of middle managers, infrastructure, technology, marketing issues, lack of\nexport credit, and governance issues (in order of importance) are the most crucial\nconstraints facing Ugandan SMEs in the AGOA market. These findings are in\nconsonance with the clusters hypothesized by Tesform and Lutz (2006). Lack of\nmiddle managers, inadequate export credit and marketing issues are similar to the\ninternal company barriers /forces identified by Tesform and Lutz, while infrastructure,\ntechnology and governance issues can be clustered as external forces in their model.\n\nIn agreement with Yang et al 1992( lack of personnel to administer exporting activities)\nand the African Competitiveness Report (2005), this study finds that lack of middle\nmanagers (and a poor entrepreneurial culture) are the factors that most hinder exports\nto the AGOA market. Although Universities churn out many managers every year,\nmany of them do not live up to the expectations of the employers as established in a\nstudy by Asiimwe et al., ( 2000) on local government in Uganda. In this study,\nuniversity graduates were found to be lacking practical skills, had low motivation,\nlacked dedication, were unable to solve problems, had narrow focus and lacked cross-\n\ncutting multi-displinary and integrative knowledge. Another problem in this regard\nis the lack of a good work ethic among Ugandan managers as postulated by Ntayi\n(2005:156), that work as a determinant of personal value and identity and as an\nindicator of good character and good morals is disappearing out in Uganda.", "word_count": 409, "start_char": 39852, "end_char": 42460}
{"chunk_id": "DOC0082__00019", "doc_id": "DOC0082", "chunk_index": 19, "text": "nother problem in this regard\nis the lack of a good work ethic among Ugandan managers as postulated by Ntayi\n(2005:156), that work as a determinant of personal value and identity and as an\nindicator of good character and good morals is disappearing out in Uganda.\n\nFor example, graduates who find a job after years of street walking spend more time\ncontemplating greener pastures than doing their assignment in the first week of their\nemployment (Twinamatsiko in Ntayi 2005). Therefore it is not surprising that many\nfirms in many sectors (e.g. flowers and textiles) hire non-Ugandan middle managers.\nHowever, the issue of entrepreneurship is controversial given that Walter et al., (2003)\nestablished that Uganda is the most entrepreneurial country in the world in terms of\nnecessity and opportunity entrepreneurship. The former is involuntary and is driven by\nnecessity while the latter is voluntary and motivated by the pursuit of perceived\nopportunities (Reynolds et al., in Walter et al., 2003: 20). Uganda is reported as being\nthree times as entrepreneurial as the USA, yet Uganda is a poor country. The likely\nexplanation in this case could be in terms of government policy as a factor limiting\nentrepreneurship. Walter et al., (2003) argue that the regulatory and administrative\nburden associated with entrepreneurship is too high in Uganda. The tax system is not\nconducive to the development of entrepreneurial firms and it seems government\nunderstanding of entrepreneurship is not sufficient. Thus the strong entrepreneurial\nspirit is wasted if the conditions handicap entrepreneurship in trying to compete at a\nglobal level. As Kasekende et al., (2002) observe, there is a positive correlation\nbetween a good policy environment and economic growth. Therefore, it is apparent that\ndesigning policies and programme that promote the growth of SMEs must be the\ncornerstone of any growth strategy for this country.", "word_count": 302, "start_char": 42197, "end_char": 44117}
{"chunk_id": "DOC0082__00020", "doc_id": "DOC0082", "chunk_index": 20, "text": "s Kasekende et al., (2002) observe, there is a positive correlation\nbetween a good policy environment and economic growth.T\n\nherefore, it is apparent that\ndesigning policies and programme that promote the growth of SMEs must be the\ncornerstone of any growth strategy for this country.\n\nIt is universally agreed that for policy coherence and overall effectiveness, trade policy\nshould be mainstreamed into a country’s overall development strategy (Oyejide 2004).\nWhile government has taken steps to streamline trade matters into the overall\ndevelopment plan (PEAP- Poverty Eradication Action Plan), there is a need to also\nfocus on the capacity of the individual exporters who are behind the SMEs. In this\nrespect Ugandan exporters to AGOA have benefited a lot from the USA trade hub in\nNairobi. On the other hand, marketing issues stand out as important in affecting\nexports to AGOA, consistent with Katsikeas and Morgan (1994), who underscore the\nimportance of organizational capacity to execute the marketing function. In the case of\napparel for example, American firms have a lot of bargaining power compared with the\ngarment producer, who must comply with given specifications in terms of sizes,\nlabeling, packaging etc. (USAID Report, 2001). Thus access to market information,\nmarketing skills, familiarity with global best practices and knowledge of the export\nmarket become critical factors for success, in agreement with Weaver and Pack (1990);\n\nBordur (1986); and Karafakioglu (1986). These factors combine to worsen an already\nprecarious situation and account for many lost opportunities. Thus steps must be taken\nto equip SMEs with knowledge about marketing issues in order for them not to lose out\non matters that they would otherwise control. Today the world is “a global village” and\nthe environment is more competitive than ever before. Specifically, access to\ninformation is critical because inadequate information or information received late\nspells doom for the SMEs.\n\nThe findings indicate that availability of export credit is a critical factor in the bid by\nSMEs to export to AGOA, in agreement with Tesform and Lutz. Beyene (2002) also\nfinds that access to finance is the biggest constraint facing SSA SMEs. Many SMEs\nlack the capacity to fund large orders on their own. Late payments and bank red tape\ncannot be ruled out. However, another related problem is the high interest rates that\nprevail in Uganda as well as the fluctuating dollar rates. This situation is not surprising\nsince the high cost of capital and risks are prevalent in many African countries\n(Kasekende et al., 2002). Certainly the government needs to set up special credit\nlines for exporters.", "word_count": 425, "start_char": 43833, "end_char": 46519}
{"chunk_id": "DOC0082__00021", "doc_id": "DOC0082", "chunk_index": 21, "text": "owever, another related problem is the high interest rates that\nprevail in Uganda as well as the fluctuating dollar rates.T\n\nhis situation is not surprising\nsince the high cost of capital and risks are prevalent in many African countries\n(Kasekende et al., 2002).C\n\nertainly the government needs to set up special credit\nlines for exporters.\n\nTechnology is a major constraint because it greatly influences value addition, and\nhence the ability of the products to compete with those from other countries through\ninnovation. The problem of inappropriate technology is acute, because in many\ninstances manufactures find it difficult to acquire modern technology which would\nmake their products competitive. Technology influences the ability of firms to be\ninnovative, utilize economies of scale and thus gain a competitive edge in the market.\nFor example ,production systems used to mass-produce apparel in industries around the\nworld are still foreign in Ugandan textile companies (USAID Report, 2001). Thus there\nis need for technology transfer from the developed countries to the LDCs. High\ntransaction costs resulting from poor technology are worsened by poor infrastructure in\nterms of transport, and energy. In addition to the high power tariffs, the current\npower shortage which the country is facing has made load shedding a daily\noccurrence, thus forcing many firms to use generators, further raising production costs.\nHowever, reforms in the telecommunication sector that have brought the number of\nlicensed national operators to 4 have greatly reduced tariffs much to the relief of\nexporters.\n\nAs noted by Bigman (2002), successful implementation of policy reforms depends on a\ncountry’s institutions of governance. While the government has taken measures to\ncombat corruption through the Inspector General of Government, improve democratic\nspace and observe the rule of law, the 20-year old rebellion has diverted important\nresources in terms of human beings, money and time, and displaced millions of people", "word_count": 307, "start_char": 46178, "end_char": 48195}
{"chunk_id": "DOC0082__00022", "doc_id": "DOC0082", "chunk_index": 22, "text": "hile the government has taken measures to\ncombat corruption through the Inspector General of Government, improve democratic\nspace and observe the rule of law, the 20-year old rebellion has diverted important\nresources in terms of human beings, money and time, and displaced millions of people\n\nfrom their homes and productive activities. Such resources could have been put to\nbetter use in terms of infrastructure, technology, and market support. Last but not least,\nrules of origin are a major factor determining whether AGOA contributes to the\ndevelopment of local industries in LDCs. As Hayashi et al., (2004) note, if the rules\nare too strict, AGOA would discourage the vertical integration of production chains\nCONCLUSION\nThis study set out to investigate the barriers that hinder Ugandan exports from reaching\nthe AGOA market, with a view to ranking them in order of importance. This would\nhelp the government in the prioritization of interventions to mitigate these constraints\nin the light of the limited resource envelop. Given that trade preferences that have been\ngranted to ACP states for the last 30 years by the European Union (EU) under\nYaoundé, Lome and Cotonou have already expirer the opportunity presented by AGOA\nshould not be wasted.", "word_count": 200, "start_char": 47903, "end_char": 49157}
{"chunk_id": "DOC0082__00023", "doc_id": "DOC0082", "chunk_index": 23, "text": "his would\nhelp the government in the prioritization of interventions to mitigate these constraints\nin the light of the limited resource envelop.G\n\niven that trade preferences that have been\ngranted to ACP states for the last 30 years by the European Union (EU) under\nYaoundé, Lome and Cotonou have already expirer the opportunity presented by AGOA\nshould not be wasted.\n\nAgainst this background, this study makes a contribution in this direction by\nidentifying the most important constraints facing Uganda in the AGOA market so that\nmore emphasis is put on them. In general the identified constraints are interwoven, i.e.\none constraint leading to another or contributing somehow to its impact, be they\ninternal or external factors. In totality, these barriers contribute to the high trade\nrelated costs facing Ugandan exporters to AGOA. Besides the most common\nconstraints in the extant literature like technology and infrastructure, entrepreneurship,\nand limited knowledge of global best practices, poor marketing skills are also\nimportant constraints facing Ugandan SMEs in the AGOA market. It is difficult to be\ncompetitive in a market which one does not understand. Hence there is need to improve\nthe marketing expertise of the exporters. Further, most of the respondents were just\nmoderately satisfied with the way the government is handling these constraints,\nimplying that there is a need for more effort in this direction. In addition to making an\neffort to integrate trade matters into the PEAP, government is currently carrying out a\nseries of studies in order to improve the country’s export capacity. It is hoped that such\nefforts and others like this study will help to put the focus on the elimination of the\nmost important barriers facing exporters. However, government alone cannot change\nthe situation, thus there is need for a concerted effort on the part of all stakeholders,\nincluding academic institutions and civil society. Since weaknesses in institutions of\ngovernance undermine domestic reforms and thus the business environment in which\nSMEs operate, there must be a concerted effort to improve this area. There is also a\ngreat need to put an end to all forms of rebellion in the country, and stem resource\nwaste through combating corruption.\n\nREFERENCE\nAsiimwe, D., Ezati, E., Mugisha, F., Onweng, T., & Nsabagasani, X. (2000): Human\nresource demand assessment from the perspective of the district. Kampala\nMISR\n\nBarnes, S. (2007): Virtual worlds as a medium for advertising. The DATABASE for\nadvances in Information Systems. Volume 38 Number 4.\n\nBeck .T, Demirguc-Kunt, A, and Levine, R. (2003): Small and medium enterprise\ngrowth and poverty: cross-country evidence. World Bank Policy Research\nworking Paper 3178. World Bank, Washington, USA.", "word_count": 434, "start_char": 48788, "end_char": 51560}
{"chunk_id": "DOC0082__00024", "doc_id": "DOC0082", "chunk_index": 24, "text": "ampala\nMISR\n\nBarnes, S. (2007): Virtual worlds as a medium for advertising.T\n\nhe DATABASE for\nadvances in Information Systems.V\n\nolume 38 Number 4.B\n\neck .T, Demirguc-Kunt, A, and Levine, R. (2003): Small and medium enterprise\ngrowth and poverty: cross-country evidence.W\n\norld Bank Policy Research\nworking Paper 3178.W\n\norld Bank, Washington, USA.\n\nBeyene, A. (2002): Enhancing the competitiveness and productivity of SMEs in Africa:\nAn analysis of differential Roles of National Governments through improved\nsupport services. Africa Development, Vol. xxvii No.3. 2002\n\nBiggs, T. (2002): Is small beautiful and worthy of subsidy? International Finance\nCorporation, Washington, USA.\n\nBigman, D (2002) Globalization and the Developing Countries. Oxon. CABI\nPublishing\n\nBrenton .P and Kenzuki (2004): “The initial and potential impact of preferential access\nto the US market under AGOA”. Policy Working PaperNo3262, World Bank,\nWashington, DC\n\nBrenton, P. & Hoppe, M. (2006): AGOA, Exports and development in SSA. Policy\nResearch Paper 3936. The World Bank.\n\nCortina, J .M (1993): What is coefficient alpha? An examination of theory and\napplications .Journal of Applied Social Psychology 78(1).pp98-104\n\nCorey W.C (2006): Small African Business Lag in Reaping AGOA Benefits.\n\nhttp://uninfo.state.gov/archives/display.html\n\nCoolican. H (2004): Research Methods and Statistics in Psychology. London. Hodder\nand Stoughton\n\nECA (2001), Enhancing the competitiveness of SMEs in Africa: “A Strategic\nFramework for support services”, Economic Commission for Africa\nDMD/PSD/TP/00/04\n\nFreeman, J. and Lawley, M. (2005): “Export Performance: A framework for\ncomparison of regional and metropolitan exporters”, ANZMAC – 2005\nConference: Marketing in international and cross-cultural environments.\n\nFrancois, J., Hoekman, B., & Manchini, M. (2005): Preference erosion and multilateral\ntrade liberalization. Tinbergen Institute Discussion Paper. TI 2005 – 073/2\n\nGreenland. S, Coshall. J and Combe .I (2005): Evaluating service quality and customer\nsatisfaction in emerging markets. International Journal of Consumer Studies.\nVol. 30 issue 6. Pp582-590\n\nGumede, V and Rasmussen, K. (2002): Small manufacturing enterprises and exporting\nin South Africa: a preliminary assessment of key export success factors.\nJournal of Small Business and Enterprise Development Vol 9 No 2 pp161-171\n\nHaggblade, S., Hazell, P. and Reardon, T. (2002): Strategies for stimulating Poverty\nalleviating growth in the rural non-farm economy in developing countries.\nDiscussion Paper No. 92.The World Bank, Washington, USA.\n\nHair .J.F., Anderson R.E., Tathem R.L, & Black W.C. (1998): Multivariate Data\nAnalysis. Englewood Cliffs. Prentice Hall.\n\nHallberg, K. (2001): A market–orientated strategy for small and medium-scale\nEnterprise. IFC Discussion Paper No. 40. International Finance Corporation.\n\nHayashi, M, Bartel, C. & Monge Roffaredo, L. (2004): AGOA. African Technology\nDevelopment\nForum.\nhttp://www.atdforum.org/spip.php?article\n(10.2.2008)\n\nHoskyns, C. (2006): Linking Gender and International Trade Policy. Is interaction\nPossible? CSGR, University of Warwick.\n\nHosmer, D.Z. & Lemeshaw, S. (1989): Applied Logistical Regression .New York. Wiley\nand Sons.", "word_count": 439, "start_char": 51212, "end_char": 54439}
{"chunk_id": "DOC0082__00025", "doc_id": "DOC0082", "chunk_index": 25, "text": "FC Discussion Paper No. 40.I\n\nnternational Finance Corporation.H\n\nayashi, M, Bartel, C. & Monge Roffaredo, L. (2004): AGOA.A\n\nfrican Technology\nDevelopment\nForum.\nhttp://www.atdforum.org/spip.php?article\n(10.2.2008)\n\nHoskyns, C. (2006): Linking Gender and International Trade Policy.I\n\ns interaction\nPossible?C\n\nSGR, University of Warwick.H\n\nosmer, D.Z. & Lemeshaw, S. (1989): Applied Logistical Regression .New York.W\n\niley\nand Sons.\n\nInternational Trade Center (ITC) (2001), Converting LDC export opportunities into\nbusiness: A strategic response. ITC, Geneva.\n\nJaffet, S. and Henson, S. (2004): Standards and agro–food exports from developing\ncountries: Rebalancing the debate. Policy Working paper 3348, World Bank,\nWashington, DC\n\nKaiser, H.F. (1974): An index of factorial simplicity. Psychometrika, (39):31-36.\n\nKline, P. (2000): Handbook of Psychological Testing .2nd\n\nEdition. London. Routledge.\nKasekende, L.A., Atingi-Ego, M. & Sebudde, R.K. (2002): The African growth\nexperience. Uganda Country Study. Work in Progress.\nhttp://www.gdnet.org/pdf/draft_country_studies/Uganda-\nAtingi_FR.pdf.(15.2.2008)\n\nKatsikeas, C.S and Morgan, R.E (1994): “Differences in perceptions of export\nproblems based on firm size and export market experience”, European\nJournal of Marketing Vol. 28 pp. 17 – 35\n\nKwesiga, C. (2003): Seminar presentation on AGOA: Uganda’s response and\nchallenges. Kampala. AGOA Country Office.\n\nLeonidou, L. (2004): An analysis of the barriers hindering small business export\ndevelopment. Journal of Small Business Management Vol 42 No.3 pp 229-302\n\nLiedholm .C and Mead, D. (1987): Small-scale industries in developing countries:\nEmpirical evidence and policy implications. Michigan State University\nInternational Development Papers No. 9. Michigan State University, East\nLansing, USA\n\nLoewenthal, K.M (2001): An Introduction to Psychological Tests and Scales .2nd\n\nEdition. New York. Psychological Press.\nLow. P; Pier martini, R & Richenting, J (2005): Multilateral solutions to the erosion of\nnon–reciprocal preferences in NAMA. Working Paper ERSD-2005-05,\nWTO, Geneva.\n\nMcQueen .D. (2004): Small-scale enterprises and sustainable development.\nPolicy Discussion Paper .Edinburgh IIED/SDC/DFID\n\nMutahunga E. (2006): “Mainstreaming trade into national development plans.” A\npresentation at the 4th\n\nCourse on Introduction to Trade and Trade Policy\nAnalysis. Kampala. MITI\nNtayi, J.M. (2005): Work ethic, locus of control and sales force performance. Journal\nof African Business Vol. 6 Numbers 1/2 International Business Press.\n\nNg, F and Yeats (2000): On the recent trade performance of Sub-Saharan African\nCountries: Cause for Hope or More of the same? African Region Working\nPaper. World Bank, Washington. DC.\n\nNeupert, K.E; Baughn, C.C and Dao, L.T (2006): “SME export challenges in\ntransitional and developed economies”, Journal for Small Business and\nEnterprise Development, Vol. 13 No. 4, Pg. 535 – 545\n\nNorusis, M.J. (1988) SPSS – X Advanced Statistics Guide. SPSS Inc. Chicago.\n\nNunnally J.C and Bernstein I.H (1994): Psychometric Theory, New York MacGraw\nHill.\n\nOECD, (2000): Small and Medium Enterprises Outlook. 2nd\n\nedition, Paris France.\nOhtswamah, C. (2008):20 years later NRM fails where it mattered. The Independent\n.Issue 4 Jan-Feb 2008. www.independent.co.ug", "word_count": 447, "start_char": 54005, "end_char": 57303}
{"chunk_id": "DOC0082__00026", "doc_id": "DOC0082", "chunk_index": 26, "text": "PSS Inc.C\n\nhicago.N\n\nunnally J.C and Bernstein I.H (1994): Psychometric Theory, New York MacGraw\nHill.O\n\nECD, (2000): Small and Medium Enterprises Outlook. 2nd\n\nedition, Paris France.O\n\nhtswamah, C. (2008):20 years later NRM fails where it mattered.T\n\nhe Independent\n.Issue 4 Jan-Feb 2008. www.independent.co.ug\n\nOyejide, A.T (2005): Relaxing export supply capacity constraints and promoting export\nexpansion and diversification in Africa. The role of special export\ndevelopment strategies.( Retrieved 6/11/07.)\nhttp://www.afdb.org/pls/portal/url/ITEM?22FE8F94631A299E04C00A0C3D\n3.\nParasuramman A., Zeithamal V.A., and Berry, L.L. (1998): SERVQUAL:\nA multiple–item scale for measuring consumer perceptions of service quality.\nJournal of Retailing 64(1):12-40.\n\nReinartz, W. Kraft, M., & Hoyer, W. (2003): Measuring the customer relationship\nconstruct and linking its performance outcomes. INSEAD Working Paper\nSeries 2003/02/MKT.\n\nSiekpe S.J (2005): An Examination of the multi-dimensionality of the flow construct in\na computer mediated environment. Journal of Electronic Commerce\nResearch. 6 (1)\n\nSorebo, O Christensen, G.E, & Eikebrokk, T.R (2004): The impact of purposeful enduser computing activities on job performance: An empirical investigation.\nJournal of Research and Practice in Information Technology Vol. 36 No. 2\n\nStiglitz, J.E and Charlton, A. (2005): Fair Trade for All:- How Trade can Promote\nDevelopment\n\n: Oxford University Press, London.\nTesfom, G. and Lutz, C. (2006): “A classification of export marketing problems of\nsmall and medium-sized manufacturing firms in developing countries”.\nInternational Journal of Emerging Markets, Vol. 1 No.3 pp. 265 – 281\n\nTodaro, M.P. (1995): Economics for a Developing World\n\n. Longman. London\nTodd, R.P and Javalgi, R. (2007): “Internationalization of SMEs in India”,\nInternational Journal of Emerging Markets, Vol.2 No.2, pp. 166 – 180\n\nTupy, L.M (2005), “Trade liberalization and poverty reduction in Sub-Sahara Africa”,\nPolicy Analysis No. 557, CATO Institute, Washington\n\nUEPB (2005). http://www.ugandaexportsonline.com/s\n\nUNCTAD (2004): Beyond conventional wisdom in development policy. An\nintellectual history of UNCTAD (1964 – 2004). UNCTAD/ EDM/ 2004/4\n\nUSAID (2001): AGOA Textile & garment -what future for Uganda’s exports? Nathan\n–MSI (OUT-PCE-1-807-980016)\n\nUS Government (2005) Africa Competitiveness Report.\n\nUS Government (2000) AGOA Act Implementation Guide.\n\nWalter, T. Balunywa, W., Rosa, P., Sserwanga, A., Barabas, S., Namatovu, R. (2003):\nGlobal Entrepreneurship Monitor. Kampala. MUBS.\n\nWorld Bank (2000): Can Africa Claim the 21st\n\nCentury? World Bank, Washington DC.\nZachary, P.G. (2008): Should the map of Africa be redefined? The Independent Issue 4\nJan-Feb 2008. www.independent.co.ug\n\nEND NOTE\n\n1 Average Variance Extracted (AVE ) is given by : AVE =Σλi2/{Σλi2 + Σ(1- λi2)}\n,where Σλi2 is the sum of the squared loadings, while Σ(1- λi2) is the sum of the\nresidual variances.", "word_count": 410, "start_char": 56992, "end_char": 59954}
