{"chunk_id": "DOC0052__00000", "doc_id": "DOC0052", "chunk_index": 0, "text": "Catherine Bwire\n(ITIL,CISA, CISM,CCNA, CEH, ISO27001,ISO27701 LI)\nDepartment of Computing & Technology\nFaculty of Engineering, Design & Technology\nCybersecurity & Digital Forensics\nLegal and Ethical issues Related to Digital Forensics\nLecture Introduction\n•\nDigital Forensics is a vital tool in the fight against Cyber Crime, but it also raises legal and Ethical issues\nthat need to be addressed.\n•\nThe legal issues related to Digital Forensics revolve around the admissibility of digital evidence in court,\nthe Chain of Custody and the qualifications of the forensic examiner..\n\na) Admissibility of digital evidence in court\nDigital Forensics involves the collecting, preserving, analyzing, and presenting digital evidence in court.\nTherefore, to be admissible in court, evidence must be collected lawfully and preserved without changing\nor damaging it.\nAdditionally, a certified professional must analyze the evidence\nThe Chain of Custody is another legal concern, as it must be documented and maintained for evidence to\nbe admissible.\n1. What is the Chain of Custody?\n2. Why is it key in digital forensics investigations?\nb) Chain of Custody", "word_count": 172, "start_char": 0, "end_char": 1144}
{"chunk_id": "DOC0052__00001", "doc_id": "DOC0052", "chunk_index": 1, "text": "dditionally, a certified professional must analyze the evidence\nThe Chain of Custody is another legal concern, as it must be documented and maintained for evidence to\nbe admissible.\n1.W\n\nhat is the Chain of Custody?\n2.W\n\nhy is it key in digital forensics investigations?\nb) Chain of Custody\n\nEthical issues related to Digital Forensics mainly involve;\na) privacy and confidentiality\nThe Digital Forensics investigator must respect the privacy of the individual and only collect data that is\nrelevant to the investigation.\na) the use of forensic technology\nForensic Technology can be good, powerful and intrusive – Collecting data without individuals knowledge or\nconsent. It is important that these are used responsibly and used only when necessary.\na) and the use of data collected.\nThe Forensic examiner must maintain the individual’s confidentiality and ensure that the data is only used for\nthe intended purpose.\nWe shall get to understand these better when we get to the Case studies and labs.\nb) Other Legal and Ethical Issues\nCase Study: - Assignment 1\nFacebook Cambridge Analytica Scandal Submission due date: s\n(7th February 2025 23:59hrs)\nIn 2018, it as discovered that face book had allowed the political consulting firm Cambridge\nAnalytica to access the personal data of millions of users without their consent.\nThis raised ethical issues about the use of personal data and the responsibility of companies to\nprotect users’ privacy.\nDigital Forensics was used to investigate the data breach and determine the extent of damage.\nQuestions:\n1. What are some of the sensitive and personal data that may be collected during a digital\nForensics Investigation?\n2. How does Uganda's data privacy law address this type of case, and what rights does it grant to\nindividuals? (Describe each of the rights in the context of the scenario mentioned above)\n3. Discuss the role of the General Data Protection Regulation (GDPR) in addressing data privacy\nissues. How might the GDPR have influenced the outcome of the Cambridge Analytica case if it\nhad been in effect at the time?\n\nWhat is Digital Evidence?\nDigital Evidence is defined as any type of file stored on a device, such as a text file, a document, an image\nor an executable file.\nIt is any information of probative value that is either stored or transmitted in a digital form.\nLocard’s Exchange principle states that everyone who enters and exits a crime scene leaves something of\nthemselves behind.\nWhat is Digital Evidence?\nDigital information can be gathered:\n•\nFrom the media\n•\nFrom the live capture of packets being transmitted\n•\nFrom any other electronic source", "word_count": 428, "start_char": 854, "end_char": 3476}
{"chunk_id": "DOC0052__00002", "doc_id": "DOC0052", "chunk_index": 2, "text": "ocard’s Exchange principle states that everyone who enters and exits a crime scene leaves something of\nthemselves behind.W\n\nhat is Digital Evidence?D\n\nigital information can be gathered:\n•\nFrom the media\n•\nFrom the live capture of packets being transmitted\n•\nFrom any other electronic source\n\nSources of Digital Evidence\nDigital Evidence is found in files such as :\n•\nEmails\n•\nLog files\n•\nInternet browser histories, cookies\n•\nGraphic files\n•\nServer logs\n•\nHard Disk\nMainly evidence that is gathered from hard disks of the seized system.\nThe data is stored in different file formats such as text, pictures, video files, computer program files etc.\n•\nThumb Drive\nThumb drive is another important electronic storage device with USB connection\n\n•\nMemory Card\nMemory card is a removeable electronic storage device, used in many devices such as digital cameras,\nPDAs, computers etc.\nData present in the memory card is not lost when power is turned off as it is a secondary storage\n•\nSmart Card\nA smart Card has memory and stores encryption keys or password and digital certificates\n•\nDongle\nA copy protection device provided with software that is plugged into a computer port.\n•\nBiometric Scanner\nIt is a device connected to a computer system that identifies the physical characteristics of an individual\nmainly for identification purposes\n\n•\nDigital Camera – Images and videos\nEvidence is found in images,removeable cartridges, videos, sound, date and time stamp\n•\nModem\nIt is used by computers to communicate over telephone lines.\nEvidence is found on the device itself.\n•\nPrinter\nPrinters contain memory buffers and store data.\n•\nScanner\nIt is an optional device connected to a computer, which scans documents and transmits to a computer\nnetwork.\nEven physical marks and damages on the scanner can become evidence\n\nCharacteristics of Digital Evidence\n▪Admissible\nEvidence must be admissible in the courts of law and must be related to the fact being proved.\n▪Authentic\nEvidence must be real and related to the incident\n▪Complete\nEvidence must prove the attacker’s action or his innocence\nCharacteristics of Digital Evidence continued\nReliable\nThere must be no doubt about the authenticity or veracity of the evidence\nBelievable\nEvidence must be clear and understandable by the judges/jury\nReproducible\nEvidence must be reproducible\n\n@ugandachristianuniversity\n@UCUniversity\n@UgandaChristianUniversity\nP.O. Box 4 Mukono, Uganda\nTel: 256-312-350800\nhttps://ucu.ac.ug/\nEmail: info@ucu.ac.ug.\nUganda Christian University\nhttps://cse.ucu.ac.ug/\n@ucu_ComputEng\n@ucucomputeng\nTel: +256 (0) 312 350 863 | WhatsApp: +256 (0) 708 114 300\nDepartment of Computing & Technology\nFACULTY OF ENGINEERING, DESIGN AND TECHNOLOGY\nEmail: dct-info@ucu.ac.ug\nNEXT TOPICS:\n1. Basic Concepts of digital forensics and Digita\nEvidence\n2. Rule of evidence and antiforensics", "word_count": 438, "start_char": 3185, "end_char": 6032}
