{"chunk_id": "DOC0148__00000", "doc_id": "DOC0148", "chunk_index": 0, "text": "HR Practices and OCB: Mediating Role of Employee Engagement in Soft Drink\nFirms in Uganda\n\nJoseph Jakisa Owor\nSenior Teaching Fellow\nFaculty of Business & Administration\nUganda Christian University\nP. O. Box 4 Mukono\n\nAbstract\n\nThe purpose of this study was to investigate the mediating role of employee engagement in the relationship\nbetween HR practices and OCB in soft drink firms in Uganda. Quantitative cross-sectional survey design (N =\n210) examined the relationship between nine HR practices (antecedents), employee engagement and OCB.\nHypotheses were tested through correlation and hierarchical regression. All the nine antecedent variables studied\nwere significantly related to employee engagement and employee engagement was significantly related to OCB.\nThe hierarchical regression analysis results shows that five antecedent variables demonstrated a significant\nrelationship with OCB - role clarity, collaboration, job security, compensation fairness, and development. This\nresearch has validated the organizational citizenship behaviour model, extended the engagement model and\nsocial exchange theory and established that all the nine antecedents studied were related to engagement but only\nfive were significantly related to OCB.\n\nKeywords: employee engagement, antecedents, OCB, HR practices, employee development, job security,\ncompensation fairness, collaboration, Uganda.\n\nBackground\n\nResearchers within Human Resource Management (HRM) field have been concerned with how HRM can lead to\nimproved organizational performance (Huselid, 1995; Delbridge and Keenoy, 2010). While early HRM studies\ntended to propose a direct link between HR practices and firm performance, recent evidence suggests that the\nrelationship is most likely mediated by a range of attitudinal and behavioral variables at the individual level –\nemployee engagement, task performance, and OCB (Guest, Conway, & Dewe, 2004; Kuvaas, 2008; Snape &\nRedman, 2010). Prior HRM-performance-studies tended to focus on the macro level and proposed a direct\nrelationship between the two, but lacked convincing theoretical explanations (Guest 2011). Recent research has\nadopted a social exchange framework and quantitative methodologies at the micro level to suggest that the\nrelationship is most likely mediated by attitudinal variables, especially employee engagement which has ushered\nin a very recent interest in the parallel stream of research linking employee engagement and employee outcomes.\nBringing the two streams together suggests that engagement may constitute the mechanism through which HR\npractices impact individual and organizational outcomes within the framework of social exchange theory.", "word_count": 372, "start_char": 0, "end_char": 2684}
{"chunk_id": "DOC0148__00001", "doc_id": "DOC0148", "chunk_index": 1, "text": "ringing the two streams together suggests that engagement may constitute the mechanism through which HR\npractices impact individual and organizational outcomes within the framework of social exchange theory.\n\nUganda’s industrial sector, is dominated by Micro, Small and Medium enterprises (MSEs), and contributes 25\npercent to the GDP. From early 1990s government of Uganda embarked on the country’s Economic Recovery\nPrograms, aimed at removing structural distortions and imbalances in the economy by providing an enabling\nenvironment for industry for sustainable industrial development. Despite the government’s efforts to make\nUganda’s private sector more competitive, very little appears to be happening in comparison to other countries\n(Nyanzi, 2012). The Global Competitiveness Report 2014/15 has ranked Uganda 122 out of 144 economies.\nUganda still lags behind Rwanda (62) and South Africa (56) which are the top performers in Africa - while Kenya\nis ranked 90 (World Economic Forum, 2014). This leads us to propose that the macro-economic policy\nenvironment is a necessary but not sufficient condition for firm performance. The solution to the performance\nproblem lies more at how the HR practices are handled at the firm level.", "word_count": 184, "start_char": 2477, "end_char": 3713}
{"chunk_id": "DOC0148__00002", "doc_id": "DOC0148", "chunk_index": 2, "text": "his leads us to propose that the macro-economic policy\nenvironment is a necessary but not sufficient condition for firm performance.T\n\nhe solution to the performance\nproblem lies more at how the HR practices are handled at the firm level.\n\nThis is in line with researchers who argue that aggregate outcome variables, such as competitiveness, firm\nfinancial performance and effectiveness, are too distal from the micro-level HR interventions, and that more\nproximal outcome indicators at the individual level would provide a better and more reliable measure of\nindividual HR outcomes (Paauwe, 2004; Purcell & Kinnie, 2007; Wright & Haggerty, 2005). The carbonated soft\ndrink sub-sector in Uganda has attracted a number of players in the last two years including Riham, Fizzy and\nAzam soda resulting into stiff competition causing the two giant franchises – Coca-Cola and Pepsi to cut prices to\nremain competitive in the market. Bottled water, which is emerging as the fastest growing in the beverage market\nhas eaten into the carbonated soft drink market (New Vision, 2015: Focus on Manufacturing, June 2). The leading\ncompetitor in the bottled water industry is Rwenzori Bottling Company Ltd, a subsidiary of SABMiller. Since\nthere is no empirical data on outcomes, HR or individual attitudinal variables on the sampled firms, it is necessary\nto bridge the gap by studying the firm level HR factors (antecedents) and employee engagement hypothesized to\npredict outcomes like OCB which has a bearing on performance and competitiveness. Firms often compete by\nlowering prices, cutting costs, redesigning business processes and downsizing but all these have limits. New\napproaches to HRM are supported by numerous scholars who call for a more positive HR approaches, for\nexample, engaging employees rather than focusing on problem-coping strategies as vital for employee retention\n(Luthans & Avolio, 2009; Bakker et al, 2008; Luthans & Youssef, 2007; Avey et al., 2008; Seligman et al., 2005).\n\nPurpose of the Study\n\nThe purpose of the study is to establish the mediating role of employee engagement in the relationship between\nHR practices (antecedents) and OCB in soft drink industry in Uganda in the context of the social exchange theory.\n\nHypothesis\n\nH1: HR practices (antecedents) are positively correlated with employee engagement;\nH2: Employee engagement is significantly positively correlated with OCB;\nH3: After controlling for HR practices (antecedents), employee engagement will predict unique variance in OCB.\n\nLiterature Review", "word_count": 388, "start_char": 3475, "end_char": 6012}
{"chunk_id": "DOC0148__00003", "doc_id": "DOC0148", "chunk_index": 3, "text": "ypothesis\n\nH1: HR practices (antecedents) are positively correlated with employee engagement;\nH2: Employee engagement is significantly positively correlated with OCB;\nH3: After controlling for HR practices (antecedents), employee engagement will predict unique variance in OCB.L\n\niterature Review\n\nThe classical approaches to strategic HRM imply that the role of good HR practices is to maximize the\ncontribution of human assets in order to achieve corporate goals (Huselid, 1995). Discussion of HR outcomes\nsuggests that good HR practices act to improve the self confidence and flexibility of the workforce and contribute\nto increased motivation, morale and OCB, which in turn are related to individual and business performance\n(Becker & Huselid, 1998, 2006; Appelbaum, 2002; Tamkin, 2004). Because no exact number of practices in the\ngood HR practices ‘bundle’ are agreed upon (Boxall, & Macky, 2007, Delery, 1998; Becker & Huselid, 1997;\nMacDuffie, 1996; Thompson, 2000; Batt, 2002), this study looks at nine very common set of good HR practices\n(antecedents) – Job design characteristics, role clarity, material supplies, collaboration/teamwork, reward &\nrecognition, perceived social support, compensation fairness, job security, employee development, which have\nbeen found to have impact on HR outcomes ( Rich et al, 2010; Hackman & Oldham, 1980; Xanthopoulou, et al,\n2009; Seigts & Crim, 2006; Harter et al, 2002; Demerouti & Bakker, 2011; Kahn 1990; Rhoades & Eisenberger,\n2002; Ryan & Deci, 2000) and hence to test the model in the context soft drink industry in Uganda .\n\nGood HR practices represent the conceptual dimensions of social exchange that manifest not only the norms of\nexchange from an employer’s point of view, but also specify the resources of exchange between employers and\nemployees. Certain HR practices (e.g., proper job design, training, pay level, benefits level, and job security)\nreflect higher levels of rewards offered to employees (Shaw et al., 2009; Tsui et al., 1997). On the other hand,\ncertain HR practices, for example, Individual pay-for-performance systems, employee monitoring, and formal\nperformance appraisals reciprocate employer expectations about employee performance levels (Shaw et al.,\n2009). This presents a fair exchange relationship. Thus, from an exchange theory view, good HR practices will\nlikely increase employees’ perceived obligation to the employer, elicit engagement, as well as high in-role\nperformance (Shaw et al 2009). The concept of organizational citizenship behaviours (OCBs) was introduced to\nthe research literature by Organ (Organ, D. W. & Ryan, K., 1995). OCBs are voluntary contributions at work that\ninclude altruistic helping behaviours, compliance with work norms and requirements, courtesy to others to ensure\nsmooth working relationships, sportsmanship to maintain performance under adversity, and civic virtue to\ncontribute constructively to issues that arise in the workplace.", "word_count": 436, "start_char": 5716, "end_char": 8674}
{"chunk_id": "DOC0148__00004", "doc_id": "DOC0148", "chunk_index": 4, "text": ". & Ryan, K., 1995).O\n\nCBs are voluntary contributions at work that\ninclude altruistic helping behaviours, compliance with work norms and requirements, courtesy to others to ensure\nsmooth working relationships, sportsmanship to maintain performance under adversity, and civic virtue to\ncontribute constructively to issues that arise in the workplace.\n\nOCB has been shown to have significant relations with employee engagement (for example Saks, 2006).\nSchaufeli and Bakker (2004) suggest that job resources (good HR practices) are related to engagement and\nengagement is in turn, related to employee outcomes like turnover intention, OCB, and organizational\ncommitment. Previous research has demonstrated that perceptions of the environment are important in predicting\nwork engagement (Alarcon et al., 2008, Saks, 2006). Given that the job resources are expected to predict\nengagement and engagement predicts outcomes, it is possible that engagement mediates the relationship between\nthe job resources and the outcomes such as job satisfaction, turnover intentions and OCB. This is consistent with\nthe Maslach et al. (2001) model and is more likely given that most of the job resources (e.g. job characteristics,\nPOS,) have been associated with various outcomes. Furthermore, several studies have found that engagement\nmediates the relationship between antecedent variables and outcomes (Schaufeli and Bakker, 2004; Sonnentag,\n2003).\n\nConceptual Framework\n\nBasing on the various theories, models and concepts reviewed in the literature, a conceptual framework linking\nemployee engagement, antecedents and OCB has been developed and tested in this study (figure 1). Empirical\nstudies in this research are discussed in line with the reciprocity framework of the social exchange theory (SET),\nwhich proposes that good HR practices (antecedents) influence engagement through the reciprocal exchange of\nengagement for motivational HR practices which then influences attitudinal and performance outcomes. The nine\nengagement antecedents studied in this research are job characteristics, role clarity, material adequacy, teamwork,\nrewards & recognition, perceived social support, compensation fairness, job security and employee development.\nThese antecedents are assumed to separately but also collectively drive employee engagement and engagement\ninfluences OCB.\n\nFigure 1: Conceptual Framework: HR Practices (Antecedents), Employee Engagement and OCB\n\nAntecedents (independent Variables)\n\nMediator\n\nOCB (depedent variable)\n\nEngagement (Mediator)\n\nSource: Derived from review of Literature\n\nMethodology", "word_count": 355, "start_char": 8324, "end_char": 10921}
{"chunk_id": "DOC0148__00005", "doc_id": "DOC0148", "chunk_index": 5, "text": "hese antecedents are assumed to separately but also collectively drive employee engagement and engagement\ninfluences OCB.F\n\nigure 1: Conceptual Framework: HR Practices (Antecedents), Employee Engagement and OCB\n\nAntecedents (independent Variables)\n\nMediator\n\nOCB (depedent variable)\n\nEngagement (Mediator)\n\nSource: Derived from review of Literature\n\nMethodology\n\nThis study using a quantitative cross-sectional survey design (N = 210) examined the relationship between nine\nantecedents, employee engagement and OCB. Because of the three-step nature of the study variables a regression\nanalysis of the quantitative data was used. The target population was 1,773 employees from four purposively\nsampled firms in Kampala, Mukono, and Buikwe districts and a sample of 317 different categories of employees\nwere drawn using Krejcie and Morgan’s (1970) table. Out of the 317 questionnaires distributed, 210 usable ones\nwere collected, giving a response rate of 66%. The instruments used to measure the three variables were\nstandardized instruments used in several empirical studies elsewhere. The antecedents were determined using 58\nshort questions measuring 9 different antecedents. All antecedents had computed (overall scale) reliability\ncoefficient alpha of 0.91. Employee engagement was determined using the 9-scale University of Utrecht Work\nengagement scales (UWES-9, - Cronbach alpha, 0.84). The dependent variable – organizational citizenship\nbehavior (OCB) was measured using standardized instruments - (seven items - Cronbach alpha, 0.84). The\nresponses to the questions were elicited on a 4 point Likert type scales of - Strongly Disagree (1), - Disagree (2) -\nAgree (3), - Strongly Agree (4).\nAntecedents\n\nJob characteristics\n\nRole clarity\n\nMaterial adequacy\n\nTeamwork\n\nRewards/recognition\n\nPerceived social support\n\nCompensation fairness\n\n\nEmployee development\nEmployee\n\nVigour\n\n\nOCB\n\nWe assumed the relationships between the variables are linear and used a regression equation with the antecedents\nas independent variables, employee engagement as mediator and OCB as dependent variable:\n\nOCB = α + β1JobCh + β2RoleC + β3Mat + β4Coll + β5Rew + β6PSS + β7CompF + β8JobSe + β9Dev + β10EE (ABS,\nDED, VIG) + ε\n\n(Key: ABS – Absorption, DED = Dedication, VIG = Vigour, EE – Employee engagement, ε = error term).\n\nResults\n\nHypothesis 1: Pearson’s correlation analysis showed that employee engagement is significantly positively related\nto each of the nine antecedents (table 1) – the coefficients ranging from r = .48 to r = .67. The three dimensions of\nengagement (vigor, absorption and dedication) are also found to be significantly positively related to the\nantecedents with the correlation coefficient ranging from r = .37 to r=.65. Eight of the nine antecedents showed\nlarge effects correlation coefficients (Cohen, 1988), providing empirical support for H1. Employees who scored\nhighly on employee engagement also reported high levels of all the tested antecedents.", "word_count": 444, "start_char": 10560, "end_char": 13545}
{"chunk_id": "DOC0148__00006", "doc_id": "DOC0148", "chunk_index": 6, "text": "ight of the nine antecedents showed\nlarge effects correlation coefficients (Cohen, 1988), providing empirical support for H1.E\n\nmployees who scored\nhighly on employee engagement also reported high levels of all the tested antecedents.\n\nTable 1: Correlation – Employee Engagement (V, A, D) and the nine Engagement Antecedents\n\nEE\nVigor\nABS\nDED\nJobCh\nRole\nMat\nColl\nRew\nPSS\nCompF\nJobSe\nDev\n1.Engag’t\n1.00\n2.Vigor\n0.85* 1.00\n3.Absorpt\n0.84*\n0.646\n1.00\n4.Dedicat\n0.86* 0.57* 0.59* 1.00\n5.Job Char\n0.52* 0.46* 0.45* 0.42* 1.00\n6.Role Clar\n0.55* 0.51* 0.47* 0.42* 0.57*\n1.00\n7.Mater’l\n0.62* 0.56* 0.54* 0.50* 0.53*\n0.52* 1.00\n8.Collab\n0.67* 0.63* 0.53* 0.55* 0.49*\n0.63* 0.59*\n1.00\n9. Reward\n0.53* 0.54* 0.48* 0.36* 0.50*\n0.54* 0.50*\n0.55* 1.00\n10.Support\n0.59* 0.57* 0.50* 0.44* 0.55*\n0.60* 0.61*\n0.65* 0.70* 1.00\n11.Compen\n0.51* 0.52* 0.44* 0.35* 0.41*\n0.43* 0.55*\n0.57* 0.65* 0.68* 1.00\n12.Job Sec\n0.48* 0.48* 0.34* 0.40* 0.23*\n0.32* 0.36*\n0.47* 0.42* 0.48* 0.54*\n1.00\n13.Dev\n0.63* 0.60* 0.54* 0.48* 0.45*\n0.48* 0.54*\n0.66* 0.64* 0.72* 0.69*\n0.55*\n1.00\n\n* Significant at 1% Level of significance. Primary Data, 2012\n\nHypothesis 2: Employee engagement and OCB\n\nAs in table 2 the study showed that engagement is significantly positively correlated with OCB (r=0.61, p=0.00),\nhence providing empirical support for H2. The three dimensions of engagement – vigor (r=0.49, p=0.00),\nabsorption (r=0.58, p=0.00) and dedication (r=0.50, p=0.00) are also significantly positively correlated with OCB.\n\nTable 2: Correlation – Employee Engagement (V, A & D) and OCB\n\nVigor\nOCB\n1.00\nVigor\n0.85*\n1.00\n0.84*\n0.64*\n1.00\n0.86*\n0.57*\n0.59*\n1.00\nOCB\n0.61*\n0.49*\n0.58*\n0.50*\n1.00\n\n* Significant at 1% Level of significance.\n\nHypothesis 3: Engagement antecedents, employee engagement and OCB\n\nAs seen in table 3, five of the nine antecedents, role clarity (β = .21, p = .01), collaboration (β = .21, p =.01),\ncompensation fairness (β = -.26, p = .00), job security (β = -.15, p = .03), and development (β = -.31, p = .00)\ncontributed to the prediction of OCB (adj. R2 = .46, p = .00). After controlling for the antecedents, employee\nengagement contributed unique variance in OCB (∆R2 = .037, p = .00); thus, H3 was supported in this model.\nThese findings suggest that OCB can be predicted by the role clarity, collaboration, compensation fairness, job\nsecurity and development and employee engagement. Overall, the regression model explained 49% (adj. R2 =\n.494, p =.00) of the variance in organizational citizenship behavior (large effect size; Cohen, 1988).\n\nTable 3: Summary HRA with antecedents, employee engagement (V, A & D) predicting OCB\n\nVariable\n\nβ\n\nR2\n\nAdj.R2\np\nStep 1\nJob Characteristics\n\n.14\nRole Clarity\n\n.21*\n\n.01\nMaterial resources\n\n.10\nCollaboration\n\n.21*\n\n.01\nReward & recognition\n\n.11\n\nPerceived Organize. Support\n\n-.06", "word_count": 450, "start_char": 13311, "end_char": 16124}
{"chunk_id": "DOC0148__00007", "doc_id": "DOC0148", "chunk_index": 7, "text": "2 =\n.494, p =.00) of the variance in organizational citizenship behavior (large effect size; Cohen, 1988).T\n\nable 3: Summary HRA with antecedents, employee engagement (V, A & D) predicting OCB\n\nVariable\n\nβ\n\nR2\n\nAdj.R2\np\nStep 1\nJob Characteristics\n\n.14\nRole Clarity\n\n.21*\n\n.01\nMaterial resources\n\n.10\nCollaboration\n\n.21*\n\n.01\nReward & recognition\n\n.11\n\nPerceived Organize.S\n\nupport\n\n-.06\n\nCompensation fairness\n\n-.26**\n\n.00\n\n-.15*\n\n.03\nDevelopment\n\n-.31**\n\n.00\nBLOCK\n\n.481\n\n.457\n\n.00\n\nStep 2\n\n.21*\n\n.01\n\nVigor\n\n-.11\n\n.33**\n\n.00\n\n.06\nBLOCK\n\n.523\n\n.494\n\n.00\nR2 Change\n\n.042\n\n.037\n\n.00\n\nNote ** p< .01, * p< .05\n\nSummary and Discussion of Results\n\nHypothesis 1 was supported by the Pearson’s correlation analysis which showed that employee engagement is\nsignificantly positively related to each of the nine antecedents – the coefficients ranging from r = .50 to r=.67 at\n1% level of significance. The three dimensions of engagement (vigor, absorption and dedication) are also found to\nbe significantly positively related to engagement with the correlation coefficients ranging from r =.34 to r=.65. All\nthe antecedents showed large effects correlation coefficients (Cohen, 1988). Discuss of the results of each\nantecedent variable and its relation to employee engagement now follows.\n\nJob characteristics: Employees who experienced high degree of job characteristics in their jobs were more likely\nto be engaged (r=0.52, p=0.00). Xanthopoulou et al (2009) found that job resources, including job autonomy,\nhave a positive effect on daily rates of engagement among fast-food employees (n=42). A study by de Lange, et al\n(2008), found job autonomy, decision making and job design had potential engagement effects and indeed related\nto levels of engagement over time. Appraising and giving constructive feedback to employees for good\nperformance helps maintain their motivation (Hackman & Oldham, 1980) and consequently engagement as this\nsignals to them that the employer recognizes them and the principle of reciprocity in social exchange theory is\ninvoked (Cropanzano and Mitchel, 2005).\n\nRole Clarity: Employees who experienced high degree of role clarity in their jobs were more likely to be engaged\n(r=0.55, p=0.00). Role clarity has been studied by Seigts and Crim (2006) under the idea of “convey”\n(communicate) where leaders clarify work-related expectations for employees. Similar research appears in\nSpector’s (1997) Job Satisfaction Survey and House et al. (1983) measure of Role Conflict and Ambiguity.\nPrevious studies found role clarity to be positively related to engagement (Buckingham & Coffman, 1999; Harter\net al., (2002). When employees get clear role profiles they feel obliged to respond in kind and “repay” the\norganization in terms of engagement, hence validating the social exchange theory.", "word_count": 426, "start_char": 15738, "end_char": 18547}
{"chunk_id": "DOC0148__00008", "doc_id": "DOC0148", "chunk_index": 8, "text": "revious studies found role clarity to be positively related to engagement (Buckingham & Coffman, 1999; Harter\net al., (2002).W\n\nhen employees get clear role profiles they feel obliged to respond in kind and “repay” the\norganization in terms of engagement, hence validating the social exchange theory.\n\nMaterials adequacy: Employees who experienced high degree of material adequacy in their jobs were more likely\nto be engaged (r= 0.62, p=0.00). The findings of this study are consistent with Seigts and Crim (2006) that\ninadequate resources are likely to lead to stress, frustration, and lack of engagement. Materials have been found to\nbe positively related to engagement by both Buckingham and Coffman (1999) and Harter et al. (2002).\n\nWhen employees receive adequate resources to work with they feel obliged to respond in kind and “repay” the\norganization in form of higher engagement – hence validating the SET theory.\n\nCollaboration/Team Work: Employees who experienced high degree of collaboration in their jobs were more\nlikely to be engaged (r=0.67, p=0.00). Collaborative work environments are often characterized by trust and\ncooperation and may outperform groups which were lacking in positive relationships (Seigts & Crim, 2003).\nEmployee Opinions as cited by Buckingham and Coffman (1999) and Harter et al. (2002) are positively related to\nengagement. If an employee’s opinion is considered, the employee will feel valued and important and will\ntherefore be willing to emotionally, cognitively and physically engage the self. This finding is in line with the\nSchaufeli (2002) and Kahn (1990) model and in the spirit of reciprocity expounded by the social exchange theory.\n\nRecognition and Rewards: Employees who experienced high degree of recognition/rewards in their jobs were\nmore likely to be engaged (r=0.53, p=0.00). The findings of this study are consistent with Seigts and Crim (2006)\nwho emphasize that good leaders frequently recognize their employees by congratulating and by coaching them.\nRecognition has been found to have a weaker but positive relationship to engagement by Harter et al. (2002). This\nstudy found a strong positive relation (r=0.53, p=0.00) - (large effect size; Cohen, 1988). Recognition/reward\ngiven by the employer is interpreted as a gesture that has to be reciprocated in terms of higher engagement\n(Cropanzano and Mitchel, 2005).", "word_count": 364, "start_char": 18247, "end_char": 20625}
{"chunk_id": "DOC0148__00009", "doc_id": "DOC0148", "chunk_index": 9, "text": "ecognition has been found to have a weaker but positive relationship to engagement by Harter et al. (2002).T\n\nhis\nstudy found a strong positive relation (r=0.53, p=0.00) - (large effect size; Cohen, 1988).R\n\necognition/reward\ngiven by the employer is interpreted as a gesture that has to be reciprocated in terms of higher engagement\n(Cropanzano and Mitchel, 2005).\n\nPerceived Social Support (PSS): Employees who experienced high degree of PSS in their jobs were more likely to\nbe engaged (r=0.59, p=0.00). An important aspect of psychological safety (Kahn, 1992) stems from the amount of\ncare and support employees’ perceive to be provided by their organization as well as their direct supervisor.\nSupportive work environments allow members to experiment and to try new things and even fail without fear of\nthe consequences (Kahn, 1990; May et al. (2004). Basing on the Social exchange theory, Rhoades et al., (2001)\nand Saks (2006) posit that PSS creates a reciprocal obligation on the part of employees to care about the\norganization’s welfare and to help the organization reach its objectives. This is in line with the Schaufeli/Kahn\nmodel and the social exchange theory.\n\nCompensation Fairness: Employees who experienced high degree of compensation fairness in their jobs were\nmore likely to be engaged (r=0.51, p=0.00). Compensation fairness refers to the perceptions that employees have\nregarding equity in company internal and external compensation and benefits. Researchers have found that when\npay is fair in comparison with other’s pay, a worker is more likely to be engaged (Milkovich & Newman, 2005;\nVandenberghe & Tremblay, 2008). The perceived fairness will compel them to seek to pay back their employer\nby engagement. This is consistent with and validates the social exchange theory.\n\nJob security: Employees who experienced high degree of job security in their jobs were more likely to be engaged\n(r=0.48, p=0.00). Once security is assured employees are more likely to be engaged. This study shows that the\nrelation between job security and engagement is relatively low compared to all the other variables considered here\n- showing medium effect size (Cohen, 1988). This is not surprising as job security is a major concern of many\nemployees in Uganda. Assurance of job security given by the employer is interpreted as a goodwill that has to be\nreciprocated in terms of higher engagement (Cropanzano and Mitchel, 2005).", "word_count": 385, "start_char": 20260, "end_char": 22697}
{"chunk_id": "DOC0148__00010", "doc_id": "DOC0148", "chunk_index": 10, "text": "his is not surprising as job security is a major concern of many\nemployees in Uganda.A\n\nssurance of job security given by the employer is interpreted as a goodwill that has to be\nreciprocated in terms of higher engagement (Cropanzano and Mitchel, 2005).\n\nEmployee Development: Employees who experienced high degree of employee development in their jobs were\nmore likely to be engaged (r=0.63, p=0.00). Work settings in which employees have opportunities for\ndevelopment provide opportunities for growth and employee motivation and engagement (Hackman & Oldham,\n1976; Ryan & Deci, 2000). This study found the development - engagement relation (r=0.63, p=0.00) to be one of\nlarge effect size (Cohen, 1988). Opportunities for employee development by the employer are interpreted as a\nbenevolence that has to be reciprocated in terms of higher engagement (Cropanzano and Mitchel, 2005). The\nstudy findings validate social exchange theory.\n\nHypothesis 2: Hypothesis 2 stated that there would be a positive correlation between employee engagement and\nOCB. The results of this study show that engagement was significantly positively correlated with OCB (r=0.61,\np=0.00), hence providing empirical support for H2. The three factor dimensions of engagement – vigor (r=0.49,\np=0.00), absorption (r=0.58, p=0.00) and dedication (r=0.50, p=0.00) are also significantly positively correlated\nwith OCB. Other studies have also found positive relationships between employee engagement and OCB\n(Rurkkhum, 2010). Avey et al. (2008) for example, found that employees with psychological capital and positive\nemotion were likely to have an employee engagement attitude and performed more OCB.\n\nIn addition, the result of this study is similar to the finding of Wang (2009) in which a positive and strong\nrelationship between organizational support and OCB was found. Research by Ensher et al. (2001) also reported\nthat when employees perceived sincere organization support in terms development opportunities, they experience\nengagement and are more likely to reciprocate by willingly participating in their organization’s non-mandatory\nactivities.\n\nPredictors of Organizational Citizenship Behaviour (OCB)\n\nHierarchical regression analyses were performed to test H3 which stated that after controlling for selected\nengagement antecedents - employee engagement will predict unique variance in OCB. Testing the first regression\nmodel, in the first block, five of the nine engagement antecedents, role clarity (β = .21, p = .01), collaboration (β =\n.21, p =.01), compensation fairness (β = -.26, p = .00), job security (β = -.15, p = .03), and development (β = -\n.31, p = .00) contributed unique variance to the prediction of OCB (adj. R2 = .46, p = .00) in the regression\nequation.\n\nFigure 2: Predictors of OCB\n\nβ=.21\n\nβ=.21\n\nβ=-.26\n\nβ=-.31\n\nβ=-.15\n\nβ= -.31\nβ=.33\n\nSource: Research data\n\nContributions to Knowledge", "word_count": 435, "start_char": 22444, "end_char": 25336}
{"chunk_id": "DOC0148__00011", "doc_id": "DOC0148", "chunk_index": 11, "text": "2 = .46, p = .00) in the regression\nequation.F\n\nigure 2: Predictors of OCB\n\nβ=.21\n\nβ=.21\n\nβ=-.26\n\nβ=-.31\n\nβ=-.15\n\nβ= -.31\nβ=.33\n\nSource: Research data\n\nContributions to Knowledge\n\nThe study contributed to prevailing debate about whether there was a direct link between HR practices\n(antecedents) and firm performance, or that the relationship is mediated by a range of attitudinal and behavioral\nvariables at the individual level. This study filled that gap by proposing that in the Uganda context the\nantecedents-engagement-OCB relationship is mediated by attitudinal variable - employee engagement. This study\nalso contributed to the debate that aggregate outcome variables used in the existing management literature, such\nas competitiveness, firm financial performance and organizational effectiveness, are too distal from the microlevel HRM interventions, by proposing a more proximal outcome indicator such as OCB to measure individual\nHRM outcomes (Wright & Haggerty, 2005; Purcell & Kinnie, 2007; Paauwe, 2004). Besides, most of the studies\nthat have been conducted on the predictors of employee engagement and their outcomes in recent years were\nmostly centered on the Western world such as the United States (Britt, 2003; May, Gilson, & Harter, 2004),\nNetherlands (Schaufeli & Bakker, 2004; Xanthopoulou, Bakker, Demerouti, & Schaufeli, 2007), Spain (Salanova,\net al., 2005), Finland (Hakanen, Bakker, & Schaufeli, 2006; Mauno, Kinnunen, & Ruokolainen, 2007), Greece\n(Xanthopoulou, et al., 2009), Norway (Martinussen, Richardsen, & Burke, 2007). This study filled that research\ngap in the Uganda among employees of soft drink firms.\n\nConclusions\n\nVariations in OCB in Uganda context can be explained by the changes in employee engagement which in itself is\ninfluenced by changes in HR practices. Employee engagement is therefore a significant mediator between the HR\npractices and OCB.\nRole clarity\nCollaboration\nCompensation\nfairness\nDevelopment\n\nOCB\n\n(Absorption)\n\nThis research has validated and extended the engagement and social exchange theory by establishing that role\nclarity, collaboration, compensation fairness, job security, and development are significant predictors of OCB.\n\nRecommendations\n\nArising from the findings of this research, the following recommendations are made: Hypothesis 1: To enhance\nemployee engagement, practitioners should ensure that each of the nine antecedents in their businesses are\nnurtured - job characteristics, role clarity, material resources, collaboration, reward & recognition, perceived\nsocial support, compensation fairness, job security and development. Hypothesis 2: To reap the benefits of\nemployee engagement and increase OCB it is recommended that business should use the finding of this study to\ndevelop interventions and strategies for improvement of employee engagement and OCB among employees.\nHypothesis 3: since role clarity, collaboration, compensation fairness, job security, and development as well as\nemployee engagement are significant predictors of OCB, managers need to appreciate role of social exchange in\nliking these antecedents and OCB.\n\nLimitations of the study", "word_count": 449, "start_char": 25158, "end_char": 28301}
{"chunk_id": "DOC0148__00012", "doc_id": "DOC0148", "chunk_index": 12, "text": "ypothesis 3: since role clarity, collaboration, compensation fairness, job security, and development as well as\nemployee engagement are significant predictors of OCB, managers need to appreciate role of social exchange in\nliking these antecedents and OCB.L\n\nimitations of the study\n\nThis study used a cross-sectional research design as opposed to a longitudinal research design. Longitudinal and\nexperimental studies are required to provide more definitive conclusions about the causal effects of employee\nengagement and the extent to which social exchange explains these relationships. In addition, much of the data\ncame from a self-reported questionnaire. This could affect the reliability and validity of the data because\nrespondents may have answered the questions to reflect more socially acceptable responses rather than ones that\nreflect their real opinions. Although the results of this study might have been affected by method bias, statistical\nresults give us confidence in the results.\n\nSuggestions for future Research\n\nFuture research on OCB, engagement and antecedents should not be limited to a quantitative paradigm.\nQualitative studies might assist in better understanding the phenomenon under study. To replicate this study,\nstructural equation modelling (SEM) as well as longitudinal studies could be used to capture changes in the\nvariables over periods of time. Future research should examine distant antecedents such as personality variables\nas well as demographic and culture variables that might influence the development of employee engagement, as\nwell as outcomes like productivity, profitability, and competitiveness. Future researchers should expand the\nsample to include the entire food and beverage industry. A comparative study could also be done with the service\nindustry. A study could also concentrate of the five antecedents which emerged significant – collaboration, reward\n& recognition, perceived organizational support, compensation fairness, and development. Instead of the\nintermediate outcome – OCB, future research should consider final outcomes like productivity, profitability,\ncustomer satisfaction, competitiveness.", "word_count": 303, "start_char": 28020, "end_char": 30181}
