{"chunk_id": "DOC0080__00000", "doc_id": "DOC0080", "chunk_index": 0, "text": "Electronic copy available at: http://ssrn.com/abstract=1658658\n\nThe Civil, Administrative and Criminal law Standards in\nIntellectual Property enforcement in Uganda: The Good, the bad and\nthe hoped-for.\nBy Anthony C.K. Kakooza*\nAbstract\nUganda presently lacks a National Intellectual Property Policy framework developed and supported\nby all interested stakeholders, and covering the policy linkages between IP and public health\n(including implementation of the WTO Doha Declaration on the TRIPS Agreement and Public\nHealth in Uganda); agriculture and the environment including Plant variety protection; education,\nscience and technology; enterprise development and regulation; protecting Uganda's rich cultural\nheritage and traditional knowledge; and consumer interests.\n\nThis study therefore sets out to show how far Uganda has gone in stabilizing its Intellectual\nproperty rights environment, more especially in terms of enforcement of the rights involved. The\nfirst part of the study gives a summary of the Country profile with the objective of emphasizing the\nneed for building on the Intellectual Property potential that Uganda has to offer in fostering\nknowledge - based economical growth.\n\nThe second part analyses the present regional and International IP Policy and legal framework from\nwhich Uganda derives its obligations as a member of the World Trade Organization. It proceeds to\nexamine and discuss the efficacy of the enforcement mechanisms at the International and regional\nlevel particularly with Instruments ratified by Uganda. In the same vein, it also gives a\nconnotational analysis of some issues prevalent in developing countries that are ignored by\ndeveloped countries in their efforts to protect their trade interests through enforcement of\nIntellectual Property Rights.\n\nThe third part looks at the existing IP policy considerations, legal framework and Institutional\nframework in Uganda, including local jurisprudence related to IP, from which the enforcement\nmechanisms in place are determined. In the fourth part, this highlights the challenges and way\nforward for the future. It addresses recommendations as to how Uganda can come up with an\neffective enforcement structure for its IPR holders that befits the Country's political and socioeconomic setting.\n*LL.B (M.U.K), Dip. L.P (L.D.C), LL.M (Warwick, U.K) Advocate of the High Court of Uganda and Lecturer in Law\nmajoring in Intellectual Property law and ICT Law (Uganda Christian University, Mukono & Nkumba University).\n\nElectronic copy available at: http://ssrn.com/abstract=1658658\n\nLIST OF ACRONYMS\n\nAGOA\n\nAfrican Growth and Opportunity Act\nARIPO\n\nAfrica Regional Industrial Property Organization\nCOMESA\n\nCommon Market for East and Central Africa\nEAC\n\nEast African Community\n\nEACU\n\nEast African Customs Union\nEBA\n\nEverything But Arms\nEDF\n\nEuropean Development Fund\nGATS\n\nGeneral Agreement on Trade in Services\nGATT\n\nGeneral Agreement on Trade and Tarrifs\nGDP\n\nGross Domestic Product\nIPR\n\nIntellectual Property Rights\nLDC\n\nLeast Developing Country\n\nMoFPED\n\nMinistry of Finance, Planning and Economic Development\nMlTTI\n\nMinistry of Trade Tourism and Industry\nNARO", "word_count": 450, "start_char": 0, "end_char": 3148}
{"chunk_id": "DOC0080__00001", "doc_id": "DOC0080", "chunk_index": 1, "text": "National Agricultural Research Organization\n\nNITA - U\n\nNational Information Technology Authority - Uganda\n\nPEAP\n\nPoverty Eradication Action Plan\n\nTRIPS\nAgreement on Trade-Related Aspects of Intellectual Property rights\nUNCST\n\nUganda National Council for Science and Technology\nUNCTAD\n\nUnited Nations Center for Trade and Development\nUPRS\n\nUganda Performing Rights Society\nURSB\n\nUganda Registration Services Bureau\n\nWIPO\n\nWorld Intellectual Property Organization\n\nWTO\n\nWorld Trade Organization\n\nIntroduction\n\nEffective enjoyment and management of Intellectual Property Rights stands on strong enforcement\nmechanisms. Without such mechanisms, there can never be any orderly IP system not only within\nspecific local jurisdictions but also globally in terms of harmonization.\n\nEnforcement of Intellectual Property Rights has a direct link to economic development basing on\nthe underlying principles of Intellectual Property rights, which are encouragement of new ideas, and\nstrengthening honest dealing1. Protection of IP Rights through effective and globally harmonized\nlaws boosts investor confidence and as such promotes economic development. Uganda's Intellectual\nProperty environment paints a picture of mostly archaic laws inherited in whole from Britain during\nthe 1962 Independence. Prior to the 1990's, these laws were the Intellectual Property norm in the\ncountry, the general business community was not even aware of their existence and therefore did\nnot exercise any protection of LP Rights or call for reforms in enforcement where the same was\ndeemed to be lacking and thus, economic development in this area was sluggish.\n\nHowever, Uganda's ratification of the agreement establishing the World Trade Organization in\nOctober 19942 influenced its embankment on the modification of its Intellectual Property laws in\nline with the requirements of the TRIPS Agreement under the WTO. Such considered modifications\nhave expanded the focus of Uganda's horizon from the traditional confinements, that is, Trade\nMarks, Patents and Copyrights, to areas such as Geographical indications, Technovations, Trade\nSecrets, Plant Variety Protection, Traditional Medicinal Practice and establishment of an Industrial\nProperty Office3.\n\nNevertheless, improvements on the national provisions on Intellectual Property Rights enforcement\nappear more demanding then ever. As more countries are focusing on harnessing their knowledge -\nbased economies, there is International pressure for local protection of Intellectual Property rights\nthat flow from foreign investments into the country. Local investors are also weary of protection of\ntheir LP Rights both locally and where cross-border trade with immediate neighbors is concerned,\namid increasing counterfeiting and smuggling of goods across the borders. These and more\ndemands on the legislative drafters continue to emerge creating complexities as the country\nstruggles to put in place laws that are in harmony with other member states of the W.T.O.", "word_count": 420, "start_char": 3148, "end_char": 6139}
{"chunk_id": "DOC0080__00002", "doc_id": "DOC0080", "chunk_index": 2, "text": "hese and more\ndemands on the legislative drafters continue to emerge creating complexities as the country\nstruggles to put in place laws that are in harmony with other member states of the W.T.O.\n\n1 'The Republic of Uganda: Uganda Law Reform Commission - The Intellectual Property Law Project Report,\nAdvocacy Workshops, 2155- 245h October 2003, at Pg. 14\n2 Ibid, Pg 4\n3 Atwine Jeffrey., \"A Review of Uganda's current situation with regard to Intellectual Property Policy Issues: Opportunities\nand Challenges \" (Dec. 2003) Vol. l No. 2, The Uganda Living Law Journal, pp. 192 to 215.\n\nThrough an analysis of the complexities involved in the modification of Uganda's LP laws, this\nhighlights the extent of Uganda's efforts in streamlining its enforcement provisions: under the\nTRIPS obligations and leads to an appreciation of the realities on the ground. For instance, Uganda,\nas a developing Country, has inadequate infrastructure to move at the pace of developed countries\nin the modification of its LP laws. Furthermore, the enforcement of LP rights in the local context is\na hard nut to crack where the majority of the population is in the poverty class, which relies on\npirated products that are cheaper and easily accessible. The proposed modifications in the\nIntellectual Property law environment by the Uganda Law Reform Commission are sound, but there\nare concerns over deterrent provisions in criminal stipulations where LP infringements are\nconcerned. More importantly, very few countries provide for imprisonment as an option for IPR\ninfringement and we therefore need to address the efficacy of such an option.\n\nThere can also never be full harmonization of LP enforcement laws where countries, especially\nLDCs, enjoy varieties in culture. The proposed legislation on Traditional Medicinal Practice, for\ninstance, is an area under Intellectual Property that deserves the confinements of Ugandan\nlegislation and is also bound to encounter a number of complexities in the enforcement of rights\naccruing thereto. On a lighter note, however, Uganda's appreciation of its Traditional Medicinal\nPractice and the desire to protect it as an Intellectual Property Right shows that the Country is\nbeginning to exploit aspects of creativity and innovation as it takes it place in the global village as a\nknowledge-based economy.\n\nOn the whole, these and various other challenges need to be adequately addressed as Uganda\ndiligently works on a reformation of its Intellectual Property laws. Its enforcement provisions\nshould not only be streamlined on the basis of conforming to the TRIPS requirements but should\nalso be best suited for the country's SocioEconomic situation. Consideration should also go towards\nthe Intellectual Property interests of the neighboring countries to encourage concerted efforts in\naddressing cross-border activities that boost I.P. Rights infringements.\n\n1.0: BACKGROUND TO THE STUDY", "word_count": 450, "start_char": 5944, "end_char": 8859}
{"chunk_id": "DOC0080__00003", "doc_id": "DOC0080", "chunk_index": 3, "text": "ts enforcement provisions\nshould not only be streamlined on the basis of conforming to the TRIPS requirements but should\nalso be best suited for the country's SocioEconomic situation.C\n\nonsideration should also go towards\nthe Intellectual Property interests of the neighboring countries to encourage concerted efforts in\naddressing cross-border activities that boost I.P.R\n\nights infringements.\n\n1.0: BACKGROUND TO THE STUDY\n\n1.1 COUNTRY PROFILE\n\nUganda is a small; land locked country in East Africa bordered by Tanzania, Rwanda, the\nDemocratic Republic of Congo, Sudan and Kenya. Its population is estimated at approximately 30\nmillion people. Uganda's economy is largely based on the export of unprocessed agricultural\nproducts. It is a member to a number of regional bodies such as the Common Market for Eastern\nand Southern Africa (COMESA), the East African Community (EAC), the World Trade\nOrganization (WTO) and others.\n\nThe manufacturing sector makes products largely for domestic consumption, although efforts are\nunderway to increase the size of this sector in order to add value to exports4. Uganda offers a range\nof products for export that mainly target the United States and the European Union. It is one of the\nbeneficiaries of the African Growth and Opportunity Act (AGOA). Under AGOA, over 1,800\nproducts from Uganda, including textiles, arts and crafts enjoy duty - and quota - free access to the\nUnited States market. A similar preferential treatment is enjoyed under the EU's Everything But\nArms (EBA) initiative and similar initiatives in Canada, Japan and other Countries5.\n\nThe present Government policy objective is the development of the Private Sector through a five\nyear National Development Plan (NDP). The National Development Plan, which was launched in\nApril 2010, replaces the Poverty Eradication Action Plan of 1997. The NDP outlines the\ngovernment’s intention to improve road and rail networks, create employment opportunities,\nimprove labour force distribution and use the private sector as the engine of growth and\ndevelopment. The National Development Plan is based on the theme: Growth, Employment and\nSocio-Economic Transformation for Prosperity.\n\nUganda’s five year development plan is thus in line with the need for a sound Intellectual Property\nPolicy. It should thus be noted that Uganda presently lacks a National IP Policy framework\ndeveloped and supported by all interested stakeholders, and covering the policy linkages between IP\nand public health (including implementation of the WTO Doha Declaration on the TRIPS\nAgreement and Public Health in Uganda); agriculture and the environment including Plant variety\nprotection; education, science and technology; enterprise development and regulation; protecting\nUganda's rich cultural heritage and traditional knowledge; and consumer interests.", "word_count": 422, "start_char": 8435, "end_char": 11273}
{"chunk_id": "DOC0080__00004", "doc_id": "DOC0080", "chunk_index": 4, "text": "4 P. Asiimwe: IT Country Assessment of Uganda: A survey Report on the status and use of Intellectual Property by\nEnterprises, Institutions and the Uganda Registration Services Bureau,- WIPO, July 2005; at p.9\n5 United Nations & International Chamber of Commerce Report: An Investment Guide to Uganda:\nOpportunities and Challenges ; March 2004, at pr 17\n\n2.0: INTERNATIONAL AND REGIONAL POLICY FRAMEWORK\n\n2.1 Introduction\nThis part addresses Uganda's IP position in the International Perspective in terms of treaty\nratifications and obligations. It is considered relevant to analyze the International policy framework\nbefore looking at the local position in the next part of the study. Thus, apart from addressing the\nmembership obligations, this part also provides a detailed critique of the TRIPS Agreement and the\nexpectations placed upon developing countries like Uganda to fulfill their mandates as member\nstates.\n\n2.2 International obligations\nIn April 1994, Uganda signed the agreement establishing the World Trade Organization (WTO) and\nratified the same in October 1994. By 31st December 1994, Uganda had fulfilled all the conditions\nnecessary to become a founder member of the WTO. Article XVL4 of the Agreement establishing\nthe WTO provides that each member state shall ensure that its laws and regulations are brought into\nconformity with its. obligations under the Agreements. Some of the obligations, rights and benefits,\ncan only be accessed and taken advantage of with the correct legal framework in place6.\n\nIt is imperative that Uganda's legislation is at par with the international commitments to which\nUganda is bound as is provided for under Article 1 of TRIPS. Article 1 of the TRIPS Agreement\nprovides that \"members shall give effect to the provisions of this Agreement and the members may\nbut shall not be obliged to implement in their law more extensive protection than is required by this\nAgreement, provided that such protection does not contravene the provisions of this Agreement\".\n\nAs stated in the Business Guide to the Uruguay Rounds7, \"The Multilateral legal Instruments\nresulting from the Uruguay Round are treated as a single undertaking. All WTO member countries\nare required to adopt national legislation and regulations to implement the rules prescribed by\nGATT 1994 (General Agreement on Trade and Tariffs) and its associate agreements, General\nAgreement on Trade in Services (GATS) and the agreement on Trade Related Aspects of\n\n6 U.L.R.C: A study report on Intellectual Property Rights - Trademarks c5'c Service Marks Law; Law Corn Pub. No. 15 of 2004, at\np. 17\n7 Business Guide to the Uruguay Round published by UNCTAD/WTO and the Common Wealth Secretariat, 1996; at p.15,\ncited in U.L.R.C. report supra note 8", "word_count": 432, "start_char": 11273, "end_char": 14024}
{"chunk_id": "DOC0080__00005", "doc_id": "DOC0080", "chunk_index": 5, "text": "o. 15 of 2004, at\np. 17\n7 Business Guide to the Uruguay Round published by UNCTAD/WTO and the Common Wealth Secretariat, 1996; at p.15,\ncited in U.L.R.C. report supra note 8\n\nIntellectual Property Rights (TRIPS)\". It goes on to state that \"... the single undertaking rule has\nautomatically made all WTO members including developing countries and transitional economies,\nparties to the associate agreements and other multilateral agreements.\"\n\nBy virtue of being a signatory to the WTO, Uganda is bound to fulfill specific obligations that have\na bearing on its domestic legislation. Thus the legal regime with regard to commercial laws is\naffected and in particular, legislation related to TRIPS.\n\nAll WTO Agreements are essential and of immediate concern to Uganda although the degree varies\nfrom one agreement to the other as shall be seen below. The different agreements give varied time\nframes within which member countries are expected to implement them. Uganda, as a developing\ncountry, benefits from the special and different clauses that give longer periods for the application\nof particular agreements or not being required to implement certain provisions of the agreement\nbecause of the additional burden in form of resource requirements needed to implement these\nagreements and possible effect on the infant and non competitive industries. Accordingly, under the\nDeclaration on the Agreement on TRIPS and Public Health of the Ministerial conference of the\nWTO dated November 14, 2001 in Doha, Qatar, pharmaceuticals in Least Developed Countries\n(LDCs) may be excluded from patent protection8.\n\nThe need for the amendment and development of the TRIPS related laws in Uganda cannot be\noverstated. The need for strong and globally uniform laws directly affects investor confidence in a\ncountry's economy. In the Business Guide to the Uruguay Round9, it is stated that \"... Industries and\ntrading organizations were complaining that because of differing national standards for the\nprotection of Intellectual property rights such as Patents and Trademarks ... trade in counterfeit\ngoods was on the increase.\" The effect of increased trade in Counterfeit goods is that business is\ndiscouraged and investor interest wanes. This fact in the wording of the WTO is stated thus; The\nabsence of adequate protection was also considered a deterrent of foreign investment in the\nproduction of patented goods and a reason for the reluctance of industries in developed countries to\nsell or license technology to industries in developing countries.\"10\n\n2.2.1 Overview of the TRIPS Agreement\n2.2.1 (a) Obligations under Intellectual Property Conventions\nArticle 2 of the TRIPS Agreement requires that in respect of Part II (Standards", "word_count": 422, "start_char": 13851, "end_char": 16576}
{"chunk_id": "DOC0080__00006", "doc_id": "DOC0080", "chunk_index": 6, "text": "8 Uganda has no obligation to implement TRIPS until 1st July 2013. With regard to pharmaceutical products, Uganda does not\nneed to apply provisions on patents and protection of undisclosed information until 1st January 2016.\n9 Ibid, note 7 supra\n10 Ibid\n\nconcerning the availability, scope and use of Intellectual property Rights, i.e. Copyright and\nRelated Rights, Trademarks, Geographical Indications, Industrial Designs, Patents, Layout\nDesigns of Integrated Circuits, Protection of Undisclosed Information/Trade Secrets, Control of\nAnti-Competitive Practices in Contractual Licenses), Part III (Inclusive of Civil and Administrative\nprocedures and remedies as well as criminal procedures), and Part IV of the Agreement\n(Acquisition and maintenance of Intellectual property Rights and related inter-parties procedures),\nmembers shall comply with articles 1 to 12 and article 19 of the Paris Convention (1967). It further\nprovides that nothing in Parts I to IV of the Agreement shall derogate from existing obligations that\nmembers may have to each other under the Paris Convention (1967), the Berne Convention (1971),\nthe Rome Convention and the Treaty on Intellectual Property in respect of Integrated Circuits.\n\n2.2.1 (b) General obligations on enforcement of Intellectual property rights\nIt should be noted that the Berne Convention11 contains very few provisions concerning\nenforcement of LP rights. Article 15 provides that the author of a literary or artistic work protected\nby the Convention is entitled to institute infringement proceedings in the Countries of the Union.\nFurthermore, article 16 also provides that infringing copies of a work can be seized in any country\nof the Union where the work enjoys legal protection.\n\nIt is however apparent that the technological means for creation and use of protected material have\nevolved over time since the establishment of the Berne Convention. Secondly, there is also an\nincreasing economic importance in the realm of international trade with regard to the movement of\ngoods and services protected by IP rights12. The new trend that relates Intellectual Property rights to\ntrade therefore portrays a movement away from the reliance on the Berne Convention with regard to\nenforcement mechanisms for IP rights as countries are now being urged to have enforcement\nprocedures available under their own domestic legislations so as to permit effective action against\nany infringement of IP rights.\n\nThe TRIPS Agreement is evidence of this new trend. Part III of the TRIPS agreement provides for\nthe issue of enforcement of Intellectual property rights in general. Under article 41, this is inclusive\nof availing enforcement procedures under member laws such as provision of expeditious and\ndeterrent remedies; fair and equitable, timely and affordable remedies. This study later on addresses\nhow Uganda has attempted to implement these provisions in its domestic legislation.", "word_count": 440, "start_char": 16576, "end_char": 19505}
{"chunk_id": "DOC0080__00007", "doc_id": "DOC0080", "chunk_index": 7, "text": "nder article 41, this is inclusive\nof availing enforcement procedures under member laws such as provision of expeditious and\ndeterrent remedies; fair and equitable, timely and affordable remedies.T\n\nhis study later on addresses\nhow Uganda has attempted to implement these provisions in its domestic legislation.\n\n2.2.1 (c) Civil and Administrative procedures and remedies\nSections 2 and 3 of the TRIPS Agreement provide for the judicial procedures that should be made\n\n11 Berne Convention for the Protection of Literary and Artistic Works, of September 1886 (October 2, 1979)\n12 W.LP.O: Understanding Copyright and Related Rights; WIPO Publication No. 909(E) at p. 14\n\navailable to IP right holders to guarantee protection of their rights. This includes ensuring that the\nprocedures are fair and equitable (article 42), provision of evidence (article 43), injunctions to\nprevent further infringements and damages for injury suffered (articles 44 and 45 respectively), as\nwell as any other remedies available in order to deter further infringement (article 46). Article 47\nprovides for the right to information by a rights holder about third parties and article 48 provides for\nthe indemnification of a defendant against whom wrongful enforcement procedures were taken as\nwell as limiting the protection of pubic authorities. Article 49 gives direction of administrative\nmeasures. It provides that, \"to the extent that any civil remedy can be ordered as a result of\nadministrative procedures on the merits of a case, such procedures shall conform to principles\nequivalent in substance to those set forth in this section\".\n\n2.2.1 (d) Criminal procedures\nSection 5 of the TRIPS Agreement provides for Criminal enforcement mechanisms. Article 61\ntherein is to the effect that member states shall apply criminal procedures and penalties in cases of\n\"willful trademark counterfeiting or copyright piracy on a commercial scale.\" The remedies\navailable include imprisonment, monetary fines, seizure, forfeiture and destruction of the infringing\ngoods. Materials and implements predominantly used to make infringing goods may also be\nforfeited, seized and destroyed. The provision in article 46 with regards to other remedies available\napplies in this respect.\n\n2.2.2 A critical appraisal of the TRIPS Enforcement mechanisms13\nIt should be appreciated from the onset that the TRIPS' own standards of IP rights protection are\nexpressed in such general terms that Member States can freely vary the protection and enforcement\nthat they actually give14.\n\nPursuant to TRIPS, WTO members are therefore obligated to provide minimum levels of\nsubstantive IPRs protection and to provide adequate mechanisms for the enforcement of those\nprescribed levels of protection. Such obligations of each WTO member are enforceable by other\nmembers by proceedings under the WTO Dispute Settlement Understanding (DSU)15.\n\nThere are three essential principles under the TRIPS Agreement: First, it establishes minimum", "word_count": 446, "start_char": 19194, "end_char": 22179}
{"chunk_id": "DOC0080__00008", "doc_id": "DOC0080", "chunk_index": 8, "text": "uch obligations of each WTO member are enforceable by other\nmembers by proceedings under the WTO Dispute Settlement Understanding (DSU)15.T\n\nhere are three essential principles under the TRIPS Agreement: First, it establishes minimum\n\n13 Extract from Kakooza Anthony C.K: Enforcement of Intellectual Property Rights in Uganda: The complexities and\nRealities; University of Warwick, Master of Laws Degree Dissertation, 2004, at p. 14 -15\n14 Arup, C. (2004) TRIPS: Across the Global Field of lntellectual Property, Vol. 26, Issue 1 January 2004, European\nIntellectual Property Review, Pgs 7-16\n\n15 Abbott F., Cottier T. and Gurry F., The International Intellectual Property System, Commentary and Materials - Part\nTwo (1999) Kluwer Law International, The Hague, at p. 1570\n\nstandards for WTO members in the protection and enforcement of IPRs. Signatory States are free to\noperate higher standards as long as there is no, conflict with the standards enshrined in the TRIPS\nAgreements16. Articles 63 and 64 provide for the prevention and settlement of disputes under the\nWTO Dispute Settlement Understanding (DSU). Herein, the obligation of a WTO Member is\nenforceable by other Members pursuant to DSU proceedings. This is a cheap and timesaving means\nof resolving disputes between Member States.\n\nSecondly, there should be mutual treatment amongst Member states in that each country should\nprotect nationals of other parties by granting them the rights provided for in the agreement17. This is\nthe principle of national treatment.\n\nThirdly, the IPRs protection granted to nationals of signatories should be no less favourable than\nthat granted to nationals of other parties. There should not be any discrimination in the granting of\nrights to nationals. This is known as the \"most favoured nation\" principle18. Countries are therefore\nencouraged to treat the interests of other countries at the same level as they treat their own.\n\nFollowing the obligation enshrined in paragraph one of Article 41 of the TRIPS Agreement in the\nprovision of enforcement measures, the agreement sets out guidelines in the subsequent paragraphs\nand in article 42. As aforementioned, these are, inter alia, with regard to what is fair and equitable;\nto be in writing; and to be subject to review. However, it is argued that the Agreement is not clear as\nto the procedure to be followed where a Member claims that another Member has not provided\neffective enforcement measures. This argument is better illustrated hereunder:", "word_count": 390, "start_char": 21946, "end_char": 24446}
{"chunk_id": "DOC0080__00009", "doc_id": "DOC0080", "chunk_index": 9, "text": "s aforementioned, these are, inter alia, with regard to what is fair and equitable;\nto be in writing; and to be subject to review.H\n\nowever, it is argued that the Agreement is not clear as\nto the procedure to be followed where a Member claims that another Member has not provided\neffective enforcement measures.T\n\nhis argument is better illustrated hereunder:\n\n(a) Uncertainty as to when to institute a claim.\nAbbott argues that the TRIPS Agreement is not clear as to \"whether one member may obtain a\nremedy against another for a single breach of the obligation to provide effective enforcement, or\nalternatively whether the TRIPS- Agreement only envisages claims and remedies for systemic\nfailures.\"19 Abbott's discomfort is as to whether a Member whose IPRs have been infringed by\nanother Member, should seek enforcement on a case by case basis or alternatively demonstrate a\nconsistent failure in having its IPRs protected by the other Member state. The basis for this\nconfusion is in the use of the word \"any\" in Article 41.1, which stipulates for Members to provide\nprocedures \"so as to permit effective action against any act of infringement\" (emphasis mine). To\n\n16 Worthy J., \"Intellectual Property Protection after GATT\" (1994) 5 EIPR 195, Firth A., Lane S., and Smyth Yvonne:\nReadings in Intellectual Property, (1998) Sweet & Maxwell, at p. 4\n17 ibid\n18 ibid\n\n19 Abbott F., Cottier T. and Gurry F., The International Intellectual Property System, Commentary and Materials - Part One\n(1999) Kluwer Law International, The Hague, at p. 1570\n\nAbbott, the word any might be interpreted to mean that there should be adequate enforcement in\neach and every case that arises or alternatively that any type or kind of IPRs claim should provide a\nbasis of relief20.\n\nHowever, I would also opine that the word \"any\" should cover a case-by-case basis, as this would\nmake the provision more realistic. In the aforementioned provision, the words that follow are: \"act\nof infringement\" and not \"acts of infringement\" which can imply that the drafters intended the\napplication of the provision to be on a. case-by-case basis.", "word_count": 349, "start_char": 24087, "end_char": 26205}
{"chunk_id": "DOC0080__00010", "doc_id": "DOC0080", "chunk_index": 10, "text": "owever, I would also opine that the word \"any\" should cover a case-by-case basis, as this would\nmake the provision more realistic.I\n\nn the aforementioned provision, the words that follow are: \"act\nof infringement\" and not \"acts of infringement\" which can imply that the drafters intended the\napplication of the provision to be on a. case-by-case basis.\n\nFurthermore, claims for systemic failures can also be seen to arise out of one individual case and as\nsuch should not have to be interpreted differently. This was the case with the General Agreement on\nTariffs and Trade (GATT) disputes involving Section 337 of the United States Tariff Act of 1930.\nWhen Canada first raised a complaint against Section 337 in 1981, this was de facto a single private\ncase, but in 1988 when the European Community brought the second GATT complaint against\nSection 337, the focus that time was on a systemic failure of the U.S in that the said Section\nviolated national treatment principles because imported products alleged to have infringed upon a\nU.S. - granted patent were given less favourable treatment under Section 337 than treatment\nreceived by U.S Products21.\n\n(b) Uncertainty on evidence and quantum of damages in a claim.\nThe TRIPS Agreement is also criticized over the \"quantum of inadequate enforcement measures a\nMember would need to prove to obtain a remedy, and the evidence that a Member submits to prove\nits case\".22 This argument focuses on the fact that the TRIPS Agreement is not clear as to what\namounts to \"adequate evidence\" under Article 43 and \"adequate damages\" under Article 45.\nBlakeney23 adds weight to this argument by asserting that there is no guidance under Article 45.1 to\ncater for the complexity of quantifying damages suffered as the result of an Intellectual Property\ninfringement.\n\n(c) Defendant's rights under Provisional Measures.\nArticle 50, paragraph 2 of the TRIPS Agreement provides for the adoption of provisional measures\nwhere, inter alia, there is \"demonstrable risk of evidence being destroyed\". In instances where there\nis a likelihood of the defendant destroying evidence of infringement before prosecution, the IPRs\n\n20 Ibid\n21 American University International Law Review (2002): Rogers J.W., and Whitlock J.P. - Is Section 337 consistent with\nthe GATT and TRIPS Agreement? at p. 7.\n22 Abbott (note 19 supra) at p. 1573\n23 Blakeney, M. (1996), Trade Related Aspects of Intellectual Property Rights: A Concise Guide to the TRIPS Agreement, Sweet\n& Maxwell, London., pg. 129", "word_count": 407, "start_char": 25853, "end_char": 28366}
{"chunk_id": "DOC0080__00011", "doc_id": "DOC0080", "chunk_index": 11, "text": "holder can proceed to obtain an exparte injunction against the defendant on the basis of the above\nprovision. However, it is argued that this creates a likelihood of abuse of the defendant's rights, with\ndue regard to the obligation on providing for safeguards against abuse provided for under Article\n41.1 of TRIPS24.\n\nCaution should therefore be exercised in the execution of such provisional measures with the\nconsideration of having a lawyer present to ensure that the defendant is aware of his rights and that\nthese rights are respected.\n\n(d) Lack of clarity on provision of Information\nThe stipulation under Article 47 is an order upon the infringer to provide information to the IP\nRight holder pertaining to any other party involved in the production and distribution of the\ninfringing goods. The exercise of this power is cancelled where it is not \"out of proportion to the\nseriousness of the infringement\". However, as Blakeney argues, no guidance is given with regard to\nthe evaluation of what constitutes seriousness or whether this should be looked at under the\nperspective of the LP.R holder or that of the general public25.\n\n(e) Element of Good faith b Public Officials.\nArticle 48.2 of the TRIPS agreement stipulates that in administrative instances pertaining to the\nprotection or enforcement of I.P.Rs, public authorities and officials shall only be exempted from\nliability where their actions have been undertaken in good faith. However, there is no set guideline\nas to what would constitute good faith, leaving a question mark for Court to determine.\n\n2.3 Regional obligations\n(a) The East African Community\nKenya, Tanzania and Uganda signed an agreement establishing the East African Cooperation26. The\nagreement was upgraded into a treaty, signed on 30th November, 1993. Having ratified the Treaty,\nthere was need to domesticate the requirements set out in Article 8(2) of the Treaty, within 12\nmonths from the date of signing the Treaty. In effect, each state was expected to secure enactment\nof a law to give effect to the Treaty.\n\nIn Uganda, the East African Community Act was enacted in May and came into force by Statutory'\nInstrument. Having domesticated the treaty, article 8 (1) provides that Partner States shall -\n\n24 Vaver D., Some Aspect of the TRIPS Agreement: Copyright Enforcement and Dispute Settlement (Working Paper No. 1, April\n2000) Oxford Intellectual Property Research Centre, at St. Peters College\n25 Supra note 23 at pg. 131\n26 Later on joined by Rwanda and Burundi", "word_count": 408, "start_char": 28366, "end_char": 30877}
{"chunk_id": "DOC0080__00012", "doc_id": "DOC0080", "chunk_index": 12, "text": "aving domesticated the treaty, article 8 (1) provides that Partner States shall -\n\n24 Vaver D., Some Aspect of the TRIPS Agreement: Copyright Enforcement and Dispute Settlement (Working Paper No. 1, April\n2000) Oxford Intellectual Property Research Centre, at St.P\n\neters College\n25 Supra note 23 at pg. 131\n26 Later on joined by Rwanda and Burundi\n\n(a) plan and direct their policies and resources with a view to creating conditions\nfavourable for the development and achievement of the objectives of the community and\nthe implementation of the provisions of this Treaty;\n(b) abstain from any measures likely to jeopardize the achievements of the objectives or the\nimplementation of the provisions of this Treaty.\n\nAccordingly, the partner states have gone ahead to approximate their laws in relation to Intellectual\nproperty rights with various proposals. Some of these include proposals to -\n(a) include service marks in Uganda's legislation;\n(b) comply with the TRIPS Agreement; and\n(c) Harmonize laws of the East African Community Partner states.\nAnother significant development was the signing of the Common Market Protocol on 20 November\n2009 by the EAC Heads of State27. The mandate for the Partner States to negotiate the EAC\nCommon Market is derived from Article 5(2) of the Treaty and more specifically from; Article\n76(1) which states that “There shall be established a Common Market among the Partner States.\nWithin the Common Market, and subject to the Protocol provided for in paragraph 4 of this Article,\nthere shall be free movement of labour, goods, services, capital, and the right of establishment”;\nand, Article 76 (4) of the Treaty which states that “For purposes of this Article, the Partner States\nshall conclude a Protocol on a Common Market.”\nGoing by such regional developments, it is thus necessary to have Uganda's Intellectual Property\nLaw framework reviewed so as to have a smooth development of Intellectual Property Interests\nwithin the East African Community.\n\n(b) The African Regional Industrial Property Organization (ARIPO)\nThe ARIPO was founded by the Lusaka Agreement of December 9, 1976 to facilitate the\nharmonization and development of industrial property matters affecting its member states28. Uganda\nis a founder member of ARIPO and became a State Party in August 1978. The advantage that\ncomes with registration of IP rights under ARIPO is that you have a centralized registration that\ncompliments (not conflicts) with local registration of IP rights. As such, under ARIPO, protection\nof IP rights is territorial through the member states29.\n\n27 http://www.eac.int/component/content/351.html (accessed 7th June 2010)\n28 See note 6 supra at p. 37\n29 These include: Botswana, Gambia, Ghana, Kenya, Lesotho, Malawi, Sierra Leone, Somalia, Sudan, Swaziland,\nUganda, Tanzania, Zambia and Zimbabwe.", "word_count": 441, "start_char": 30529, "end_char": 33366}
{"chunk_id": "DOC0080__00013", "doc_id": "DOC0080", "chunk_index": 13, "text": "s such, under ARIPO, protection\nof IP rights is territorial through the member states29.\n\n27 http://www.eac.int/component/content/351.html (accessed 7th June 2010)\n28 See note 6 supra at p. 37\n29 These include: Botswana, Gambia, Ghana, Kenya, Lesotho, Malawi, Sierra Leone, Somalia, Sudan, Swaziland,\nUganda, Tanzania, Zambia and Zimbabwe.\n\nThe member countries of ARIPO, for instance, adopted the Banjul Protocol catering for Trademarks\nand Service Marks, administered by ARIPO, in November 1993. This protocol provides for a\ncentralized trademark registration procedure. Applications for registration may be submitted either\nto the ARIPO office or to the Industrial Property Office of a member state.\n\nOn the other hand, the Harare Protocol30 caters for a centralized registration of Patents, Industrial\nDesigns and Utility models under ARIPO. A patent granted to a local applicant by ARIPO (Harare\nProtocol) has the same effect as one granted under the Patents Act31 except where the Registrar has\nnotified ARIPO office that the patent shall be ineffective in Uganda32.\n\nAs for Copyright and related rights protection, there is no regional provision for such under ARIPO\nthough the Organization is coming up with a data base on Copyright in Africa. Protection for such\nis therefore presently only catered for by the World Intellectual Property Organization (WIPO)33\n\n(c) Other Conventions worth noting\nThe Paris Convention for the Protection of Industrial Property, March 20, 1883\nUganda is a signatory to this Convention as of June 14, 1965. This Convention covers the protection\nof Industrial Property amongst the member states including Patents, Utility Models, Industrial\ndesigns, trademarks, service marks, trade names, indications of source or appellation of origin and\nthe repression of unfair competition. Under the Paris Convention, for instance, a person who has\nduly filed an application for a patent or for the registration of a utility model or of an industrial\ndesign or of a trademark, in one of the countries of the Union, he or she or his or her successor in\ntitle, shall enjoy for the purpose of filing in the other countries, a right of priority during the periods\nfixed34.\n\nUganda is not a Member of the Berne Convention for the Protection of Literary and Artistic Works.\nNeither is Uganda a member of the Convention on the International Union for the Protection of\nNew Varieties of Plants (UPOV). Uganda is party to the Convention on Biological Diversity (CBD)\nand, as a member of the African Union (AU), may wish to take cognizance of the AU Model Law\n\n30 The Harare Protocol on Patents and Industrial Design, 1982\n31 The Patents Act, Cap. 216, Laws of Uganda, 2000 Ed.", "word_count": 429, "start_char": 33027, "end_char": 35721}
{"chunk_id": "DOC0080__00014", "doc_id": "DOC0080", "chunk_index": 14, "text": "ganda is party to the Convention on Biological Diversity (CBD)\nand, as a member of the African Union (AU), may wish to take cognizance of the AU Model Law\n\n30 The Harare Protocol on Patents and Industrial Design, 1982\n31 The Patents Act, Cap. 216, Laws of Uganda, 2000 Ed.\n\n32 Bakibinga David (Prof):Intellectual property rights in Uganda: Reform and Institutional Management Policy formulation;\npaper delivered at the Network of Academies of Sciences in Organization of Islamic Countries (NASIC), International\nSeminar on \"Intellectual property and innovation: Value creation in the Knowledge Economy\" held in Islamabad, Pakistan,\n12-14 December 2006\n33 Sibanda G.: Intellectual Property as a Tool for National Development: Imperatives for a National Intellectual Property Policy -\nThe Regional Perspective (ARIPO); Presentation at National Symposium on IP Education, Training and research -\nKampala, Uganda; May 11- 13 2009\n34 Uganda Law Reform Commission: A Study Report on Intellectual property Rights – Trade Marks and Service Marks\nLaw, ULRC Publication No. 15 of 2004, at pg 28\n\non Access\nto Genetic Resources35.\n\n2.4 IPR Enforcement in developing countries: Can one size fit all ?\nIt is argued that on the basis of infrastructural and socio-economic differences, it is obvious that\nthere cannot be complete harmonization in the area of IPRs enforcement36. The same argument\nholds the view that consideration of this fact brought the architects of the TRIPS provisions into\nfocusing on a result - oriented criteria instead of giving the details as to how enforcement should be\nregulated. This, as such, is the reason behind PART III of TRIPS containing such vague phrases as\n\"effective,\" \"reasonable,\" \"undue,\" \"unwarranted,\" \"fair and equitable\" and \"not ... unnecessarily\ncomplicated or costly.\"37 Therefore, by calling this result - oriented, the focus on such phraseology\nis to enable WTO member states to draw up their own regulations as to IPR enforcement.\n\nJohn Barton argues that it is not appropriate for one size to fit all, to wit, that developing countries\nshould be allowed to have IPR regulations that fit their conditions rather than to conform to the\nTRIPS obligations favoured by developed countries38. He presents three reasons in support of his\nargument:\na) Resource imbalance\nThe basis for Intellectual Property systems is the provocation and creation of incentives for research\nand creativity. However, there is an inadequate number of scientists and technicians in developing\ncountries to take up such creativity, as well as the infrastructure and finances to support their\nefforts.", "word_count": 407, "start_char": 35449, "end_char": 38060}
{"chunk_id": "DOC0080__00015", "doc_id": "DOC0080", "chunk_index": 15, "text": "e presents three reasons in support of his\nargument:\na) Resource imbalance\nThe basis for Intellectual Property systems is the provocation and creation of incentives for research\nand creativity.H\n\nowever, there is an inadequate number of scientists and technicians in developing\ncountries to take up such creativity, as well as the infrastructure and finances to support their\nefforts.\n\nb) Imbalance in equity\nIncentives for IPRs holders mainly come from increased prices for their products. Therefore, if such\nproducts are highly priced, the poor in developing countries cannot afford such products especially\npharmaceutical products, which are highly priced to cater for the research costs involved. The way\nout is for the developing countries to pay for such products at a lower price than developed\ncountries.\n\n35 M. Leesti & T. Pengelly: Technical and Financial Co-operation Needs for Implementation of the WTO TRIPS Agreement in\nUganda; Draft Report of Needs Assessment Diagnostic (2007) - for ICTSD & MITT at p. 9\n36 Dreier, T., TRIPS and the Enforcement of lntellectual Property Rights; Article in Abbott F., Cottier T. and Gurry F., The\nInternational Intellectual Property System, Commentary and Materials - Part One (1999) Kluwer Law International, The\nHague, at p. 631\n37 Ibid\n38 Barton, J. Nine Months after the UK Commission Report on Intellectual Property Rights: Taking Stock and Priorities for future\naction. Presentation at Chatham House, June 17, 2003 - Seminar on Intellectual Property Rights: Driver of Competition\nand Growth or Unnecessary Constraint?\n\nc) Industrial strategy\nIndustrial development in the developed countries was partly characterized by imitation. Barton\ntherefore argues that enforcement of IPRs is meant to block out industrial development along the\nsame lines by other nations and yet \"the greater the portion of human knowledge that is in the\npublic domain, the greater the opportunity for new entrants.\" This argument has also been\npresented by many developing countries that view the obligations imposed through agreements such\nas the WTO's IRIPS as mainly protecting the interests of developed countries at the expense of\ndeveloping Countries.", "word_count": 336, "start_char": 37676, "end_char": 39863}
{"chunk_id": "DOC0080__00016", "doc_id": "DOC0080", "chunk_index": 16, "text": "2.4.1. Other realities affecting enforcement of IPRs within developing countries:\na) Opting for cheaper market products\nIt is noted that IPR Infringement in developing countries is mainly in the areas of copyright\n(counterfeiting of products such as computer software and music cds which are easy to copy) and\ntrademark infringements39. Low-income countries are characterized by market forces that prefer\ncheap products to quality expensive products. Counterfeit products are therefore sold on the black\nmarket to satisfy such consumers and their growth is further strengthened by the absence of strong\nenforcement institutions and structures to discourage their operations. It has been reported in the\nmedia, for instance, that a software company in Uganda, which manufactures the 'loan performer'\nmicro-finance software, discovered that its software products were being copied without a license\nand sold cheaply locally40.\nb) Disguised monopolies\nBarton raises another argument to the effect that today's leading firms in developed countries hold\nstrong IP positions and ensure the use of both domestic and international regulations to discourage\nnew entrants in the same fields41. In this regard, IPR protection becomes a means of creating a\ndisguised monopoly to beat out competition42. Much as TRIPS provisions provide for the creation\nof licenses, it is still difficult to envisage how firms holding such licenses or firms from developing\ncountries that start out as allies of the major companies can develop into industrial competitors. The\ndifficulty created by the multinational oligopolies in bringing about new competitive entrants only\nencourages local industries in developing countries to imitate foreign products that already have a\nniche in the market through exploiting the weak enforcement laws.\n\n39 Integrating Intellectual Property Rights and Development Policy Report of the Commission on Intellectual property\nRights (London, September 2002)\n40 \"Software Pirates on the Loose\"- By Christopher Kiwawulo in\nhttp://www.newvision.co.ug/detail.php?newscategeryid -last visited 151 March 2004\n41 ibid, note 38 supra\n42 The same criticism has been leveled in various fora against the proposed Uganda Counterfeit Goods Bill, 2009 that inter\nalia allegedly appears to propose outrageous intellectual property enforcement measures that favour international firms\nover and above the socio-economic interests of Uganda.\n\nTherefore, whereas Barton is not advocating for a renegotiation of TRIPS, the focus should be on\nthe imbalance on its use and maximising the benefits from Intellectual Property protection among\nits member states. Developed countries have been exploiting TRIPS provisions to a great extent in\nthe protection of their interests. The focus should thus turn to developing countries and how TRIPS\ncan better be exploited to serve their interests as well while giving consideration to their\nshortcomings.", "word_count": 427, "start_char": 39863, "end_char": 42792}
{"chunk_id": "DOC0080__00017", "doc_id": "DOC0080", "chunk_index": 17, "text": "eveloped countries have been exploiting TRIPS provisions to a great extent in\nthe protection of their interests.T\n\nhe focus should thus turn to developing countries and how TRIPS\ncan better be exploited to serve their interests as well while giving consideration to their\nshortcomings.\n\n3.0: A review of Uganda's IP legal framework and policy\nThis part of the study analyses the present Intellectual Property environment within Uganda. It\naddresses the legislative set up; reviews recent and past case law with a view of highlighting the\njurisprudential position of IP rights and enforcement within Uganda It sums up by looking at the\nmajor institutions in place that cater for IP rights. On the whole, the civil, administrative and\ncriminal aspects of enforcement of IP rights in Uganda are catered for.\n\n3.1 Over view of existing IP legislation in Uganda\nAs the paramount law, the 1995 Constitution of the Republic of Uganda caters for protection from\ndeprivation of property under article 26. This, by inference, covers intellectual property protection\nalthough it is too generic. The provision states that every person has a right to own property, either\nindividually or in association with others, and that no person shall be compulsorily deprived of\nproperty or any interest in property unless it is for public use and that person has been fairly\ncompensated. However, the specific laws that provide for protection of intellectual property are:\n•\nThe Patents Act, Cap 216.\n•\nThe Copyright and Neighbouring Rights Act, No. 13 of 2006\n• The Trademarks Act, Cap 217.\n• The UK Designs (Protection) Act, Cap 218.\n• The Uganda National Council for Science & Technology Act, Cap 209\n• The Uganda Registration Services Bureau Act, Cap 210.\n\nOther laws that may have ramifications on the use of intellectual property, though still in draft form,\ninclude the Electronic transactions Bill, the Computer Misuse Bill and the Electronic signatures\nBill. All the three pieces of legislation above are to be implemented by the National Information\nTechnology Authority (NITA-U)43.\n\n3.1 (a) The Patents Act, Cap. 216\nThis law provides for the registration and protection of patents and utility models in Uganda. It was\n\n43 See Sec. 5(g) of the National Information Technology Authority, Uganda Act, No. 4 of 2009.", "word_count": 372, "start_char": 42507, "end_char": 44809}
{"chunk_id": "DOC0080__00018", "doc_id": "DOC0080", "chunk_index": 18, "text": "ll the three pieces of legislation above are to be implemented by the National Information\nTechnology Authority (NITA-U)43.\n\n3.1 (a) The Patents Act, Cap. 216\nThis law provides for the registration and protection of patents and utility models in Uganda.I\n\nt was\n\n43 See Sec. 5(g) of the National Information Technology Authority, Uganda Act, No. 4 of 2009.\n\nlast revised in 1991 but is presently due for further revision by the Uganda Law Reform\nCommission so as to bring it into conformity with the TRIPS Agreement. Under the present law,\napplicants can register Patents for protection of 15 years, whereas the duration of protection for\nutility models (certificates) is 7 years. The law also makes possible the filing of regional patent\napplications through the ARIPO system. Currently, the country does not have an examination\noffice. For this reason, applications are only filed at the Uganda Registration Services Bureau\n(URSB) for onward transmission to ARIPO in Harare for examination.\n\nIt has been proposed under various fora to extend the term for patent protection from 15 to 20 years\nin accordance with the TRIPS agreement44. The Patent Act is also seen to portray ambiguity on\npatentability of life forms. Sec.7 (2) (b) of the Patents Act, for instance provides for inventions not\ncapable of protection and goes further to refer to 'plant or animal varieties or essentially biological\nprocesses for the production of plants or animals, other than biological processes and the products\nof those processes'.\n\nThe provision highlighted above seems to suggest that the results of biotechnology are prevented\nunder law from being patented. If this is indeed the intention of the provision, then it ultimately\nhinders creativity and innovation in Uganda. Nonetheless, there is need for clarity so that the\ncountry can ensure that its legislation is in compliance with key provisions of the TRIPS agreement,\nincluding article 27 (3) (b) on plant and animal varieties, before July 2013.\nThe United Nations Convention on Biological Diversity, 1992, to which Uganda is a signatory,\nprovides for the setting up of protection regimes for plant varieties and recognition of the\ndependence of local communities on biological resources as well as the roles that these\ncommunities play in the conservation and sustainable use of the resources45. In pursuance of\nUganda's obligations thereof the Uganda Law Reform Commission has drafted a Plant Variety\nProtection Bill46. The Bill is aimed at, amongst other points, recognizing and protecting the rights of\nprivate and public breeds over the varieties developed by them.", "word_count": 415, "start_char": 44453, "end_char": 47068}
{"chunk_id": "DOC0080__00019", "doc_id": "DOC0080", "chunk_index": 19, "text": "n pursuance of\nUganda's obligations thereof the Uganda Law Reform Commission has drafted a Plant Variety\nProtection Bill46.T\n\nhe Bill is aimed at, amongst other points, recognizing and protecting the rights of\nprivate and public breeds over the varieties developed by them.\n\nA major shortfall of the Uganda Patents Act is that the requirements of patentability (novelty,\ninventive step and industrial application) are hard to place within the context of Uganda's socioeconomic environment47. To mitigate this, the Patents Act permits the issue of utility certificates\nwhere the invention does not fulfill patentability especially the requirement of an inventive step48.\n\n44 Article 33 of the TRIPS Agreement\n45 See note 32 supra at p. 7\n46 See note 3 supra at p. 208\n47 See Bakibinga note 32 supra, citing Atwine, note 3 supra on pg 204 as\n48 See sections 42 - 43\n\nThe certificate is valid for seven years but may be useless where there is lack of patentability in the\nform of an invention.\n\nAnother shortfall in this Act is that it has weak civil remedies for infringement of Patent Rights of\nthe holder49. The Act rules out infringement in instances where acts are done in pursuance of\nscientific research; with the consent of the owner; acts done in good faith50; as well as instances of\nexploitation of a Patent by the Government or persons employed by the Government51.", "word_count": 231, "start_char": 46795, "end_char": 48169}
{"chunk_id": "DOC0080__00020", "doc_id": "DOC0080", "chunk_index": 20, "text": "he Act rules out infringement in instances where acts are done in pursuance of\nscientific research; with the consent of the owner; acts done in good faith50; as well as instances of\nexploitation of a Patent by the Government or persons employed by the Government51.\n\n3.1 (b) The Copyright and Neighbouring Rights Act (No. 19 of 2006)\nThis Act is fairly new having been enacted in 2006. It repealed the Copyright Act, Cap. 215, which\nhad been in existence since July 1964. The old Act was originally Cap. 81 under the 1964 Revised\nEdition of the Laws of Uganda. Prior to that, Uganda followed the Copyright Ordinance (Cap.220),\nwhich applied the Copyright Act of 1911 from Britain. The old Copyright law was rather shallow in\naddressing Intellectual property concerns and there was pressure on the Government to come up\nwith a law that is in conformity with the standard requirements of the World Trade Organization, in\nparticular, the TRIPS Agreement. The Copyright and Neighbouring Rights Regulations of 2010 (S.I\nNo. 1 of 2010) have also been created to cater for registration of Copyright Works.\nThe present law thus serves the purpose of updating Uganda's Copyright law to conform with the\ninternational standards on Copyright. It provides for the protection of literary, Scientific and artistic\nIntellectual works and their neighboring rights. The law takes into account technological advances\nand provides for the protection of computer programmes and electronic data banks and other\naccompanying materials (sec. 5(1(e)). It also provides that illustrations, maps, plans, sketches and\nthree dimensional works relative to geography, topography, architecture or science are also eligible\nfor copyright protection (sec. 5 (1(h)). The law also imposes criminal sanctions against\nunauthorized use of copyright work belonging to a rights holder (sec. 47).\n\nMuch as it is apparent that this law has made significant strides to steer away from the old\nCopyright law in Uganda and closer to adhering to TRIPS, its major downside is on the\npracticability of its enforcement provisions52. The general public (inclusive of would-be rights\nholders, law enforcement personnel and the usual abusers of such) are to a great extent not aware\nabout the existence of the Copyright law. Obviously this affects the principle of deterrence from\nacts of Copyright infringement; understanding what such infringement entails as well as ways of\n\n49 Section 26\n50 Sec. 28\n51 Sec.29\n52 However, advocates for the Counterfeit Goods Bill argue that its stringent enforcement provisions will help curb\nCopyright piracy in Uganda\n\ncombating the vice.", "word_count": 416, "start_char": 47904, "end_char": 50528}
{"chunk_id": "DOC0080__00021", "doc_id": "DOC0080", "chunk_index": 21, "text": "bviously this affects the principle of deterrence from\nacts of Copyright infringement; understanding what such infringement entails as well as ways of\n\n49 Section 26\n50 Sec. 28\n51 Sec.29\n52 However, advocates for the Counterfeit Goods Bill argue that its stringent enforcement provisions will help curb\nCopyright piracy in Uganda\n\ncombating the vice.\n\nHowever, we should be weary of heavy criminal sanctions being imposed on abusers (in various\nforms) of copyrights in Uganda. Professor Ruth Okediji argues53 that when you use criminal\npenalties, you have to think about the implications on innovation. Since Intellectual property law is\nessentially about knowledge building on knowledge, then heavy criminal penalties suffocate\neconomic development. In the United States of America, for instance, in the wake of legislation\nincreasing the criminal penalties for copyright infringement or unauthorized duplication of motion\npictures and sound recordings, the computer software industry did not enjoy a mass market and\nstagnated in its infancy stage of development for a while54.\n\n3.1 (c) The Trademark Act, Cap. 217\nThis Act basically extends protection to individuals and corporations to trade marks registered\nunder it. It gives the registered owner of a trademark a right to use it to the exclusion of all other\npersons55 but permits the owner a license or assign it to other persons to use the trademark56. Under\nS.22, marks are valid for 7 years and can thereafter be renewed for 14 year durations.\n\nThis Act lacks provisions on enforcement of Trademark rights of the holder. It only provides\npunitive measures against making false entries in the Trademarks registers57. It lacks civil and\ncriminal provisions against infringement of Trademarks. The Act, therefore, does not have any\nprovisions on enforcement in line with TRIPS requirements. However, counterfeiting of\nTrademarks is covered as an offence under Section 357 of the Penal Code.\nCurrent challenges to the enforcement of trademark law in Uganda include lack of a specific\ninstitution charged with fighting counterfeits58 and disinterest of small and mediums sized\nenterprises to use the law due to the time it takes to get a mark registered; as well as non\nregistability of service marks in Uganda59.\n\nReform of the trademarks regime is necessary given the provisions of the WTO TRIPS agreement", "word_count": 370, "start_char": 50178, "end_char": 52540}
{"chunk_id": "DOC0080__00022", "doc_id": "DOC0080", "chunk_index": 22, "text": "eform of the trademarks regime is necessary given the provisions of the WTO TRIPS agreement\n\n53 Okediji R. (Prof. of Law, University of Minnesota, U.S.A) Intellectual Property law presentation at Uganda \"Trade and\nIntellectual Property Program: Legislative Review, Grand Imperial hotel, Kampala, 14'h May 2009\n54 L. Saperstein (1997): Copyrights, Criminal Sanctions and Economic Rents: Applying the rent seeking model to the\ncriminal law formulation process; Northwestern University School of Law; Journal of Criminal law and Criminology.\n55 See section 8\n56 See sections 25 to 34\n57 Ibid, see S. 56\n58 There is always a confusion in this regard basing on the mandates of the Uganda National Bureau of Standards, the\nNational Drug Authority, the Uganda Revenue Authority and the Uganda Police. The same confusion has resurfaced time\nand again during the stakeholders debates on the proposed Uganda Anti Counterfeit Goods Bill.\n59 See Asiimwe, note 4 supra\n\non trademarks (Articles 15-21), regardless of the fact that these provisions are largely in line with\nthe provisions of the Uganda Trademarks Act60. Suffice to note that the Counterfeit Goods Bill,\nspearheaded by the Ministry of Tourism, Trade and Industry (MTTI) addresses Trademark\ninfringement. As of January 2010, the draft Bill was back with the First Parliamentary Council,\nMinistry of Justice and Constitutional Affairs for incorporation of views received from various\nstakeholders on the provisions in the Bill.\n\nThe Uganda Law Reform Commission has also drafted a Trademarks Bill that, once enacted, will\nreplace the existing law. This Bill is more in line with TRIPS requirements and provides for better\nprocedures in registration, administration and enforcement of Trademarks in Uganda. The\nTrademarks Bill was passed by Parliament in early 2010 but is not yet operational as law.\n\n3.1 (d) The United Kingdom Designs (Protection) Act, Cap 218.\nAs its short title suggests, this is \"an Act to provide for the protection in Uganda of designs\nregistered in the United Kingdom\". This law was applicable in the United Kingdom as far back as\n1934. More importantly, this law states further as follows:\n\"Subject to this Act, the registered proprietor of any design registered in the United Kingdom\ntinder the Patents and Designs Acts, 1907 to 1932, or any Act of the United Kingdom\namending or substituted for those Acts shall enjoy in Uganda the like privileges and rights as\nthough the certificate of registration in the United Kingdom had been issued with an extension\nto Uganda\"61.", "word_count": 405, "start_char": 52449, "end_char": 54995}
{"chunk_id": "DOC0080__00023", "doc_id": "DOC0080", "chunk_index": 23, "text": "The implication of the foregoing provisions shows that Uganda effectively has no design law and\nrelies entirely on the UK legislation which was last revised in 199562, though in context, its\nprovisions remain the same. The fact that the short title restricts itself to designs registered in the\nUK puts most potential beneficiaries in Uganda outside its ambit as few can afford to register\ndesigns there. Secondly, few lawyers in Uganda have taken off time to acquaint themselves with the\nnumerous developments in UK design laws to enable them to competently advise those who may\nwish to file applications63.\n\nThe reform of this law is also necessary to bring it into conformity with our local settings. The\nUnited Kingdom, as a member of the European Union, has re-aligned its laws to fit into the general\ninterests of the European Union which obviously does not meet the needs, aspirations and\n\n60 See Bakibinga, note 32 supra\n\n61 Section 1\n62 See http://www.vanuatu.usp.ac.fj/paclawmat/Solomon_Islands_ legislation/Solomons_UK. Visited 28th July 2004\n63 See Asiimwe, note 4 supra\n\ntechnological levels of Uganda64. For these reasons, there is need to rapidly repeal this law\nfollowing proposals under the study conducted by the Uganda Law Reform Commission leading to\nthe drafting of the Industrial Property Bill 2009. This Bill was tabled in Parliament and read for the\nfirst time on the 7th of July 2009 and thereafter committed to the Legal and Parliamentary Affairs\nCommittee of Parliament. According to its long title, this proposed law is meant to inter alia serve\nthe purpose of promotion of inventive and innovative activities, facilitate the acquisition of\ntechnology through the grant and regulation of patents, utility models, technovations and industrial\ndesigns.\n3.1 (e) The Uganda National Council for Science and Technology Act, Cap 209\nThis Act provides for the establishment of the Uganda National Council for Science and\nTechnology, (UNCST), of which the most fundamental function is the promotion of science and\ntechnology in Uganda through the transfer of technology and support of local innovation systems.\nThe Act also gives the UNCST the mandate to protect intellectual property through appropriate\npatent laws, to promote the utilization of natural resources and local manpower and to operate a\npatent office.", "word_count": 367, "start_char": 54995, "end_char": 57331}
{"chunk_id": "DOC0080__00024", "doc_id": "DOC0080", "chunk_index": 24, "text": "he Act also gives the UNCST the mandate to protect intellectual property through appropriate\npatent laws, to promote the utilization of natural resources and local manpower and to operate a\npatent office.\n\nHowever this provision requiring the Council to operate a patent office is in contradiction with the\nprovisions of section 4 of the Patents Act which also establishes a patent office to run under the\nUganda Registration Services Bureau (URSB). The National Patent Office does not exist in\npractice, however, the Council is required to handle the technical requirements of applications for\nIPR-related applications and advise the Registrar General's office. Proposals have been made during\nconsultations through the Uganda Law Reform Commission that in the event of a national industrial\nproperty office being formed, the UNCST could handle substantive 'technical examination, while\nthe URSB handles preliminary examination to ensure compliance of applications with the law.\n\n3.1 (f) The Agricultural Seeds and Plant Act, Cap. 2865\nThis law provides for mechanisms for the identification, registration and release of new varieties of\nplants and seeds. The Act establishes a National Seed Authority under whose auspices variety\nrelease committees may be established. The Act further provides for the establishment of a National\nSeed Certification Service whose principle duty is to register and license seeds either imported or\nproduced locally66. Section 8(4), which is relevant to Plant Breeders' rights provides to the effect\nthat the Authority may grant plant breeder's rights for a variety of seeds on the recommendation of\n\n64 See Atwine, note 3 supra at p. 205\n\n65 Cap. 28, Laws of Uganda, 2000 Ed. 66\n66 Sections 7 & 8\n\nthe Variety Release Committee.\n\nThe Act however falls short of identifying Plant Breeders' Rights and basing on the fact that\nUganda is not a party to any of the Conventions relating to Plant Breeders rights (PBRs), it is thus\ndifficult to determine the content for such within the Ugandan legal setting. This is also likely to\naffect enforcement of such rights by the right holders, who would also find it difficult to identify\nthemselves with such rights basing on the fact that the relevant Act does not define them explicitly.\n\nRecommendations follow that action be taken to specify the PBR within subsidiary legislation made\nunder the Act, which legislation should give consideration to current international trends in this\narea.", "word_count": 389, "start_char": 57127, "end_char": 59593}
{"chunk_id": "DOC0080__00025", "doc_id": "DOC0080", "chunk_index": 25, "text": "ecommendations follow that action be taken to specify the PBR within subsidiary legislation made\nunder the Act, which legislation should give consideration to current international trends in this\narea.\n\n3.1(g) The Uganda Registration Services Bureau Act, Cap 210\nThe long title of this law is to the effect that it is to \"establish an agency for miscellaneous\nregistrations and collection and accounting for revenues under various relevant laws and for the\nenforcement and administration of those laws ...\" The overall functions of URSB are discussed in\nthe section below pertaining to Uganda's institutional IP structure (see Sec. 3.4.1 below).\n\n3.2 Analysis of jurisprudence on IP in Uganda\nA look at Uganda's IP legislative structure cannot stand alone without an analysis as to how the\nUgandan Courts have appreciated and applied rulings touching on IP matters over the years. A\nnumber of cases illustrate the existing civil and criminal enforcement mechanisms in place and the\napplication of the same under our legislations67:\n\n3.2.1 Civil enforcement of IPRs.\nIn Uganda, only the High Court68 and superior courts have jurisdiction over intellectual property\ndisputes. The commercial court's advent has tremendously aided the expeditious hearing of\ncommercial cases and increased business confidence in the resolution of trade related disputes in\nUganda. The creation of the commercial court within the High Court has also tremendously assisted\nin the adjudication of intellectual property disputes. Although the court does not have an intellectual\nproperty specific unit, all judges have the competences necessary to handle IP matters\nexpeditiously. A few cases will be pointed out to show the nature of cases that the court has handled\n\n67 Key findings and analysis adapted with kind permission from P. Asiimwe, note 4 supra.\n68 Under the Trademarks Act, Cap 217, s. 1,: `Court' means the High Court; while under s. 26 of the Patents Act, Cap\n216, infringement proceedings can only be brought to the High Court. However, sec. 45 of the Copyright and\nNeighbouring Rights Act is more elaborate and stipulates that infringements of Copyright proceedings are\ninstituted in the Commercial Court. The interpretation therefore is that the Commercial Division of the High Court\nhas the jurisdiction to hear matters related to Intellectual Property Rights.\n\nof recent.\n\nThe first two significant cases handled subsequent to the signing of the TRIPS Agreement were\nAttorney General v Sanyu Television69 in which court granted an injunction against further\ninfringement of a Copyright; and Britania Products (U) Ltd v. Riham Biscuit Industries (U) Ltd70,\nin which Court established that due to differences in trademarks between the parties, the defendant\nhad not infringed against the Plaintiff's Trademark.", "word_count": 433, "start_char": 59392, "end_char": 62195}
{"chunk_id": "DOC0080__00026", "doc_id": "DOC0080", "chunk_index": 26, "text": "iham Biscuit Industries (U) Ltd70,\nin which Court established that due to differences in trademarks between the parties, the defendant\nhad not infringed against the Plaintiff's Trademark.\n\nVitafoam (U) Ltd V Euroflex Ltd71: This was an application under the Judicature Statute and the\nTrademarks Act for a temporary injunction to restrain the respondent. The applicants claimed that\ntheir trade mark was in use for some 27 years of which the respondents continued to infringe on\ntheir mark in the trade by using a similar mark of the applicant to confuse the public. Both\ncompanies are manufacturers of foam mattresses. The applicant company is older on the Ugandan\nmarket and had registered various trademarks for its products. On the basis of the applicant\ncompany's evidence, court granted it an injunction restraining the respondent company and its\nofficials from continuing activities amounting to infringement of the applicant's trademarks.\n\nIn another application heard by the commercial court; Burundi Tobacco Company V. Mastermind\nTobacco Uganda Ltd72, this was an application by Burundi Tobacco Company Societe Anonyme for\na temporary injunction to restrain the respondent, Mastermind Tobacco Uganda Ltd, from using its\n'Supermatch' Trade Mark pending the disposal of the main suit. The applicant had previously\nallowed the respondents to use its 'Supermatch' trade mark registered under class 34. The applicant\nsubsequently wrote a letter to the respondent informing it that it had granted user rights of the mark\nto a company called Leaf Tobacco and Commodities (U) Ltd, and gave the Respondent one month's\nnotice of discontinuance of its license to use the trademark. When the respondent refused to comply\nwith the applicant's letter, the applicant further filed a civil suit seeking for a permanent injunction\nagainst the respondent amongst other remedies.\n\nThe court refused to grant the injunction requested by the applicant company, holding that it had\ngranted the respondent an 'unlimited' license, and therefore, its chances of success in the main suit\nwere limited. Court also held that any injury suffered by the applicant in the meantime could be\ncompensated by way of damages.\n\n69 High Court Civil Suit No. 614 of 1998\n70 High Court Civil Suit No. 1188 of 1999\n71 Misc. Appln. No. 605 of 2002 (Arising from Civil Suit No. 585 of 2002), October 14, 2002\n72 High Court Misc. Application No. 582 of 2002 (arising from civil suit No. 514 of 2002), February 13, 2003", "word_count": 398, "start_char": 62008, "end_char": 64492}
{"chunk_id": "DOC0080__00027", "doc_id": "DOC0080", "chunk_index": 27, "text": "ppln.N\n\no. 605 of 2002 (Arising from Civil Suit No. 585 of 2002), October 14, 2002\n72 High Court Misc.A\n\npplication No. 582 of 2002 (arising from civil suit No. 514 of 2002), February 13, 2003\n\nUganda Performing Rights Society Limited V Fred Mukubira73 was a landmark case in the sense\nthat it is the first suit brought by a copyright collecting society in Uganda. In an application before\ndisposal of the main suit, the court set a precedent by granting the first ever Anton pillar order for\nthe searching and seizure of the defendant's premises regarding infringing copies of the plaintiff's\nmusic. In the words of the presiding Judge:\n\"Copyright infringement of musical works is a big threat to the budding musical industry in Uganda\nand so it needs the protection of the courts. The Anton Piller Order appears to be a good tool to\nachieve this protection. It has been followed in Kenya and I find no good reason why it should not\nalso be applied in Uganda.\"\n\nThe plaintiff Company which is an umbrella organization incorporated to promote and protect the\ncopyright and intellectual property of local artistes and music publishers brought this case against\nMr. Fred Mukubira, a music dealer for alleged infringement of copyright. The plaintiff brought this\nsuit as an assignee of copyrights in various musical works from the authors of the said work. The\nplaintiff claimed that by the said assignments they had the exclusive rights to control distribution of\ncopies of the musical works and broadcasting. The court entered judgment for the plaintiffs, finding\nthat the defendants had reproduced and distributed copyrighted works that had been assigned to the\nplaintiff by various artists. Court awarded the plaintiffs part of the exemplary damages claimed,\nordered delivery up of the infringing copies of tapes and half of the costs of this suit.\n\nThis is an important decision because it shows that there are available avenues for local copyright\nowners to extract economic value from their works through such a collective society. It also shows\nthat the courts recognize the role of such associations and are ready to enforce rights where clear\nlicensing arrangements have been concluded.", "word_count": 362, "start_char": 64300, "end_char": 66493}
{"chunk_id": "DOC0080__00028", "doc_id": "DOC0080", "chunk_index": 28, "text": "his is an important decision because it shows that there are available avenues for local copyright\nowners to extract economic value from their works through such a collective society.I\n\nt also shows\nthat the courts recognize the role of such associations and are ready to enforce rights where clear\nlicensing arrangements have been concluded.\n\nOne important case touching on the significance of Non-disclosure agreements and the duty of\nconfidentiality in Copyright matters is that of Digital Solutions Limited Versus MTN Uganda\nLimited74. This case involved an action for a Permanent Injunction and an application for a\nTemporary injunction. In this matter, the Applicant developed and wrote a software programme\nwhich operates an application that enables peer-to-peer airtime, and service fee transfers between\ntwo pre-paid mobile telephone subscribers by way of a Short Messaging Service (“SMS”)\ncommand. The Applicant named its application “Me2U” and in order to interest the Respondent in\nacquiring a license to use it, disclosed the software programme and the functional specifications of\nthe application to the Respondent (MTN UGANDA LTD), in circumstances that imported a duty of\n\n73 High Court Civil Suit No. 842 of 2003; preceded lay Misc. Application No. 818 for a temporary injunction and an\nAnton Pillar Order.\n74 Miscellaneous Application No. 546 of 2004 arising from High Court Civil Suit No. 570 of 2004\n\nconfidentiality and without assigning its copyright to the Respondent or licensing it to exploit the\nsaid copyright.\n\nThe Applicant alleged that after full disclosure of the software and its functionalities were made to\nthe Respondent, the Respondent pulled out of negotiations for a commercial license from the\nApplicant and instead went ahead to unlawfully use the information obtained from the Applicant to\nlaunch the software application by way of Short Messaging Service (SMS) command also under the\nname “Me2U”. The Applicant was thus prompted to file the action in Court seeking for a\npermanent injunction restraining the Respondent from further infringing its copyright and breaching\nits duty of confidentiality by using the offending application it has also named “Me2U” and\nrestraining the Respondent from using the mark “Me2U”. The Respondent denied the claim\ncontending that the said software was internally developed and there was no reliance on information\nfrom the Applicant.\n\nThe Application for a temporary injunction did not succeed because the status quo had already\nchanged, considering that the Respondent, MTN Uganda Ltd, was already using the software\napplication in the market. Interestingly though, the parties settled the main suit out of Court.\n\nMany other cases on enforcement of Intellectual property rights have been handled and resolved\nthrough Court and alternative dispute resolution mechanisms portraying the fact that Uganda is\nmaking headway in its appreciation of IPR protection.", "word_count": 450, "start_char": 66151, "end_char": 69088}
{"chunk_id": "DOC0080__00029", "doc_id": "DOC0080", "chunk_index": 29, "text": "nterestingly though, the parties settled the main suit out of Court.M\n\nany other cases on enforcement of Intellectual property rights have been handled and resolved\nthrough Court and alternative dispute resolution mechanisms portraying the fact that Uganda is\nmaking headway in its appreciation of IPR protection.\n\n3.2.2 Enforcement through Criminal Courts\nThe infringement of intellectual property laws has largely gone on unabated due to poor\nenforcement of penal provisions that seek to punish infringers. The reason for this poor enforcement\nis generally an issue of awareness. It is partly due to lack of specific training of the police to\nsensitize them on the importance of untiringly fighting counterfeiting. Under Ugandan law, private\ncitizens can initiate criminal prosecutions. However, due to the complexity of criminal procedure\nand the notion that only the state can prosecute, few intellectual property rights owners have taken\nadvantage of this provision to enforce their rights. The recent enactment of the Copyright and\nNeighbouring Rights Act75 introduced criminal penalties under enforcement of IPRs in Uganda\nparticularly with regard to infringement of Copyrights76. The Penal Code Act also criminalizes the\ncounterfeiting of products under s. 379. This section provides that: \"Any person who sells or\nexposes, or has in possession for sale or any purpose of trade or manufacture, any goods or things,\n\n75 No. 19 of 2006\n76 Section 47\n\nwith a counterfeit trademark affixed to or impressed upon them or to or upon any case,. package or\nother receptacle in which the goods are contained, unless he or she proves that, having taken all\nreasonable precautions against committing an offence against this section, he or she had at the time\nof the commission of the alleged offence no reason to suspect the genuineness of the mark, commits\na misdemeanor\".\nIn a decision of the Buganda Road Magistrates' Court in Kampala, the Penal Code Act was put to\ngood use in prosecuting a trademark infringer. In Uganda V. Lubega Charles77, the court heard a\ncase in which the accused was charged with selling goods marked with a counterfeit trademark\ncontrary to the Penal Code Act78. Charles Lubega, the accused in this case, was charged with having\nsold or exposed for sale six hundred thirty (630) cartons of Kiwi Shoe polish with a counterfeit\ntrademark affixed to it, whereas the cartons contained produce and a trademark owned by Sara Lee\nhousehold and body Care Kenya Ltd. These goods were impounded at the Tanzania - Uganda\nborder in transit from China from where they were exported by Zhejiang Yuwu China Co.", "word_count": 422, "start_char": 68775, "end_char": 71395}
{"chunk_id": "DOC0080__00030", "doc_id": "DOC0080", "chunk_index": 30, "text": "hese goods were impounded at the Tanzania - Uganda\nborder in transit from China from where they were exported by Zhejiang Yuwu China Co.\n\nEvidence was adduced by employees of Sara Lee to prove that Sara Lee Kenya was the only\ncompany with a license to export Sara Lee products to Uganda. The Registrar of trademarks also\ntestified for the prosecution stating that she issued a trademark Kiwi Polish to Kiwi European\nHoldings BV on 11/5/04. However, there was no assignment on record in the registry of\ntrademarks.\n\nIn his defence, the accused admitted that his goods were impounded but later they were released\nand he sold them. He further stated that he did not know that Sara Lee Kenya were the only\nauthorized dealers in Kiwi shoe polish.\n\nThe court acquitted the accused. Whereas it found that the accused possessed and disposed of\ncounterfeit products contrary to the Penal Code Act, there was no proof beyond reasonable doubt\nthat he did so knowingly. The court's decision was fortified by the fact that apart from the\ntrademark registration, the assignment granted to Sara Lee Kenya over Kiwi products on the\nUgandan market was not registered with the Registrar of Trademarks. Furthermore, Sara Lee Kenya\nemployees testified that they were aware of counterfeits on the Ugandan market before but that they\ndid no more than hold sensitization seminars.\nIn this case, ignorance of the existence of an exclusive licensee on the market acted as a shield for\n\n77 Criminal Case No. 0028 of 2004\n78 Section 379\n\nthe defendant, especially since he claimed to have taken all reasonable precautions not to breach the\nlaw. However, this judgment shows that IP rights owners need to be vigilant in utilizing, even the\nminimum entitlements within IP laws if they are to take benefit of the protection offered under\nexisting laws. For instance, under S. 24 (5) of the Trademark Act:\n\"The proprietor of a registered trademark who proposes to assign it in respect of any goods\nin respect of which it is registered may submit to the registrar in the prescribed manner a\nstatement of case setting out the circumstances, and the registrar may issue to the proprietor\na certificate.. \"", "word_count": 368, "start_char": 71259, "end_char": 73430}
{"chunk_id": "DOC0080__00031", "doc_id": "DOC0080", "chunk_index": 31, "text": "The case further illustrates the importance of harmonizing laws for various states as well as\nexploring registration of IPRs in foreign jurisdictions. In this case, it is possible that the court would\nhave been more sympathetic with the complainants' case had they registered their assignment in\nUganda. Although this is not an entirely exciting precedent for trademark owners to jubilate about,\nit lays the foundation for more rights owners to make use of the criminal law as a deterrent to\ninfringement of trademarks. It has been argued in various fora that because of the existence of such\nenforcement mechanisms against Trademark infringement under the Penal Code Act, we have no\nneed for the Counterfeit Goods law which is yet to be passed by Parliament.\n\n3.4 Administration of IP: Analysis of Uganda's IP Institutional structure\nAdministration of IPRs covers a number of different dimensions of institutional capacity, such as\norganizational and management arrangements; staffing and human resource issues; and operating\nprocedures and automation models. The administration of intellectual property rights involves\nreceiving of applications, examination of those applications as to formalities and substance, refusing\nor granting and registering and publishing the IPRs79.\n\nThere are a number of Institutions (both public and private) that are responsible for IP Policy\nformulation, administration and enforcement in Uganda. The key institutions in this regard are the\nUganda Registration Service Bureau (URSB) under the Ministry of Justice and Constitutional\nAffairs; and the Uganda National Council for Science and Technology under the Ministry of\nFinance, Planning and Economic Development.\n\n3.4.1 The Uganda Registration Services Bureau\nThis is a statutory body that falls under the Ministry of Justice & Constitutional Affairs80. It is\n\n79 See note 35 supra at p. 12\n80 It is governed by Cap. 210, Laws of Uganda\n\nresponsible for administering Intellectual property rights, namely patents, trademarks, industrial\ndesigns and copyrights. It is also responsible for the registration of births, deaths, marriages and\nbusinesses.", "word_count": 319, "start_char": 73430, "end_char": 75566}
{"chunk_id": "DOC0080__00032", "doc_id": "DOC0080", "chunk_index": 32, "text": "t is\n\n79 See note 35 supra at p. 12\n80 It is governed by Cap. 210, Laws of Uganda\n\nresponsible for administering Intellectual property rights, namely patents, trademarks, industrial\ndesigns and copyrights.I\n\nt is also responsible for the registration of births, deaths, marriages and\nbusinesses.\n\nThe key functions conducted by URSB include the following: Promotion of IP protection;\nformulation of IP Laws; Provision of advice to government on IP issues; providing a link to\nARIPO; providing a link to WIPO81. The URSB promotes the protection of IP through effecting\nregistration of trademarks and Patents. However, URSB currently operates a paper-based registry\nfor industrial property rights and trademark searches are conducted manually rather than using an\nautomated system82. As such, there is inadequate information supplied in soft form with regard to IP\nregistrations. That notwithstanding, the more specific functions of URSB include maintaining\nregisters, data and records on registrations effected by the bureau and to act as a clearing house for\ninformation and data on these registrations, evaluate and monitor performance of relevant laws,\ncarry out research and dissemination of findings.\n\nThe URSB carries out a trademarks registration function, including publication for opposition,\nregistration and renewal. There is little, if any, administrative workload performed by the Bureau on\npatents. The majority of patents that are registered arrive via the ARIPO route and the determination\nof patentability of applications is outsourced to ARIPO. There is a minimal workload associated\nwith the registration of utility models and industrial designs83.\n\n3.4.2 The Uganda National Council for Science and Technology84\nThe Uganda National Council for Science and Technology (UNCST) was established by Statute\nNo. 1 of 1990 (now Cap. 209) as a body corporate, Inter alia to advise Government on and\ncoordinate the formulation of an explicit national Policy on all fields of Science and Technology85.\nThe UNCST Act also clearly stipulates that one of the functions of the Council 'Shall be ... to\nprotect Intellectual Property through appropriate patent laws and to operate a national patent\noffice ...'86 In practice, the National Patent Office does not exist at the Council, however the Council\nis required to handle the technical requirements of applications for IPR-related applications and\nadvise URSB.\n\nBoth UNCST and URSB are the main institutions dealing with the administration and enforcement\n\n81 Findings by P. Asiimwe, note 4 supra\n82 See note 35 supra, p.13\n83 Ibid\n84 See Atwine, note 3 supra at p.210\n85 Sec. 3\n86 Sec. 3(e)\n\nof IP rights in Uganda. They are ordinarily supposed to work together and coordinate their\nactivities.", "word_count": 425, "start_char": 75271, "end_char": 78023}
{"chunk_id": "DOC0080__00033", "doc_id": "DOC0080", "chunk_index": 33, "text": "oth UNCST and URSB are the main institutions dealing with the administration and enforcement\n\n81 Findings by P.A\n\nsiimwe, note 4 supra\n82 See note 35 supra, p.13\n83 Ibid\n84 See Atwine, note 3 supra at p.210\n85 Sec. 3\n86 Sec. 3(e)\n\nof IP rights in Uganda.T\n\nhey are ordinarily supposed to work together and coordinate their\nactivities.\n\n3.4.3 Other key Institutions\nThere are a number of other key institutions, both private and public, that are responsible either\ndirectly- or indirectly for IP policy formulation, administration and enforcement. These include the\nfollowing:\n(a) Uganda Investment Authority (U.I.A)\nThe investment authority is one of the key statutory bodies in the public sector charged with\nthe mandate of registering technology licenses. This duty was placed on this institution\nbecause of its central position in interacting with foreign investors and through its vetting of\ninvestments.\n\n(b) The Ministry of Tourism, Trade and Industry (MTTI)\nThe department of industry and technology under the Ministry of trade is the key player in\nimplementing the proposed industrialization policy. One of the main aims is to improve\nindustrial capacity and capabilities through skills development, entrepreneurship, quality\nenhancement and operationalization of the innovation and industrialization Fund, and\nResearch and Development Fund that are intended to support industry-led growth.\n\n(c) Uganda Industrial Research Institute (UIRI)\nThe UIRI is a key institution under the Ministry of Trade, Tourism and Industry. Its role is to\nfacilitate industrial development through research interventions in key sectors of the\neconomy. The institute is working towards establishing an institutional intellectual property\npolicy that will help it manage its IP assets and direct its investments in new knowledge.\n\n4.0: Challenges and way forward\nThe final part of the study addresses the viability of a developing country like Uganda fulfilling its\nobligations on enforcement of IPRs pursuant to the TRIPS\nAgreement. It concludes with an input as to how IPRs can be better enforced in developing\ncountries.\n\na) Awareness and appreciation of the law87\nPart of the challenges facing intellectual property owners in Uganda is the attitude that there is no\nlaw, or that the existing law is weak and ineffective. This caliber of people has largely resigned\n\n87 Asiimwe , note 4 supra", "word_count": 369, "start_char": 77689, "end_char": 80070}
{"chunk_id": "DOC0080__00034", "doc_id": "DOC0080", "chunk_index": 34, "text": "his caliber of people has largely resigned\n\n87 Asiimwe , note 4 supra\n\nthemselves to counterfeiters using their works and managers paying them a pittance for public\nperformances. There has also been a perception, largely encouraged by corporate users of copyright\nworks, particularly among artists and musicians, that due to the ongoing reform of intellectual\nproperty laws, the existing legislation is no longer in force. For this reason, some are waiting for the\nrevised laws to assert their rights. The public education and sensitization role is thus important to\nset the record straight and enable IP rights owners to benefit maximally from the existing laws as\nthe reform and policy formulation process goes on.\n\nThe aspect of inadequate awareness needs to be dealt with by the URSB and other non profit IP\nrelated agencies, both local and international. These include the UPRS and any other associations\nthat may come up to support inventors. Since these organizations and the URSB are in the nascent\nstages of performing their IP functions, they need all the technical and financial support they can\nget, both from government and intergovernmental organizations such as COMESA, WIPO, and\nUNCTAD, among others.\n\nb) Adequate enforcement mechanisms and networking among enforcement agencies88\nIPRs are only valuable if they can be enforced. For many LDCs, establishing an effective\nenforcement regime presents considerable institutional challenges for policing and judicial systems,\ncivil and criminal procedures and the customs authorities (regarding border enforcement measures).\nMoreover, for an effective enforcement system to operate, close co-operation is required between\nthe enforcement agencies and those institutions dealing with IPRs administration.\n\nc) Training of stakeholders in IP expertise89\nThere is still an inadequate number of specialized lawyers to teach Intellectual Property law, as a\nresult of which, it is a hardly appreciated field of law in practice. Neither has it brought out enough\nfully knowledgeable persons to join the requisite institutions where such manpower is needed. Poor\nfunding of LP related institutions has also slowed down the process of updating the IP- related\nlegislation and general operation of such institutions, thus slowing down further the road map to full\nimplementation of the TRIPS Agreement in Uganda and more significantly, the establishment of an\nLP Policy framework in Uganda.\nThere is thus a need to train and qualify private sector practitioners to effectively represent the\ninterests of applicants and owners of IPRs before the URSB and the courts. There is a current\nshortage in Uganda of lawyers and agents, particularly in the field of patents; with the combination\n\n88 See note 35 supra at p.16\n89 Ibid", "word_count": 429, "start_char": 80001, "end_char": 82774}
{"chunk_id": "DOC0080__00035", "doc_id": "DOC0080", "chunk_index": 35, "text": "here is thus a need to train and qualify private sector practitioners to effectively represent the\ninterests of applicants and owners of IPRs before the URSB and the courts.T\n\nhere is a current\nshortage in Uganda of lawyers and agents, particularly in the field of patents; with the combination\n\n88 See note 35 supra at p.16\n89 Ibid\n\nof legal and scientific knowledge and skills that are needed to assist applicants to obtain IP Rights\nand later to help them defend those rights. Ugandan lawyers need to take advantage of the study\nopportunities in LP training facilitated by the WIPO.\n\nIt is widely recognized that the value of IPRs is, in the first instance, dependent on the validity of\nthe rights established. Validity, in turn, is largely determined by the quality of prosecution of the\napplication before the national administrative authorities. Ultimately, success in defending or\nchallenging IPRs in Court is heavily dependent on the competence of the lawyers handling the\nmatter.\n\nThere is also an urgent need for technical and financial support to develop and deliver training\nprograms for attorneys as well as engineers and scientists in matters relating to patent prosecution\nand litigation. Such training could be delivered through a professional development or continuing\neducation program at the Law Development Centre, for example. In the longer term, the\ngovernment may choose to establish standards that must be met by private sector IP practitioners in\norder to qualify to represent applicants before the URSB. Ultimately, another factor that boosts\ninvestor confidence, particularly in knowledge-based sectors, is the presence of adequate\nenforcement mechanisms and skilled legal practitioners in the relevant field.\n\nd) Training of enforcement agencies in IPR concepts 90\nThere is also a need for training trainers in IP concepts and enforcement matters for the full range of\nenforcement authorities and such other organizations that play important roles in contributing to\neffective enforcement of IPRs. Such training should initially target core groups of senior officers in\nthe Uganda Police Force, the National Revenue Authority's Customs and Excise Department, the\nUganda National Bureau of Standards and the National Drug Authority. At the same time,\nspecialized training should be designed and delivered for the office of the public prosecutor and\nmembers of the commercial division of the High Court. In addition, training in enforcement of IP\nrights should be designed and made available to other interested organizations (governmental and\nprivate sector) that play a key role in the development of IP in Uganda. All training programmes\nshould be carefully sequenced to the promulgation of new IP legislation and related public\neducation campaigns on IPRs in Uganda in order to be effective.", "word_count": 440, "start_char": 82442, "end_char": 85263}
{"chunk_id": "DOC0080__00036", "doc_id": "DOC0080", "chunk_index": 36, "text": "ll training programmes\nshould be carefully sequenced to the promulgation of new IP legislation and related public\neducation campaigns on IPRs in Uganda in order to be effective.\n\ne) Establishment of effective and well-networked databases on Ugandan IP91\nThere is a need for technical and financial support in the provision of access to networked,\n\n90 Ibid\n91 Ibid\n\ncomputerized databases on intellectual properties that are in force in Uganda, for use by\nenforcement authorities in co-operation with the Uganda Registration Services Bureau.\nAdditionally, on-line communications with and access to World Customs Organization (WCO)\ndatabases to improve 'risk profiling' and to identify counterfeit trademarks and fake goods should\nalso be provided to the Customs authority and, if feasible, to the Ministry of Health. Technical cooperation from the WCO and International Criminal Police Organization (INTERPOL) would be\nrequired in establishing the latter system and training staff in its use. An initial pilot project could be\nrun in the Customs service at Entebbe or Kampala regions and then rolled out to the three other\ncustoms regions over the longer term. This project should be synchronized with general training of\nenforcement agencies as well as development of IP legislation in Uganda.\n\nf) Effective networking and coordination between local and international IP Institutions\nWhereas it can be argued that reciprocity of IPR enforcement between countries can be difficult to\nattain due to financial, logistical, infrastructural and related differences, coordination and cooperation between the IP institutions within Uganda and another concerned country can be a\nstarting point paving way for protection and enforcement of each country's IPRs. Such institutions\ncan also serve a good purpose in targeting their respective local entrepreneurs and facilitating the\ndissemination of domestic and foreign knowledge in IPRs.\n\nIt should be noted, however, that in reforming its IPRs systems along such lines, Uganda should\nmatch its roles to its capacities and not simply copy the institutional structures and procedural\nformats of the countries with which it coordinates its IP Office92. Thailand, another developing\ncountry, established an Intellectual Property and International Trade Court in 1997 to provide for a\nmechanism to satisfy its TRIPS obligations93. Uganda, therefore, can gain from studying the\nstructure and operation of the Thailand IP Court in the establishment and running of a National IP\noffice in Uganda in conjunction with the Ugandan Commercial Court.\n\n(g) The role of developed countries\nThe overriding basis of TRIPS being the creation of free trade at a global level, developed countries\nhave a key role to play in assisting low-income countries like Uganda in fulfilling its obligations\nunder TRIPS. The TRIPS Agreement obligates industrialized countries to provide \"technical and", "word_count": 437, "start_char": 85086, "end_char": 87997}
{"chunk_id": "DOC0080__00037", "doc_id": "DOC0080", "chunk_index": 37, "text": "he TRIPS Agreement obligates industrialized countries to provide \"technical and\n\n92 Braga C. A. P., Fink C, and Claudia Paz Sepulveda: Intellectual Property Rights and Economic Development,- Article in\nAbbott F., Cottier T. and Gurry F., The International Intellectual Property System, Commentary and Materials - Part Two\n(1999) Kluwer Law International, The Hague, at p. 2008\n93 Morgan, A., Trips to Thailand: The Act for the establishment of and procedure for Intellectual Property and International Trade\nCourt. (March 2002) Fordharn International Law Journal, Fordharn University School of Law.\n\nfinancial cooperation in favour of developing and least - developed country members\"94. Such\nassistance includes supporting the IPRs reform process, implementation and building IPRs\ninstitutions; enhancing the IPRs environment and improvement in the understanding of the socioeconomic effects of IPRs protection. Presently, Uganda's Intellectual Law Project has received\nfunding from the United States Aid for International Development (USAID), as well as the\nCommercial Justice Reform Programme under the Justice Law and Order Sector95. Funding and\ndonor programmes therefore play a big role in broadening Uganda's IP enforcement system.\n\nCONCLUSION\n\nThis study has addressed Uganda's position in the enforcement of IPRs pursuant to the TRIPS\nAgreement. The challenges posed and the huddles to be jumped only go to show that Uganda is\npart of the global village and the improved protection and enforcement of IPRs internally will\ncontribute to the nurturing of a knowledge-based economy within the country with regards to IP\nrelated matters. This will thus impact positively on the general economy. This effectively involves\nbuilding a national consensus on IP protection, establishment of strong institutions and\ninfrastructure with the necessary capacity to handle administration and enforcement of IPRs.\nUganda will reap more from its membership under TRIPS if it follows such an approach.\n\n94 Abbott F., Cottier T., and Gurry F., Supra Note 20 at p. 2014\n95 Supra note 1, at p. 6\n\nBibliography:\n\nText Books\n1. Abbott F., Cottier T. and Gurry F., The International Intellectual Property -system,\nCommentary and Materials - Part One and Two (1999) Kluwer Law International, The\nHague.\n\n2.\nBaker & McKenzie, London and R. Hart, Guide to Intellectual Property in the I.T.\nIndustry 1st Ed. (1998) Sweet and Maxwell Limited.\n\n3.\nBlakeney M.: Trade Related Aspects of Intellectual Property Rights: A concise guide to the\nTRIPS Agreement; (1996) Sweet and Maxwell Limited.\n\n4.\nCorrea C., Intellectual Property Rights, the WTO and Developing Countries: The TRIPS\nAgreement and Policy Options, (2000) Zed Books Limited.\n\n5.\nG. Dinwoodie, W. Hennessey and S. Perlmutter, International Intellectual Property Law\nand Policy (2001) LexisNexis.\n\n6.\nMartin Khor: Intellectual Property, Biodiversity and Sustainable Development (2002)\nThird World Network.", "word_count": 438, "start_char": 87918, "end_char": 90861}
{"chunk_id": "DOC0080__00038", "doc_id": "DOC0080", "chunk_index": 38, "text": "orrea C., Intellectual Property Rights, the WTO and Developing Countries: The TRIPS\nAgreement and Policy Options, (2000) Zed Books Limited.\n\n5.G\n\n.D\n\ninwoodie, W.H\n\nennessey and S.P\n\nerlmutter, International Intellectual Property Law\nand Policy (2001) LexisNexis.\n\n6.M\n\nartin Khor: Intellectual Property, Biodiversity and Sustainable Development (2002)\nThird World Network.\n\n7.\nMatsushita M., Schoenbaum T.J., and Mavroidis P.C; THE WORLD TRADE\nORGANIZATION: Law, Practice and Policy; (2003).\n\n8.\nPhillips, J. and Firth, A., Introduction to Intellectual Property Law, 4th Ed. (2001)\nButterworths\n\nJournals and Reports\n\n9.\nAtwine Jeffrey., \"A Review of Uganda's current situation with regard to Intellectual\nProperty Policy Issues: Opportunities and Challenges \" (Dec. 2003) Vol. 1 No. 2, The\nUganda Living Law Journal, Pgs 192 to 215.\n\n10. P.F. Kihwelo. \"The World Trade Organisation (WTO): For whose benefit ?\" (Dec. 2003)\nVol.1 No. 2, The Uganda Living Law Journal, Pgs 216 to 232.\n\n11. Tabaro Edgar., \"Multimedia Convergence and the Future of Copyright in Uganda\" (Dec.\n2003) Vol.1 No. 2, The Uganda Living Law Journal, Pgs 179 to 191.\n\n12. Worthy J., “Intellectual Property Protection after GATT\" (1994) 5 EIPR 195, Firth A.,\nLane S., and Smyth Yvonne: Readings in Intellectual Property, (1998), Sweet & Maxwell.\n\n13. The Republic of Uganda: Uganda Law Reform Commission - The Intellectual\nProperty Law Project Report; Advocacy Workshops., 21st - 24th October 2003.\n\nArticles and Commentaries:\n\n14. Berryman, Jeff, Faculty of Law, University of Windsor: Recent Developments in Anton Piller\nOrders: John and Jane Doe, rolling along in Canada, Oxford Intellectual Property Centre,\nWorking Paper Series No. 4 Nov. 2001 http://www.oiprc.ox.ac.uk/EJWP1199.html (last\nvisited 3rd March 2004)\n\n15. Blakeney Michael (Prof.), Intellectual Property in the Dream-time - Protecting the Cultural\ncreativity of indigenous peoples, Queen Mary Intellectual Property Research Institute,\nQueen Mary and Westfield College, University of London (Research Seminar, 9 Nov.\n1999) Oxford Intellectual Property Research Centre - Paper available in pdf format from\nhttp://www.oiprc.ox.ac.uk/ETWP1199.html (last visited 3rd March 2004)\n\n16. Bodeker Gerard (Dr.), Indigenous Medical Knowledge: The Law and Politics of Protection,\nGreen College, University of Oxford - Overheads presented at the Oxford Intellectual\nProperty Research Centre seminar in St. Peter's College, Oxford on 25th January 2000.\n\n17. Bronwyn H. Hall and Rose Marie Ham, The Determinants of Patenting in the U. S Semi-\nConductor Industry, 1980 - 1994. (January 27, 1999)\n\n18. Darko Djaic, Why does the Enforcement of Indonesia's Intellectual Property Laws continue\nto be a problem? (2000) European Intellectual Property Review, Sweet & Maxwell\nLimited and Contributors\n\n19. Freeland, R., Litigation of Patents in Europe: The Proposed European Patent Litigation\nProtocol and the proposed Community Patent Simmons_ and Simmons (January 2003)", "word_count": 433, "start_char": 90488, "end_char": 93474}
{"chunk_id": "DOC0080__00039", "doc_id": "DOC0080", "chunk_index": 39, "text": "arko Djaic, Why does the Enforcement of Indonesia's Intellectual Property Laws continue\nto be a problem? (2000) European Intellectual Property Review, Sweet & Maxwell\nLimited and Contributors\n\n19.F\n\nreeland, R., Litigation of Patents in Europe: The Proposed European Patent Litigation\nProtocol and the proposed Community Patent Simmons_ and Simmons (January 2003)\n\n20. Kakooza Anthony C.K: Enforcement of Intellectual Property Rights in Uganda : The\ncomplexities and Realities; University of Warwick, Master of Laws Degree Dissertation,\n2004.\n\n21. Kamal Puri (Prof.), Is Traditional or Cultural knowledge a form of Intellectual Property?\nUniversity of Queensland. WP 01/00, Oxford Electronic Journal of Intellectual Property\nRights http://www.oiprc.ox.ac.uk/EJWP0100.pdf (last visited 3rd March 2004)\n\n22. Lu Guoqiang (Chief Judge), Recent Developments in Judicial Protection for Intellectual\nProperty in China, Vice President of Shanghai, Vice President of Shanghai, No. 2\nIntermediate People's Court.\n\n23. Morgan, A., Trips to Thailand: The Act for the establishment of and procedure for\nIntellectual Property and International Trade Court. (March 2002) Fordham\nInternational Law Journal, Fordham University School of Law.\n\n24. Rose Marie Ham Ziedonis, The Enforcement of Patent Rights in the United States: Insights\nfrom cases involving US Semi-conductor Firms, The Wharton School, University of\nPennsylvania - Prepared for presentation at the October 2001 Conference on New Research\non the operation of the Patent System, U.S National Academies, Washington, D.C, Final\nReport April 2002.\n\n25. Vaver D., Some aspects of the TRIPS Agreement: Copyright Enforcement and Dispute\nSettlement, Reuters Professor of Intellectual Property and Information Technology Law,\nUniversity of Oxford (Working Paper No. 1: April 2000) Oxford Intellectual Property\nResearch Centre at St. Peter's College www.oiprc.ox.ac.uk (last visited 4th March 2004)", "word_count": 270, "start_char": 93111, "end_char": 95047}
