{"chunk_id": "DOC0090__00000", "doc_id": "DOC0090", "chunk_index": 0, "text": "American Journal of Agriculture and Forestry\n2018; 6(3): 38-43\nhttp://www.sciencepublishinggroup.com/j/ajaf\ndoi: 10.11648/j.ajaf.20180603.11\nISSN: 2330-8583 (Print); ISSN: 2330-8591 (Online)\n\nSpecies Richness and Nutritive Values of Fodder and Their\nRelationship with Soil Characteristics in Ugandan\nRangelands\nChristine Kyoshabire1, Sarah Kizza2, Karumuna Rollanda3, *\n1Ministry of Water and Environment, Department of Environment Affairs, Kampala, Uganda\n2Department of Engineering and Environment, Uganda Christian University, Mukono, Uganda\n3Health and Environment Research International (HERI), Kampala, Uganda\nEmail address:\n\n*Corresponding author\nTo cite this article:\nChristine Kyoshabire, Sarah Kizza, Karumuna Rollanda. Species Richness and Nutritive Values of Fodder and Their Relationship with Soil\nCharacteristics in Ugandan Rangelands. American Journal of Agriculture and Forestry. Vol. 6, No. 3, 2018, pp. 38-43.\ndoi: 10.11648/j.ajaf.20180603.11\nReceived: July 18, 2017; Accepted: March 22, 2018; Published: May 18, 2018\n\nAbstract: A study was conducted to determine the species richness and nutritive values of fodder and their relationship with\nsoil characteristics in the Ugandan rangelands. The aim of the study was to determine the current status and nutritive values of\nfodder species and their relationship with soil characteristics. Four fodder species Panicum maximum - Guinea grass,\nSpartinaalterniflora - Cord grass, Hyperreniarufa -Jaragua/thatching grass and Acacia spp were selected for the study. The\nspecies were counted to determine their richness in their rangelands and also tested to establish their nutritive values. The focus\non nutritive values was on CP, NDF, Ca, P and K. The research also determined the soil characteristics pH, OM, N, P and K.\nResults of the study show that the fodder species were below the recommended levels of species richness in the rangelands.\nSpartinaalterniflora (Cord grass) had the largest coverage of 109.1Km2 (22.4%) out of 486Km2 in the rangelands while Acacia\nhad the lowest coverage of 10.2 Km2 (2.1%). All the soil characteristics were below the minimum concertration levels apart\nfrom P and there was a significant difference in soil characteristics across the different locations (P<0.05). Average pH was\n6.63, OM was 0.5%, and P was 74.09ppm while K was 17cmoles/kg. The most nutritious fodder species was Panicum\nmaximum (Guinea grass). However all the fodder species were below the recommended nutrient levels. The mean\nconcentration level of CP in all the fodder species was8.95%, Ca was 1.29%, P was 0.4%, K was 1.59% while NDF was 29%.\nThere was no significant difference in level of concentration across all the fodder species (P>0.05). Reduction of overstocking;\ngrowing of Panicum maximum (Guinea grass) at farm level; and rotation of animals are recommended.\nKeywords: Rangeland, Fodder Species, Soil Characteristics, Species Richness", "word_count": 418, "start_char": 0, "end_char": 2921}
{"chunk_id": "DOC0090__00001", "doc_id": "DOC0090", "chunk_index": 1, "text": "here was no significant difference in level of concentration across all the fodder species (P>0.05).R\n\neduction of overstocking;\ngrowing of Panicum maximum (Guinea grass) at farm level; and rotation of animals are recommended.K\n\neywords: Rangeland, Fodder Species, Soil Characteristics, Species Richness\n\n1. Introduction\nFodder species richness and their nutritive values has been\na concern for most researchers focusing rangeland studies [1].\nTheir relationship with soil status has equally been a great\nconcern due to the role played by soil through its soil\ncharacteristics [2]. The term rangeland globally refers to area\nwith arid or semi-arid and dry sub-humid climates, and where\ntopography and soils are unsuitable for food crop farming [3].\nIn the sub-Saharan region, rangelands have very limited\nopportunities for crop cultivation but are very suitable for\nlivestock production. Most of these areas are dominated by\narid and semi-arid landscapes [4]. Most rangeland dwellers\nprioritize cattle production over crop growing due to frequent\ndroughts and low/fluctuating rainfall patterns.\nIn Uganda, as is the case in the rest of sub-Saharan Africa,\nnaturally growing fodder still serve largely as a source of\nessential nutrients for livestock grazing. Species richness has\npotential to boost livestock productivity in rangelands. This is\nbecause the higher the richness the more balanced the nutritional\nvalues are for animal consumption in the rangelands [4]. In", "word_count": 218, "start_char": 2618, "end_char": 4088}
{"chunk_id": "DOC0090__00002", "doc_id": "DOC0090", "chunk_index": 2, "text": "n Uganda, as is the case in the rest of sub-Saharan Africa,\nnaturally growing fodder still serve largely as a source of\nessential nutrients for livestock grazing.S\n\npecies richness has\npotential to boost livestock productivity in rangelands.T\n\nhis is\nbecause the higher the richness the more balanced the nutritional\nvalues are for animal consumption in the rangelands [4].I\n\nn\n\nUganda, species richness in the rangelands is not well studied,\nhowever the scanty information available shows that the fodder\nspecies in the rangelands are mainly Panicum maximum (Guinea\ngrass), Spartinaalterniflora (Cord grass), Hyperreniarufa\n(Jaragua/thatching grass), and Acacia spp. [5-7]There are other\nspecies available in the rangelands but these are the dominant\nones that support livestock grazing in the rangelands of Uganda.\nThe richness of fodder species and their nutritional values are\namong other factors influenced by physical and chemical\nproperties of the soil in the rangelands. Soil types play a very big\nrole in ensuring nutritional efficiency as well as richness in the\nrangelands [8]. Favourable soil characterises such as high\norganic matter and good pH are associated with high fodder\nregeneration rate in the rangelands. Similarly nutritional content\nin the fodder species is influenced by the soil characteristics\nsuch as nitrogen, phosphorous and potassium content in the soil.\nFor example crude protein which is a critical ingredient in\nfodder species for livestock consumption is influenced by\nnitrogen content in the soil [3]. Concentrations of mineral\nelements in forage are dependent upon the interaction of a\nnumber of factors, including soil, plant species, stage of maturity,\nyield, pasture management and climate [9]. Even though it is a\nknown fact that these factors influence nutritional efficiency of\nfodder species, little is known about the levels and extent of this\nin the rangelands of Uganda.\nThe rangeland conditions and status of fodder species has\nbeen largely attributed to unsustainable practices especially\novergrazing, bush burning and deforestation that is largely\ninfluenced by charcoal trade [10]. Such practices lead to soil\nerosion and can hinder the net primary production of the\ngrass layer yet soil nutrients and their accessibility are\nimportant factors controlling net primary productivity of\nrangeland’s natural vegetation [7].\nThere has been little research done in rangeland areas of\nUganda to determine species richness and nutritive values of\nfodder and their relationship with soil characteristics. Little\ninformation is available on the mineral status of the fodder\nspecies in rangelands of Uganda. It is not clear whether the\nfodder species available in rangelands for animals to graze on\nare still able to deliver the much needed nutrients to the\nanimals; yet this information would be vital in planning the\nnecessary improvements that would go a long way in\nimproving the livelihoods of the people who depend on the\nrangelands for survival. This study thus investigated the\ncurrent species richness, the soil characteristics and nutritive\nvalues of the fodder species (Panicum maximum (Guinea\ngrass), Spartinaalterniflora (Cord grass), Hyperreniarufa\n(Jaragua/thatching grass), and Acacia spp.) in order to\nprovide the right diagnosis to the problem identified above.\n2. Materials and Methods\n2.1. Description of the Study Area\nThe study was carried out in the rangelands of Kayunga\nDistrict 74 Km East of Kampala City in Uganda. Its\ncoordinates\nare\n1°20'41.0\"N,\n32°23'24.0\"E\n(Latitude:\n1.2041N; Longitude: 32.8490). The altitude ranges between\n1000-1200m above sea level. Kayonza sub-county occupies a\nland area of approximately 486 Km2. Rural communities\naround the rangelands are mainly comprised of the Baganda,\nBasoga, Banyankole, Bagweri, Bakiga, Banyarwanda and\nimmigrant Bahima among other ethnics. The precipitation,\ntemperature, soil and vegetation in most of these areas\nsupport pastoralism activities which explain why agropastoralism is a popular practice in the rangelands of Uganda.\n2.2. Study Design\nBelt transects of up to 1 km between the 25mx25m\ndemarcations to the north, south, east and west from the\ncenter of the selected parishes were established and divided\ninto experimental plots (Kapu, 2012). At least 5 plots were\nestablished along each of the 4 directions making it a total of\n20 plots per parish. The plots were 200 meters apart along the\ntransects. A total of 40 plots were established for counting.\nThere were however two plots at the centre where each of the\ntwo belt transects meet which were added to the 40 plots that\nwere established in the two parishes making them 42 plots.\nThe midpoints (centres) for the selected parishes were\nestablished through group discussions in which the local\nresidents together with their leaders were engaged to draw\nresource maps. The actual counting was done by identifying\nthe patches covered by each of the fodder species within the\n25mx25m plots since grass cannot be counted individually.\nThe width and lengths of the patches was then measured\nusing a tape measure and recorded in the book. Plots were\nsketched and the patches located in each of the plots.", "word_count": 799, "start_char": 3711, "end_char": 8894}
{"chunk_id": "DOC0090__00003", "doc_id": "DOC0090", "chunk_index": 3, "text": "he actual counting was done by identifying\nthe patches covered by each of the fodder species within the\n25mx25m plots since grass cannot be counted individually.T\n\nhe width and lengths of the patches was then measured\nusing a tape measure and recorded in the book.P\n\nlots were\nsketched and the patches located in each of the plots.\n\nFigure 1. Distribution of the plots within the study area.\nFor soil sampling, two plots were randomly sampled along\nthe west-east transects and the south-north transects for\nextracting soil samples. The sampling plot at the midpoint\n\nAmerican Journal of Agriculture and Forestry 2018; 6(3): 38-43", "word_count": 102, "start_char": 8563, "end_char": 9192}
{"chunk_id": "DOC0090__00004", "doc_id": "DOC0090", "chunk_index": 4, "text": "igure 1.D\n\nistribution of the plots within the study area.F\n\nor soil sampling, two plots were randomly sampled along\nthe west-east transects and the south-north transects for\nextracting soil samples.T\n\nhe sampling plot at the midpoint\n\nAmerican Journal of Agriculture and Forestry 2018; 6(3): 38-43\n\nwhere the transects met/converged also acted as a sampling\npoint [3]. In total 5 plots were randomly selected from each\nparish making it 10 plots from which soil was sampled. Soil\nsamples were picked using an auger. Soil was picked from all\nthe corners of the selected plots and mixed together before\nbeing packed in the polythene bags to achieve uniform\ndistribution of soil. The soil was air dried under shade and\nthe weather was sunny and windy. From each plot, at least 1⁄2\na kilogram of soil was picked. Samples were marked and\ngiven labels according to the point of sampling before being\ntransported to the laboratory for analysis to ease traceability\nproblems. Soil was extracted between 0-20cm deep from the\nsurface using the soil auger. This was because the fodders\nsampled were shallow rooted.\nFive tests were carried out on each sample making a total\nof 50 tests on the 10 soil samples collected. The tests covered\npH, Organic Mater Content (OM), Nitrogen (N), Phosphorus\n(P) and Potassium (K). Sample analysis was carried out\nfollowing the procedures of Okalebo and Kapu [3, 11].\n2.3. Sampling of the Selected Fodder Species\nFive (5) plots were randomly selected from the 10 plots\nfrom where the soil was sampled. From each plot 4 fodder\nspecies\n(Panicum\nmaximum\n-\nGuinea\ngrass,\nSpartinaalterniflora\n-\nCord\ngrass,\n-\nJaragua/thatching grass and Acacia spp) were sampled.\nCutting was done at least 10 cm above the ground except for\nacacia which was harvested from the branches because the\nheight of the acacia ranged between 0.5m-2.5m. The grass\nwas harvested with stems. The stems were targeted because\nof their richness in crude protein. Crude protein was among\nthe parameters that were analyzed during the study. At least\nhalf a kilo of each fodder species was harvested. Twenty (20)\nsamples were picked for analysis in the laboratory. Selected\nfodder species were put in clean paper bags. Samples were\nproperly labelled to ease traceability in the laboratory.\nSamples were transported to the laboratory immediately to\nminimize changes in the physical and chemical integrity of\nthe samples. Upon arrival at the laboratory, samples were\nchecked for any damages, spoilage and deterioration before\nbeing accepted in the laboratory for analysis. All the\nprocedures were guided by Kapu [3]. A total of 100 tests\nwere carried out on the 20 samples. From each of the five\nplots, samples of the four species selected for the study were\npicked. This means that each species was sampled from each\nof the five plots. Each species was subjected to 5 tests. The\ntests were CP, NDF, Ca, P and K. Sample preparation and\nanalysis was carried out following the procedures of\nVanSoest [18, 19]\n2.4. Data Analysis\nFodder species richness measured in each plot was\ncalculated in meters and then converted to kilometres. Data\nfrom the laboratory about soil characteristics and nutrient\ncontent of fodder species was sorted in accordance with the\ncodes assigned to the samples. Data was further segregated\nby species type and location. Analysis of variance and\nregression analysis were used to determine the significance\nof relationships between the samples and across the different\nlocations. The correlation between soil characteristics and\nspecies richness was determined using a regression analysis\nin which R2 was determined.\n3. Results and Discussion\n3.1. Coverage of Fodder Species\nThe study showed that fodder species richness is generally\nlow in the rangeland. Spartinaalterniflora (Cord grass)had\nthe largest coverage of 109.1km2(22.4%) out of 486Km2\nwhich Kayonza rangeland covers. Panicum maximum\n(Guinea grass) had the second largest coverage of 70.68km2\n(14.5%) while Hyperreniarufa (Jaragua/thatching grass)\ncovered 56.03km2 (11.5%) of the three grass species studied.\nAs for acacia, the coverage was 10.2 Km2 (2.1%) and was the\nlowest (Figure 2). Species richness must be at least 200m2\nand above in a plot of 25mx25m in a savannah rangeland [3].\nHowever, from the analysis of results, it was found out that\nthe average richness of species in the plots that were\nrandomly established during field data collection was\n102.73m2 per plot of 25mx25m. This is below the\nrecommended average. The low species richness points\ntowards over grazing and conversion of some parts of the\nrangeland to crop lands. There was evidence of crop growing\nactivity in some farmlands. Some areas were first cultivated\nand later abandoned to regenerate and form pasture. This\nkind of pasture differed from the one that was observed in\nareas where crop farming had not been carried out. Most of\nthe acacia was harvested for fuel as it gives good charcoal\nand firewood and attracts customers and this explains the low\nrichness of the specie in the area. Analysis of variance\n(ANOVA) showed that there was a significant difference\nbetween coverage of the fodder species studied (P<0.05).", "word_count": 834, "start_char": 8894, "end_char": 14062}
{"chunk_id": "DOC0090__00005", "doc_id": "DOC0090", "chunk_index": 5, "text": "ost of\nthe acacia was harvested for fuel as it gives good charcoal\nand firewood and attracts customers and this explains the low\nrichness of the specie in the area.A\n\nnalysis of variance\n(ANOVA) showed that there was a significant difference\nbetween coverage of the fodder species studied (P<0.05).\n\nFigure 2. Coverage of fodder species in the rangeland.\nSpecies richness also correlated with soil characteristics.\nKapureported that soil conditions significantly influence the\nrichness of grass in rangelands [3]. This is the case in\nKayonzarangelands because the areas that had high level of", "word_count": 92, "start_char": 13764, "end_char": 14356}
{"chunk_id": "DOC0090__00006", "doc_id": "DOC0090", "chunk_index": 6, "text": "igure 2.C\n\noverage of fodder species in the rangeland.S\n\npecies richness also correlated with soil characteristics.K\n\napureported that soil conditions significantly influence the\nrichness of grass in rangelands [3].T\n\nhis is the case in\nKayonzarangelands because the areas that had high level of\n\nspecies richness were also found to be more fertile.\nOvergrazing could also contribute to species reduction.\nDuring the study it was observed that areas which were not\novergrazed had high species richness. This is a clear\nindication that overgrazing could negatively affect species\nrichness. Related observations were made by Smet and Ward\n[12]. These report that plant species composition, diversity\nand vegetation structure in a semi-arid savannah is affected\nby the size of the herd per square kilometre in the rangeland.\n3.2. Physical and Chemical Properties of the Soil\nSoil was generally not suitable for growing fodder as\nevidenced from the results of status of pH, Organic Matter\n(OM), Nitrogen (N) and Potassium (K). Eighty percent (80%)\nof the soil samples tested for OM content were below the\nrecommended levels of >3%. Concerning pH, only 40% of\nthe samples were within the recommended levels of 5.5-6.5.\nAs for N, only one sample met the recommended level of\n0.2%. The rest of the samples (90%) were below the\nrecommended levels. Concerning K, none of the samples met\nthe recommended level of concertration which is >3moles/kg.\nHowever, all the soil samples met recommended levels of\navailable P. The average concentration of pH, OM, N, P and\nK was 6.63, 2.39%, 0.15%, 74.09ppm and 2.17moles/kg\nrespectively (Table 1). Soil whose average concentration of\nOM is above 3% with Nitrogen concentration that is above\n0.2% is regarded to be suitable for animal fodder (3 and 15).\nThis is because such soil will favour the quick growth and\nmultiplication of the grass. Related results were obtained by\nSolomon, [13] during assessment of rangeland dynamics in\nsouthern Ethiopia in which focus was put on the botanical\ncomposition of grasses and soil characteristics in relation to\nland-use and distance from water. The study found out that\nthe rangeland soils were fertile but lacked adequate moisture\nto facilitate the effectiveness of the chemical properties in the\nsoil.\nThe physical and chemical properties of the soil varied\ngreatly with different locations (P<0.05). This correlates with\nthe fodder species richness where areas that had better soil\nproperties also had high species richness. These variations\ncould be attributed to overgrazing, over cultivation,\nvariations in defoliation levels of vegetation cover in the\nrangeland and differences in moisture levels [3].\nTable 1. Status of physical and chemical properties of the soil.\npH\nOM\nN\nMean P\nK\n%age\nppm(mg/kg)\ncmoles/kg\n6.39\n2.94\n0.19\n49.2\n2.20\n6.68\n2.45\n0.16\n96.2\n2.75\n6.58\n3.24\n0.20\n62.3\n2.26\n6.38\n2.16\n0.11\n38.2\n1.83\n6.90\n1.96\n0.10\n102.3\n2.36\n6.94\n1.57\n0.14\n126.5\n2.26\n7.14\n1.67\n0.10\n130.4\n2.56\n6.74\n3.14\n0.19\n59.7\n2.06\n6.45\n2.45\n0.15\n36.4\n1.69\n6.12\n2.35\n0.14\n39.7\n1.77\nMean\n6.63\n2.39%\n0.15%\n74.09ppm\n2.17moles/kg\nRecommended levels\n5.5-6.5\n>3%\n>0.2%\n>15ppm\n>3moles/kg", "word_count": 503, "start_char": 14061, "end_char": 17201}
{"chunk_id": "DOC0090__00007", "doc_id": "DOC0090", "chunk_index": 7, "text": "The pH showed no significant difference between the\ndifferent locations in the rangelands (P>0.05). The pH level\nis an important soil factor measured as level of acidity (>6.5)\nor alkalinity (<5.5). Incompliant soil pH can be a major\ncontributing factor to fodder stand failure. The level of pH\nabove 6.5 hinders available Phosphorus (P) in soil for pasture\nuptake [3] and this was also true in the rangelands of\nKayunga based on the regression analysis between pH and\navailable P (R2=0.8167).\nOM showed significant variations between different\nlocations of the rangelands (P<0.05). OM was generally\navailable across the rangelands probably due to the dense\nlevel of woody plants and grass defoliation [13] which\naccumulated a large portion of dead plants/grass material\nunder a moist condition for rapid decaying and then these\nmaterials are converted into soil essential minerals [14].\nThere were significant variations between different locations\nof the rangelands as pertains to Nitrogen (P<0.05). The\nmeans of Nitrogen and Potassium at different locations were\nsignificantly different at an alpha of 0.05. N and P are\nessential nutrients for plant growth due to the large amounts\nabsorbed from the root zone in the production of pastures [1].\nAt times N and P are unavailable because they are held\nbetween layers of clay mineral which is referred to as fixed\nPotassium [3]. The soils in the pasture lands studied lacked\nadequate amounts of K as evidenced by the results (Table 1).\nThe concentration of K did not significantly differ in the\ndifferent locations of the rangelands (P>0.05). However, in\nsome pasture lands K is supplied in a recommended amount\nfor nutrition of plants [1]. The variations in physical and\nchemical properties of the soil across different locations have\nalso been reported by Maharjan [1] and past anthropogenic\ndamage such as over cultivation, overgrazing, deforestation\nand bush burning (a common practice among the pastoralists)\ninfluence the variations.\nThe soil properties discussed above influenced species\n\nAmerican Journal of Agriculture and Forestry 2018; 6(3): 38-43", "word_count": 330, "start_char": 17201, "end_char": 19309}
{"chunk_id": "DOC0090__00008", "doc_id": "DOC0090", "chunk_index": 8, "text": "he variations in physical and\nchemical properties of the soil across different locations have\nalso been reported by Maharjan [1] and past anthropogenic\ndamage such as over cultivation, overgrazing, deforestation\nand bush burning (a common practice among the pastoralists)\ninfluence the variations.T\n\nhe soil properties discussed above influenced species\n\nAmerican Journal of Agriculture and Forestry 2018; 6(3): 38-43\n\nrichness in the study area. This means that if the soil\nproperties are favourable, there is a high potential for fodder\nto grow significantly [15]. However, if the soil properties are\nunfavourable, there is a likelihood of fodder species richness\nbeing low [13].\n3.3. Nutrient Composition of Fodder Species\nThe analysis of results shows that majority of the\nnutritional values in the fodder species did not meet the\nrecommended concentrations.\nTable 2. Nutrient composition per fodder species.\nSample Name\nPhosphorus (P) %\nCalcium\n(Ca) %\nPotassium\n(K) %\nNeutral Detergent\nFibre (NDF) %\nCrude\nProtein %\nPanicum maximum (Guinea grass)\n0.33±0.2\n1.12±1.8\n1.92±0.43\n36.54±1.34\n11.56±0.24\nSpartinaalterniflora (Cordgrass)\n0.32±0.1\n1.3±1.4\n2.04±0.24\n30.2±0.8\n8.74±1.8\n0.18±0.14\n1.1±0.42\n1.38±0.3\n23.2±0.38\n6.08±0.16\nAcacia spp\n0.52±0.32\n1±0.28\n0.98±0.24\n26.16±0.64\n9.4±1.5\nRecommended concentration\n0.6\n1.4\n2.2", "word_count": 187, "start_char": 18892, "end_char": 20214}
{"chunk_id": "DOC0090__00009", "doc_id": "DOC0090", "chunk_index": 9, "text": "able 2.N\n\nutrient composition per fodder species.S\n\nample Name\nPhosphorus (P) %\nCalcium\n(Ca) %\nPotassium\n(K) %\nNeutral Detergent\nFibre (NDF) %\nCrude\nProtein %\nPanicum maximum (Guinea grass)\n0.33±0.2\n1.12±1.8\n1.92±0.43\n36.54±1.34\n11.56±0.24\nSpartinaalterniflora (Cordgrass)\n0.32±0.1\n1.3±1.4\n2.04±0.24\n30.2±0.8\n8.74±1.8\n0.18±0.14\n1.1±0.42\n1.38±0.3\n23.2±0.38\n6.08±0.16\nAcacia spp\n0.52±0.32\n1±0.28\n0.98±0.24\n26.16±0.64\n9.4±1.5\nRecommended concentration\n0.6\n1.4\n2.2\n\nPanicum maximum (Guinea grass) had the highest\npercentage of CP (11.56±0.24%) while Hyperreniarufa\n(Jaragua/thatching grass) had the lowest percentage of CP\n(6.08±0.16%).\nCa\nwas\nhigh\nin\n(Jaragua/thatching grass) that is 1.34±1.4% and very law in\nSpartinaalterniflora (Cord grass). Acacia spp had the highest\nconcertration of P (0.52±0.32%), followed by Panicum\nmaximum\n(Guinea\ngrass)\nwhose\nconcertration\nwas\n0.33±0.2%.\nP\nwas\nvery\nlow\nin\n(Jaragua/thatching grass) – 0.18±0.14%. The species with the\nhighest\nconcentration\nof\nK\n(2.04±0.24%)\nwas\nSpartinaalterniflora (Cord grass). Acacia spp had the least\nconcentration level of 0.98±0.24%. Panicum maximum\n(Guinea grass) had the highest percentage of NDF\n(36.54±1.34%). This was followed by Spartinaalterniflora\n(Cord grass) with NDF of 30.2±0.8%. Hyperreniarufa\n(thatching grass) had the NDF percentage of 23.2±0.38%.\nAcacia spp had the lowest percentage of NDF (26.16±0.64%).\nAnalysis of variance showed that there was no significant\ndifference in nutrient composition across all the species\n(P<0.05). The concertration of nutrients in the fodder species\nvaried with location and the soil characteristics. Areas that\nhad high levels for pH, OM, N, P and K had fodder species\nwith high content of nutrients (Table 2). For example the\nhigher the N the higher the level of CP that was found in the\nfodder species. The amino acids which are found in CP\ncontain N which is a clear indicator that N levels have an\ninfluence on CP levels [16]. A correlation analysis was\ncarried out to determine if the level of nutrients was related\nto soil characteristics. It was found out that indeed soil\ncharacteristics significantly influenced nutrient composition\nin fodder species (R2=0.8126). Ca across all the species was\nsignificantly different (P<0.05). This means that the\ncomposition across all the species sampled for the study\ndiffered. However there were no variations in composition of\nCa within the samples of the same species (P>0.05).\nImportant to note was that Soil nutrient uptake status for the\nfodders studied was different. This further explains the\nvariations in nutrient status of the fodder species studied. A\nrelated study by Kapu [3] also reports that Ca composition in\nfodder species found in rangelands significantly varied across\nall the species studied. This is because the level of Ca\nconcertration in the soil directly impacts on how much Ca the\nplant will take in. Grass samples whose P was high had a\ncorrelation (R2=0.6748) with the soil samples whose\ncharacteristics especially pH, OM and P were high. This\nshows that soil characteristics influence the level of P in the\nfodder species. Well-structured soils have many pores and\nspaces in the soil to allow good drainage, easy plant root\ngrowth and efficient uptake of several nutrients including P.\nSoils which are rich in OM are more likely to have high\nconcertration of P [17]. K is also an essential nutrient for\nplant growth and large amounts are absorbed from the root\nzone in the production of most fodder and it is classified as a\nmacronutrient responsible for biochemical reaction in plants.\nIt is as well being associated with movement of water,\nnutrients, and carbohydrates from one part of the plant to\nanother as well as the opening and the closing of the stomata\nduring the period of photosynthesis. If K is deficient or not\nsupplied in adequate amounts, growth of pasture is stunted\nand yields are reduced. There was a significant difference\nbetween the species in the percentage of NDF (P<0.05). The\nNDF% of a feed is that portion referred to as the cell wall\nfraction which can be digested by the animal. This cell wall\nis correlated to those indigestible fractions of the feed\n(cellulose, hemicelluloses and lignin) – [3, 14].\n4. Conclusion\nThe richness of the fodder species studied was low and\nmost of the soil samples did not meet the recommended\nlevels and concertration of pH, OM, N, P and K. Similarly\nmost of the fodder species did not meet the recommended\nlevels of nutrients. Spartinaalterniflora (Cord grass)was the\nmost abundant fodder specie in in the rangeland. The most\ncommonly consumed species in the rangelands was\nSpartinaalterniflora (Cord grass)probably due to its richness\nover the rest. Panicum maximum (Guinea grass) and\nHyperreniarufa (Jaragua/thatching grass) though highly\nnutritious, were scarce. The scarcest of the fodders was\nAcacia spp. Species richness varied with location. In addition,\nthe nutrient levels of the fodder species varied with location\nand soil physical and chemical characteristics. Locations with\ngood soil characteristics had high species richness. This\nmeans that soil characteristics influence species richness.\nHighly grazed areas had lesser species richness which", "word_count": 807, "start_char": 19754, "end_char": 24968}
{"chunk_id": "DOC0090__00010", "doc_id": "DOC0090", "chunk_index": 10, "text": "he scarcest of the fodders was\nAcacia spp.S\n\npecies richness varied with location.I\n\nn addition,\nthe nutrient levels of the fodder species varied with location\nand soil physical and chemical characteristics.L\n\nocations with\ngood soil characteristics had high species richness.T\n\nhis\nmeans that soil characteristics influence species richness.H\n\nighly grazed areas had lesser species richness which\n\nsuggests that environmental degradation played a big role in\nspecies richness. The study recommends introduction of\nresting periods for some over grazed parts of the rangeland.\nQuick growing species such as Panicum maximum (Guinea\ngrass) are encouraged to supplement the abundant species\nsuch as Spartinaalterniflora (Cord grass) which is less\nnutritious but highly grazed by the cows. Panicum maximum\n(Guinea grass) should be used for cattle feeding due to its\nnutrient efficiency over the rest of the fodder species.", "word_count": 135, "start_char": 24571, "end_char": 25488}
