{"chunk_id": "DOC0070__00000", "doc_id": "DOC0070", "chunk_index": 0, "text": "Fundamentals of Web Design\nBSIT, BSDS, BSCS\n\nIntroduction to the Internet\nWhat is the Internet?\n❏\nGlobal system of interconnected computer networks.\n❏\nEnables communication between devices worldwide.\nHistory of the Internet:\n❏\nARPANET (1969): The precursor to the Internet.\n❏\nEvolution: Transition to NSFNET and the commercial Internet.\n\nHow the Internet Works\nClients and Servers:\n❏\nClients request data (e.g., browsers).\n❏\nServers provide data (e.g., web servers).\nIP Address:\n❏\nUnique numerical label for devices on a network.\nDomain Name System (DNS):\n❏\nConverts domain names to IP addresses.\nInternet Protocols:\n❏\nHTTP/HTTPS: Web page transfer.\n❏\nFTP: File transfer.\n❏\nSMTP: Email transfer.\n\nThe World Wide Web (WWW)\nWhat is the Web?\n❏\nInterlinked hypertext documents accessible via the Internet.\nComponents of the Web:\n❏\nWeb Pages: HTML documents.\n❏\nWeb Browsers: Tools to access the web (e.g., Chrome, Firefox).\n❏\nURLs: Address for accessing web resources.\nWeb Servers:\n❏\nRole: Host and deliver web pages.\n❏\nExamples: Apache, Nginx.\n\nHow the Web Works\nRequest/Response Cycle:\n❏\nHTTP Request: User requests a web page.\n❏\nHTTP Response: Server sends the web page back.\nWeb Hosting:\n❏\nHosting Services: Companies providing space for websites.\n❏\nDomain Registration: Process of acquiring a website domain.\n\nIntroduction to Network Concepts\nNetwork Types:\n❏\nLAN (Local Area Network): Limited area networks.\n❏\nWAN (Wide Area Network): Broad area networks, e.g., the Internet.\n❏\nPAN (Personal Area Network): Network around a person’s workspace.\nIP Addressing:\n❏\nIPv4 vs. IPv6: Addressing systems for devices.\n❏\nSubnetting: Dividing a network into smaller sections.\n\nNetwork Protocols & Devices\nProtocols:\n❏\nTCP/IP: Fundamental communication protocols.\n❏\nDNS: Converts domain names to IP addresses.\n❏\nHTTP/HTTPS: Web communication protocols.\nNetwork Devices:\n❏\nRouter: Directs data between networks.\n❏\nSwitch: Connects devices within a network.\n❏\nModem: Converts data for transmission over different media.\n\nBasic Internet Security Concepts\nEncryption:\n❏\nSymmetric vs. Asymmetric: Types of encryption.\n❏\nSSL/TLS: Protocols for secure web communication.\nFirewalls:\n❏\nPurpose: Protect networks by controlling traffic.\n❏\nTypes: Hardware and software-based firewalls.\nCommon Threats:\n❏\nMalware: Viruses, worms, Trojan horses.\n❏\nPhishing: Fraudulent attempts to obtain sensitive information.\n❏\nDDoS Attacks: Overwhelming a server to disrupt services.\n\nBest Practices for Internet Security\nStrong Passwords:\n❏\nUse complex, unique passwords.\n❏\nChange passwords regularly.\nTwo-Factor Authentication (2FA):\n❏\nAdds a second layer of security.\nRegular Software Updates:\n❏\nProtect against vulnerabilities.\n\nPractical Session: Exploring the Web\nWeb Browsing:\n❏\nNavigate websites to understand URLs and links.\nViewing Page Source:\n❏\nInspect HTML, CSS, and JavaScript of web pages.\nSetting Up a Basic Web Server:\n❏\nUse Python's SimpleHTTPServer or XAMPP.\n❏\nHost a basic HTML page locally.", "word_count": 442, "start_char": 0, "end_char": 2972}
{"chunk_id": "DOC0070__00001", "doc_id": "DOC0070", "chunk_index": 1, "text": "egular Software Updates:\n❏\nProtect against vulnerabilities.P\n\nractical Session: Exploring the Web\nWeb Browsing:\n❏\nNavigate websites to understand URLs and links.V\n\niewing Page Source:\n❏\nInspect HTML, CSS, and JavaScript of web pages.S\n\netting Up a Basic Web Server:\n❏\nUse Python's SimpleHTTPServer or XAMPP.\n❏\nHost a basic HTML page locally.\n\nPractical Session: Network Exploration\nThe ping Command:\n➔\nTest connectivity to websites.\nThe traceroute Command:\n➔\nExplore the path data takes across the Internet.\n\nThe Web\n\nWhat Does Web Mean?\nThe Web is the common name for the World Wide Web, a subset of the Internet\nconsisting of the pages that can be accessed by a Web browser. Many people assume\nthat the Web is the same as the Internet, and use these terms interchangeably.\nHowever, the term Internet actually refers to the global network of servers that\nmakes the information sharing that happens over the Web possible.\nSo, although the Web does make up a large portion of the Internet, but they are not\none and same.\n\nVague but exciting!\nIn March 1989, a proposal was sent internally at CERN outlying a universal linked\ninformation system. Dubbed 'Information Management: A proposal', pictured below, the\nproposal was created by Sir Tim Berners-Lee and was sent to his boss Mike Sendall,\nwho described it as 'vague but exciting...'.\nSir Tim Berners-Lee’s vision for universality enabled the development of a\nhigh-level network of content that allows any document to link to any other\ndocuments.\nThe World Wide Web was initially created to make it easier to share research papers.\nIt is a system of interlinked ‘hypertext’ documents that are accessed via the\nInternet; in essence, an information space. While he did not invent hypertext\nsystems, Berners-Lee proposed using them 'to link and access information of various\nkinds as a web of nodes in which the user can browse at will.'\n\nHis\nbreakthrough\nwas\nto\nlink\nhypertext to the Internet and he used\nthree technologies to do this:\n●\nHyperText\nTransfer\nProtocol\n(HTTP) is the foundation of data\ncommunication for the Web.\n●\nHyperText Markup Language (HTML)\nis the main markup language for\ncreating\nWeb\npages\nand\ninformation that can be displayed\non a Web browser.\n●\nWeb\naddresses\nor\na\nUniform\nResource Locator (URL) are used\nto reference a Web page.\n\nRegulation of the Web", "word_count": 386, "start_char": 2631, "end_char": 4956}
{"chunk_id": "DOC0070__00002", "doc_id": "DOC0070", "chunk_index": 2, "text": "egulation of the Web\n\nWhat is W3C?\nThe World Wide Web Consortium is the main international standards organization for\nthe World Wide Web. Founded in 1994 and currently led by Tim Berners-Lee, the\nconsortium is made up of member organizations that maintain full-time staff working\ntogether in the development of standards for the World Wide Web.\nThe W3C community is passionate about creating free and open Web standards. They\nvalue that the Web is:\n1.\nUniversal, international and truly “World Wide”\n2.\nAvailable on any device, for any type of information, in any language\n3.\nAccessible by people with disabilities\n4.\nRoyalty-free and built on open standards\n5.\nPowerful – The Open Web Platform makes Web pages themselves powerful tools\n6.\nTransformational for how business gets done; improving delivery, enhancing user\nsatisfaction, and reducing costs\n\nQuiz\n1.\nWhat is the difference between Internet and Web?\n2.\nWhat is the difference between HTML and HTTP?\n\nDiversity and Inclusion\n\nWhat is Web accessibility?\nThe power of the Web is in its universality.\nAccess by everyone regardless of disability is an essential aspect.\nTim Berners-Lee, W3C Director and inventor of the World Wide Web\nThe Web has become an essential aspect of our daily lives, and everyone should have\naccess to this technology. Web accessibility focuses on ensuring equivalent access\nfor people with disabilities. It is increasingly important to many organizations and\ngovernments from around the world, and has many business benefits. Access to\ninformation, including on the Web, is also recognized by the UN Convention on the\nRights of Persons with Disabilities (CRPD).\n\nWho is impacted?\nWeb accessibility addresses all disabilities, including hearing,\nlearning and cognitive, neurological, physical, speech, and visual\ndisabilities. Some examples of Web accessibility features include:\n●\nCaptions on audio and multimedia content for people who are hard of\nhearing;\n●\nClear and consistent layout for people with learning and cognitive\ndisabilities;\n●\nKeyboard support for people who do not use their mouse, for\nexample, people with physical disabilities;\n●\nText alternatives for people with visual disabilities and who are\nusing screen readers.", "word_count": 344, "start_char": 4936, "end_char": 7156}
{"chunk_id": "DOC0070__00003", "doc_id": "DOC0070", "chunk_index": 3, "text": "Web accessibility benefits people with and without disabilities\nWeb accessibility features also benefit many more users, such as:\n❏\nPeople with temporary situational limitations, such as a broken arm;\n❏\nPeople using mobile devices, televisions, and other access channels;\n❏\nPeople using older computers, with low bandwidth, and other limitations;\n❏\nPeople who are new to computers, to the Web, or to your own Website;\n❏\nPeople who are not fluent in the language of your particular Web site.\nThe Web is an increasingly important resource in many aspects of life:\neducation, employment, government, commerce, health care, recreation, and\nmore. When Web pages, Web technologies, Web tools, or Web applications are\nbadly designed, they can create barriers that exclude people from using the\nWeb.\n\nGroup Activity\n1.\nWhy is Diversity and Inclusion an important aspect in web\ndesign?\n2.\nAs a web engineer and architect, how can you ensure\naccessibility to be to websites that you develop?", "word_count": 157, "start_char": 7156, "end_char": 8137}
