{"chunk_id": "DOC0160__00000", "doc_id": "DOC0160", "chunk_index": 0, "text": "ECAJS\n\nSurgical Mortality at a Mission Hospital in Western Uganda.\nG . Tumusiime\nDepartment of Surgery, Mubende Regional Referral Hospital, P.O Box 4, Mubende, Uganda.\nE-mail: tumurald@gmail.com, tumurald@yahoo.com.\nBackground: Audit of Surgical mortality seeks to focus on improvement in the process of\nsurgical care and not on individual surgical ability. Audit of surgical mortality was conducted to\nestablish the factors associated with the surgical deaths in Virika Hospital to propose ways of\nimprovement.\nMethods: The study was conducted in Virika Mission Hospital in Western Uganda, a 155 bed\ncapacity hospital with a surgical bed capacity of 32 located in rural Uganda.Individual case file\nreview of the fourty three surgical deaths from 1st July 2008 to 31st June 2009 was conducted.\nAdditional data was retrieved from hospital admission register, operation registers, and death\ncertificate\nbooks.\nResults: The operation death rate was 1.3%, all were emergencies, and 82.6% were done under\ngeneral anaesthesia and17.4% died on table. The laparotomy death rate was 12.5%,\nHerniorrhaphy 0.9%, drainage of pus 1.4% and wound suture 0.4%. Surgery was delayed due\nto lack of blood in only one case but there was no record of lack of any resource for delaying\nsurgery. Surgical conditions were: Injuries 39.5%, Intestinal perforations 30.2%, Intestinal\nobstruction 20.9% and others 9.3%. The hospital had no high dependency unit and no intensive\ncare unit. No postmortem was conducted in all cases.\nConclusion: Overall the Audit identified client, provider, administrative and community-related\nfactors that need to be addressed collectively to reduce surgical mortality in Virika\nhospital.Audit of surgical mortality should be part of the health workers’ general approach to\nmaking more information available in a meaningful way for continuous improvement of\nsurgical services.", "word_count": 280, "start_char": 0, "end_char": 1882}
{"chunk_id": "DOC0160__00001", "doc_id": "DOC0160", "chunk_index": 1, "text": "o postmortem was conducted in all cases.C\n\nonclusion: Overall the Audit identified client, provider, administrative and community-related\nfactors that need to be addressed collectively to reduce surgical mortality in Virika\nhospital.Audit of surgical mortality should be part of the health workers’ general approach to\nmaking more information available in a meaningful way for continuous improvement of\nsurgical services.\n\nIntroduction\nIn recent years, audit has become an acquired concept in health care in both industrialized and\ndeveloping countries. Audit can measure the resources and personnel available, processes that happen\nin practice and outcome that indicate the results of care. This is well appreciated that audit not fault\nfinding, but it encourages thoughtful planning which leads to valid information collection and\nsubsequently to informed decision making1,2. Mortality audit is important because it gives an\nunderstanding of what happened and why. This helps to go beyond rates and ratios to determine the\ninciting factors and to take measure of how they could be avoided3. Audit of Surgical mortality seeks\nto focus on improvement in the process of surgical care and not on individual surgical ability.\nIn countries like the United Kingdom where audit of surgical mortality has been institutionalized,\nthere has been significant reduction in preventable death. The underlying principle of the audit is the\nrecognition that surgical care is system based. Ultimately the findings of audit of surgical mortality\nmay demonstrate deficiencies in surgical procedures, staffing in the hospitals, access to high\ndependence beds and other resource matters that will then need to be addressed by all stakeholders.\nThe core purpose of audit of surgical mortality is the feedback of information to inform, educate and\nfacilitate change and improvement in service.\nAudit of surgical mortality should be part of the health workers’ general approach to making more\ninformation available in a meaningful way for continuous improvement of surgical services. The\nemphasis on problem-solving, not punishment, helps address issues and build staff capacity. This\n\nECAJS", "word_count": 322, "start_char": 1461, "end_char": 3629}
{"chunk_id": "DOC0160__00002", "doc_id": "DOC0160", "chunk_index": 2, "text": "udit of surgical mortality should be part of the health workers’ general approach to making more\ninformation available in a meaningful way for continuous improvement of surgical services.T\n\nhe\nemphasis on problem-solving, not punishment, helps address issues and build staff capacity.T\n\nhis\n\nECAJS\n\nstudy was aimed at reviewing the cases of surgical deaths with a view of determining the factors\nassociated with surgical mortality and consequently to propose ways of improvement surgical care.\nMaterial and Methods\nThe study was conducted in Virika hospital, a 155 bed capacity hospital with a surgical bed capacity\nof 32 located in rural Uganda. The hospital has neither an intensive care nor high dependency unit and\nno intensive care unit.Individual case file review of the fourty three surgical deaths from 1st July 2008\nto 31st June 2009 was conducted. Additional data was retrieved from hospital admission register,\noperation registers, and death certificate books. The American Society of Anaesthesiologists (ASA)\nclassification was not documented on any anaesthesia sheet.\nResults\nDuring the period 1st July 2008 to 31st June 2009, there were 1,678 admissions of which 1,818\nunderwnt surgery. There were 43 deaths, giving a mortality rate of 2.6%. Thirty three (6.7%) of the\ndeath occurred in males. The patients’ ages ranged from 3 days to 84 years with a mean age of\n25years and median of 22yeays. 74.4% (32) were below the age of fourty years.\nOf the 43 deaths, 23 (53%) had undergone surgery. The overall death rate of the operated cases was\n1.3%. All the 23 had emergency operations. Nineteen (82.6%) of the 23 operations complicated by\ndeath were done under general anaesthesia while four were performed under local anaesthesia.\nTwenty (87%) of the 23 operations were laparotomy; there were 160 laparotomies performed during\nthe review period, giving a laparotomy death rate of 12.5%.The other three procedures performed\namong the deceased with their respective death rates were: Herniorrhaphy (MR = 0.9%), incision and\ndrainage of pus (MR = 1.4%) and surgical toilet and suture of wounds (MR = 0.4%).\nFive (21.7%) of those operated on had comorbid conditions that included diabetes mellitus in two and\nAIDS WHO stage four in three cases. The interval between admission and surgery ranged from 30\nminutes to nine days. Twelve (52.2%) were operated on within 24 hours of admission while 6 (26.1%)\nhad surgery three days after admission. Nineteen (82.6%) of the 23 were operated on once while four\nwere operated on twice before death. The reasons for reoperation were burst abdomen in all the four\ncases. The interval between the first and second operations was 5 days, 10 days, 11 days and 12 days\nrespectively.\nOf the twenty patients who were not operated on, the reasons for not doing surgery were: condition\nnot requiring surgery in 12 (60%), rapid death in 5 (25%) and in 3 (15%) an active decision was taken\nby the attending doctor and anaesthetist not to operate because patients were not fit for anaesthesia.\nNone of the patients refused an operation. Twenty four (55%) of the 43 patients died within three days\nof admission while 10 (23%) died after one week of admission.\nFour (17.4%) of the 23 patients died intraoperativel on the table, 10 (43.5%) died within three days\nafter surgery and six (26.1%) died after seven days. The longest staying patient died on the 18th post\noperative day. Two of the patients who died on the table underwent laparotomy, one had\nherniorrhaphy, and one died before surgery was started. All the four were under general anaesthesia.\nTwenty five (58%) of the 43 came direct from their homes and the rest came from various heath\ninstitutions. Upon arrival in the hospital, only 7 (16.3%) were attended to first before admission. The\nmajority was first reviwed and admitted by either nurses or by clinical officers. All the 43 patients\nwho died were reviewed by a doctor at least once before death. Indications for admission among the\nfourty three deaths were included traumatic injuries (39.5%), intestinal perforations (30.2%),\nintestinal obstruction (20.9%) and others (9.3%). Fifteen (88%) of the 17 traumtic injuries were\nunintentional while two were due to assault among tea plantation workers.", "word_count": 689, "start_char": 3332, "end_char": 7582}
{"chunk_id": "DOC0160__00003", "doc_id": "DOC0160", "chunk_index": 3, "text": "ll the 43 patients\nwho died were reviewed by a doctor at least once before death.I\n\nndications for admission among the\nfourty three deaths were included traumatic injuries (39.5%), intestinal perforations (30.2%),\nintestinal obstruction (20.9%) and others (9.3%).F\n\nifteen (88%) of the 17 traumtic injuries were\nunintentional while two were due to assault among tea plantation workers.\n\nECAJS", "word_count": 58, "start_char": 7197, "end_char": 7589}
{"chunk_id": "DOC0160__00004", "doc_id": "DOC0160", "chunk_index": 4, "text": "ll the 43 patients\nwho died were reviewed by a doctor at least once before death.I\n\nndications for admission among the\nfourty three deaths were included traumatic injuries (39.5%), intestinal perforations (30.2%),\nintestinal obstruction (20.9%) and others (9.3%).F\n\nifteen (88%) of the 17 traumtic injuries were\nunintentional while two were due to assault among tea plantation workers.E\n\nCAJS\n\nCauses of the 15 unintentional injuries included 7 (47%) road traffic crashes, 7 (47%) due to burns\nand one due to a collapsing wall. Eight of these cases were diagnosed as head injuries, seven of them\nbeing open head injuries. Five of the seven cases of burns were due to scalds among children at home\nwhile two were due to acid assault. Perforations were located in the ileum in 11 (84.6%) of the 13\ncases of intestinal perforation and of the appendix in two cases. 76.9% (10) of these patients were first\nadmitted on the medical ward for more than three days and the remaining three were first treated for\nmalaria and gastroenteritis for more than three days by the referring hospitals.\nPlain abdominal X-ray radiography was not done in any case of intestinal perforation. Of the eleven\npatients with perforations on the ileum, 54.5% (6) were done abdominal ultrasound scan before\nsurgery and all suggested peritonitis. Full blood count was not done in any of the cases. Widal test\nwas done in four (36.4%) of the cases and of these only one was positive. HIV serology was done in\nthree (27.3%) of the cases and were all positive.\nSeven (77.8%) of the nine patients with intestinal obstruction had large bowel obstruction five of\nwhich were due to sigmoid volvulus and two had anorectal malformation.The two small gut\nobstructions were due to strangulated hernia and intussusception.\nNo postmortem was conducted in all cases.\nDiscussion\nSurgical complications are a considerable cause of death and disability around the world4.They are\ndevastating to patients, costly to healthcare systems, and often preventable, though their prevention\ntypically requires a change in systems and individual behaviour.\nThe death rates and complications observed in this study are in agreement with the findings by\nHaynes et al5 in a settings like Virika hospital where the World Health Organisation Surgical Safety\nchecklist is not used.The risk of complications is poorly characterized in many parts of the world, but\nstudies in industrialized countries have shown a perioperative rate of death from inpatient surgery of\n0.4 to 0.8% and a rate of major complications of 3 to 17% 6,7. These rates are likely to be much higher\nin developing countries8-11. Thus, every facility should design a system of establishing individual rates\nand contributing factors and institute appropriate measures to address them.\nIntroduction of the WHO Surgical safety checklist12 into operating rooms in eight diverse hospitals\nwas associated with marked improvements in surgical outcomes. Death rates and postoperative\ncomplication rates fell by 36% and the results suggested that the checklist program can improve the\nsafety of surgical patients in diverse clinical and economic environments5. Its use would help the\nsurgical team to prevent omission of important processes noted in this study like ASA classification of\nall surgical patients, adequate fluid resuscitation and recording on the daily fluid balance chart, timely\nadministration of prophylactic antibiotics and availability of all essential laboratory and imaging\nresults before surgery. This in turn would reduce on outcomes like intra-operative death and burst\nabdomen noted in this study.\nPrevious efforts to implement practices designed to reduce surgical site infections or anaesthesiarelated mishaps have been shown to reduce complications significantly13-15. A growing body of\nevidence also links teamwork in surgery to improved outcomes, with high-functioning teams\nachieving significantly reduced rates of adverse events 16, 17.\nThere is a high likelihood that surgical intervention in our series was delayed given the fact that\nmajority of the deaths were among patients who came from to hospital direct from their homes. Those\nreferred from health facilities and even those within the hospital were first treated as medical cases.\nDelays have been shown to cause adverse events and in a hospital setting delay in transferring to", "word_count": 681, "start_char": 7197, "end_char": 11564}
{"chunk_id": "DOC0160__00005", "doc_id": "DOC0160", "chunk_index": 5, "text": "hose\nreferred from health facilities and even those within the hospital were first treated as medical cases.D\n\nelays have been shown to cause adverse events and in a hospital setting delay in transferring to\n\nECAJS", "word_count": 35, "start_char": 11357, "end_char": 11571}
{"chunk_id": "DOC0160__00006", "doc_id": "DOC0160", "chunk_index": 6, "text": "hose\nreferred from health facilities and even those within the hospital were first treated as medical cases.D\n\nelays have been shown to cause adverse events and in a hospital setting delay in transferring to\n\nECAJS\n\ntheatre is one of the most frequently reported causes for an area of concern or adverse event18. Delays\nmay be resource related or clinical decision-making process. In a setting like Virika hospital where\nmajority of the patients are first seen and admitted by nurses and clinical officers, delays in decisionmaking process can be reduced by regular refresher training of these cadres in timely recognition of\nemergencies and resuscitation so that the few doctors available can concentrate on more complex\ntasks in the care process.\nAlthough physical access to health facilities in Uganda has improved with 82.5% of the population\nreporting to be living within 5 km of a health facility19, considerable disparities exist regarding the\nlevel and expertise of service delivery. This partly explains the observation that about 80% of the\ndeceased came from districts which do not have hospitals. In addition, actual access and utilisation\ndiffers significantly between the poorer and richer segments of the population. Therefore, there is\nneed for health workers in lower level health units to be trained in recognising cases that require\nsurgical intervention and be able to make timely referrals to hospitals.\nThere is also need to educate communities especially those in remote areas on the danger signs of\ncommon surgical diseases so that they can make a decision to go to health facilities before\ncomplications set in. Timely surgical intervention is important especially in resource-limited facilities\nlike high dependence units, intensive care units and expertise to handle complicated cases.\nAlthough the main concern raised in surgical mortality audits in developed countries is mortality\namong the elderly 20-25, the main concern of this audit was that the majority were young people below\nfourty years of age. This age group contributes to scholars, income for many families and the\ncountry’s workforce. However, this is not surprising since over seventy percent of the Uganda’s\npopulation and the life expectancy is below sixty years19,26.\nInjuries were associated with the majority of the surgical mortality. Globally, injuries have been\nrecognised as one of the most life threatening public health problems. They represent 12% of global\nburden of diseases and the third most important cause of overall mortality27. According to WHO, an\nestimated 5.06 million people die each year as a result of some form of injuries, comprising almost\n9% of all deaths. This equates to almost 14,000 injury deaths every single day 28. Majority of the\ninjuries (88%) were unintentional with a big proportion due to road traffic accidents in agreement\nwith injury experience in Addis Ababa, Ethiopia 29 and in Kampala, Uganda 30. However, the results\nwere contrary to findings in North Gonder, Ethiopia 31 and the Jamaican injury profile 32 where more\nthan half is violence related.\nIt is of great concern that none of the patients with head injury had their Glasgow coma scale recorded\nsince it is an objective way of determining the severity of head injury in a resource limited setting,\nhelps in monitoring the progress of a head injury patient and may be of importance in case of\nlitigation to justify the likelihood of death.\nSimilarly, failure to assess and record the burn surface area points to inappropriate fluid resuscitation\namong the burns patients since the percentage burn surface area is used to estimate the fluid\nrequirements especially in resource-limited situations. Although no postmortems were not done,\nautopsy has been shown to provide additional information while in some cases it has been rejected25.\nConclusion\nOverall the audit identified client, provider, administrative and community-related factors that need to\nbe addressed collectively to reduce surgical mortality in Virika hospital. Audit of surgical mortality\nshould be part of the health workers’ general approach to making more information available in a\nmeaningful way for continuous improvement of surgical services.", "word_count": 658, "start_char": 11357, "end_char": 15572}
{"chunk_id": "DOC0160__00007", "doc_id": "DOC0160", "chunk_index": 7, "text": "onclusion\nOverall the audit identified client, provider, administrative and community-related factors that need to\nbe addressed collectively to reduce surgical mortality in Virika hospital.A\n\nudit of surgical mortality\nshould be part of the health workers’ general approach to making more information available in a\nmeaningful way for continuous improvement of surgical services.\n\nECAJS\n\nIt is hoped that all health workers will accept audit of surgical mortality as a peer review audit\nundertaken voluntarily by all participants, thereby ensuring that every surgical death is scrutinized\nindependently and the collective results of that scrutiny are widely and freely disseminated resulting\nin improved care.", "word_count": 101, "start_char": 15193, "end_char": 15902}
