{"chunk_id": "DOC0059__00000", "doc_id": "DOC0059", "chunk_index": 0, "text": "GigaScience, 8, 2019, 1–16\ndoi: 10.1093/gigascience/giz115\nResearch\nRESEARCH\nprovides insights into disease resistance, drought\ntolerance, and the evolution of the genome\nBo Song\n1,2,3,†, Yue Song\n1,3,4,†, Yuan Fu\n1,2,†, Elizabeth\nBalyejusa Kizito\n5, Sandra Ndagire Kamenya5,6, Pamela Nahamya Kabod5,\nHuan Liu\n1,2,3, Samuel Muthemba\n7, Robert Kariba\n7, Joyce Njuguna6,\nSolomon Maina\n6, Francesca Stomeo\n6,8, Appolinaire Djikeng6,9, Prasad\nS. Hendre\n7, Xiaoli Chen\n1,2, Wenbin Chen1,2, Xiuli Li1,2, Wenjing Sun1,2,\nSibo Wang1,3, Shifeng Cheng1,2, Alice Muchugi7, Ramni Jamnadass\n7,\nHoward-Yana Shapiro7,10,11, Allen Van Deynze\n10, Huanming Yang1,2,\nJian Wang1,2, Xun Xu\n1,2,3, Damaris Achieng Odeny\n12,* and Xin Liu\n1,2,3,*\n1BGI-Shenzhen, Beishan Industrial Zone, Yantian District, Shenzhen 518083, China; 2China National\nGeneBank, BGI-Shenzhen, Jinsha Road, Shenzhen 518120, China; 3State Key Laboratory of Agricultural\nGenomics, BGI-Shenzhen, Shenzhen 518083, China; 4BGI-Qingdao, BGI-Shenzhen, Qingdao 266555, China;\n5Uganda Christian University, Bishop Tucker Road, Box 4, Mukono, Uganda; 6Biosciences Eastern and Central\nAfrica (BecA) – International Livestock Research Institute (ILRI) Hub, P.O. Box 30709, Nairobi 00100, Kenya;\n7African Orphan Crops Consortium, World Agroforestry Centre (ICRAF), United Nations Avenue, Nairobi 00100,\nKenya; 8Present address: European Molecular Biology Laboratory (EMBL), Heidelberg, Germany; 9Present\naddress: Centre for Tropical Livestock Genetics and Health (CTLGH), University of Edinburgh, Edinburgh EH25\n9RG, UK; 10University of California, 1 Shields Ave, Davis, CA, USA; 11Mars, Incorporated, 6885 Elm Street,\nMcLean, VA 22101, USA and 12International Crops Research Institute for the Semi-Arid Tropics (ICRISAT) –\nEastern and Southern Africa, P.O. Box 39063, Nairobi 00623, Kenya\n∗Correspondence address. Xin Liu, BGI-Shenzhen, Beishan Industrial Zone, Yantian District, Shenzhen 518083, China. Tel: +86-180-2546-0332;\nE-mail: liuxin@genomics.cn\nhttp://orcid.org/0000-0002-3629-3752; Damaris Achieng Odeny, P.O Box 39063–00623, Nairobi, Kenya. Tel: +254 20 7224559;\nE-mail: D.Odeny@cigar.org\nhttp://orcid.org/0000-0003-3256-2940\n†Equal contribution.\nAbstract\nBackground: The African eggplant (Solanum aethiopicum) is a nutritious traditional vegetable used in many African countries,\nincluding Uganda and Nigeria. It is thought to have been domesticated in Africa from its wild relative, Solanum anguivi. S.\nReceived: 26 January 2019; Revised: 14 July 2019; Accepted: 24 August 2019\nC⃝The Author(s) 2019. Published by Oxford University Press. This is an Open Access article distributed under the terms of the Creative Commons\nAttribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium,\nprovided the original work is properly cited.", "word_count": 369, "start_char": 0, "end_char": 2866}
{"chunk_id": "DOC0059__00001", "doc_id": "DOC0059", "chunk_index": 1, "text": ".R\n\neceived: 26 January 2019; Revised: 14 July 2019; Accepted: 24 August 2019\nC⃝The Author(s) 2019.P\n\nublished by Oxford University Press.T\n\nhis is an Open Access article distributed under the terms of the Creative Commons\nAttribution License (http://creativecommons.org/licenses/by/4.0/), which permits unrestricted reuse, distribution, and reproduction in any medium,\nprovided the original work is properly cited.\n\naethiopicum has been routinely used as a source of disease resistance genes for several Solanaceae crops, including Solanum\nmelongena. A lack of genomic resources has meant that breeding of S. aethiopicum has lagged behind other vegetable crops.\nResults: We assembled a 1.02-Gb draft genome of S. aethiopicum, which contained predominantly repetitive sequences\n(78.9%). We annotated 37,681 gene models, including 34,906 protein-coding genes. Expansion of disease resistance genes\nwas observed via 2 rounds of amplification of long terminal repeat retrotransposons, which may have occurred ∼1.25 and\n3.5 million years ago, respectively. By resequencing 65 S. aethiopicum and S. anguivi genotypes, 18,614,838 single-nucleotide\npolymorphisms were identified, of which 34,171 were located within disease resistance genes. Analysis of domestication\nand demographic history revealed active selection for genes involved in drought tolerance in both “Gilo” and “Shum”\ngroups. A pan-genome of S. aethiopicum was assembled, containing 51,351 protein-coding genes; 7,069 of these genes were\nmissing from the reference genome. Conclusions: The genome sequence of S. aethiopicum enhances our understanding of\nits biotic and abiotic resistance. The single-nucleotide polymorphisms identified are immediately available for use by\nbreeders. The information provided here will accelerate selection and breeding of the African eggplant, as well as other\ncrops within the Solanaceae family.\nKeywords: Solanum aethiopicum; African eggplant; Solanum anguivi; LTR-Rs; biotic stress; drought tolerance\nBackground\nThe African eggplant, Solanum aethiopicum (NCBI:txid205524), is\nan indigenous non-tuberiferous Solanaceae crop that is mainly\ngrown in tropical Africa [1], especially in Central and West Africa.\nS. aethiopicum is hypervariable [2, 3] and is generally classified\ninto 4 groups: Gilo, Shum, Kumba, and Aculeatum. Gilo is the\nmost important group and has edible fruits, while Shum has\nsmall and bitter fruits. Kumba is used as a leafy vegetable, while\nAculeatum is used as an ornamental [3, 4] or as rootstock because of its excellent disease resistance [5]. The African eggplant\nis reported to have anti-inflammatory activity [6], and its roots\nand fruits have been used to treat colic, high blood pressure, and\nuterine complications in Africa [6].\nAlthough S. aethiopicum is one of the most important cultivated eggplants in Africa [7, 8], it remains an “orphan crop”\nbecause research and breeding investments are lagging behind other Solanaceae relatives, such as Solanum lycopersicum\n(tomato), Solanum tuberosum (potato), and Solanum melongena (edible eggplant). Consequently, there have been few robust genomic resources, such as a well-annotated reference genome.\nGenomics-assisted breeding is an effective approach that would\nfacilitate the breeding of orphan crops such as the African eggplant. Previous attempts to develop molecular markers for S.\naethiopicum, using the S. melongena genome as a reference, have\nbeen unsuccessful because of compromised accuracy [9]. An alternative approach that uses genome editing has been successfully deployed in other Solanaceae crops, including Physalis pruinose [11, 12], but cannot be implemented in S. aethiopicum because of its lack of well-annotated reference genome and gene\nsequences.\nThe African eggplant serves as a gene reservoir for other\neconomically important crops within the Solanaceae family.\nThanks to its cross-compatibility with S. melongena [4, 10] and\nits outstanding resistance to various pathogens, including Fusarium, Ralstonia, and Verticillium [5, 11–13], S. aethiopicum has been\nused to develop rootstocks [13] or improve the disease resistance\nof S. melongena [14]. Because the genomic basis of resistance in\nS. aethiopicum is poorly understood, it can be time-consuming to\nuse it as a donor in such interspecific crosses. Mapping resistance genes and then developing markers associated with these\ngenes might resolve this challenge. The development and expansion of resistance genes is usually accompanied by the amplification of long terminal repeat retrotransposons (LTR-Rs). A\ntypical example is shown in the Solanaceous hot pepper (Capsicum annuum), in which a burst of LTR-Rs substantially mediated the retrotransposition of nucleotide-binding, leucine-rich\nrepeat-related (NLR) genes, leading to the expansion of resistance genes [15]. LTR-Rs are abundant in plant genomes, including Solanaceae crops such as Nicotiana sylvestris (∼38.16%)\n[16], pepper (>70.0%) [17], potato (62.2%) [18], tomato (50.3%) [19],\nand petunia (>60%) [20]. The role of LTR-Rs in the S. aethiopicum\ngenome remains unknown, and whether the resistance seen\nin S. aethiopicum is a result of LTR-R amplification remains to\nbe investigated. The generation of a reference genome for S.\naethiopicum, as well as for other orphan crops, is urgently needed\nto advance their research and breeding.\nHere, we report a draft whole-genome assembly and annotation for S. aethiopicum. We found 2 amplifications of LTR-Rs\nthat occurred ∼1.25 and 3.5 million years ago (MYA), resulting\nin the expansion of resistance genes. We also resequenced 2\nS. aethiopicum groups, “Gilo” and “Shum,” and S. anguivi\nat a\nhigh depth (∼60×) and identified 18,614,838 single-nucleotide\npolymorphisms (SNPs), 34,171 of which are located within resistance genes. Subsequently, we generated a pan-genome of S.\naethopicum. The genomic data provided in this study will greatly\nadvance research and breeding activities of the African eggplant.\nData Description\nWe sequenced the genome of S. aethiopicum using a wholegenome shotgun approach. A total of 242.61 Gb raw reads were\ngenerated by sequencing the libraries with insert sizes of 250\nand 500 bp, and mate-pair libraries with sizes ranging between\n2,000 and 20,000 bp, on an Illumina Hiseq 2000 platform. The\nfiltered reads used for downstream analysis are shown in Supplementary Table 1. k-mer (k = 17) analysis [21] revealed the S.\naethiopicum genome to be diploid and homozygous, with an estimated genome size of 1.17 Gb (Supplementary Fig. 1). “Clean\nreads” amounting to 127.83 Gb (∼109×) were used to assemble\nthe genome using Platanus [22] (see Methods). A final assembly of 1.02 Gb in size was obtained, containing 162,187 scaffolds\nwith N50 contig and scaffold values of 25.2 and 516.15 kb (Table 1 and Supplementary Table 2), respectively. Our results reveal that the S. aethiopicum genome is larger than that of other\nSolanum genomes, including tomato (0.76 Gb) and potato (0.73\nGb) [18, 19], but it has a comparable guanine-cytosine (GC) ratio\n(33.12%) (Supplementary Table 3).\nRepetitive elements, predominantly transposable elements\n(TEs) (Supplementary Table 4), occupied 811 Mb (78.9%) of the\nsequenced genome. Most annotated TEs were retrotransposon elements, including long terminal repeats (LTRs), short\ninterspersed nuclear elements, and long interspersed nuclear", "word_count": 1072, "start_char": 2451, "end_char": 9811}
{"chunk_id": "DOC0059__00002", "doc_id": "DOC0059", "chunk_index": 2, "text": "epetitive elements, predominantly transposable elements\n(TEs) (Supplementary Table 4), occupied 811 Mb (78.9%) of the\nsequenced genome.M\n\nost annotated TEs were retrotransposon elements, including long terminal repeats (LTRs), short\ninterspersed nuclear elements, and long interspersed nuclear\n\nTable 1: Statistical data for the Solanum aethiopicum genome and gene\nannotation\nParameter\nValue\nScaffolds\nNumber\n162,187\nTotal length\n1.02 Gb\nN50\n516.1 kb\nLongest\n2.94 Mb\nContigs\nNumber\n231,821\nTotal length\n936 Mb\nN50\n25.2 kb\nLongest\n366.2 kb\nGC content\n33.13%\nNumber of genes\n34,906\nAverage/total coding sequence length\n1104.3 bp/38.5 Mb\nAverage exon/intron length\n265.8 bp/613.1 bp\nTotal length of transposable elements\n805.7 Mb (78.23%)\nelements. Together these retrotransposons made up 75.42% of\nthe assembly. DNA transposons accounting for 2.87% of the\ngenome were also annotated (Supplementary Table 4).\nProtein-coding gene models were predicted by a combination of homologous search and ab initio prediction. The resulting models were pooled to generate a final set of 34,906 proteincoding genes. Predicted gene models were, on average, 3,038 bp\nin length, with a mean of 3.15 introns. The mean length of coding sequences, exons, and introns was 1,104, 265, and 613 bp, respectively (Table 1, Supplementary Table 5, Supplementary Fig.\n2). As expected, these gene features were similar to those of\nother released genomes, including Arabidopsis thaliana [23] and\nother Solanaceae crops including S. lycopersicum, S. tuberosum, C.\nannuum, and N. sylvestris [16, 18, 19, 24] (Supplementary Table 5).\nWe further assessed the annotation completeness of this assembly by searching for 1,440 core embryophyta genes (CEGs) with\nBUSCO, version 3.0 [25]. We found 80.4% CEGs in this assembly,\nwith 77.8% being single copies and 2.6% being duplicates (Supplementary Table 6). We also annotated the non-coding genes\nby homologous search, leading to the identification of 128 microRNA, 960 transfer RNA (tRNA), 1,185 ribosomal RNA (rRNA),\nand 503 small nuclear RNA (snRNA) genes (Supplementary Table 7).\nWe annotated 31,863 (91.28%) proteins for their homologous function in several databases. Homologs of 31,099 (89.09%),\n26,319 (75.4%), and 20,932 (59.97%) proteins were found in\nTrEMBL, InterPro, and SwissProt databases, respectively (Supplementary Table 8). The remaining 3,043 (8.72%) genes encoded\nputative proteins with unknown functions.\nAnalyses\nGenome evolution and phylogenetic analysis\nBy comparing with 4 other sequenced Solanaceae genomes (S.\nmelongena, S. lycopersicum, S. tuberosum, and C. annuum), 25,751\nof the S. aethiopicum genes were clustered into 19,310 families using OrthoMCL (version 2.0) [26], with an average of 1.33\ngenes each. Single-copy genes shared by these 5 genomes were\nconcatenated as a supergene representing each genome and\nwere used to build a phylogenetic tree (Fig. 1A). The split time\nbetween S. aethiopicum and S. melongena was estimated to be\n∼2.6 MYA. McScanX [27] identified 182 syntenic blocks. We detected evidence of whole-genome duplication (WGD) events in\nthis genome by calculating the pairwise synonymous mutation\nrates and the rate of 4-fold degenerative third-codon transversion (4DTV) of 1,686 paralogous genes in these blocks. The 4DTV\ndistribution plot displayed 2 peaks, at ∼0.25 and 1, indicating\n2 WGDs (Fig. 1B). The first 1 (peak at 1) represents the ancient\nWGD event shared by asterids and rosids [28], while the second\nWGD event is shared by Solanaceae plants. This suggests that\nits occurrence predates the split of Solanaceae.\nEvolution of gene families\nOrthoMCL [26] clustering of genes from S. aethiopicum, S. melongena, S. lycopersicum, S. tuberosum, and C. annuum identified\n25,751 gene families. Among these, 465 gene families were\nunique to S. aethiopicum and 10,166 were common (Supplementary Table 9, Fig. 1C). As expected, the number of shared gene\nfamilies decreased as a function of evolutionary distance between S. aethiopicum and the selected species (Supplementary\nTable 10). For example, S. aethiopicum shared 15,723 gene families with S. melongena, compared with only 13,461 genes shared\nwith C. annuum. To further investigate the evolution of gene families, we identified expanded and contracted gene families. Compared with S. melongena, 437 gene families were expanded; most\nexpanded gene families were found to be involved in biological\nprocesses related to drought or salinity tolerance or disease resistance, including defense response (GO:0006952), response to\noxidative stress ( GO:0006979), glutamate biosynthetic processes\n( GO:0006537), and response to metal ions ( GO:0010038) (Supplementary Table 11). No gene families were contracted when\ncomparing with S. melongena.\nAmplification of LTR-Rs\nLTR-Rs made up ∼70% of the genome and accounted for 89.31%\nof the total TEs in S. aethiopicum (Supplementary Table 4). Consistent with previous studies of LTR-Rs, most LTR-Rs were classified as being in Ty3/Gypsy (82.36% of total LTR-Rs) and Ty1/Copia\n(14.90% of total LTR-Rs) subfamilies. The proportion of Ty3/Gypsy\nin S. aethiopicum is comparable to that reported in the hot pepper genome (87.7% of Ty3/Gypsy) [24]. To investigate the roles\nof LTR-Rs in the evolution of S. aethiopicum, we detected 36,599\nfull-length LTR-Rs using LTRharvest [29] with the parameters “-\nmaxlenltr 2000, -similar 75” and LTRdigest software [30]. We further analyzed their evolution, activity, and potential biological\nfunctions.\nThe age of each LTR-R was inferred by comparing the divergence between the 5′ and 3′ LTR-R, using a substitution rate\nof 1.3e−8 year−1 site−1 [31]. Two amplifications of LTR-Rs were\nfound in S. aethiopicum, while only 1 was detected in tomato and\nhot pepper (Fig. 2A). The early amplification occurred at ∼3.5\nMYA, coincident with the LTR-R burst found in C. annuum [15]\n(Fig. 2A). The second amplification was at 1.25 MYA, coinciding with the LTR-R burst in the tomato genome [19] (Fig. 2A).\nAlthough the time of LTR-Rs amplification is vertically coincident between different species, they occurred separately in each\ngenome since the ancestor of S. aethiopicum diverged from that\nof hot pepper and tomato ∼20 and 4 MYA, respectively (Fig. 1A).\nThese results imply that environmental stimulators shared between these species during their evolution could have triggered\nthe amplifications observed. We also estimated the amplification time of Ty3/Gypsy and Ty1/Copia LTR-Rs and found 2 peaks\nat ∼1.25 and 3.5 MYA for Gypsy LTR-Rs (Fig. 2B) but only 1 peak\n(∼1.25 MYA) for Ty1/Copia LTR-Rs (Fig. 2C). Compared with the\namplification time of Ty3/Gypsy and Ty1/Copia LTR-Rs in differ-", "word_count": 1006, "start_char": 9518, "end_char": 16195}
{"chunk_id": "DOC0059__00003", "doc_id": "DOC0059", "chunk_index": 3, "text": "e also estimated the amplification time of Ty3/Gypsy and Ty1/Copia LTR-Rs and found 2 peaks\nat ∼1.25 and 3.5 MYA for Gypsy LTR-Rs (Fig. 2B) but only 1 peak\n(∼1.25 MYA) for Ty1/Copia LTR-Rs (Fig. 2C).C\n\nompared with the\namplification time of Ty3/Gypsy and Ty1/Copia LTR-Rs in differ-\n\nS. lycopersicum\nS. tuberosum\nS. aethiopicum\nS. melongena\nC. annuum\n6.6(6.0-7.0)\n2.6(1.7-3.7)\n15.9(11.0-19.2)\n19.5(19.0-20.0)\nMillion years ago\n0.0\n0.5\n1.0\n1.5\n2.0\n4DTV\nPercentage of syntenic genes (%)\nS.aethiopicum - S.aethiopicum\nS.tuberosum - S.tuberosum\nV.vinifera - V.vinifera\nS.aethiopicum - V.vinifera\n10166\nC. annuum\nS. aethiopicum\nS. tuberosum\nS. melongena\nS. lycopersicum\nA\nB\nC\nFigure 1: Comparative analysis of the Solanum aethiopicum genome. (A) Phylogenetic analysis of Solanum melongena, S. lycopersicum, S. tuberosum, S. aethiopicum, and\nCapsicum annuum using single-copy gene families. The species differentiation time between S. aethiopicum and S. melongena was 2.6 million years. (B) Distribution of\n4DTv distance, which showed 2 peaks ∼0.25 and 1 (black line), representing 2 whole-genome duplication events. (C) Venn diagram showing overlaps of gene families\nbetween S. melongena, S. lycopersicum, S. tuberosum, S. aethiopicum, and C. annuum. A total of 465 gene families were unique to S. aethiopicum and 10,166 were common\nto the genomes of the 5 species. V. vinifera: Vitis vinifera.\nent species, we observed that the insertion time of Ty1/Copia\nLTR-RTs in S. aethiopicum and tomato were earlier than that of\nS. melongena and hot pepper. On the contrary, the insertion time\nof Ty3/Gypsy LTR-RTs (∼3.5 MYA) in S. aethiopicum was consistent\nwith the insertion time of hot pepper (Fig. 2B and C).\nTo investigate the activities of these LTR-Rs, we measured\ntheir expression levels by using RNA-sequencing (RNA-seq) data\nfrom different tissues (see Methods). Younger LTR-Rs were expressed at higher levels than those of older LTR-Rs. We detected\n2 peaks of LTR-R activity, at positions corresponding to the 2\nrounds of LTR-R insertions (Fig. 2D–G). The slight shift of the former peaks indicates that the activities degenerated more slowly\nthan the LTR-R sequences (Fig. 2D–G). The LTR-R activities varied across these tissues. The degeneration of LTR-R activities\nwas slower in fruits and roots than those in flowers and leaves\n(Fig.\n2D). This pattern was also confirmed by the varied activity of each LTR-R across these tissues ( Supplementary Fig. 3A ),\nimplying that these LTR-Rs have different roles in development.\nIncreased resistance is facilitated by LTR-R\namplification\nWe\nidentified\n1,156\nLTR-R\ncaptured\ngenes\nand\nLTR-\nR disrupted genes. The insertion time of LTR-R captured\nand LTR-R disrupted genes both ranged between 1.5 and\n3.5 MYA (Fig. 3A), showing a pattern similar to the insertions\nof\nwhole\nLTR-Rs\n(Fig.\n2A).\nThese\nresults\nsuggest\nthat\nLTR-R–mediated\ngene\ndisruption\nand\ncapture\noccurred\nsimultaneously.\nWe\nfurther\nclassified\nthe\nLTR-R\ncaptured genes into Gene Ontology (GO) categories and performed GO enrichment analysis. GO terms related to disease\nresistance including “defense response to fungus (GO:0006952),”\n“chitin\ncatabolic\nprocess\n(GO:0006032),”\n“chitinase\nactivity (GO:0004568),” “chitin binding (GO:0008061),” “cell wall\nmacromolecule catabolic process (GO:0016998),” and “defense\nresponse to bacterium (GO:0042742)” were overrepresented in\nthe LTR-R captured genes (Fig.\n3B, Supplementary Table 12),", "word_count": 513, "start_char": 15913, "end_char": 19348}
{"chunk_id": "DOC0059__00004", "doc_id": "DOC0059", "chunk_index": 4, "text": "O terms related to disease\nresistance including “defense response to fungus (GO:0006952),”\n“chitin\ncatabolic\nprocess\n(GO:0006032),”\n“chitinase\nactivity (GO:0004568),” “chitin binding (GO:0008061),” “cell wall\nmacromolecule catabolic process (GO:0016998),” and “defense\nresponse to bacterium (GO:0042742)” were overrepresented in\nthe LTR-R captured genes (Fig.\n3B, Supplementary Table 12),\n\nFigure 2: Long terminal repeat retrotransposon (LTR-R) insertion time distribution and the expression level of LTR-Rs in different tissues. Insertion time distribution of\ntotal LTR-Rs (A), Ty3/Gypsy LTR-Rs (B), and Ty1/Copia LTR-Rs (C) of Capsicum annuum, Solanum melongena, S. lycopersicum, and S. aethiopicum. The x- and y-axes, respectively,\nindicate the insertion time and the frequency of inserted LTR-Rs. Expression levels of LTR-Rs in flower (D), fruit (E), leaf (F), and root (G) tissues.", "word_count": 119, "start_char": 18960, "end_char": 19846}
{"chunk_id": "DOC0059__00005", "doc_id": "DOC0059", "chunk_index": 5, "text": "nsertion time distribution of\ntotal LTR-Rs (A), Ty3/Gypsy LTR-Rs (B), and Ty1/Copia LTR-Rs (C) of Capsicum annuum, Solanum melongena, S. lycopersicum, and S. aethiopicum.T\n\nhe x- and y-axes, respectively,\nindicate the insertion time and the frequency of inserted LTR-Rs.E\n\nxpression levels of LTR-Rs in flower (D), fruit (E), leaf (F), and root (G) tissues.\n\nFigure 3: LTR-R captured and disrupted genes. (A) The distribution of ages of LTR-R captured and disrupted genes. (B) GO enrichment analysis between the LTR-R\ncaptured and disrupted gene set. (C) GO terms enriched in LTR-R captured genes that are specifically and highly expressed in various tissues, including leaf, flower, root,\nand fruit. (D) Phylogenetic tree of the nucleotide-binding, leucine-rich repeat-related (NLR) gene in Solanum aethiopicum and S. melongena. ADP: adenosine diphosphate;\nER: endoplasmic reticulum.\nsuggesting that they may be involved in enhancing disease\nresistance.\nWe also analyzed the expression of genes captured by LTR-\nRs. It was intriguing to find that most of these genes were active\nin only 1 tissue (Supplementary Fig. 3B). Among these genes, 159\n(13.75%), 105 (9.08%), 106 (9.16%), and 129 (11.15%) were specifically and highly expressed in root, leaf, flower, and fruit, respectively. The genes captured by LTR-Rs that were specifically active in leaf tissues were significantly enriched in functions relating to disease resistance (Supplementary Table 13). The biological processes and molecular activities related to disease resistance mentioned above were overrepresented in these genes\n(Fig. 3C). The high expression level of resistance genes in leaves\nwould arm the plant with stronger resistance to pathogens. On\nthe contrary, these GO terms were not enriched in the genes that\nwere specifically and highly expressed in leaves. Instead, as expected, “photosynthesis” and “photosystem I” were significantly\noverrepresented (Supplementary Table 14). The discrepancy between these 2 gene sets highlights the contribution to resistance\nof LTR-R captured genes.\nProteins containing nucleotide-binding, leucine-rich repeat\ndomains (NB-LRRs) are major components that are responsible for defense against various phytopathogens [32]. The NB-\nLRR family is highly expanded in plants, with numbers ranging from <100 to >1,000 [33, 34]. As NB-LRR genes are often colocalized with LTR-Rs [35], we inspected their genomic locations\nin the S. aethiopicum genome. Because proteins containing the\nnucleotide-binding (NB) site can also confer disease resistance,\nwe searched for all the NB-containing genes in the genome. As\na result, we identified 447 NB-containing genes in the genome,\namong which 62 (13.9%) NB-containing genes co-localized\nwith LTR-Rs were identified as LTR-R captured genes. The", "word_count": 408, "start_char": 19489, "end_char": 22278}
{"chunk_id": "DOC0059__00006", "doc_id": "DOC0059", "chunk_index": 6, "text": "ecause proteins containing the\nnucleotide-binding (NB) site can also confer disease resistance,\nwe searched for all the NB-containing genes in the genome.A\n\ns\na result, we identified 447 NB-containing genes in the genome,\namong which 62 (13.9%) NB-containing genes co-localized\nwith LTR-Rs were identified as LTR-R captured genes.T\n\nhe\n\nTable 2: Statistical data for single-nucleotide polymorphisms and indels of 65 accessions\nType\nClass\nNo. (%)\nSNPs\nExon\n392,160 (2.11)\nIntron\n669,855 (3.60)\nIntergenic\n17,552,823 (94.29)\nSynonymous\n126,172 (0.68)\nNonsynonymous\n267,710 (1.44)\nTotal\n18,614,838\nIndels\nExon\n32,349 (1.62)\nIntron\n145,362 (7.27)\nIntergenic\n1,821,530 (91.11)\nFrame shift\n2,977 (0.15)\nTotal\n1,999,241\nphylogenetic\ntree\nshows\na\nsubstantial\nexpansion\nof\nNBcontaining genes after the amplification of LTRs in S. aethiopicum\n(Fig. 3D). A similar expansion was also observed in S. melongena. However, the number was remarkably fewer than\nin\nS.\naethiopicum,\nprobably\nbecause\nof\nthe\nlimited\nnumber of LTR-Rs in the S. melongena genome (Supplementary\nTable 15).\nPolymorphisms in different S. aethiopicum groups\nWe resequenced 60 S. aethiopicum genotypes in 2 major groups,\nGilo and Shum, and 5 accessions of S. anguivi, the progenitor of S. aethiopicum [36]. We generated ∼60 Gb raw data (60×)\n(Supplementary Table 20) and identified 18,614,838 SNPs and\n1,999,241 indels, with an average of 3,530,488 SNPs for each\naccession (Supplementary Table 16). On average, there were\n18,090 SNPs and 1,943 indels per megabase. Among them,\n424,509 (2.06%), 815,217 (3.95%), and 19,374,353 (93.99%) were\nlocated in exons, introns, and intergenic regions, respectively\n(Table 2). There were 267,710 SNPs that resulted in amino acid\nsequence changes by introducing new start codons, premature\nstop codons, or nonsynonymous substitutions (Table 2). We also\nidentified 1,255,302 structural variations (SVs). Of the detected\nindels, 177,711 (8.89%) were located in genic regions, among\nwhich 2,977 caused frameshift changes and, therefore, resulted\nin amino acid sequence changes that may have led to gene malfunctions. Furthermore, 106,377 SVs were identified in genic regions, including 53,736 (50.51%) deletions, 34,368 (32.31%) insertions, and 8,872 (8.34%) duplications.\nOn counting the SNPs and indels in each group, we found\n12,777,811, 15,165,053 and 8,557,818 SNPs in “Gilo,” “Shum,” and\n“S. anguivi,” respectively, accounting for 68.64%, 81.47%, and\n45.97% of the total SNPs, respectively. There were 2,019,539\n(10.85%), 4,747,418 (25.50%), and 587,885 (3.16%) SNPs unique to\nGilo, Shum, and S. anguivi, respectively (Fig. 4A). Most (93.13%)\nSNPs in S. anguivi were shared with either Gilo or Shum (Fig. 4A),\nwhich is in line with the fact that S. anguivi is the ancestor [36].\nSimilarly, 92.62% of the indels identified in S. anguivi were also\nshared with Gilo or Shum (Fig. 4B).\nNucleotide diversity (π) of all the genotypes was determined to be 3.58 × 10−3 for whole genomes, 2.06 × 10−3 for\ngenic regions, and 3.75 × 10−3 for intergenic regions. Nucleotide\ndiversity for each genotype revealed lower diversity for Gilo\n(S. anguivi: 3.16 × 10−3, Shum: 3.65 × 10−3, and Gilo: 2.55 ×\n10−3, respectively). Linkage disequilibrium (LD) estimation using Haploview (version 4.2) [37] revealed that r2 reached the half\nmaximum value at ∼150 kb (Fig. 4C), which is smaller than in\nother Solanaceae crops, e.g., tomato (2,000 kb) [38]. Because S.\naethiopicum has been routinely used to improve disease resistance in eggplant and other Solanaceaee crops [14], we further\nidentified SNPs that were strongly associated with resistance\ngenes by selecting those lying within resistance genes. A total\nof 34,171 SNPs were finally selected, which could be used in the\nselection of Solanaceae plants with disease resistance (Supplementary Table 16).\nPopulation structure and demography of S. aethiopicum\nTo investigate the evolution and population demography of S.\naethiopicum, we first built a maximum-likelihood (Fig. 5A, Supplementary Fig. 4) phylogenetic tree using the full set of SNPs.\nWe observed population structure in the genome-wide diversity.\nAs anticipated, the accessions from Gilo and Shum were clearly\nseparated in the tree, with only 1 exception in each group, probably caused by labelling errors. On the other hand, accessions\nof S. anguivi, the known ancestor of S. aethiopicum, did not cluster separately, but grouped with either Gilo or Shum. This structure was also supported by principal component analysis (PCA),\nwhich clearly separated these accessions into 2 clusters (Fig. 5B,\nSupplementary Fig. 5).\nThe domestication history of S. aethiopicum was inferred by\nconstructing a multilevel population structure using ADMIX-\nTURE [39]. This enabled us to estimate the maximum-likelihood\nancestry (Fig. 5A). The parameter K, representing the number of\nsubgroups to be divided, was set in the range of 2–9, and the\ncross-validation (CV) error was calculated individually. The CV\nerror converged to 0.4375 when K = 6, suggesting the division of\nthe resequenced accessions into 6 subgroups: I–VI (Fig. 5A). The\nstructure changes with increasing K-value from 2 to 6, showing a\ntime-lapse domestication history of S. aethiopicum that was first\nsplit into 2 groups, Gilo and Shum. The former was subsequently\ndivided into subgroups I and II. Two groups emerged in Shum\nwhen K = 3, each of which was then divided into 2 subgroups\nwhen K = 6. In summary, Gilo was divided into 2 subgroups (I\nand II) and Shum was divided into 4 subgroups (III–VI).\nThe demographic history of S. aethiopicum was inferred using\nthe pairwise sequential Markovian coalescent model [40]. By doing this, we inferred changes in the effective population sizes of\nS. aethiopicum (Fig. 5C). Our data revealed distinct demographic\ntrends from 10,000 to 100 years ago, in which a bottleneck was\nshown ∼4,000–5,000 years ago, followed by an immediate expansion of population size. The great population expansion might\nbe associated with the early domestication of S. aethiopicum in\nAfrica because it coincides with human population growth in\nwestern Africa, also occurring 4,000–5,000 years ago [41].\nArtificially selected genes in S. aethiopicum\nWe used reduce of diversity (ROD) and fixation index-statistics\n(Fst) measures to detect artificially selected regions along the\ngenome. Briefly, ROD and Fst were calculated in a sliding nonoverlap 10-kb window. Regions with ROD > 0.75 and Fst >\n0.15 were identified as candidate regions under selection. As\na result, genomic regions of 3,238 and 1,062 windows were\nfound to be under selection during the domestication of Gilo\nand Shum, respectively (Supplementary Table 17). Among them,\n161 windows were common between these 2 groups, while\n3,077 and 901 windows were unique to Gilo and Shum, respectively. Genes located within these regions were identified as selected genes. Thirty-six and 1,406 selected genes were identified in Shum and Gilo, respectively, and 12 of these genes were", "word_count": 1073, "start_char": 21943, "end_char": 28943}
{"chunk_id": "DOC0059__00007", "doc_id": "DOC0059", "chunk_index": 7, "text": "mong them,\n161 windows were common between these 2 groups, while\n3,077 and 901 windows were unique to Gilo and Shum, respectively.G\n\nenes located within these regions were identified as selected genes.T\n\nhirty-six and 1,406 selected genes were identified in Shum and Gilo, respectively, and 12 of these genes were\n\nFigure 4: Single-nucleotide polymorphisms (SNPs), indel, and linkage disequilibrium (LD) decay for ”Gilo,” ”Shum,” and ”S. anguivi” groups. (A) SNPs numbering 2,019,539\n(10.85%%), 4,747,418 (25.50%), and 587,885 (3.16%) were unique to Gilo, Shum, and S. anguivi, respectively. Most (93.13%) of SNPs in S. anguivi were shared with either\nGilo or Shum. (B) Indels amounting to 14.06%, 28.96%, and 2.76% were unique to Gilo, Shum, and S. anguivi, respectively, and, like the SNP statistics in these groups,\n92.62% of indels in S. anguivi were shared with either Gilo or Shum. (C) LD estimation revealed that r2 reaches the half maximum value at ∼150 kb.\nselected in both. Ten of the 12 genes were annotated in the\nSwissProt database with known functions and included many\ngenes known to be involved in tolerance to unfavorable environmental stresses, such as autophagy-related gene 18f (ATG18f),\nATP-binding cassette transporter B (ABCB18), lysine–tRNA ligase (LYSRS), acyl-coenzyme A oxidase 4 (ACX4), inositol hexakisphosphate and diphosphoinositol-pentakisphosphate kinase\n(VIP2) (Supplementary Table 18). For example, ATG18 is reported\nto be involved in defense response to powdery mildew fungus\nthrough autophagy in Arabidopsis [42]; it is also involved in response to nutrition starvation by serving as an accessory component to ATG1/13 kinase complex [43]. ABCB is reported to be\nassociated with lipid transport and confers tolerance to heavy\nmetal ions, such as aluminium [44], cadmium, and lead [45].\nThe expression of LYSRS has been shown to be specifically induced in tomato root during the unusual accumulation of metal\nions [46]. VIP2 is reported to be critical in myo-inositol phosphate signalling pathways, and is known to be involved in responses to drought and salt stresses [47]. Furthermore, 2 genes\nencoding pentatricopeptide repeat-containing protein were also\nfound among these genes, suggesting that RNA editing may have\nplayed a crucial role in the domestication of S. aethiopicum [48].\nGO enrichment analysis showed that genes selected in both the\nGilo and Shum groups were enriched in “transport” (Supplementary Table 19). GO terms for “response to auxin,” “response\nto hormone,” “response to salt stress” and “response to water”", "word_count": 391, "start_char": 28630, "end_char": 31197}
{"chunk_id": "DOC0059__00008", "doc_id": "DOC0059", "chunk_index": 8, "text": "O enrichment analysis showed that genes selected in both the\nGilo and Shum groups were enriched in “transport” (Supplementary Table 19).G\n\nO terms for “response to auxin,” “response\nto hormone,” “response to salt stress” and “response to water”\n\nFigure 5: Population structure and demographic history of Solanum aethiopicum. (A) A maximum-likelihood phylogenetic tree and population structure constructed\nusing the full set of single-nucleotide polymorphisms (SNPs). (B) Principal component analysis (PCA). (C) Pairwise sequential Markovian coalescent model analysis\nindicated a distinct demographic history of S. aethiopicum from 10,000 to 100 years ago, in which a bottleneck was shown ∼4,000–5,000 years ago, followed by an\nimmediate expansion of population size.\nwere also overrepresented in genes selected either in Gilo or\nShum only. This result could explain the enhanced tolerance to\ndrought and salinity in S. aethiopicum.\nWe also focused on the diversity of genes co-localized with\nLTR-Rs. A total of 24,682 SNPs were located within these colocalized genes, corresponding to 0.133% of the total number\nof SNPs (18,614,838). This is substantially fewer than would be\nexpected if SNPs were evenly distributed across all genes, particularly because the LTR-R co-localized genes comprise 3.31%\nof the total gene set. The repellant of SNPs in these genes suggests purifying selection, which was also supported by the large\namount (9,728; 39.41%) of rare SNPs (minor allele frequency <5%)\nfound among the co-localized genes. We also observed that\nnonsynonymous SNPs (9,544) were much more abundant than\nsynonymous ones (5310) among the co-localized genes. These\nvariations led to amino acid changes in the encoded proteins,\nwhich may have contributed to the diversification of resistance\ngenes.\nPan- and core-genome of S. aethiopicum\nGene content varies across different accessions. A single reference assembly is insufficient to include all S. aethiopicum genes.\nTherefore, we assembled contigs for individual accessions using\npair-end reads, with coverages ranging from 30 to 60× (Supplementary Table 20).\nWe assembled the genomes individually using SOAPdenovo2\n[49] and filtered out contigs smaller than 2 kb. As a result, 753,084\ncontigs were retained, among which 432,785 were from Shum,\n260,119 were Gilo and 60,180 were from S. anguivi. These contigs were further pooled separately and cleaned by removing duplicates using CD-HIT [50]. This led to the retention of 97,429,\n76,638, and 36,915 contigs for Shum, Gilo and S. anguivi, respectively. The annotation of these contigs resulted in 41,626, 33,194,\nand 17,662 protein-coding genes, among which we identified accessory gene sets of 29,389, 23,726, and 12,829 for Shum, Gilo,\nand S. anguivi, respectively, by comparing against the reference\ngenome sequence. We generated a pan-genome of S. aethiopicum\n(including Shum, Gilo and S. anguivi groups) of 51,351 genes\n(Supplementary Table 21). These genes were further clustered\ntogether with those annotated in the reference using CD-HIT.\nOverall, we identified 7,069 genes unique to the pan-genome\ngene set, suggesting that they had been missed from the reference. The average length of accessory genes was 1.62 kb with\n2.22 introns. This is comparable to gene models in the reference\ngenome, providing further evidence of accurate annotation. We\nfurther assigned their putative functions by querying against\nprotein databases. A total of 48,572 (94.59%) genes were fully annotated and functional descriptions (Supplementary Table 22)\nprovided. Among the identified gene models, 10,409 (20.27%)\nwere common to these 3 groups and were thus defined as “core”\ngenes. As expected, they were mainly composed of housekeeping genes (Supplementary Table 23). However, it is important\nto note that the number of core genes may have been underestimated because S. anguivi was underrepresented, while the\nother 2 S. aethiopicum groups, Kumba and Aculeatum, were not\nincluded in the present study.\nDiscussion\nSolanum aethiopicum is cross-compatible with S. melongena and\nis routinely used as a donor of disease resistance genes to its\nclose relative [14]. Genomic analysis of S. aethiopicum revealed\nhigher LTR-mediated expansion of resistance gene families than\nits other close relatives, including tomato, potato, eggplant, and\nhot pepper. LTR amplification is one of the major forces driving\ngenome evolution. It shapes the genome by capturing, interrupting, or flanking genes [51]. The consequences of LTR insertions", "word_count": 675, "start_char": 30953, "end_char": 35473}
{"chunk_id": "DOC0059__00009", "doc_id": "DOC0059", "chunk_index": 9, "text": "enomic analysis of S. aethiopicum revealed\nhigher LTR-mediated expansion of resistance gene families than\nits other close relatives, including tomato, potato, eggplant, and\nhot pepper.L\n\nTR amplification is one of the major forces driving\ngenome evolution.I\n\nt shapes the genome by capturing, interrupting, or flanking genes [51].T\n\nhe consequences of LTR insertions\n\ndepend on the genomic position of insertion. For example, inserting into protein-coding sequences results in pseudogenization. LTR-Rs adjacent to protein-coding genes can downregulate\nor silence the expression of flanking genes by extending methylation regions or by producing antisense transcripts [52–55]. LTR-\nRs also mediate gene retroposition, capturing genes back into\nthe genome [51]. In the present study, LTRs preferentially captured genes related to disease resistance, resulting in the overrepresentation of GO terms related to disease resistance in the\nLTR-captured genes. Enrichment of the GO terms “chitin binding (GO:0008061)” and “chitinase activity (GO:0006032)” (Fig. 3B,\nSupplementary Table 12) implies that these genes may have\nbeen selected to resist infection by fungal pathogens, such as\nFusarium oxysporum [56]. On the contrary, no GO term enrichment was seen in genes that were disrupted by LTR-Rs. This suggests that gene disruption by LTR-Rs may be a random event in\nterms of gene function. The age distribution of LTR-R captured\ngenes coincidently fit with that of the LTR-R–disrupted genes,\nsuggesting that these 2 events may have occurred simultaneously (Fig. 3A). It is not clear why genes related to disease resistance were favoured by LTR-Rs, but one explanation is that\nthe disease resistance genes may have been more active than\nother genes at the time of LTR retrotransposition. The expression pattern of LTR-R captured genes also varied between tissues. Those related to resistance were specifically active in the\nleaf, while those engaged in the transport of cations, nitrogen,\nand cell proliferation were active in flowers. This outcome suggests low abundance of transcripts for disease resistance genes,\nresulting in a relatively low chance to adequately capture the\ngenes in flowers under normal conditions. Another possible scenario is that LTR retrotransposition occurred under stress conditions, which resulted in the simultaneous induction of the expression of resistance genes in gametes and the activity of LTR\nretrotransposition. Such possible stresses might be extreme environmental conditions or pathogen infection. A “reinforcement\nmodel” has been proposed to explain the simultaneous accumulation of stress-responsive genes and the activity of retrotransposons in genomes under environmental stress [57, 58].\nThere are 4 major groups of S. aethiopicum: “Gilo,” “Shum,”\n“Kumba,” and “Aculeatum.” We resequenced accessions from\nthe Gilo and Shum groups, which are widely consumed as vegetables. The accessions resequenced in this study were clustered\ninto 6 subgroups (4 for Shum and 2 for Gilo). By scanning for regions with lower genomic diversity, we identified regions and\nseveral genes involved in responses to salt, water, and drought\ntolerance that were under selection during the domestication\nof S. aethiopicum. Furthermore, purification selection was also\nfound among disease resistance genes.\nIn the present study, resequencing S. aethiopicum and S. anguivi genomes at a high depth (30–60×) (Supplementary Table\n20) enabled us to assemble draft genomes for these individuals.\nDespite resequencing only a few genotypes from the 2 groups,\nwe intend to supplement the reference gene set with accessory\ngenes by pooling the resequenced contigs for gene prediction\nand annotation. This “pan-genome” is expected to provide a\nmore comprehensive understanding of S. aethiopicum in the future.\nWe report a reference genome for African eggplant, which\nwill provide a basic data resource for further genomic research and breeding activities for S. aethiopicum. The gene sequences annotated in the genome will be essential for developing genome editing vectors to create mutants to further understand the functions of genes within the genome and develop superior genotypes. Molecular markers developed using\nthe genome sequences will also enable more efficient and precise selection of superior accessions by breeders.\nMethods\nDNA extraction, library construction and sequencing,\nand genome assembly\nHigh molecular weight genomic DNA was extracted from young\nleaves of 14-day-old seedlings of Solanum aethiopicum “Shum” accession 303, which had been previously and repeatedly selfed to\nensure homozygosity. Shum 303 is a selection of African eggplant from Uganda, with green fruits and pigmented stem and\nleaf veins. DNA was extracted using a modified cetyl trimethylammonium bromide (CTAB) protocol, as previously described\n[59]. Briefly, 2.5 g fresh leaf tissue was flash-frozen in liquid nitrogen and ground to a fine powder, before adding 15 mL of 2×\nextraction buffer (100 mM Tris-HCl pH 8.0, 1.4 M NaCl, 20 mM\nEDTA, 2% w/v CTAB, 10 μL/mL β-mercaptoethanol), then incubated at 65◦C. One volume of chloroform: isoamyl alcohol (24:1)\nwas added and mixed and the sample was centrifuged twice.\nThe aqueous phase was precipitated overnight and the washed\npellet was treated with RNaseA. A repeat chloroform extraction\nwas performed, as above, to remove RNaseA and any other contaminants. The aqueous phase was collected and DNA was precipitated and washed with ethanol. DNA was allowed to dry,\nthen was resuspended in 100 μL elution buffer.\nHigh molecular weight DNA was fragmented and used to\nconstruct paired-end libraries with insert sizes of 250 bp, 500 bp,\n2 kb, 6 kb, 10 kb, and 20 kb, following standard Illumina protocols. The libraries were sequenced on an Illlumina HiSeq 2000\nplatform, resulting in a total of 242.61 Gb raw reads. Filtering\nof duplicated, low-quality reads and reads with adaptors was\ndone using SOAPfilter (version 2.2, an application included in\nthe SOAPdenovo2 package, RRID:SCR 014986) [49] with the parameters “-M 2, -f 0, -p”. Reads with ≥40% low-quality bases or\nwith ≥10% uncalled bases (“N”) were filtered. We used 17 k-mer\ncounts [21] of high-quality reads from small insert libraries to\nevaluate the genome size and heterozygosity using GCE [60] and\nKmergenie [61]. We assembled the genome using Platanus (Platanus, RRID:SCR 015531) [22].\nGenomic DNA used for resequencing was extracted from\nyoung leaves of 65 accessions. DNA was sheared into small fragments of ∼200 bp and used to construct paired-end libraries,\nfollowing standard BGI protocols as previously described [62],\nand subsequently sequenced on a BGI-500 sequencer. Briefly, the\nDNA fragments were ligated to BGISEQ-500 compatible adaptors, followed by an index PCR amplification, the products of\nwhich were then pooled and circularized for sequencing on the\nBGISEQ-500 (BGI, Shenzhen, China). Ultra-deep data were produced for each accession, with coverage ranging from ∼45 to\n∼75× (Supplementary Table 20).\nRNA extraction, library construction, and sequencing\nFor RNA extraction, seeds of Gilo and Shum inbred lines were\nobtained from Uganda Christian University. The seeds were\nplanted in a screenhouse at the BecA-ILRI Hub (Nairobi, Kenya)\nin polyvinylchloride pots (13 cm height and 11.5 cm diameter)\ncontaining sterile forest soil and farmyard manure (2:1). The\nseedlings were later transplanted into larger polyvinylchloride\npots of 21 cm height and 14 cm diameter. Plants were raised in\na screenhouse at 21–23◦C and 11–13◦C day and night temperatures, respectively (average 12 light hours per day). The plants", "word_count": 1148, "start_char": 35107, "end_char": 42743}
{"chunk_id": "DOC0059__00010", "doc_id": "DOC0059", "chunk_index": 10, "text": "he\nseedlings were later transplanted into larger polyvinylchloride\npots of 21 cm height and 14 cm diameter.P\n\nlants were raised in\na screenhouse at 21–23◦C and 11–13◦C day and night temperatures, respectively (average 12 light hours per day).T\n\nhe plants\n\nwere regularly watered to maintain moisture at required capacity.\nTwo plants were selected randomly from each of Gilo and\nShum accessions and were tagged at the seedling stage for tissue\nsampling. Fresh tissues were sampled from each of the tagged\nplants and flash-frozen in liquid nitrogen immediately. Total\nRNA was extracted from the frozen tissues using the ZR Plant\nRNA MiniprepTM Kit (Zymo Research, Irvine, CA, USA), according to the manufacturer’s instructions. RNA integrity was evaluated by electrophoresis in denaturing agarose gel (1% agarose,\n5% formamide, 1× TAE) stained with 3× GelRed (Biotium, Fremont, CA, USA). RNA was quantified using the Qubit RNA Assay Kit (Thermo Fisher Scientific, Carlsbad, CA, USA). Ribosomal RNA (rRNA) was removed from 4 μL of total RNA from\neach sample using the Epicentre Ribo-zeroTM rRNA Removal\nKit (Epicentre, Madison, WI, USA). The rRNA-depleted RNA was\nthen used to generate strand-specific RNA-seq libraries using\nTruSeq R⃝Stranded mRNA Kit (Illumina, San Diego, CA, USA).\nTwenty mRNA libraries were prepared, multiplexed (10 samples\nat a time), and sequenced as paired-end reads on the MiSeq (Illumina, San Diego, USA) platform at the BecA-ILRI Hub. Similar to the process of filtering genomic reads, SOAPfilter software [49] was used, with the parameters “-M 2, -f 0, -p” to filter low-quality reads and adaptor sequences. Reads with ≥40%\nlow-quality bases or with ≥10% uncalled bases (“N”) were filtered\nout.\nRepeat annotation\nTandem repeats were searched in the genome using TRF, version 4.04 [63]. Transposable elements (TEs) were identified by a\ncombination of homology-based and de novo approaches. Briefly,\nthe assembly was aligned to a known repeats database (Repbase16.02) using RepeatMasker (RRID:SCR 012954) and Repeat-\nProteinMask (version 3.2.9) [64] at both the DNA and protein\nlevel. In the de novo approach, RepeatModeler (version 1.1.0.4,\nRRID:SCR 015027) [65] was used to build a de novo repeat library\nusing the S. aethiopicum assembly, in which redundancies were\nfiltered out. TEs in the genome were then identified by Repeat-\nMasker [64]. LTRs were identified using LTRharvest [29], with the\ncriterion of 75% similarity on both sides. LTRdigest [30] was used\nto identify the internal elements of LTR-Rs with the eukaryotic\ntRNA library [66]. Identified LTR-Rs including intact poly purine\ntracts and primer binding sites with LTR-Rs on both sides were\nconsidered to be the final intact LTR-Rs. These were then classified into superfamilies, Gypsyand Copia, by querying against Repbase 16.02 [67].\nAnnotation of gene models and ncRNA\nGene models were predicted using a combination of de novo prediction, homology search, and RNA-aided annotation. Augustus software (RRID:SCR 008417) [68] was used to perform de novo\nprediction after the annotated repeats were masked in the assembly. To search for homologous sequences, protein sequences\nof 4 closely related species (S. lycopersicum, S. tuberosum, Capsisum annuum, and Nicotiana sylvestris), together with Arabidopsis thaliana, were used as query sequences to search the reference genome sequence using TBLASTN (RRID:SCR 011822) [69]\nwith the e-value ≤1e−5. Regions mapped by these query sequences were subjected to GeneWise (RRID:SCR 015054) [70], together with their flanking sequences (1,000 bp) to identify the\npositions of start/stop codons and splicing. For RNA-aided annotation, RNA-seq data from different tissues of S. aethiopicum were\nmapped to the genome assembly of S. aethiopicum using HISAT\n(RRID:SCR 015530) [71]. Mapped reads were then assembled using StringTie (RRID:SCR 016323) [72]. GLEAN software [73] was\nused to integrate mapped transcripts from different sources to\nproduce a consensus gene set. tRNAscan-SE (RRID:SCR 010835)\n[74] was performed to search for reliable tRNA positions. snRNA\nand miRNA were detected by searching the reference sequence\nagainst the Rfam database (RRID:SCR 007891) [75] using BLAST\n[69]. rRNAs were detected by aligning with BLASTN (RRID:SC\nR 004870) [69] against known plant rRNA sequences [76]. For\nfunctional annotation, protein sequences were searched against\nSwissprot, TrEMBL, KEGG (release 88.2), InterPro, Gene Ontology,\nCOG, and Non-redundant protein NCBI databases [77–82].\nGene family analysis\nProteins of S. aethiopicum, S. tuberosum (PGSC v3.4) [18], S. lycopersicum (v2.3) [19], C. annuum (PGA v.1.6) [24], and S. melongena\n(Sme2.5.1) [83] were selected to perform all-against-all comparisons using BLASTP (RRID:SCR 001010) [69], with an e-value cutoff of ≤1e−5. OrthoMCL (RRID:SCR 007839) [26] and the default\nMCL inflation parameter of 1.5 were used to define the gene\nfamilies. Single-copy families were selected to perform multiple sequence alignment using MAFFT (RRID:SCR 011811) [84].\nFour-fold degenerate sites were picked and used to construct a\nphylogenetic tree based on the maximum-likelihood method by\nPhyML (RRID:SCR 014629) [85], with C. annuum as the outgroup.\nWGD analysis was achieved by identifying colinearity blocks by\nparalog gene pairs in MCscanX, with default parameters [27].\nEach aligned paralog gene pair was concatenated to a supersequence in 1 colinearity block and 4dTv (transversion of 4-fold\ndegenerate site) values of each block were calculated. We also\ndetermined the distribution of 4DTv values to estimate the speciation between species or WGD events. The divergence time of\nS. aethiopicum was estimated using the MCMCtree program [86],\nwith the constructed phylogenetic trees and the divergence time\nof C. annuum [24] and S. tuberosum [18].\nAnalysis of LTR-Rs\nInsertion times of identified, intact LTR-Rs were estimated on\nthe basis of the sequence divergence between the 5′ and 3′ LTR\nof each element. The nucleotide distance K between 1 pair of\nLTR-Rs was calculated using the Kimura 2-parameter method\nin Distmat (EMBOSS package) [87]. An average base substitution\nrate of 1.3e−8 [31] was used to estimate the insertion time, based\non the following formula:\nT = K /2r [15].\nTranscriptomic data were used to analyse the activity of intact LTR-Rs. After filtering and removing low-quality reads, highquality reads from each were mapped against the full-length\nLTR-R sequence using BWA-MEM software [88], with default parameters. Expression levels of intact LTR-Rs were calculated using EdgeR [89] and visually presented using pheatmap in R [90].\nAnalysis of NB-containing genes\nNB domain-containing genes in the S. aethiopicum genome were\nidentified using a method previously described [15, 91]. Briefly,\nthe hidden Markov model (HMM) profile of the NB-ARC domain\n(PF00931) was used as a query to perform an HMMER search (version 3.2.1, RRID:SCR 005305 [92]) against protein sequences of\ntomato, potato, hot pepper [18, 19, 24], and annotated sequences", "word_count": 1061, "start_char": 42489, "end_char": 49525}
{"chunk_id": "DOC0059__00011", "doc_id": "DOC0059", "chunk_index": 11, "text": "riefly,\nthe hidden Markov model (HMM) profile of the NB-ARC domain\n(PF00931) was used as a query to perform an HMMER search (version 3.2.1, RRID:SCR 005305 [92]) against protein sequences of\ntomato, potato, hot pepper [18, 19, 24], and annotated sequences\n\nof S. aethiopicum, with an e-value cut-off of ≤1e−60. Aligned\nNB-ARC domain sequences of S. aethiopicum were extracted and\nused to build the S. aethiopicum–specific HMM model. NB-ARC domain sequences of tomato, potato, and hot pepper were mapped\nas the query sequences against the S. aethiopicum genome using TBLASTN [69], with an e-value cut-off of ≤1e−4 using GeneWise software [70] to identify candidate NB-containing genes\nat the whole-genome level. Final NB-containing genes were confirmed by searching the genome with an S. aethiopicum–specific\nNB-ARC HMM model, constructed with an e-value cut-off of\n≤1e−4. Retroduplicated NLRs were identified according to the\nmethod described by Kim et al. (2017) [15]. Phylogenetic trees for\nS. aethiopicum and S. melongena NB-containing genes were constructed using FastTree (RRID:SCR 015501) [93], with default parameters.\nSNP calling\nThe GATK pipeline (RRID:SCR 001876) [94] was used to call\nSNPs and indels. Briefly, low-quality, duplicated, and adaptorcontaminated reads were filtered using SOAPfilter (version 2.2)\n[49] before further processing. To reduce the compute time, scaffolds in the assembly were sequentially linked into 24 pseudochromosomes, in which the original scaffolds were separated by\n100 Ns, before mapping reads using BWA (RRID:SCR 010910) [88],\nwith default parameters. Picard Tools [95] and SAMtools (RRID:\nSCR 002105) [96] were used to further process the alignment outputs, including sorting and marking of duplicates. After alignment and sorting, the GATK pipeline (version 4.0.11.0) was used\nto call SNPs by sequentially implementing the following modules: RealignerTargetCreator, IndelRealigner, UnifiedGenotyper,\nsamtools mpileup, VariantFiltration, BaseRecalibrator, Analyze-\nCovariates, PrintReads, and HaplotypeCaller, with default parameters. This pipeline produced a file in gvcf format, which displayed the called SNPs and indels filtered according to genotype\ninformation. The file was then analysed using PLINK software\n[97] for quality control, with “GENO>0.05, MAF<0.1, HWE test\np-value ≤0.0001” parameters (GENO: maximum per-SNP missing; MAF: minor allele frequency; HWE: Hardy-Weinberg disequilibrium P-value). The loci of these SNPs and indels were anchored back to the original scaffolds and annotated using SnpEff\n[98]. To identify structural variations (SVs), sample information\nwas added using AddOrReplaceReadGroups, a module of Picardtools, and SVs were detected using DiscoverVariantsFromContigAlignmentsSAMSpark, a GATK module.\nPopulation analysis\nA maximum-likelihood phylogenetic tree was constructed,\nbased on the genotypes at all the SNP loci using FastTree [93],\nwith default parameters. To perform PCA, Beagle4.1 [99] was\nused to impute the unphased genotypes. All imputed and identified genotypes at SNP loci were pooled and finalized using PLINK\n[97] and ReSeqTools [100], which were then subjected to PCA using GCTA software [101]. The population was clustered using AD-\nMIXTURE software [39], with K (the expected number of clusters)\nincreasing from 2 to 9. The K value with the minimum crossvalidation error was eventually selected.\nGenome-wide linkage disequilibrium (LD) was calculated for\npopulations of different groups using Haploview [102] in windows of 2,000 kb. Briefly, the correlation coefficient (r2) between\nSNP pairs in a non-overlapping sliding 1-kb bin was calculated\nand then averaged within bins.\nCandidate regions under selection were identified by comparing polymorphism levels—measured by ROD, as well as by\nFST—between Gilo, Shum, and Solanum anguivi groups. ROD was\ncalculated using the formula\nROD = 1 −πcul/πwild,\nwhere πcul and πwild denote the nucleotide diversity within the\ncultivated and wild populations, respectively.\nFST measurement was calculated according to the formula\nFST = (πbetween −πwithin) /πbetween,\nwhere πbetween and πwithin represent the average number of pairwise differences between 2 individuals sampled from different\nor the same population.\nConstruction of pan- and core-genome\nTo build a gene set including as many S. aethiopicum genes as possible, we assembled contigs of all 65 resequenced accessions individually using SOAPdenovo2 [49]. The assembled contigs from\neach group (Gilo, Shum, and S. anguivi) were then merged. CD-\nHIT-EST [50] was used to eliminate redundancy and generate the\nfinal dataset of pan-genomes for each group. Similarly, all these\ncontigs were merged into a pan-genome of S. aethiopicum. Gene\nmodels were predicted from these contigs as described above\nand their functions were also annotated.\nAvailability of supporting data and materials\nThe raw sequence data from our genome project were deposited\nin the NCBI SRA with BioProject number PRJNA523664 and in the\nCNGB Nucleotide Sequence Archive database under project accession number CNP0000317. Assembly and annotation of the S.\naethiopicum genome are available in GigaDB [103].\nAdditional files\nSupplementary Table 1. Summary of the library types and data\ngenerated in this study\nSupplementary Table 2. Statistics of the S. aethiopicum assembly\nSupplementary Table 3. Comparison of the genomic characteristics in different genomes\nSupplementary Table 4. Statistics of repeat annotation, transposable elements\nSupplementary Table 5. Statistics of gene model in different\nspecies\nSupplementary Table 6. Evaluation of predicted gene models using 1,440 CEGs\nSupplementary Table 7. Statistics of predicted ncRNA\nSupplementary Table 8. Result of function annotation\nSupplementary Table 9. Statistics of gene families\nSupplementary Table 10. Common shared gene families between S. aethiopicum and other species\nSupplementary Table 11. GO annotation of expansion gene family of S. aethiopicum\nSupplementary Table 12. GO classification and enchriment analysis of LTR-captured and LTR disrupted genes in S. aethiopicum\nSupplementary Table 13. GO classification and enchriment analysis of LTR capture genes with specifical activity in different tissues", "word_count": 892, "start_char": 49270, "end_char": 55510}
{"chunk_id": "DOC0059__00012", "doc_id": "DOC0059", "chunk_index": 12, "text": "ommon shared gene families between S. aethiopicum and other species\nSupplementary Table 11.G\n\nO annotation of expansion gene family of S. aethiopicum\nSupplementary Table 12.G\n\nO classification and enchriment analysis of LTR-captured and LTR disrupted genes in S. aethiopicum\nSupplementary Table 13.G\n\nO classification and enchriment analysis of LTR capture genes with specifical activity in different tissues\n\nSupplementary Table 14. GO classification and enchriment analysis of total specifical active gene in 4 tissues\nSupplementary Table 15. Number of annotated NLR genes in S.\naethiopicum, S. melongena and other species\nSupplementary Table 16. SNPs within resistance genes\nSupplementary Table 17. Under selection genomic regions of\nGilo and Shum\nSupplementary Table 18. Gene position and functional annotation description for 12 Artificially selected genes (both in Gilo\nand Shum)\nSupplementary Table 19. GO enrich for Artificially selected genes\n(Gilo and Shum)\nSupplementary Table 20. Sequencing data of Pan-genome\nSupplementary Table 21. Pan-genome annotation\nSupplementary Table 22. Statistics of functional annotation for\nthe protein-coding genes from the three groups (S. anguivi, Shum\nand Gilo) and pan-genome (All)\nSupplementary Table 23. Statistics of genes which commened\nshared by three groups (S. anguivi, Gilo and Shum)\nSupplementary Figure 1. 17-mer analysis for estimating the S.\naethiopicum genome size\nSupplementary Figure 2. Distributions of the gene model for four\ncategories in the relative species\nSupplementary Figure 3. Distinct expression pattern of LTR-Rs\nand their captured genes in different tissues\nSupplementary Figure 4. Maximum-likelihood phylogenetic tree\nof 65 samples using the full-set of SNPs\nSupplementary Figure 5. Principal-component analysis\nAbbreviations\n4DTV: 4-fold degenerative third-codon transversion; BLAST:\nBasic Local Alignment Search Tool; bp: base pairs; BUSCO:\nBenchmarking Universal Single-Copy Orthologs; BWA: Burrows-\nWheeler Aligner; CEG: core embryophyta gene; COG: Clusters of\nOrthologous Groups; CV: cross-validation; Fst: fixation distance;\nGATK: Genome Analysis Toolkit; Gb: gigabase pairs; GC: guaninecytosine; GCE: Genomic Character Estimator; GCTA: Genomewide Complex Trait Analysis; GO: gene ontology; HMM: hidden Markov model; kb: kilobase pairs; KEGG: Kyoto Encyclopedia of Genes and Genomes; LTR: long terminal repeat; LD:\nlinkage disequilibrium; LTR-R: long terminal repeat retrotransposon; MAFFT: Multiple Alignment using Fast Fourier Transform; Mb: megabase pairs; MYA: million years ago; NB-LRR:\nnucleotide-binding, leucine-rich repeat domain; NCBI: National\nCenter for Biotechnology Information; NLR: nucleotide-binding,\nleucine-rich repeat-related; PCA: principal component analysis;\nRNA-seq: RNA-sequencing; rRNA: ribosomal RNA; SNP: singlenucleotide polymorphism; snRNA: small nuclear RNA; SRA: Sequence Read Archive; TE: transposable element; TrEMBL: Translation of European Molecular Biology Laboratory; TRF: Tandem\nRepeats Finder; tRNA: transfer RNA; WGD: whole-genome duplication.\nCompeting interests\nThe authors declare that they have no competing interests.\nFunding\nThis\nwork\nwas\nsupported\nby\nthe\nNational\nNatural\nScience\nFoundation\nof\nChina\n(grant\nnumber\n31601042),\nthe\nScience, Technology and Innovation Commission of Shenzhen Municipality (grant numbers JCYJ20151015162041454 and\nJCYJ20160331150739027), and by the Guangdong Provincial\nKey Laboratory of Genome Read and Write (grant number\n2017B030301011).\nAuthors’ contributions\nD.A.O., X.X., A.V., X.Liu., H.S., R.J., A.M., J.W., and H.Y. conceived\nthe project; D.A.O., F.S., E.B.K., A.V., S.C., and H.L. managed and\nsupervised the work; B.S., Y.F. and X.C. managed the samples at\nBGI; B.S., Y.F. and W.C. assembled the whole genome; and Y.F.,\nY.S., and W.S. annotated the genome. S.N.K., S.M., and R.K. extracted high molecular weight DNA. H.L. and S.P. constructed\nDNA libraries and sequenced the genome. S.N.K. and S.M. prepared RNA libraries and sequenced the transcriptome. J.N. and\nS.N.K. assembled and analysed the transcriptome. Y.S., X.Li. and\nB.S. performed the analysis of gene families, LTR evolution, and\ntranscriptomic data; P.N.K. extracted DNA for resequencing samples. Y.F. and B.S. analysed the resequencing data; Y.S., Y.F., S.W.\nand B.S. collected datasets required for the genome annotation\nand analyses. B.S., X.Liu., Y.S., D.A.O., P.S.H. and Y.F. wrote and\nrevised the manuscript.\nAcknowledgements\nWe acknowledge Uganda Christian University for providing\nseeds of the African eggplant.", "word_count": 617, "start_char": 55102, "end_char": 59652}
