{"chunk_id": "DOC0057__00000", "doc_id": "DOC0057", "chunk_index": 0, "text": "Dependence\nGROUP 3\n\nKey Definitions in Dependence\nDependence: the condition of being habitually and compulsively occupied with or\ninvolved in something, that you cannot control, and despite negative consequences.\nSocial-recreational use: use of substances in social settings to increase euphoria and\nenhance enjoyment.\nMisuse: intensified use characterized by regular, daily, or long-term use.\nTolerance: the need for more of the behavior to get the same effect.\nWithdrawal: potentially falling sick when attempting to stop the behavior.\nCraving: an intense desire to continue the behavior.\nAbuse: continuous behavior despite knowing the problems associated with it.\n\nTobacco\nIt is smoked, chewed, and dipped in various forms around the world, smoking\nbeing the most common.\nCigarettes have nicotine that is addictive and other harmful chemicals like\ncarbon monoxide and cyanide that cause cancers and lung disease.\nTobacco use typically begins through social contact and is reinforced by\nphysiological dependence derived from nicotine.\nIt is the 2nd major cause of death globally and responsible for 1 in 10 adult\ndeaths. It is the 4th common risk factor for disease.\n\nAlcohol\nIn the case of beer, wine, liquor, spirits, and brews, what matters is\nhow much is consumed. Wine usually has a higher alcohol per milliliter\npercentage than beer. Liquors have more than wine.\nBeers range from 6-8% alcohol.\nLiquors with higher concentrations of 40-80% alcohol.\nWaragi, distilled liquor, has 40% alcohol.\n\nOther drugs\nCommon drugs in Uganda include mairungi and marijuana now known as weed. Other\ndrugs are less common but are increasing in availability.\nNot all drugs are addictive. Doctors prescribe many helpful drugs but some prescribed\ncan be abused.\nOther substances one can be addicted to are caffeine, more commonly found in coffee\nand energy drinks. The consequences of its use have not been recorded to be as bad.\nDrugs give temporary feelings of euphoria, joy, relief, enhanced alertness, and a feeling of\ncontrol.\n\nUnderstanding Dependence\nThe word “addiction” is often substituted for “dependence” by professionals\nthese days. It is present in a person who demonstrates any combination of three or\nmore of the following symptoms in the same 12-month period.\n•\nPreoccupation with the use of\nthe substance in periods.\n•\nUsing more of the substance\nthan anticipated.\n•\nDeveloping tolerance to the\nsubstance.\n•\n“Withdrawal syndrome” from\nthe substance.\n•\nUsing the substance to avoid or\ncontrol withdrawal symptoms\n• Repeated efforts to cut back or stop\nsubstance use\n• Intoxication at inappropriate times\n• Reduction in social and\noccupational activities\n• Continued abuse despite suffering\nrelated social, emotional, and or\nphysical problems .", "word_count": 424, "start_char": 0, "end_char": 2748}
{"chunk_id": "DOC0057__00001", "doc_id": "DOC0057", "chunk_index": 1, "text": "Addictions besides Alcohol, Tobacco, and\nDrugs\nThese are things people habitually and compulsively occupied with or involved in a Habit,\na repeated behavior. Compulsive means it goes from one controlling it to being controlled by\nit.\nEating\nGambling\nSex\nWork\nTelevision\nExercise\nSocial Media\nEven prayer\n\nProgression from Use to Dependence\nSubstance Use: Under this, we have experimental use; usually from curiosity\nor peer pressure, recreational use; that is use in social settings to increase\neuphoria, and situational use; short-term use to cope with a problem.\nMisuse: intensified use characterized by regular or daily long-term use of a\ndrug or several in combination. At this stage, tolerance, withdrawal, and\ncraving arise.\nAbuse: This occurs when one continues the behavior despite knowing its\nsocial, mental, emotional, and physical hazards and impacts on them and\nthose around them.\nDependence: One becomes dependent when compulsive use the\nperson’s behavior is no longer tied to pleasure, peer acceptance, or\nsituational issues, but simply getting by in a day.\n\nStopping Dependence\nAddiction can be stopped, but you have to know what is underneath the problem. If\nyou want to stop the problem, you need to deal with the factors that led to the problem.\nTo help someone overcome this, you have to get past those reasons for starting and\ncontinuing use.\nOvercome the denial. Getting a person to admit they have a problem is a huge task.\nStop the behavior. Break away from the consumption or the behavior. Nobody will\nreduce and sustain the reduction.\nGet through withdrawal. This may be a medical problem, especially if an alcoholic has\nhigh blood pressure or diabetes. You need a good 3 days to a week to get through this.\nImprove your leisure time activities – find fun things to do, like art, or sports, or playing\ngames with friends. Nature walks are great. Improve in your work skills – apply yourself to craft\nor trade\nImprove your education – not necessarily for a certificate, just for its natural reward\nIgnore feelings of shame. A big part of recovery is being aware you made mistakes.\nOthers will also point them out to you. Know that you are on the path to recovery and those\nmistakes will fade in the background.", "word_count": 372, "start_char": 2748, "end_char": 4990}
{"chunk_id": "DOC0057__00002", "doc_id": "DOC0057", "chunk_index": 2, "text": "big part of recovery is being aware you made mistakes.O\n\nthers will also point them out to you.K\n\nnow that you are on the path to recovery and those\nmistakes will fade in the background.\n\nThe 12 Steps of Recovery\n1.\nWe admitted we were powerless over alcohol — that our lives had become unmanageable.\n2.\nCame to believe that a Power greater than ourselves could restore us to sanity.\n3.\nDecide to turn our will and our lives over to the care of God.\n4.\nMade a searching and fearless moral inventory of ourselves.\n5.\nAdmitted to God, to ourselves, and to another human being the exact nature of our wrongs.\n6.\nWere entirely ready to have God remove all these defects of character.\n7.\nHumbly asked Him to remove our shortcomings.\n8.\nMade a list of all persons we had harmed and became willing to make amends to them all.\n9.\nMade direct amends to such people wherever possible, except when to do so would injure\nthem or others.\n10. Continued to take personal inventory and when we were wrong promptly admitted it.\n11. Sought through prayer and meditation to improve our conscious contact with God, praying\nonly for knowledge of His will for us and the power to carry that out.\n12. Having had a spiritual awakening as the result of these steps, we tried to carry this message\nto alcoholics, and to practice these principles in all our affairs.", "word_count": 243, "start_char": 4804, "end_char": 6143}
