{"chunk_id": "DOC0026__00000", "doc_id": "DOC0026", "chunk_index": 0, "text": "Vol. 13(2), pp. 99-109, April-June 2021\nDOI: 10.5897/JAT2021.0453\nArticle Number: 357DF5266699\nISSN 2141-6664\nCopyright © 2021\nAuthor(s) retain the copyright of this article\nhttp://www.academicjournals.org/JAT\n\nJournal of Accounting and Taxation\n\nFull Length Research Paper\n\nFinancial accountability mechanisms in local\ngovernments in Uganda: a case of Kabale\nDistrict Local Government\n\nPerpetua Arinaitwe1, Marus Eton1*, Moses Agaba1, Abanis Turyehebwa1,\nBernard Patrick Ogwel2 and Fabian Mwosi3\n\n1Department of Business Studies, Faculty of Economics and management Sciences, Kabale University, Kabale,\nUganda.\n2Department of Development, Peace and Conflict Studies, College of Humanities and Social Sciences, Kampala\nInternational University, Kampala Uganda.\n3School of Post Graduate Studies, Bishop Barham University College, Kabale Uganda.\n\nReceived 18 January, 2021; Accepted 20 April, 2021\n\nThe purpose of the study is to present financial accountability mechanisms in local governments, with\nreference to Kabale district local government. A cross-sectional research design, which used both\nquantitative and qualitative approaches to collect and analyze data, was adopted. Both simple random\nand purposive sampling techniques were used to select 117 respondents from 174 subjects.\nQuestionnaires and personal interviews were used to collect data from respondents. Frequencies and\npercentages were used to analyze quantitative data, while direct quotes from interviews conducted\namong key informants formed the basis for qualitative analysis. Quantitative analysis was aided by\nsoftware for document analysis (SPSS V 20.0). The study found out that service delivery was the most\ncommonly used financial accountability mechanism, followed by financial reporting, expenditure\ncontrol and budget. The paper therefore, concluded that service delivery is the most used mechanism\nof financial accountability, though the district’s local budget seemed unclear on reflecting the priorities\nof the local people. This paper suggests that the local government should ensure that the district’s\nbudget demonstrates community preference; salaries and wages should be paid in accordance with the\ndistrict’s approved budget; expenditures on development should always be as per the approved\nbudget, and the mode of financial reporting, particularly on liabilities should be standardized.\n\nKey words: Financial accountability, expenditure control, financial reporting, service delivery, budget.\n\nINTRODUCTION\n\nIn government, financial accounting entails the recording,\ncommunicating, summarizing, analyzing and interpreting\nfinancial statement in aggregate and in details (Onuarah\nand Appah, 2012). It is required that government\naccounts meet internal management requirements while\nproviding the public with a window on government\noperations. Achua (2009) explains that ggovernment\nfinancial reports would have been prepared with the\nobjective of providing full disclosure on a timely basis of\nall material facts relating to government financial position\n\n*Corresponding author. E-mail: emarus@kab.ac.ug, eton.marus@gmail.com.\n\nAuthor(s) agree that this article remain permanently open access under the terms of the Creative Commons Attribution\nLicense 4.0 International License\n\n100 J. Account. Taxation", "word_count": 436, "start_char": 0, "end_char": 3293}
{"chunk_id": "DOC0026__00001", "doc_id": "DOC0026", "chunk_index": 1, "text": "-mail: emarus@kab.ac.ug, eton.marus@gmail.com.A\n\nuthor(s) agree that this article remain permanently open access under the terms of the Creative Commons Attribution\nLicense 4.0 International License\n\n100 J.A\n\nccount.T\n\naxation\n\nand\noperations.\nHowever,\nmany\nsector\norganizations seem to undermine this practice. For\ninstance, Kiyemba (2018) shows incidences of infective\nbudgetary controls that are fueled by fraud and\ncorruption, and personal interests over community\npreferences in Wakiso district. Overseas Development\nInstitute (2018) shows how Ministry of Finance introduced\na\nTransparency\nInitiative\nto\npromote\naccountability and service delivery in Uganda. However,\nsustainability of the initiative failed due to weak\ncoordination of activities and failure to understand\nexpected roles and expectations between central and\nlocal governments. Government of Uganda has over the\nyears introduced a number of reforms aimed at\nenhancing\ntransparency,\nof\nresources\nand\nimproved\nservice\ndelivery.\nThe\ngovernment adopted the practice of open and transparent\nbudget consultative process, which was further enacted\nby Public Finance Management Act 2015. Workshops\nhave been organized to consult all stakeholders\n(development\npartners,\nlocal\ngovernments,\ngovernment ministries and departments) at National and\nlocal government levels to guide in the process of priority\nsetting and resource allocation (MOFPED, 2017). One of\nthe\nkey\nmilestones\nin\nreforming\nfinance\nmanagement in Uganda has been the decentralization of\nthe payroll management. However, the limited internet\ninfrastructure and technical capacity to operate the IFMS\nare still a challenge (Munyambonera and Lwanga, 2015).\nKabale district local government formulates her Budget\nFrame Work Paper by involving all stakeholders and\ncontinues to emphasize decentralized and participatory\ndevelopment\nplanning\nand\nbudgeting\nprocess\nas\nstipulated in the Local Government Act CAP 243 under\nsection 36 (3). The Local Government Budget Framework\nPaper outlines district interventions for social and\neconomic development in the fiscal year. Kabale district\nlocal government suffers from inadequate local revenue\ncollections\ndue\nto\npolitical\ninfluence\nand\npoor\nadministration and fluctuating indicative planning figures\nfrom\ngovernment\n(Kabale\nDistrict\nLocal\nGovernment, 2015), which have inched on the district‟s\nfinancial accountability. While the (Auditor General, 2017)\ndoes\nnot\nindicate\nincidences\nof\npoor\naccountability, cases of inadequate controls surrounding\nmanagement of domestic arrears and understaffing at the\ndistrict remain critical and unattended to. Despite the\nmany years of decentralization policy in Uganda, and\nnumerous efforts to reform the local government system\n(Auditor General, 2017; Eton et al., 2018:106), financial\naccountability at local government remains a challenge in\nUganda. It‟s upon these bases therefore the researchers\nconducted this study.\n\nLITERATURE REVIEW\n\nFrom the theoretical perspective, financial accountability", "word_count": 407, "start_char": 3067, "end_char": 6075}
{"chunk_id": "DOC0026__00002", "doc_id": "DOC0026", "chunk_index": 2, "text": "espite the\nmany years of decentralization policy in Uganda, and\nnumerous efforts to reform the local government system\n(Auditor General, 2017; Eton et al., 2018:106), financial\naccountability at local government remains a challenge in\nUganda.I\n\nt‟s upon these bases therefore the researchers\nconducted this study.L\n\nITERATURE REVIEW\n\nFrom the theoretical perspective, financial accountability\n\nwas discussed in view of the Principal-agent theory. The\nprincipal, who are the citizens grant some authority to the\nagents (politicians and civil servants) to act on their\nbehalf (Shah, 2007; Agwor and Akani, 2017; Gailmardy,\n2012). The principal-agent theory relates the customer\n(principal), who pays for services or goods, and the\nagent. More than often, however, the agent least does\nwhat the principal expects (Hlavaeek and Hlavaeek,\n2006), yet the principal is limited in his ability to monitor\nand judge the contractor‟s input and output (Keil, 2005),\nwhich leads to mistrust and can only be avoided under\nhigh monitoring costs. In ideal situations, the public\nempowers government officials to promote public welfare\nusing public resources. However, more often than none,\ngovernment officials serve their own interests, which\njeopardize service to the public. According to (Berner and\nSmith, 2004) accountability is interpreted as the ability of\nthe principals (public) to question the conduct and\nbehavior of the agents, and to impose sanctions where\nsuch conduct or behavior falls short of the requirement.\nThis would be demonstrated in the ballot box on the side\nof the politicians, but how about the civil servants? In\ngrowing democracies, the agents override the principals,\nthus denying them full participation in their demand for\naccountability of the actions of the agents (Cabannes,\n2005) to the point of denying them full participation\nthrough\nexchange.\nPrincipals\nonly\ndisseminate information to advance their own selfinterests and to maximize their own utilities (United\nNations, 1999). According to Birskyte (2013), the public\nattempts to demand accountability from politicians and\ncivil servants however, a wider range of principals lack\nthe capacity to hold agents accountable. This research\nargues that while the public can be involved in\ndemanding accountability from politicians and civil\nservants, the public is also driven by personal interests,\npolitical patronage, resource shortage and foreign\nbackings. In turn, the agents do not consider the targets\nof the constituent principals. In other words, the principalagent-theory cannot apply in dynamic situations where\npower is not directly delegated. As people continue to\nlook to politicians for cash in exchange for their votes,\nthis implies a decrease in their legality to demand\naccountability (United Nations, 2005). Since resources\nare in the hands of an elected government, people must\nbe corrupted by accepting bribes for their votes, which\nconstrains effectiveness and delivery of public goods.\n\nFINANCIAL ACCOUNTABILITY", "word_count": 446, "start_char": 5683, "end_char": 8685}
{"chunk_id": "DOC0026__00003", "doc_id": "DOC0026", "chunk_index": 3, "text": "s people continue to\nlook to politicians for cash in exchange for their votes,\nthis implies a decrease in their legality to demand\naccountability (United Nations, 2005).S\n\nince resources\nare in the hands of an elected government, people must\nbe corrupted by accepting bribes for their votes, which\nconstrains effectiveness and delivery of public goods.F\n\nINANCIAL ACCOUNTABILITY\n\nAccountability is generally defined as accepting and\nmeeting one's personal responsibilities, being and feeling\nobligated to another individual as well as oneself, and\nhaving to justify one's actions to others (Wilson et al.,\n2010). Accountability has frequently been presented as\nrational practice to ensure responsibility by individuals\nand institutions, which should be implemented in all civil\n\nsocieties, economic institutions and organizations (Agwor\nand Akani, 2017). He noted that the traditional tools of\nare\noften\nconsidered\nby\nnon-profit\norganizations as unnecessary formal tasks and excessive\nbureaucracy, which can have important consequences\nboth organizationally and managerially. According to\n(Onuarah and Appah, 2012), accountability focuses on\nthe extent to which feedback recipients perceive they are\nresponsible\nfor,\nutilizing\nfeedback\nfor\ndevelopment. A sound system of public expenditure\nmanagement needs to take into account the wider values\nand requirements of society. Accountability, transparency,\npredictability and participation are important instruments\nfor sound budget management, but also have an intrinsic\nvalue, and are generally seen as the four pillars of good\ngovernance. If budget managers do not comply with\nparliament's authorizations, or if public funds are used for\nprivate purposes, it is doubtful whether either aggregate\nfiscal discipline or efficient resource allocation, or both,\nwill be achieved. Financial accountability is about\nassuring its stakeholders regarding the use of public\nresources (stewardship) as well as to underpin decisionmaking about how to allocate scarce resources like time,\npersonnel, space, equipment and money (Doussy and\nDoussy, 2014). The allocation of resources may affect\nthe entire operation and success of an organization,\nwhich often hinges on the quality of its financial\nmanagement. Thus public entities have to provide\ninformation about financial activities to its stakeholders in\norder to discharge financial accountability. Financial\naccountability is a very important component of the public\nsector financial management process.\n\nFinancial accountability mechanisms\n\nExpenditure controls", "word_count": 357, "start_char": 8307, "end_char": 10860}
{"chunk_id": "DOC0026__00004", "doc_id": "DOC0026", "chunk_index": 4, "text": "hus public entities have to provide\ninformation about financial activities to its stakeholders in\norder to discharge financial accountability.F\n\ninancial\naccountability is a very important component of the public\nsector financial management process.F\n\ninancial accountability mechanisms\n\nExpenditure controls\n\nThere is a tendency for spending on wages and salaries,\ngoods and services and other items of recurrent\nexpenditure to be higher than the approved budget, and\nfor spending on the development budget to be lower than\nthe\napproved\namounts.\nThe\nunder\nspending\nin\ndevelopment expenditure is mainly due to capacity\nlimitations, weak project implementation and possibly a\nlack of reporting on execution of donor-funded projects\n(Cabannes, 2005). Overspending in the recurrent budget\ncan be attributed to weaknesses in expenditure controls,\nincluding inadequate commitment controls. The lack of\ndata integrity is a big issue, both for aggregate and\nindividual budget items, thus reducing the overall quality\nof financial reports. Credibility in public expenditure is\nassessed by comparing aggregate expenditure out-turn\nto original approved budget, compositions of expenditure\nout-turn to original budget and aggregate revenue outturn to original approved budget (PNG Government,\n2015). However, Hladchenko (2016) advises that when\nthe resource envelope allows, the government should\nArinaitwe et al. 101", "word_count": 197, "start_char": 10552, "end_char": 11958}
{"chunk_id": "DOC0026__00005", "doc_id": "DOC0026", "chunk_index": 5, "text": "redibility in public expenditure is\nassessed by comparing aggregate expenditure out-turn\nto original approved budget, compositions of expenditure\nout-turn to original budget and aggregate revenue outturn to original approved budget (PNG Government,\n2015).H\n\nowever, Hladchenko (2016) advises that when\nthe resource envelope allows, the government should\nArinaitwe et al. 101\n\nshift its policy focus towards improving the quality of\npublic expenditure. Such restraints normally arise from\nthe weak budget forecast.\nAnnual financial reports, which are a reflection of final\nbudget outcome, may indicate an overall level of budget\nexecution which was in line with the initial approved\nbudget. For example, a very small difference between\noriginal and executed budget can be explained by the\nsupplementary budget that was adopted in-year and\nhelped reallocate expenditure among sections (Dunleavy\net al., 2006). This helps to increase the overall level of\nbudget execution. Without this supplementary budget,\nmost public entities operate under-execution of the\nbudgets. Similarly, Pelizzo and Stapenhurst (2013) noted\nthat it is possible for the recurrent budget to appear\noverspent while the development budget is regularly\nunder-executed. These two items broadly compensate at\nthe overall level. At the end of the year, departments tend\nto transfer lapsing funds into trust accounts, which results\ninto a recorded increased level of budget execution even\nthough these transfers represent no more than an\naccounting transaction between different government\naccounts (Lytvynchuk, 2014). Effective expenditure\ncontrol is attained when the extent to which the\ncomposition of expenditures differs from the original\napproved budget is compared, and that public entities\ncan predict the extent to which the budget is predictable,\nreliable and reflects the implementation of stated public\npolicy (Pelizzo and Stapenhurst, 2013; Pillay, 2013). This\nsuggests that documents containing a large amount of\ndetailed information with vast accompanying narrative\nshould be provided. In a related view, Miller (2012) adds\nthat any discrepancies in the data for total revenues and\nexpenditures should be presented in the documents. A\nlack or shortage of information on important fiscal\nindicators such as the debt stock, financial assets, fiscal\nrisks and tax expenditures, in addition to a medium-term\nbudget framework impinges on the level of financial\naccountability. Moreover, presenting the development\nbudget for each agency in the same section as the\ncurrent budget, and modifying the definitions of the\ndevelopment budget would reflect genuine capital\nexpenditure (Shah, 2007).\n\nFinancial reporting", "word_count": 389, "start_char": 11584, "end_char": 14270}
{"chunk_id": "DOC0026__00006", "doc_id": "DOC0026", "chunk_index": 6, "text": "oreover, presenting the development\nbudget for each agency in the same section as the\ncurrent budget, and modifying the definitions of the\ndevelopment budget would reflect genuine capital\nexpenditure (Shah, 2007).F\n\ninancial reporting\n\nFinancial reporting plays a major role in fulfilling\ngovernment‟s duty to be publicly accountable in a\ndemocratic society. Financial reporting is used in\nassessing accountability by comparing actual financial\nresults with the legally adopted budget, assessing\nfinancial condition and result of operations, assisting in\ndetermining compliance with financial laws and assisting\nin evaluating efficiency and effectiveness (Wang, 2013).\nThe accounting profession through oversight bodies,\ndeveloped certain international rules and guidelines on\n\n102 J. Account. Taxation", "word_count": 108, "start_char": 14036, "end_char": 14838}
{"chunk_id": "DOC0026__00007", "doc_id": "DOC0026", "chunk_index": 7, "text": "inancial reporting is used in\nassessing accountability by comparing actual financial\nresults with the legally adopted budget, assessing\nfinancial condition and result of operations, assisting in\ndetermining compliance with financial laws and assisting\nin evaluating efficiency and effectiveness (Wang, 2013).T\n\nhe accounting profession through oversight bodies,\ndeveloped certain international rules and guidelines on\n\n102 J.A\n\nccount.T\n\naxation\n\nhow financial information is treated and communicated so\nthat measurement and presentation are less subjective\n(Kumar et al., 2012). These guidelines and rules for\npreparing financial statements are commonly known as\nGenerally Accepted Accounting Principles (GAAP), The\nInternational Accounting Standards Board (IASB), the\nInternational\nAccounting\nStandards\n(IASs)\nand\nInternational Financial Reporting Standards (IFRSs).\nThese standards start with a conceptual framework which\nanchors financial reports to a set of principles such as\nmateriality (the degree to which the transaction is big\nenough to matter) and verifiability (the degree to which\ndifferent people agree on how to measure the\ntransaction) (Beyer and Guttman, 2012). The standards\nestablish which resources and obligations should be\nrecorded as assets and liabilities, which changes in\nassets and liabilities should be recorded, when these\nchanges should be recorded, how the recorded assets\nand liabilities and changes in them should be measured,\nwhat information should be disclosed and which financial\nstatements should be prepared (Li, 2005). That is, the\nstandards prescribe recording and reporting practices\nthat are deemed to be acceptable when reporting on the\nfinancial affairs of an entity.\nToday, all public institutions in Uganda are adhering to\nIFRSs to ensure the same understanding of the\ninformation by both the preparers and users of that\ninformation. The enforcement of accounting standards\nimproves the quality of financial reporting (Auditor\nGeneral, 2017). Unfortunately, literature recognizes that\nmeasuring the quality of financial reports like the financial\nstatements is problematic especially because different\nusers may perceive the usefulness of information very\ndifferent from each other (Indriasari, 2008; Rabrenovic,\n2009; Hladchenko, 2016). This is associated with the fact\nthat most of the stakeholders will not have the ability or\nneed to analyze the financial statements in detail or test\nthe compliance with accounting standards. Therefore,\nconcentrating on characteristics like understandability,\ncomparability, verifiability and timeliness (Kedia and\nPhilippon, 2003), which enhance faithfulness and\nrepresentation to citizens, politicians, donors, government\nand NGOs; is far better. Stakeholders like CSOs and\ncommunity members could be probably only interested in\nwhether the statements are trust worthy, that no\ncorruption took place, the budget were complied with and\nthat the organization in question is in a position to provide\nvalue for money (Graham et al., 2006). Therefore,\nfinancial statements must be transparent and easy to\nunderstand to enable making informed decision.\nWhile the definition of financial accounting system\npoints to set of procedures from data recording to financial\nreporting in order to answer budget implementation,\nfinancial accounting system can be measured by five\ndimensions: the accounting of cash, the accounting\nprocedures, cash outlays, the accounting procedures\nassets, the accounting procedures in cash, and the", "word_count": 493, "start_char": 14393, "end_char": 17899}
{"chunk_id": "DOC0026__00008", "doc_id": "DOC0026", "chunk_index": 8, "text": "hile the definition of financial accounting system\npoints to set of procedures from data recording to financial\nreporting in order to answer budget implementation,\nfinancial accounting system can be measured by five\ndimensions: the accounting of cash, the accounting\nprocedures, cash outlays, the accounting procedures\nassets, the accounting procedures in cash, and the\n\npresentation of financial reports. In government however,\nfinancial accountability statements are about accounting\nstandards, which are structured to report on the financial\nposition reporting entity (Elliot and Elliot, 2012). This\nsuggests that emphasis of reporting is laid on\naccountability dimension, presentation dimension and\ndisclosure. As the organization processes and reviews its\naccounting material, a systematic approach to the\nidentification, analysis, evaluation, endorsement and\nperiodic review of decisions taken involving such material\nis provided, which spans a number of accounting areas.\nHowever, at the end of the day, the final financial\nstatements will include amounts based on judgments,\nestimates and assumptions by management (South\nAfrican Institute of Chartered Accountants (SAICA),\n2012).\nA consolidated local government financial statement is\nprepared annually that includes full information on\nrevenues, expenditure and financial assets including\nrevenue arrears. These annual statements however, do\nnot provide a full reporting on liabilities. They do not\nprovide any information on expenditure arrears or\naccounts payable (Kabale District Local Government,\n2015). Under the cash accounting system the source\ndocument for accounting entries is the payment voucher\ncoupled with the electronically generated cheque or other\npayment instruction. Entries are dated using the date on\nthe payment instrument. It is important to note that\nauditing is a crucial component of most modernist\nconceptions of accountability since it legitimates the\ninformation on which formal, financial accountability rests\n(Shulman et al., 2013).The fundamental role of an auditor\nis to provide independent assurance to external users\nthat a financial report of an entity is accurate and reliable.\n\nService delivery", "word_count": 307, "start_char": 17530, "end_char": 19722}
{"chunk_id": "DOC0026__00009", "doc_id": "DOC0026", "chunk_index": 9, "text": "t is important to note that\nauditing is a crucial component of most modernist\nconceptions of accountability since it legitimates the\ninformation on which formal, financial accountability rests\n(Shulman et al., 2013).The fundamental role of an auditor\nis to provide independent assurance to external users\nthat a financial report of an entity is accurate and reliable.S\n\nervice delivery\n\nA service is an activity or a series of activities of more or\nless intangible nature that normally, but not necessarily,\ntakes place in interactions between the customer and\nservice employees and/or systems of service providers,\nwhich are provided as solutions to customer problems\n(Bajo et al., 2017). Service delivery can be taken to be an\noutcome of performance depending on the context in\nwhich it is used (Yeo and Neal, 2004). According to\n(Birskyte, 2013), service can be expressed in terms of\ncapacity to deliver desired services and from which\ncustomers get satisfaction. A service delivery gap is that\ngap between the established delivery standards and the\nactual service delivered (Goncalves, 2013). It is an\ninconsistency\nbetween\nservice\ndesign/quality\nspecifications and the actual service quality by the\nservice delivery system. Effective engagement between\ncitizens, service providers and elected representatives is\nessential to democratic service delivery.\nService delivery refers to programs or services that are", "word_count": 213, "start_char": 19337, "end_char": 20752}
{"chunk_id": "DOC0026__00010", "doc_id": "DOC0026", "chunk_index": 10, "text": "service delivery gap is that\ngap between the established delivery standards and the\nactual service delivered (Goncalves, 2013).I\n\nt is an\ninconsistency\nbetween\nservice\ndesign/quality\nspecifications and the actual service quality by the\nservice delivery system.E\n\nffective engagement between\ncitizens, service providers and elected representatives is\nessential to democratic service delivery.S\n\nervice delivery refers to programs or services that are\n\nprovided either to the general public or to specifically\ntargeted groups of citizens, either fully or partially using\ngovernment resources. This includes services such as\neducation and training, health care, social and community\nsupport, policing, road construction and maintenance,\nagricultural support, water and sanitation, and other\nservices (Salahu, 2012). He observes that service delivery\nexcludes those services provided on a commercial basis\nthrough public corporations. Similarly, (Public Expenditure\nand Financial Accountability (PEFA), 2016) points out\nthat service delivery excludes policy functions, internal\nadministration, and purely regulatory functions undertaken\nby the government, although performance data for these\nactivities may be captured for internal management\npurposes. It also excludes defense and national security\n(Agwor and Akani, 2017).\nQuality of service delivery has emerged as the most\nsignificant\nstrategy\nin\nensuring\nthe\nsurvival\nof\norganizations and also a fundamental route to business\nexcellence as well as extending market share of health\ncare organizations. Service provision that is de-linked\nfrom citizen-influence and democratic decision making is\nunlikely to deliver quality services for the poor (Omolaye,\n2015). For meaningful contributions, the poor require the\nability and capacity to ask questions and, sufficient\ninformation of their right and entitlements, service\noptions, local and national budgets, and the systems to\naddress when decisions are taken undemocratically or\nwhen services are of poor quality. Local governments are\nassumed to be performing if the projects and services\nmeet the demands of the citizens in the local areas\n(Agwor and Akani, 2017).\nShah (2007) insists that service delivery has to be\ncommunicated over and over again to everyone.\nEmployees at all levels must be aligned with a single\nvision of what the organization is trying to accomplish.\nThus, effective internal communications is the requisite\nfor integration and harmony in the service organizations\nactivities and quality. Public Expenditure and Financial\nAccountability (2016) also emphasizes that the goal of\nany social service organization is to improve the results\nof the target population in some way by providing the\nright type of services and by providing them in an\nappropriate and adequate way.", "word_count": 400, "start_char": 20303, "end_char": 23097}
{"chunk_id": "DOC0026__00011", "doc_id": "DOC0026", "chunk_index": 11, "text": "ublic Expenditure and Financial\nAccountability (2016) also emphasizes that the goal of\nany social service organization is to improve the results\nof the target population in some way by providing the\nright type of services and by providing them in an\nappropriate and adequate way.\n\nBudget is a plan of financial operation embodying an\nestimate of proposed expenditures for a given period of\ntime and the proposed means of financing them. In a\nmuch more general sense, budgets may be regarded as\ndevices to aid management in operating an organization\nmore\neffectively.\nGovernments\nbuild\nbudgets\nto\ndemonstrate compliance with laws and to communicate\nperformance effectiveness (Wilson et al., 2010). It is\nworth noting that financial accounting and management\nArinaitwe et al. 103", "word_count": 122, "start_char": 22818, "end_char": 23595}
{"chunk_id": "DOC0026__00012", "doc_id": "DOC0026", "chunk_index": 12, "text": "n a\nmuch more general sense, budgets may be regarded as\ndevices to aid management in operating an organization\nmore\neffectively.G\n\novernments\nbuild\nbudgets\nto\ndemonstrate compliance with laws and to communicate\nperformance effectiveness (Wilson et al., 2010).I\n\nt is\nworth noting that financial accounting and management\nArinaitwe et al. 103\n\naccounting cannot be so neatly compartmentalized in the\npublic sector, where management accounting refers to\nbudgeting and control, rather than accounting solely in\nthe service of managers. The budget is an expression of\npublic policy and political preferences (Tsurkan et al.,\n2016). It is an instrument of fiscal policy on revenue and\nspending to achieve macroeconomic objectives. It\nprovides benchmarks for performance measured partly\nby the accounting system. Given their close relationship,\nit is often difficult to tell where budgeting ends and\naccounting begins. They reinforce each other in\ndemonstrating and discharging fiscal accountability to the\ngovernment's stakeholders, who are more numerous and\ndiverse than the owners of a firm.\nBudgeting is an important mechanism for financial\nplanning and management and, as a cyclical decisionmaking process, it allows for the achievement of\norganizational priorities and objectives through limited\nfiscal resources. The correct application of budgeting can\ncontribute significantly to greater efficiency, effectiveness\nand accountability within any organization if a level of\nsynergy exists between the policy direction and the fiscal\nframework (Berner and Smith, 2004). Being part of the\ncontrol environment relating to the efficient, effective and\neconomic utilization of resources, budgets are also an\nindistinguishable part of the broader planning and policy\nenvironment. Similarly, (Mikesell, 2007) expresses that a\nbudget‟s importance in a democratic setting should be\naligned to both the legislative and executive management\nenvironments and emphasizes publicity, amongst others,\nas a core principle of any budget (Neblo et al., 2010). In\nessence, publicity requires budget openness and\ntransparency during all the stages of the budgeting\nprocess, which include executive recommendation,\nlegislative consideration and budget execution.\nIn budgeting, this means uniting administrators, who\nhave information on municipal finance and budgetary\nprocesses, with their constituents, who have information\non their own preferences (Kim et al., 2010). This\nsuggests that combining of information leads not only to\nnew information but also to new understanding. The\nbudget measures the extent to which aggregate budget\nexpenditure outturn reflects the amount originally\napproved,\nas\ndefined\nin\ngovernment\nbudget\ndocumentation and fiscal reports (Omolaye, 2015). He\nnotes that aggregate expenditure includes planned\nexpenditures and those incurred as a result of\nexceptional events such as armed conflicts or natural\ndisasters; and expenditures financed externally by loans\nor grants should be included. However, if amounts are\nheld in suspense accounts at the end of any year that\ncould affect the scores if included in the calculations, they\ncan be included. The budget recognizes that it is prudent\nto include an amount to allow for unforeseen events in\nthe form of a contingency vote, although this should not\nbe so large as to undermine the credibility of the budget\n(Salahu, 2012). Where part of the budget is protected", "word_count": 502, "start_char": 23254, "end_char": 26673}
{"chunk_id": "DOC0026__00013", "doc_id": "DOC0026", "chunk_index": 13, "text": "he budget recognizes that it is prudent\nto include an amount to allow for unforeseen events in\nthe form of a contingency vote, although this should not\nbe so large as to undermine the credibility of the budget\n(Salahu, 2012).W\n\nhere part of the budget is protected\n\n104 J. Account. Taxation", "word_count": 51, "start_char": 26409, "end_char": 26699}
{"chunk_id": "DOC0026__00014", "doc_id": "DOC0026", "chunk_index": 14, "text": "he budget recognizes that it is prudent\nto include an amount to allow for unforeseen events in\nthe form of a contingency vote, although this should not\nbe so large as to undermine the credibility of the budget\n(Salahu, 2012).W\n\nhere part of the budget is protected\n\n104 J.A\n\nccount.T\n\naxation\n\nfrom spending cuts for either policy (for example, poverty\nreduction spending) or regulatory reasons (for example,\ncompulsory welfare payments), this will show up as a\ncomposition\nvariance\n(Berner\nand\nSmith,\n2004).\nAssessors are requested to report on the purpose and\nextent of protected spending in the narrative.\nAccurate revenue forecasts are a key input to the\npreparation of a credible budget. Revenues allow the\ngovernment to finance expenditures and deliver services\nto its citizens. Overly optimistic revenue forecasts can\nlead to unjustifiably large expenditure allocations that will\neventually require either a potentially disruptive in-year\nreduction in spending or an unplanned increase in\nborrowing\nto\nsustain\nthe\nspending\nlevel\n(Public\nExpenditure and Financial Accountability (PEFA), 2016).\nOn the other hand, undue pessimism in the forecast can\nresult in the proceeds of an over-realization of revenue\nbeing used for spending that has not been subjected to\nthe scrutiny of the budget process (Mikesell, 2007). As\nthe consequences of revenue under-realization may be\nmore severe, especially in the short term, the criteria\nused to score this indicator allow comparatively more\nflexibility, when assessing an over-realization.\nA robust classification system allows transactions to be\ntracked throughout the budget‟s formulation, execution,\nand reporting cycle according to administrative unit,\neconomic category, function/sub function, or program\n(Public Expenditure and Financial Accountability (PEFA),\n2016). The budget should be presented in a format that\nreflects\nthe\nmost\nimportant\nclassifications.\nThe\nclassification should be embedded in the government‟s\nchart of accounts (the accounting classification) to ensure\nthat every transaction can be reported in accordance with\nany of the classifications used. In the same line, Tsurkan\net al. (2016) argue that the budget and accounting\nclassifications should be reliable and consistently applied,\nproviding users with confidence that information recorded\nagainst one classification will be reflected in reports\nunder the other classification. In view of national budgets,\na set of budget supporting documents must be provided\nby the executive to the legislature for scrutiny and\napproval. These documents provide a complete picture of\ncentral government fiscal forecasts, budget proposals,\nand outturn of the current and previous fiscal years\n(Mikesell, 2007). The arrangements for providing transfers\nfrom central government to sub national governments\nand the timeliness of information on those transfers ought\nto be captured. Financial reporting by sub national\ngovernments and fiscal risks to central government from\nsub national governments are addressed to governments\nthrough their budgets, or through conditional (earmarked)\ngrants to sub national governments to implement\nselected service delivery and expenditure responsibilities\n(Salahu, 2012). The overall level of grants is usually\ndetermined\nby\npolicy\ndecisions\nat\nthe\ngovernment‟s discretion or as part of constitutional\nnegotiation processes. However, clear criteria for the", "word_count": 492, "start_char": 26407, "end_char": 29809}
{"chunk_id": "DOC0026__00015", "doc_id": "DOC0026", "chunk_index": 15, "text": "he overall level of grants is usually\ndetermined\nby\npolicy\ndecisions\nat\nthe\ngovernment‟s discretion or as part of constitutional\nnegotiation processes.H\n\nowever, clear criteria for the\n\ndistribution of grants among sub national governments\nare needed to ensure a locative transparency and\nmedium-term predictability of funds available for planning\nand budgeting of expenditure programs by sub national\ngovernments (Edeme and Nkalu, 2017). He further\nclarifies that every fiscal transfer from central government\nto the relevant sub national governments should be taken\ninto consideration.\nLegislatures play a critical role in the management of\npublic finances. As part of their budget decision-making\nresponsibilities, legislatures approve the national budget\nand subsequently provide oversight as the executive\nimplements the budget (Wilson et al., 2010). The\nchallenge that remains with local government budgets is\ntimeliness of reliable information provided to sub national\ngovernments on their allocations from central government\nfor the coming year. It is crucial for sub national\ngovernments to receive information on annual allocations\nfrom central government well in advance of the\ncompletion (and preferably before commencement) of\ntheir own budget-preparation processes. Information on\ntransfers to sub national governments‟ budgets should be\nregulated by the central government‟s annual budget\ncalendar, which should provide for reliable information on\nallocations early in the cycle (Public Expenditure and\nFinancial Accountability (PEFA), 2016).\n\nMETHODOLOGY", "word_count": 217, "start_char": 29625, "end_char": 31195}
{"chunk_id": "DOC0026__00016", "doc_id": "DOC0026", "chunk_index": 16, "text": "nformation on\ntransfers to sub national governments‟ budgets should be\nregulated by the central government‟s annual budget\ncalendar, which should provide for reliable information on\nallocations early in the cycle (Public Expenditure and\nFinancial Accountability (PEFA), 2016).M\n\nETHODOLOGY\n\nThe study adopted a cross-sectional research design. This type of\nresearch design measures differences between or from among a\nvariety of people, subjects, or phenomena rather than a process of\nchange. Data was collected in a single interface with respondents\nand a report was produced. Quantitative approaches were used to\ncollect and analyze data on financial accountability constructs\n(expenditure control, financial reporting, service delivery and\nbudget). The target population included local government staff,\nelected leaders, and civil society leaders identified from Kabale\ndistrict local government (central division, town councils, sub\ncounties). These categories of the population were contacted\nbecause they are part of financial accountability in addition to\nhaving enough experiences on financial accountability in the\ndistrict. The study comprise of a total of 174 study units, constituting\n100 staff, 42 elected leaders, and 32 civil society leader. The target\npopulation was stratified into three strata that is staff, elected\nleaders, and civil society leaders. Proportional allocation was\nemployed to determine the number of participants to be taken from\neach stratum. This resulted into taking 67 staff, 29 elected leaders,\nand 21 civil society leaders, which was equivalent to a sample size\nof 117. Purposive sampling was used to select the CAO, District\nchairperson, and town clerks while simple random sampling was\nused to select the staff, elected leaders, and civil society leaders.\nThe CAO, District chairperson, and town clerks were purposvely\nselected because of their vast knowledge of public finance\nmanagement and accountability expectations.Questionnaires and\ninterview methods were used to collect primary data. The CAO,\ndistrict chairperson, and town clerks were interviewed while the rest\nof the staff, elected leaders, and civil society leaders were served\nwith questionnaires. A structured questionnaire with close-ended\nquestions was designed. The items were developed from literature\nreview. The questionnaire had two sections that is a background", "word_count": 341, "start_char": 30906, "end_char": 33283}
{"chunk_id": "DOC0026__00017", "doc_id": "DOC0026", "chunk_index": 17, "text": "he CAO,\ndistrict chairperson, and town clerks were interviewed while the rest\nof the staff, elected leaders, and civil society leaders were served\nwith questionnaires.A\n\nstructured questionnaire with close-ended\nquestions was designed.T\n\nhe items were developed from literature\nreview.T\n\nhe questionnaire had two sections that is a background\n\nsection and a basic section. The background section had 7 items\ncovering background characteristics. the basic section, which was\ndirectly related to financial accountability mechanisms had four subsections. Expenditure control had 6 items, financial reporting had 8\nitems, servide delivery had 7 items while budget had 7 items. All the\nitems on financial accountability mechanisms were scale-items,\nmeasured on a 5-point likert scale ranging from 1 (strongly\ndisagree) to 5 (strongly agree). Collected data was sorted and\nentered into SPSS version 20. The software was used to help in\ngenerating percentages of counts for each item used in the\nquestionnaire. The researcher summarized percentage data into\ndisagreement (an aggregate of strongly disagree and disagree),\nagreement (an aggregate of strongly agree and agree) and „not\nsure‟.\n\nRESULTS\n\nBackground characteristics\n\nParticipation according to gender indicates that 78.9%\nwere male while 21.1% were female. In respect to age\ndistribution, 43.1% belonged to (40 - 49) years of age and\nconstituted the majority, 27.5% belonged to (30 - 39)\nyears, 17.4% belonged to (50 and above) years while\n11.9% belonged to (20 - 29) years and constituted the\nleast participation, which suggests that most of the\nparticipants were adults with a high degree of reasoning\nand maturity, which were essential in the study.\nRegarding their marital status, In line with marital status,\n75.2% indicated to be married and were the majority,\n19.3% were single while only 6 participants representing\n5.5% indicated the “others” option. In terms of the highest\nlevel of education revealed that 58.7% were tertiary\ngraduates, 24.8% were university graduates while 16.5%\nindicated secondary as their highest level of education.\nAccording to their experience in local government\nactivities, 52.3% had (5 -9) years‟ experience with the\nlocal government, 26.5% had not worked with the local\ngovernment for more than 5 years while 21.1% had\nworked with the local government for 10 years and over.\n\nFinancial accountability mechanisms used in Kabale\ndistrict local government.", "word_count": 369, "start_char": 32941, "end_char": 35387}
{"chunk_id": "DOC0026__00018", "doc_id": "DOC0026", "chunk_index": 18, "text": "ccording to their experience in local government\nactivities, 52.3% had (5 -9) years‟ experience with the\nlocal government, 26.5% had not worked with the local\ngovernment for more than 5 years while 21.1% had\nworked with the local government for 10 years and over.F\n\ninancial accountability mechanisms used in Kabale\ndistrict local government.\n\nThe study investigated three mechanisms of ensuring\nin\nKabale\ndistrict\nlocal\ngovernment. These were expenditure control, financial\nreporting, service delivery and the budget. Table 1\npresents the details of the findings. Bringing to light the\naspect of expenditure control as a mechanism of\nensuring financial accountability in Kabale district local\ngovernment, 89.9% that the district local government‟s\nresource envelope is adequate enough to allow for\nquality public expenditure, while 85.3% confirmed that the\ndistrict‟s overall budget execution is always in line with\nthe official approved budget and the district council is\ncommitted to spending within the budget (71.5%).\nActually, Kabale is a stop-off point for tourists to Lake\nArinaitwe et al. 105", "word_count": 165, "start_char": 35045, "end_char": 36146}
{"chunk_id": "DOC0026__00019", "doc_id": "DOC0026", "chunk_index": 19, "text": "ctually, Kabale is a stop-off point for tourists to Lake\nArinaitwe et al. 105\n\nBunyonyi and the two parks famous for mountain gorilla\ntracking:\nMgahinga\nnational\npark\nand\nBwindi\nimpenetrable national park. In moderate presentation,\n64.2% confirmed that the district‟s financial reports\nalways indicate a very small difference between the\noriginal and the expected budget, 62.4% confirmed that\nthe money spent on development is lower than the\napproved budget, while 54.1% confirmed that council\nspends more on salaries and wages than is approved in\nthe budget. On the whole, expenditure control as a\nfinancial accountability mechanism in Kabale district\nappears to stand at 71.2%.\nIn relation to financial reporting as a financial reporting\nmechanism, 92.7% confirmed that the overall budget\nexecution is achieved under supplementary budget,\n83.5% confirmed that the financial reporting system is\ncompliant with financial laws, while 80.7% indicated that\nthe reporting system has a standard for recording assets.\nIn a related view, 78.9% confirmed that the local\ngovernment‟s\nis\ntreated\nin\naccordance with international rules and guidelines, which\nmakes district‟s reporting system to demonstrate quality.\nThough participants confirmed that their financial reports\nare easily understood by users (76.2%), they also\nmoderately\nindicated\nthat\nis\npresented in a less subjective manner (61.5%) and that\nthe reporting system has a standard for recording\nliabilities (57.8%). On the whole, financial reporting as a\nfinancial accountability in Kabale district local government\nappears to stand at 76.3%.\nIn view of service delivery, 88.1% confirmed that the\ndistrict runs projects that are intended to improve citizens‟\nwelfare, 82.6% confirmed that the services delivered by\nthe council are indeed of the right type, 81.7% agreed\nthat the projects implemented by the council meet the\ndemand of citizens in the local area. About 79.8% agreed\nthat the district delivered quality services, are a\nguarantee of their tight (74.3%) and reflect citizens‟\nparticipation in decision making (70.7%). On a slightly\nlower end, 64.2% agreed that district council solves\ncitizen‟s problems. On the whole, service delivery in\nKabale district local government appears at 77.3%.\nIn line with budget as a mechanism of financial\naccountability in Kabale district local government, 87.1%\nindicated that budget demonstrates political preference.\nIn moderate view points, 56.9% agreed that the budget\ndemonstrates a sound financial system, 55.0% agreed\nthat the budget is a true measure of council‟s\neffectiveness while 51.4% agreed that the budget is a\ntrue measure of council‟s efficiency. It should be noted\nthat 47.8% disagreed with the view that the budget\nenables council to attend to priorities in the local area,\n40.4%\ndisagreed\nthat\nthe\nbudget\ndemonstrates\ncommunity preference, while 35.8% disagreed that the\nbudget enables council to utilize resources economically.\nThe above statistics suggest a politicized and biased\nposition on the budget as a policy document. In the same", "word_count": 460, "start_char": 36069, "end_char": 39127}
{"chunk_id": "DOC0026__00020", "doc_id": "DOC0026", "chunk_index": 20, "text": "he above statistics suggest a politicized and biased\nposition on the budget as a policy document.I\n\nn the same\n\n106 J. Account. Taxation\n\nTable 1. Financial accountability mechanisms.\n\nVariable List\nDisagreement\n(%)\nNot Sure\n(%)\nAgreement\n(%)\nExpenditure control\n1.Our resource envelope is adequate to allow quality public expenditure\n6.4\n3.7\n89.9\n2.Our overall budget execution is always in line with the official approved budget\n8.2\n6.4\n85.3\n3.Our council is committed to spending within the budget\n20.2\n8.3\n71.5\n4.Our financial reports always indicate a very small difference between the original and the\nexecuted budget\n26.6\n9.2\n64.2\n5.The money council spends on development is lower than is approved in the budget\n14.7\n62.4\n6.Our council spends more on salaries and wages than is approved in the budget\n29.4\n16.5\n54.1\n19.0\n9.8\n71.2\n\nFinancial reporting\n\n1.The overall level of budget execution is achieved under supplementary budget\n5.5\n1.8\n92.7\n2.Our financial reporting system is compliant with financial laws\n9.2\n7.3\n83.5\n3.Our financial reporting system has a standard for recording assets\n7.4\n11.9\n80.7\n4.Our financial information is treated in accordance with international rules and guidelines\n11.9\n9.2\n78.9\n5.Our financial reporting systems demonstrates quality\n6.5\n14.7\n78.9\n6.Our financial reports are easily understood by users\n23.9\n76.2\n7.Our financial information is presented in a less subjective manner\n20.2\n18.3\n61.5\n8.Our financial reporting system has a standard for recording liabilities\n23.9\n18.3\n57.8\n13.6\n11.6\n76.3\n\nService delivery\n\n1.The projects that are intended to improve citizens' welfare are clearly communicated to everyone\n11.9\n88.1\n2.The services delivered by my council are indeed of the right type\n9.2\n8.3\n82.6\n3.The projects implemented by my council meet the demand of citizens in the local area\n18.3\n81.7\n4.The services delivered by our council are of quality\n7.4\n12.8\n79.8\n5.The services delivered by our council are a guaranteed of my right\n18.4\n7.3\n74.3\n6.The services delivered by our council reflect citizen participation in decision making\n13.8\n15.6\n70.7\n7.The services delivered by our council solves citizen problems\n24.8\n64.2\n14.8\n11.0\n77.3\n\n1.Our council budget is a demonstration of political preference\n4.6\n8.3\n87.1\n2.Our budgets demonstrate the a sound financial system\n26.6\n16.5\n56.9\n3.Our budget is a true measure of council's effectiveness\n24.8\n20.2\n4.Our budget is a true measure of council's efficiency\n30.3\n18.3\n51.4\n5.Our budgets enable council to utilize resources economically\n35.8\n18.3\n45.9\n6.Our council budget is a demonstration of community preferences\n40.4\n17.4\n42.2\n7.Our budget enables council to attend to priorities in the local area\n47.8\n24.8\n27.5\n30.0\n17.7\n52.3\n\nSource: Field data, 2019.", "word_count": 436, "start_char": 39017, "end_char": 41782}
{"chunk_id": "DOC0026__00021", "doc_id": "DOC0026", "chunk_index": 21, "text": "line of observation, one respondent reiterates: “...any\ngovernment that delivers quality services, which are\nconsistent with community interests and that promotes\nthe private-sector growth alongside proper management\nof public resources is not far from the Millennium\nDevelopment Goals...” (Civil Society Advocate). However,\nit remains evident that since the budget in Kabale district\nis a demonstration of political preference, it is true that\nlocal area priorities and preference are ignored, which\nrenders council inefficient. Similarly, if the budget can\nhardly demonstrate a sound financial system, the council\nstands to inefficient in its utilization of economic\nresources. On the whole, the budget, as revealed by the\nstatistics suggests a non-performing budget represented\nby 52.3%. The findings are in agreement with the opinion\nof one key informant: “...Mayors have the powers to\nimplement their policy preferences but these should not\nsuppress citizens’ interests...” (Sub County Speaker). In\npractice, competing\ninterests should be\nanalyzed\ndemocratically than politically suppressing them. It should\n\nbe noted that out the four mechanisms of financial\naccountability used in Kabale district local government,\nservice delivery (77.3%) and financial reporting (76.3%)\nappear to be two practices that propagate sound financial\naccountability.\n\nDISCUSSION", "word_count": 191, "start_char": 41782, "end_char": 43146}
{"chunk_id": "DOC0026__00022", "doc_id": "DOC0026", "chunk_index": 22, "text": "n\npractice, competing\ninterests should be\nanalyzed\ndemocratically than politically suppressing them.I\n\nt should\n\nbe noted that out the four mechanisms of financial\naccountability used in Kabale district local government,\nservice delivery (77.3%) and financial reporting (76.3%)\nappear to be two practices that propagate sound financial\naccountability.D\n\nISCUSSION\n\nThe study sought to establish the financial mechanisms\nthat are used in Kabale district local government.\nParticipants pointed to service delivery are the most\nimportant mechanism of financial accountability in Kabale\ndistrict local government. The findings are line with\n(MOFPED, 2017) which presented how government of\nUganda has over the years introduced a number of\nreforms aimed at enhancing transparency, accountability\nof public resources and improved service delivery. The\nfindings render support to (Rabrenovic, 2009) who\noutlined service delivery as one the mechanisms that can\nensure\nsound\naccountability.\nBased\non\nEuropean Union guidelines, Rabrenovic notes that the\nability of the accounting entity to remain transparent and\ngive evidence of value for money is dependent on the\neffectiveness of the internal controls in place to foretell\nbudgetary problems before they occur.\nThe findings seem to disagree with Auditor General\n(2017) whose report called for the need to ensure quality\nservice delivery as well as citizen participation and\ninvolvement. The disagreement of the findings with\nAuditor general‟s report comes in as corrective evidence\nto the recommendations of the Auditor General‟s report of\n2017. Contrary to Auditor General‟s report, the current\nstudy presented Kabale district local government as\ndelivering services that depict the right type and as\nmeeting the demands of citizens. The findings is in\nagreement with Agwor and Akani (2017) who investigated\nand\nperformance\nof\nlocal\ngovernments in River State, Nigeria; and observed that\nlocal governments are assumed to be performing if the\nprojects and services meet the demands of the citizens in\nthe local areas.\nThe findings indicated pessimistically that Kabale\ndistrict local government solves the problems of citizens.\nThis agrees with Keil (2005) who analyzed the principleagent theory and its application on outsourcing in\nsoftware development. He found that the principles (who\nare the citizens in this case) fail to receives the goods\nand services they pay for because they are limited in\nability to monitor and judge the input and output of the\ncontractors (in this case the local government). Similarly,\nHlavaeek and Hlavaeek (2006) who analyzed the\n“Principal – Agent” problem in the context of the\neconomic survival found that the public empowers\ngovernment officials to promote public welfare using\npublic resources, however, government officials end up\nserving their own interests, which jeopardizes service to\nArinaitwe et al. 107", "word_count": 430, "start_char": 42783, "end_char": 45676}
{"chunk_id": "DOC0026__00023", "doc_id": "DOC0026", "chunk_index": 23, "text": "imilarly,\nHlavaeek and Hlavaeek (2006) who analyzed the\n“Principal – Agent” problem in the context of the\neconomic survival found that the public empowers\ngovernment officials to promote public welfare using\npublic resources, however, government officials end up\nserving their own interests, which jeopardizes service to\nArinaitwe et al. 107\n\nthe public. This is true in the sense that the public lacks\nthe ability to question the conduct and behavior of\ngovernment officials and to impose sanctions where such\nconduct or behaviors fall short of the requirement.\nThe study presented the budget as the least used\nmechanism of financial accountability in the district.\nParticipants disagreed that the budget enables council to\nattend to priorities in the local area. The findings agree\nwith Tsurkan et al., (2016) who noted that financial\naccounting and management accounting cannot be\nneatly compartmentalized in the public sector, where\nmanagement accounting refers to budgeting and control\nrather than accounting solely in the service of managers.\nCertainly, if the budget is an expression of political\npreference, service delivery will be compromised in favor\nof political interests. However, the findings disagree with\nBerner and Smith (2004) who view the budget as a\nmechanism for financial planning. In their view, the\nbudget allows for the achievement of priorities and\nobjectives through the limited fiscal resources. Treated in\nthis angle, the budget can contribute significantly to\ngreater efficiency, effectiveness and accountability within\nthe organization. Participants also disagreed that they\ndemonstrate community preference and that council\nutilizes resources economically. In this view, all public\nactions should embrace citizens‟ preference and work\ntowards achieving it. The findings however, disagree with\nKim et al. (2010) who noted that when various\nstakeholders\ncombine\non\nbudgeting\npreferences, the principle of publicity overrides all the\ncore principles of any budget. Competing interests should\nbe analyzed and prioritized democratically.\n\nCONCLUSION AND POLICY IMPLICATION", "word_count": 306, "start_char": 45335, "end_char": 47435}
{"chunk_id": "DOC0026__00024", "doc_id": "DOC0026", "chunk_index": 24, "text": "n this view, all public\nactions should embrace citizens‟ preference and work\ntowards achieving it.T\n\nhe findings however, disagree with\nKim et al. (2010) who noted that when various\nstakeholders\ncombine\non\nbudgeting\npreferences, the principle of publicity overrides all the\ncore principles of any budget.C\n\nompeting interests should\nbe analyzed and prioritized democratically.C\n\nONCLUSION AND POLICY IMPLICATION\n\nThe study examined financial accountability mechanisms\nin Kabale district local government, Uganda. Given the\nfour financial accountability mechanisms investigated,\nservice delivery is the most widely applied financial\nmechanism\nin\nKabale\ndistrict\nlocal\ngovernment. Given the current study, it is clear that most\nof the projects implemented in the district align with the\ndemands of the local population and citizens‟ welfare, in\nparticular. The study found that participants could\nevaluate the performance of the district in terms of\nservice delivery because such services are visible to the\npublic compared to financial reporting, expenditures and\nthe\nbudget,\nwhich\nrequire\ntechnical\njudgment.\nNotwithstanding the technical requirements to evaluate\nfinancial performance in terms of financial reporting,\nexpenditure control, and the budget; this study found that\nthe district achieves much of her budgetary goals under\nsupplementary budget approvals. The budget was indeed\nthe least measure of financial performance strongly\nbecause of the irregularities in salaries and wages\nexpenditures, and its political preference. Therefore, local\n\n108 J. Account. Taxation\n\ngovernments should ensure their budgets demonstrate\ncommunity preference, pay salaries and wages as\napproved in the budget, and standardize their reporting\non liabilities. Due to the scope of this paper, which could\nnot quantitatively relate financial accountability and\nservice delivery, future researchers should consider\nassessing the effect of financial accountability on service\ndelivery in local governments.\n\nCONFLICT OF INTERESTS\n\nThe authors have not declared any conflict of interest.", "word_count": 289, "start_char": 47024, "end_char": 49098}
