{"chunk_id": "DOC0074__00000", "doc_id": "DOC0074", "chunk_index": 0, "text": "THE IMPACT OF EMERGING TECHNOLOGIES ON LAST MILE DELIVERY OPERATIONS\nCASE OF STUDY: DALSEYH HILLBOM LYNN, UGANDA (DHL)\n\nMARTHA INGABIRE\nJ22B12/117\n\nA DISSERTATION SUBMITTED TO THE SCHOOL OF BUSINESS, IN PARTIAL\nFULFILLMENT OF THE REQUIREMENTS FOR THE AWARD OF A DEGREE OF BACHELOR\nOF PROCUREMENT AND LOGISTICS MANAGEMENT OF UGANDA CHRISTIAN\nUNIVERSITY\n\nJune, 2024\n\ni\n\nDECLARATION\n\nI, INGABIRE MARTHA, REG NO: J22B12/117 do hereby declare that “The impacts of\nemerging technology on last mile delivery\" adoption on organizational performance. A case\nstudy of DHL. This research report has never been published by any other person and so is\npurely by myself with a close guidance of my academic supervisor.\n\nSignature .....................................................\nName INGABIRE MARTHA\n\nDate........................................................\n\nii\n\nAPPROVAL.\n\nThis research report has been submitted by INGABIRE MARTHA, REG No: J22B12/117 with\nthe approval of my academic supervisor.\n\nSignature: .........................................\n\nName: MR: MULOOSI PASCAL\n\nDate: ......... /06/2024\n\niii\n\nDEDICATION\nI dedicate this study report to God, my family, and my friends in appreciation of their love,\nconcern, and support throughout my academic career. They gave me a strong drive to learn and\nmade it simple for me to get a top-notch education. God be with you everyone.\n\niv\n\nACKNOWLEDGEMENT\nI want to thank Almighty God first and foremost for providing me with the health and strength I\nneeded to finish this thesis. Additionally, I would like to express my gratitude to my supervisor,\nMr. Muloosi Pascal, for his advice and helpful criticism from the start of the research proposal\nuntil the finishing the thesis document. I would like to thank the entire DHL personnel, as well as\nmy responders and anybody else who assisted me in gathering data and supporting\ndocumentation for this thesis project. I am grateful to all of my friends for their encouragement\nand support throughout my thesis. Above all, my family—especially my parents, who have given\nme vital guidance and support—deserves my sincere appreciation. You have supported me\nthrough the good times and the bad during my time as a student at Uganda Christian University,\nnot just during this thesis work. Lastly, I would want to thank all of my relatives and friends for\ntheir support throughout.\n\nv", "word_count": 360, "start_char": 0, "end_char": 2374}
{"chunk_id": "DOC0074__00001", "doc_id": "DOC0074", "chunk_index": 1, "text": "ou have supported me\nthrough the good times and the bad during my time as a student at Uganda Christian University,\nnot just during this thesis work.L\n\nastly, I would want to thank all of my relatives and friends for\ntheir support throughout.\n\nv\n\nABSTRACT\nThe last mile delivery segment of logistics has witnessed a transformative evolution with the\nadvent of emerging technologies. This dissertation explores the multifaceted impact of these\ntechnologies on last mile delivery operations, considering both the opportunities and challenges\nthey present. Through a comprehensive review of literature, analysis of case studies, and\nempirical research, this study examines the adoption and integration of technologies such as\nautonomous vehicles, drones, robotics, and artificial intelligence in last mile delivery processes.\nThe research delves into the efficiency gains, cost savings, and environmental benefits facilitated\nby these technologies, as well as their implications for workforce dynamics and urban\ninfrastructure. Furthermore, it investigates the regulatory frameworks and ethical considerations\nshaping the deployment of emerging technologies in last mile delivery. By synthesizing\ntheoretical insights with real-world insights, this dissertation contributes to a deeper\nunderstanding of the complex interplay between technology, logistics, and society.\nUltimately, this study underscores the importance of strategic planning, collaboration, and\nadaptation in leveraging emerging technologies to optimize last mile delivery networks. It\nprovides valuable insights and recommendations for industry stakeholders, policymakers, and\nresearchers to navigate the dynamic landscape of modern logistics and harness the potential of\ntechnology-driven innovations for sustainable and efficient last mile delivery.\n\nvi\n\nLIST OF ACRONYMS\n\nDHL DALSEYH HILLBOM LYNN, UGANDA\nIOT INTERNET OF THINGS\nIT INFORMATION TECHNOLOGY\nAI ARTIFICAL INTELLIGENCE\nE-COMMERCE ELECTRONIC COMMERCE\nP2P PEER TO PEER\n\nvii\n\nTABLE OF CONTENTS\nDECLARATION ............................................................................................................................. i\nAPPROVAL. .................................................................................................................................. ii\nDEDICATION ............................................................................................................................... iii\nACKNOWLEDGEMENT ............................................................................................................. iv\nABSTRACT .................................................................................................................................... v\nLIST OF ACRONYMS ................................................................................................................. vi\nCHAPTER 0NE ............................................................................................................................ 1\n1.0 INTRODUCTION ........................................................................................................................... 1\n1.1BACKGROUND OF THE STUDY ................................................................................... 1\n1.2 STATEMENT OF THE PROBLEM ................................................................................. 4\n1.3 SPECIFIC OBJECTIVES OF THE STUDY .................................................................... 4\n1.4RESEARCH QUESTIONS ................................................................................................ 4\n1.6 SCOPE OF THE STUDY.................................................................................................. 6\n1.7 LIMITATIONS OF THE STUDY ................................................................................................ 6\nCHAPTER TWO: Literature Review ......................................................................................... 7\n2.0 INTRODUCTION ........................................................................................................................... 7\n2.1 THE EFFECTIVENESS OF TECHNOLOGY TO LAST MILE DELIVERY ...................... 8\n2.2 TECHNOLOGICAL TRENDS IN LAST MILE DELIVERY ................................................. 9\n2.3 CHALLENGES IN IMPLEMENTING TECHNOLOGY TO LAST-MILE DELIVERY . 12\n2.4 METRICS AND KEY PERFORMANCE INDICATORS (KPIs) TO MONITOR THE\nEFFECTIVENESS AND IMPACT OF TECHNOLOGY ON DELIVERY EFFICIENCY ..... 13\nCHAPTER THREE: Methodology ........................................................................................... 16\n3.0 INTRODUCTION ......................................................................................................................... 16\n3.1 RESEARCH DESIGN .................................................................................................................. 16\n\nviii", "word_count": 417, "start_char": 2129, "end_char": 7030}
{"chunk_id": "DOC0074__00002", "doc_id": "DOC0074", "chunk_index": 2, "text": "3.2 AREA OF STUDY ........................................................................................................................ 17\n3.3 SAMPLE SIZE .............................................................................................................................. 17\n3.4 SAMPLES DESIGN AND PROCEDURE ................................................................................ 17\n3.4.1PURPOSIVE SAMPLING ............................................................................................ 18\n3.4.2RANDOM SAMPLING ................................................................................................ 18\n3.4.3 SOURCES OF DATA .................................................................................................. 18\n3.5 DATA COLLECTION INSTRUMENTS .................................................................................. 18\n3.6 QUESTIONNAIRE GUIDE ........................................................................................................ 19\n3.7 DATA ANALYSIS ....................................................................................................................... 19\n3.8 ETHICAL CONSIDERATION ................................................................................................... 20\nCHAPTER FOUR ....................................................................................................................... 21\n4.0 INTRODUCTION ......................................................................................................................... 21\n4.1 FINDINGS ON BIO DATA OF THE RESPONDENTS ......................................................... 21\n4.1.1 ACADEMIC QUALIFICATIONS............................................................................... 22\n4.1.2 YEARS OF SERVICE ................................................................................................. 23\n4.1.2 DEPARTMENTS THAT WERE ABLE TO RESPOND ............................................ 23\n4.2 FINDINGS ON THE CHALLENGES FACED WHILE USING TECHNOLOGY IN\nLAST MILE DELIVERY ................................................................................................................... 24\n4.3 FINDINGS ON THE EFFECTIVENESS OF TECHNOLOGY IN LAST MILE\nDELIVERY ........................................................................................................................................... 25\n4.4 FINDINGS ON THE FACTORS IN MEASURING THE SUCCESS OF TECHNOLOGY\nADOPTION INITIATIVES IN LAST MILE DELIVERY ........................................................... 27\n4.4 ADDITIONAL INFORMATION ACQUIRED ........................................................................ 29\n4.4.1Qn: \"In case there is any other challenges, measurements and key performance\nindicators (Kpi's) to track the success of technology adoption initiatives and the\neffectiveness of technology on delivery efficiency ............................................................... 29\n\nix\n\nCHAPTER FIVE ........................................................................................................................ 31\nSUMMARY OF THE FINDINGS, CONCLUSION AND RECOMMENDATIONS .............. 31\n5.0 Introduction .................................................................................................................................... 31\n5.1 SUMMARY OF THE STUDY FINDINGS .............................................................................. 31\n5.2 THE FINDINGS OF THE CHALLENGES FACED WHILE USING TECHNOLOGY ON\nLAST MILE DELIVERY OPERATIONS DHL. ............................................................................ 31\n5.3 FINDINGS ON THE EFFECTIVENESS OF TECHNOLOGY ON\nLASTMILEDELIVERY OPERATIONS AT DHL ........................................................................ 32\n5.4 FINDINGS ON THE FACTORS IN MEASURING THE SUCCESS OF TECHNOLOGY\nADOPTION INITIATIVES LAST MILE DELIVERY AT DHL ................................................ 33\n5.5 SUMMARY OF FINDINGS ....................................................................................................... 34\n5.6 RECOMMENDATIONS .............................................................................................................. 35\nReferences ..................................................................................................................................... 40", "word_count": 266, "start_char": 7030, "end_char": 11420}
{"chunk_id": "DOC0074__00003", "doc_id": "DOC0074", "chunk_index": 3, "text": "CHAPTER 0NE\n1.0 INTRODUCTION\nThe study looks at how last-mile delivery operations are affected by developing technology. This\nchapter includes the study's background to study, problem statement, research objective, and\nspecific goals, research Issues, The study's scope Importance of the research, expected issues,\ntheir resolution, and the specification of variables in practice.\n1.1BACKGROUND OF THE STUDY\nTechnology is a broad concept that deals with use and knowledge of tools and crafts and how its\nuse affects the ability to control and adapt to the social and physical environment. (Banta, July\n2009, ) In the context of business, technology encompasses a wide range of tools, software,\nhardware, and systems that streamline operations, enhance communication, and drive innovation.\nIn the paper by (Jucha, (2021)) addresses technology developments in the delivery sector with an\nemphasis on effectiveness and client support. Route optimization, real-time tracking,\nautonomous sorting, mobile apps, contactless delivery, drones, autonomous cars, data analytics\nfor demand forecasting, and cybersecurity measures are some of the examples of innovations.\nLast mile delivery refers to the final leg of the delivery process, where goods are transported\nfrom a distribution center or hub to the end consumer's doorstep or desired location. (Puri,\n2022)This stage of delivery has evolved significantly over time. In the past, last mile delivery\nwas typically handled by individual couriers or postal workers who would manually deliver\npackages to each customer's address. These couriers would often navigate through busy city\nstreets and face challenges such as traffic congestion, limited parking, and difficult-to-reach\nlocations. However, with the advancement of technology and the rise of e-commerce, last mile\ndelivery has undergone significant changes.\nWe explore the historical development of last-mile delivery, tracing its evolution from early\nmethods of transportation to the innovative solutions and challenges faced in the contemporary\nera. By examining key milestones, trends, and shifts in priorities within supply chain\nmanagement, we aim to provide a comprehensive understanding of how last-mile delivery has", "word_count": 320, "start_char": 11420, "end_char": 13644}
{"chunk_id": "DOC0074__00004", "doc_id": "DOC0074", "chunk_index": 4, "text": "e explore the historical development of last-mile delivery, tracing its evolution from early\nmethods of transportation to the innovative solutions and challenges faced in the contemporary\nera.B\n\ny examining key milestones, trends, and shifts in priorities within supply chain\nmanagement, we aim to provide a comprehensive understanding of how last-mile delivery has\n\nevolved over time and its increasing importance in meeting the demands of today's dynamic\nmarketplace.\nLogistics, in its essence, is the management of the flow of goods and services from the point of\norigin to the point of consumption. It encompasses various activities such as transportation,\nwarehousing, inventory management, packaging, and information management. The significance\nof logistics lies in its role as the backbone of global trade and commerce, facilitating the efficient\nmovement of goods across supply chains, ultimately ensuring products reach consumers in a\ntimely manner.\nThe evolution of technology in the logistics sector has been intertwined with the progression of\nhuman civilization. Early logistics operations relied heavily on manual labor and basic\ntransportation methods, such as carts and pack animals. With the advent of civilization,\ncivilizations began developing more sophisticated transportation methods, such as the invention\nof the wheel and the utilization of waterways for trade (mecalux, 2023).\nThe industrial revolution marked a significant turning point in logistics technology with the\ninvention of the steam engine. Steam-powered locomotives and steamships revolutionized\ntransportation, enabling goods to be transported over long distances more quickly and efficiently.\nAdditionally, the introduction of the assembly line by Henry Ford in the early 20th century\nstreamlined manufacturing processes, leading to increased production and the need for more\nefficient logistics management. (Sharma, 2020)\nThe emergence of computer technology in the mid-20th century brought about further\nadvancements in logistics. Computerized inventory management systems enabled companies to\ntrack and manage inventory levels more effectively, reducing waste and improving efficiency in\nsupply chain operations (Banta, July 2009, ).\nIn the contemporary landscape of logistics technology, digitalization, automation, and data\nanalytics play pivotal roles in transforming traditional logistics practices. The integration of\nInternet of Things (IoT) sensors into logistics operations allows for real-time monitoring of\nshipments, enabling companies to track the location, condition, and status of goods throughout\nthe supply chain (Mouha, 2021).", "word_count": 366, "start_char": 13279, "end_char": 15915}
{"chunk_id": "DOC0074__00005", "doc_id": "DOC0074", "chunk_index": 5, "text": "n the contemporary landscape of logistics technology, digitalization, automation, and data\nanalytics play pivotal roles in transforming traditional logistics practices.T\n\nhe integration of\nInternet of Things (IoT) sensors into logistics operations allows for real-time monitoring of\nshipments, enabling companies to track the location, condition, and status of goods throughout\nthe supply chain (Mouha, 2021).\n\nBlock chain technology has emerged as a game-changer in supply chain transparency, providing\na secure and transparent way to record and track transactions across multiple parties. By creating\nan immutable ledger of transactions, block chain technology enhances trust and accountability in\nsupply chain management (Dutta, 2020).\nArtificial intelligence (AI) algorithms have revolutionized logistics with predictive analytics\ncapabilities. AI-powered systems analyze vast amounts of data to forecast demand, optimize\nroute planning, and anticipate potential disruptions in supply chain operations, enabling\ncompanies to make data-driven decisions and improve efficiency (Ushakov, 2022).\nLast-mile delivery, the final leg of the delivery process from distribution center to the end\ncustomer, has become increasingly important in urban logistics and e-commerce fulfillment.\nAdvancements in logistics technology have enabled companies to optimize last-mile delivery\noperations through innovative solutions such as route optimization algorithms, real-time tracking\nsystems, and customer engagement platforms.\nCompanies leverage technology to optimize delivery routes, minimize delivery times, and reduce\ntransportation costs in the last mile. Real-time tracking systems provide customers with visibility\ninto the status of their deliveries, enhancing transparency and customer satisfaction.\nAdditionally, companies utilize customer engagement platforms to communicate with customers,\nprovide delivery updates, and gather feedback, further enhancing the overall delivery experience.\n(Jucha, (2021))\nE-commerce's ascent (1990s–2000s) Last-mile delivery saw a major transformation in the 1990s\nand 2000s with the development of e-commerce. In order to properly fulfill consumer orders,\nonline merchants like Amazon invented new logistics methods, which raised demand for\ndeliveries that were quicker and more dependable. (Corejova, 2022)The global retail ecommerce sales have grown from 1.34 trillion in 2014 to 4.28 trillion in 2020. Further growth is\nexpected, as experts predict sales of 6.39 trillion by 2024, amounting for almost 22% of total\nretail sales (Cramer-Flood, 2021).", "word_count": 342, "start_char": 15506, "end_char": 18090}
{"chunk_id": "DOC0074__00006", "doc_id": "DOC0074", "chunk_index": 6, "text": "urther growth is\nexpected, as experts predict sales of 6.39 trillion by 2024, amounting for almost 22% of total\nretail sales (Cramer-Flood, 2021).\n\n1.2 STATEMENT OF THE PROBLEM\nThe last-mile delivery landscape is considered a rapidly transforming thanks to a surge in\ninnovative technologies. While DHL has made significant strides in optimizing logistics and\nefficiency (Moradi, 2023)a closer look reveals an underutilization of these advancements within\ntheir last-mile operations. This underutilization manifests in the limited adoption of solutions like\nadvanced route optimization algorithms, real-time tracking enhancements, and autonomous\nvehicles. As a result, DHL isn't reaping the full benefits of these technologies, hindering their\nability to achieve peak efficiency, customer satisfaction, and cost-effectiveness. This gap\nbecomes even more critical when considering the evolving landscape of customer expectations\nand industry standards. DHL's current approach, while functional, risks falling behind\ncompetitors who are more aggressively embracing cutting-edge solutions. Additionally, the\ngrowing demand for faster, transparent, and sustainable deliveries further emphasizes the need\nfor DHL to bridge this technological gap (Sorooshian, (2022)). To stay ahead, a comprehensive\nreview and strategic integration of advanced technologies are crucial. By aligning their last-mile\noperations with the ever-changing demands of the logistics landscape, DHL can ensure they\nremain competitive and deliver exceptional customer experiences.\n1.3 SPECIFIC OBJECTIVES OF THE STUDY\nI.\nTo examine the effectiveness of technology to last mile delivery\nII.\nTo examine create measurements and key performance indicators (KPIs) to track the\nsuccess of technology adoption initiatives and their effects on delivery efficiency.\nIII.\nTo examine the challenges that come with implementing technology in the companies\n\n1.4RESEARCH QUESTIONS\nI.\nWhat are the effectiveness of technology to last mile delivery\nII.\nWhat create measurement and key performance indicators that will track the success of\ntechnology adoption initiatives and their effects on delivery efficiency at DHL?\nIII.\nWhat are the challenges that come with implementing technology at DHL?", "word_count": 310, "start_char": 17944, "end_char": 20190}
{"chunk_id": "DOC0074__00007", "doc_id": "DOC0074", "chunk_index": 7, "text": "hat are the effectiveness of technology to last mile delivery\nII.W\n\nhat create measurement and key performance indicators that will track the success of\ntechnology adoption initiatives and their effects on delivery efficiency at DHL?I\n\nII.W\n\nhat are the challenges that come with implementing technology at DHL?\n\n1.5 SIGNIFICANCE OF THE STUDY\nIn order to maintain competitiveness, improve customer happiness, and adjust to the everchanging landscape of technology-driven logistics operations, the logistics industry must\ncomprehend the complexities and difficulties associated with integrating developing\ntechnologies in last-mile delivery. In order to enable logistics stakeholders to make wise\ndecisions and carefully apply cutting-edge technology for long-term success, this study aims to\nprovide insightful information.\nThe study's conclusions can direct future investigations into developing technologies and lastmile delivery. It offers a foundation for investigating novel directions, improving current\ntechnology, and dealing with new problems.\nThe study supports the development of sustainable practices by assessing the environmental\nimpact of developing technologies in last-mile delivery. By using this information, logistics\ncompanies may reduce their carbon footprint and promote environmental sustainability by\nimplementing eco-friendly measures.\nThe study will help management and the workforce comprehend the abilities and know-how\nneeded to adjust to last-mile delivery's technology advancements. In order to guarantee a\nseamless transition to technologically sophisticated procedures, this expertise is essential for\nworkforce development and training programs.\nLogistics companies may optimize last-mile delivery processes by studying the opportunities and\nchallenges posed by developing technology. This can therefore result in increased customer\nsatisfaction, decreased operating expenses, and higher efficiency.\nLogistics firms, online retailers, and other industry participants will be able to use the study's\npractical insights to help them decide how best to incorporate cutting-edge technologies into lastmile delivery. This covers investment choices, operational optimizations, and strategic planning.\nCompanies may adjust their services to match changing customer expectations by knowing how\ncustomers view and interact with last-mile delivery services enhanced by developing\n\ntechnologies. Better client happiness, loyalty, and a competitive advantage in the market may\nresult from this.\n1.6 SCOPE OF THE STUDY\nThe scope of the study on the impact of emerging technologies on last-mile delivery in logistics\nencompassed several key dimensions, each aligned with the specific objectives and research\nquestions outlined earlier.\n1.6.1GEOGRAPHICAL SCOPE\nThe study focused on DHL a German logistics company providing international shipping and\ncourier services but particularly DHL Kampala, Uganda which is located on Kampala Road,\nMabirizi Complex Building, First Floor Room 03, and Kampala, Uganda.\n1.6.2 TIME SCOPE\nThe study covered the period between 2019 and 2024 as this was the period when the company\nhad inefficiencies in the supply chain system.", "word_count": 432, "start_char": 19879, "end_char": 23060}
{"chunk_id": "DOC0074__00008", "doc_id": "DOC0074", "chunk_index": 8, "text": "1.7 LIMITATIONS OF THE STUDY\nIt was difficult for the researcher to answer inquiries from respondents when they didn't actually\nknow the answers. Giving people more likely scale questions to answer, where they can check\nthe options at will and minimal information is required for the open-ended questions, can fix this\nproblem.\nDue to the fact that the researcher paid for transportation to and from the company, printing,\nstationery, binding, and other expenses, the researcher was limited by financial limitations. This\nwas resolved by asking friends and family for money so she can complete the exercise.\nOne potential constraint could be the respondent's unwillingness to provide the researcher with\nthe necessary information, as certain information may be confidential and they may choose not\nto share it with the researcher. We'll tried to persuade them that the data is solely intended for\nstudy and has no other use in order to resolve this.\n\nCHAPTER TWO: Literature Review\n2.0 INTRODUCTION\nAccording to Ronald and William (2003), technology is a system of both simple and complete,\nelectronic, hardware devices and informal communication chains or computer-based information\nsystems that use hardware and software, internet, and other telecommunication networks that\ntransform data resources into endless data of information products.\n(Casella, 2022)The late 20th and early 21st centuries witnessed the rise of automation and\ninformation technology in logistics. Automated warehouses, robotic systems, and advanced\nmaterial handling equipment streamlined operations and improved efficiency. Furthermore, the\nadvent of computer systems and software facilitated the management of inventory, transportation\nplanning, and supply chain coordination,leading to greater visibility and control over logistics\nprocesses.\nThe advent of the internet and e-commerce in the late 20th and early 21st centuries transformed\nlast-mile delivery. E-commerce platforms and online marketplaces revolutionized retail,\nallowing consumers to shop for goods online and have them delivered directly to their doorsteps.\n(Peppel M. R., 2022)Last-mile delivery became a critical focus for logistics companies and\nretailers, with a growing emphasis on speed, convenience, and customer experience.\nAdvancements in logistics technology, such as route optimization software, real-time tracking\nsystems, and alternative delivery solutions (e.g., drones, autonomous vehicles), have further\ntransformed last-mile delivery, enabling companies to optimize delivery routes, provide real-time\ntracking and visibility, and offer innovative delivery options to meet the evolving needs of\ncustomers. Consequently, manufacturing, logistics, and transportation systems are significantly\nimpacted by technologies such as cyber-physical systems (CPS) and the Internet of Things (IoT).\n(Kostrzewski, 2022)", "word_count": 399, "start_char": 23060, "end_char": 25926}
{"chunk_id": "DOC0074__00009", "doc_id": "DOC0074", "chunk_index": 9, "text": "onsequently, manufacturing, logistics, and transportation systems are significantly\nimpacted by technologies such as cyber-physical systems (CPS) and the Internet of Things (IoT).\n(Kostrzewski, 2022)\n\n2.1 THE EFFECTIVENESS OF TECHNOLOGY TO LAST MILE DELIVERY\nLast-mile delivery, the final step in the logistics chain, plays a crucial role in customer\nsatisfaction and business success. With the rise of e-commerce and consumer demand for fast\nand reliable deliveries, the effectiveness of last-mile delivery has become increasingly important.\nTechnology has emerged as a powerful tool to optimize last-mile delivery processes, enhancing\nefficiency, accuracy, and customer experience. In this essay, we will explore the effectiveness of\ntechnology in last-mile delivery through seven key points.\nAccording to (Koh L. Y., Consumer acceptance of the autonomous robot in last-mile delivery: A\ncombined perspective of resource-matching, perceived risk and value theories. Transportation\nResearch Part A: Policy and Practice, 2024), One of the primary benefits of technology in lastmile delivery is automation. Advanced algorithms and machine learning enables companies to\noptimize delivery routes, minimize delivery times, and reduce costs. Automated route planning\nsoftware is able to track traffic patterns, weather conditions, and delivery windows to create the\nmost efficient routes for drivers. These companies can achieve higher delivery densities, lower\nfuel consumption, and ultimately, faster deliveries. (Chen, 2021).\nTechnology provides real-time tracking and visibility throughout the delivery process, enabling\nboth businesses and customers to monitor shipments accurately (Shukla, 2022). GPS tracking\nsystems allow customers to track their deliveries in real-time, providing them with updates on\nthe status and estimated time of arrival. Similarly, businesses can track their vehicles and\nmonitor delivery progress to ensure timely and efficient service. (Kafile, 2023)Real-time\nvisibility not only enhances customer satisfaction but also improves operational transparency and\naccountability. According to (Peppel M. S., 2024) delivery management platforms provide\ncomprehensive solutions for managing last-mile delivery operations. These platforms integrate\nvarious functionalities such as order management, route optimization, driver dispatching, and\ncustomer communication into a single interface. Through centralized platforms, companies can\nstreamline their delivery processes, improve coordination between stakeholders, and enhance\noverall efficiency. (Alverhed, 2024) Moreover, these platforms often offer customizable features\nand scalability, allowing businesses to adapt to changing requirements and scale their operations\nas needed.", "word_count": 362, "start_char": 25727, "end_char": 28479}
{"chunk_id": "DOC0074__00010", "doc_id": "DOC0074", "chunk_index": 10, "text": "hrough centralized platforms, companies can\nstreamline their delivery processes, improve coordination between stakeholders, and enhance\noverall efficiency. (Alverhed, 2024) Moreover, these platforms often offer customizable features\nand scalability, allowing businesses to adapt to changing requirements and scale their operations\nas needed.\n\nThe COVID-19 pandemic has accelerated the adoption of contactless delivery solutions, further\nhighlighting the importance of technology in last-mile delivery. (Koh L. Y., 2024) Contactless\ndelivery options, such as doorstep delivery, self-service lockers, and drone delivery, minimize\nphysical contact between drivers and customers, reducing the risk of transmission. Technology\nenables the seamless implementation of these solutions, ensuring safe and hygienic delivery\nexperiences for both parties (Bergi, 2021). Contactless delivery not only addresses immediate\nhealth concerns but also sets a precedent for future delivery standards. Effective last-mile\ndelivery relies on collaboration and integration between various stakeholders, including retailers,\ncarriers, drivers, and customers. (Judijanto, 2024) Technology facilitates seamless collaboration\nthrough integration with existing systems and platforms. APIs (Application Programming\nInterfaces) enable different software applications to communicate and share data, allowing for\nthe seamless exchange of information between stakeholders. By fostering collaboration and\nintegration, technology promotes interoperability, efficiency, and service consistency across the\ndelivery ecosystem. (Ko, 2020)\nTechnology-driven innovation is essential for the continuous improvement of last-mile delivery\noperations. As consumer preferences and market dynamics evolve, companies must innovate and\nadapt to stay competitive (Krishnan, 2024). Emerging technologies such as artificial intelligence,\nrobotics, and block chain offer new opportunities to enhance last-mile delivery efficiency and\ncustomer experience. By investing in research and development, companies can stay ahead of the\ncurve, drive innovation in the industry, and deliver value-added services to customers.\n2.2 TECHNOLOGICAL TRENDS IN LAST MILE DELIVERY\nTechnological advancements have been reshaping last-mile delivery, optimizing routes,\nenhancing tracking capabilities, and introducing innovative delivery methods. Supply chain\nmanagement has advanced significantly as a result of the convergence of digitalization,\nautomation, and data analytics in the modern logistics technology environment. Modern\nadvancements in artificial intelligence (AI), block chain technology, Internet of Things (IoT)\nsensors, and AI algorithms are revolutionizing old logistical methods and bringing forth\nincreased cost-effectiveness, efficiency, and transparency.", "word_count": 347, "start_char": 28138, "end_char": 30943}
{"chunk_id": "DOC0074__00011", "doc_id": "DOC0074", "chunk_index": 11, "text": "upply chain\nmanagement has advanced significantly as a result of the convergence of digitalization,\nautomation, and data analytics in the modern logistics technology environment.M\n\nodern\nadvancements in artificial intelligence (AI), block chain technology, Internet of Things (IoT)\nsensors, and AI algorithms are revolutionizing old logistical methods and bringing forth\nincreased cost-effectiveness, efficiency, and transparency.\n\nRoute optimization plays a crucial role in last-mile delivery efficiency. Several studies have\nexplored algorithms and models for optimizing delivery routes to minimize costs, reduce\ndelivery times, and improve resource utilization. (Jucha, (2021))\nLiterature suggests that heuristic algorithms, metaheuristic algorithms (such as genetic\nalgorithms and simulated annealing), and mathematical optimization models (such as integer\nlinear programming and vehicle routing problem formulations) are commonly used for route\noptimization in last-mile delivery.\nResearch has focused on developing algorithms that consider various constraints and factors,\nincluding traffic congestion, vehicle capacity, delivery time windows, customer preferences, and\nenvironmental concerns.\nThe Internet of Things (IoT) is basically like a system for connecting computer devices,\nmechanical and digital machines, objects, or individuals provided with a unique system (UIDs)\nand without transfer to transmit data over an ability human-to-human or computer-to-human\nrelation. (Laghari, 2021)Sensors embedded in physical objects, allow them to collect and\ntransmit data over the internet. The sensors are used to track shipments, monitor environmental\nconditions (such as temperature and humidity), and optimize fleet management. (Kostrzewski,\n2022) Temperature sensors in refrigerated containers ensure that perishable goods remain within\nthe required temperature range during transportation, reducing the risk of spoilage. (Mouha,\n2021) GPS trackers enable real-time tracking of shipments, providing visibility into their\nlocation and estimated arrival time which improves logistics planning and customer service by\nreducing delivery delays.\nBlockchain technology are shared and distributed data structures or ledgers that can securely\nstore digital transactions without using a central point of authority. More importantly, block\nchains allow for the automated execution of smart contracts in peer-to-peer (P2P) networks [9]\n(Dutta, 2020). They can alternatively be seen as databases that permit multiple users to make\nchanges in the ledger simultaneously, which can result in multiple chain versions. In logistics,\nblock chain ensures supply chain transparency, traceability, and security by creating an\nimmutable record of every transaction or event such as food companies use block chain to track\nthe origin of ingredients and verify their authenticity, enhancing food safety and compliance with\nregulations. Retailers and manufacturers use block chain to trace the movement of products", "word_count": 401, "start_char": 30513, "end_char": 33511}
{"chunk_id": "DOC0074__00012", "doc_id": "DOC0074", "chunk_index": 12, "text": "n logistics,\nblock chain ensures supply chain transparency, traceability, and security by creating an\nimmutable record of every transaction or event such as food companies use block chain to track\nthe origin of ingredients and verify their authenticity, enhancing food safety and compliance with\nregulations.R\n\netailers and manufacturers use block chain to trace the movement of products\n\nthroughout the supply chain, reducing the risk of counterfeit goods and improving product recall\nprocesses. (Andoni, 2019)\nArtificial Intelligence (AI) Artificial intelligence (AI) is a broad area of computer science that\nmakes machines function like a human brain. It is used to address issues that are difficult to\nclarify using traditional computational techniques. AI was first discovered in 1956 by John\nMcCarthy but failed to achieve its objectives. (Abduljabbar, 2019) The algorithms analyze large\nvolumes of data to identify patterns, trends, and anomalies, enabling predictive analytics and\nactionable insights. In logistics, AI is used for demand forecasting, route optimization, and\npredictive maintenance. AI-powered demand forecasting algorithms analyze historical sales\ndata, market trends, and external factors (such as weather) to predict future demand with greater\naccuracy. This reduces inventory holding costs and stock outs. AI-driven route optimization\nsoftware optimizes delivery routes based on factors like traffic conditions, vehicle capacity, and\ncustomer preferences, reducing fuel consumption and transportation costs. (Ushakov, 2022)\nLast-mile delivery holds immense significance in urban logistics and e-commerce fulfillment, as\nit represents the final step in getting goods from a distribution center to the customer's doorstep.\nIn urban areas, where population density is high and traffic congestion is common, efficient lastmile delivery is crucial for timely and cost-effective delivery. Moreover, in the context of ecommerce, where customers expect fast and convenient delivery options, optimizing the last mile\nis essential for enhancing customer satisfaction and retention.\nIn e-commerce fulfillment, last-mile delivery plays a critical role in shaping the customer\nexperience and influencing purchasing decisions. Customers expect fast, reliable, and convenient\ndelivery options, and the success of e-commerce companies is hinged on their ability to meet\nthese expectations.", "word_count": 334, "start_char": 33124, "end_char": 35525}
{"chunk_id": "DOC0074__00013", "doc_id": "DOC0074", "chunk_index": 13, "text": "n e-commerce fulfillment, last-mile delivery plays a critical role in shaping the customer\nexperience and influencing purchasing decisions.C\n\nustomers expect fast, reliable, and convenient\ndelivery options, and the success of e-commerce companies is hinged on their ability to meet\nthese expectations.\n\n2.3 CHALLENGES IN IMPLEMENTING TECHNOLOGY TO LAST-MILE\nDELIVERY\nThe exponential growth of e-commerce, particularly evident during the COVID-19 pandemic,\nhas intensified the challenges associated with last-mile deliveries. Defined as the final stage of\nthe supply chain, last-mile delivery encounters complexities exacerbated by shifts in consumer\nbehavior and rapid urbanization. These challenges manifest in congestion, prolonged delivery\ntimes, and sustainability concerns, as noted by (Alverhed, 2024).\nWhile implementing technology in last-mile delivery offers numerous advantages, it also\npresents several hurdles that companies must navigate to realize its full potential. Chief among\nthese challenges is the significant upfront investment required to adopt and integrate new\ntechnologies into existing delivery processes. This investment encompasses not only the\nacquisition of hardware like GPS trackers, handheld devices, or delivery drones but also the\nimplementation of software solutions such as route optimization algorithms and customer\ntracking systems. (mohammad, 2023) highlights the critical role of these technologies in\nadvancing logistics, particularly in urban areas.\nIntegrating new technology into the last-mile delivery ecosystem necessitates adjustments to\nestablished workflows and comprehensive employee training programs. Employees need time to\nfamiliarize themselves with new tools and systems, which may temporarily disrupt operations\nand productivity. To mitigate these disruptions, companies must invest in thorough training\nprograms and provide ongoing support to facilitate smooth adoption.\nAnother formidable challenge lies in managing and maintaining the intricate technology\ninfrastructure essential for efficient last-mile delivery. This includes ensuring the reliability and\nsecurity of hardware and software systems, promptly addressing technical issues, and staying\ncurrent with software updates. (Merchán, 2021)underscores the importance of regular\nmaintenance and monitoring for delivery drones or autonomous vehicles to ensure optimal\nperformance and safety. The relentless pace of technological innovation necessitates continuous\nevaluation and upgrading of technology solutions to remain competitive. However, this poses a\nchallenge for businesses with limited resources or expertise in emerging technologies. Strategic\nplanning and investment are essential for identifying technologies that offer the most significant\nbenefits to last-mile delivery operations.", "word_count": 364, "start_char": 35224, "end_char": 38035}
{"chunk_id": "DOC0074__00014", "doc_id": "DOC0074", "chunk_index": 14, "text": "he relentless pace of technological innovation necessitates continuous\nevaluation and upgrading of technology solutions to remain competitive.H\n\nowever, this poses a\nchallenge for businesses with limited resources or expertise in emerging technologies.S\n\ntrategic\nplanning and investment are essential for identifying technologies that offer the most significant\nbenefits to last-mile delivery operations.\n\nMoreover, the integration of technology introduces new cybersecurity risks that demand vigilant\nmitigation efforts. As delivery operations become increasingly reliant on interconnected devices\nand digital platforms, they become more susceptible to cyber threats such as data breaches or\nransom ware attacks. Protecting sensitive customer information and ensuring the integrity of\ndelivery systems require robust cybersecurity measures.\nAdditionally, cultural resistance to change within organizations can impede the successful\nimplementation of technology in last-mile delivery. Employees may be hesitant to embrace new\ntechnologies due to fears of job displacement or uncertainty about the impact on their roles.\nOvercoming this resistance necessitates effective communication, leadership buy-in, and a clear\narticulation of the benefits that technology can bring to both the company and its employees.\n\n2.4 METRICS AND KEY PERFORMANCE INDICATORS (KPIs) TO\nMONITOR THE EFFECTIVENESS AND IMPACT OF TECHNOLOGY ON\nDELIVERY EFFICIENCY\nEstablishing metrics and key performance indicators (KPIs) is pivotal for gauging the\neffectiveness and impact of technology adoption efforts on last-mile delivery efficiency. These\nmetrics should provide insights into various aspects of the delivery process and facilitate tracking\nprogress towards enhancing efficiency (Alverhed, 2024). Without clear metrics and KPIs, it's\nchallenging for companies to assess the impact of technology adoption on last-mile delivery\nefficiency. By establishing relevant metrics, businesses can effectively monitor their progress\nand identify areas for improvement.\nMeasuring the variance between estimated and actual delivery times is crucial. This KPI\nevaluates the accuracy of delivery time predictions enabled by technologies like route\noptimization algorithms and real-time tracking systems. Comparing delivery times before and\nafter technology implementation allows for an assessment of efficiency improvements, with a\nlower variance indicating enhanced planning and execution in last-mile delivery. Tracking the", "word_count": 329, "start_char": 37630, "end_char": 40121}
{"chunk_id": "DOC0074__00015", "doc_id": "DOC0074", "chunk_index": 15, "text": "easuring the variance between estimated and actual delivery times is crucial.T\n\nhis KPI\nevaluates the accuracy of delivery time predictions enabled by technologies like route\noptimization algorithms and real-time tracking systems.C\n\nomparing delivery times before and\nafter technology implementation allows for an assessment of efficiency improvements, with a\nlower variance indicating enhanced planning and execution in last-mile delivery.T\n\nracking the\n\nvariance between estimated and actual delivery times provides tangible evidence of how\ntechnology adoption impacts delivery accuracy and efficiency. By reducing this variance,\ncompanies demonstrate improved planning and execution, leading to more reliable delivery\nservices (mohammad, 2023).\nAccurate order fulfillment is paramount for customer satisfaction and operational efficiency.\nTechnology solutions such as automation in inventory management and order processing enable\ncompanies to monitor order accuracy. On-time delivery is a critical KPI reflecting delivery\nefficiency, with the percentage of successful first-attempt deliveries serving as a key indicator. A\nhigher success rate signifies effective technology utilization in overcoming obstacles and\nensuring timely deliveries. Accurate order fulfillment is crucial for maintaining customer\nsatisfaction and optimizing operational efficiency. By leveraging technology solutions,\ncompanies can streamline inventory management and order processing, leading to higher rates of\non-time delivery and improved customer experiences (puri, 2022).\nCost savings are a significant outcome of technology adoption in delivery processes. Monitoring\nthe cost per delivery and cost per mile traveled allows for an assessment of the financial impact\nof technology implementation. Optimizing routes and leveraging technology solutions like GPS\ntracking and route optimization software help reduce delivery costs per mile, enhancing\nefficiency and profitability. Cost savings are a key driver of technology adoption in last-mile\ndelivery. By monitoring costs per delivery and per mile, companies can evaluate the financial\nbenefits of technology implementation, including reduced fuel consumption and labor costs\n(puri, 2022).\nFor transportation and logistics businesses, tracking driver productivity is essential for\noptimizing delivery efficiency. Monitoring the utilization rate of delivery drivers and vehicle\nperformance metrics such as fuel efficiency and maintenance costs enables businesses to\noptimize fleet performance and minimize disruptions in last-mile delivery operations.\nMaximizing driver productivity and vehicle performance is essential for achieving efficient lastmile delivery. By leveraging technology solutions, companies can optimize resource utilization,\nreduce operational costs, and enhance overall delivery efficiency (Merchán, 2021).\nUltimately, the effectiveness of technology adoption efforts should translate into improved\ncustomer satisfaction and retention. Gathering feedback from customers regarding their last-mile", "word_count": 392, "start_char": 39667, "end_char": 42717}
{"chunk_id": "DOC0074__00016", "doc_id": "DOC0074", "chunk_index": 16, "text": "aximizing driver productivity and vehicle performance is essential for achieving efficient lastmile delivery.B\n\ny leveraging technology solutions, companies can optimize resource utilization,\nreduce operational costs, and enhance overall delivery efficiency (Merchán, 2021).U\n\nltimately, the effectiveness of technology adoption efforts should translate into improved\ncustomer satisfaction and retention.G\n\nathering feedback from customers regarding their last-mile\n\ndelivery experience through surveys, feedback mechanisms, and Net Promoter Score (NPS)\nhelps assess whether technology enhancements positively impact the overall delivery experience.\nPositive feedback and high satisfaction scores indicate that technology-enabled last-mile delivery\nprocesses are meeting or exceeding customer expectations, thus reinforcing the benefits of\ntechnology adoption in enhancing delivery efficiency. Customer satisfaction is a critical measure\nof the success of technology adoption in last-mile delivery. By collecting feedback and\nmonitoring satisfaction metrics, companies can ensure that technology-enabled processes align\nwith customer expectations and contribute to long-term customer loyalty and retention (maisano,\n2018).\n\nCHAPTER THREE: Methodology\n3.0 INTRODUCTION\nThis chapter mostly addresses the techniques and protocols that were be used by the research to\nget the necessary data. Additionally, this chapter covers the study region, sample design, data\ncollecting source, data collection tools, data collection techniques, and tool validation and\ndependability, research variables, data processing, methods for interpretation and analysis,\nethical considerations, and study limitations.\nThis chapter presents the methodology, which should be used in carrying out the study, which\nincludes the research design, study population, sample size determination, sample selection,\nsources of data, data collection instruments, validity & reliability and ethical consideration.\n3.1 RESEARCH DESIGN\nThis study has employed a descriptive research design in order to collect data required to answer\nthe research questions. This provides the researcher with a clear picture about how IT impact on\nsupply chain at DHL The basic reason for using descriptive study design is because not so much\nis known about the situation at hand to comprehend the nature of and describe the characteristics\nof variables of interest in situations thus fit for such kind of study given that little empirical\nresearch has been carried out on IT According to (McLeod, 2008),a research design is \"the\noverall plan or structure of the study that serves as a guide in collecting and analyzing data.\"\nThe study employed a cross-sectional research approach which can allow to study, multiple\nvariables at the same time for example age, gender and level of education as well as other\nperformance indicators. The study also incorporated both qualitative and quantitative data\ncollection methods in order to achieve the desired results. This design facilitated the\nmanipulation of study variables to derive insights of the study.", "word_count": 428, "start_char": 42252, "end_char": 45346}
{"chunk_id": "DOC0074__00017", "doc_id": "DOC0074", "chunk_index": 17, "text": "he study also incorporated both qualitative and quantitative data\ncollection methods in order to achieve the desired results.T\n\nhis design facilitated the\nmanipulation of study variables to derive insights of the study.\n\n3.2 AREA OF STUDY\nThe study population refers to the specific group of individuals or elements from which data is\ncollected and analyzed in a research study. The study will be carried out At Kampala Road,\nMabirizi Complex Building, First Floor Room 03, and Kampala, Uganda.\n\n3.3 SAMPLE SIZE\nDHL is a wide company in over 200 countries with over 600,000 employees overall. The study\nwill focus on the employees in Uganda with the number of respondents where the Sample Size =\nN / (1 + N*e2)\nN= population size\ne= margin of error\nThe total population of employees of DHL Kampala road are 30 employees and the researcher\nwill purposively select respondents including Managers, Officers and other support staff. The\nresearch will use a sample size of 30 respondents that will be selected from the population above.\n\n3.4 SAMPLES DESIGN AND PROCEDURE\nSampling design can be divided into two main categories, probability, and non-probability\nsampling. In probability sampling, every person in the target population (either random or\nrepresentative) has an equal chance of being selected for the sample. (Lanz, 2019) To be more\nprecise, the researcher employed purposive sampling along with a nonprobability sampling\napproach. This was because the people that were recognized had an edge over others in light of\nthe questions that were posed, and they assisted the researcher in providing the best answers\npossible because the researcher already had some background details on their studies and the\nactivities they carry out as part of DHL initiatives.\n\n3.4.1PURPOSIVE SAMPLING\nThe procurement, production, research and development, and operations department heads will\nbe Purposively Sampled for the qualitative data. This approach will be taken since the\npurposively selected individuals are assumed to have vast knowledge of the subject. The\nresearcher is eager to learn more from people who are knowledgeable and experienced in last\nmile delivery-related matters. The respondents will be recorded and the data will later be\ntranscribed for purposes of the research report.\n3.4.2RANDOM SAMPLING\nThese other respondents including all staff will be selected randomly without bias and each will\nhave chance is being selected. Aiming to produce a representative sample that accurately reflects\nthe characteristics of the population from which it will be drawn. The researcher will use to come\nup the exact number of people to respond to the questionnaire for quantitative data.", "word_count": 420, "start_char": 45127, "end_char": 47816}
{"chunk_id": "DOC0074__00018", "doc_id": "DOC0074", "chunk_index": 18, "text": "iming to produce a representative sample that accurately reflects\nthe characteristics of the population from which it will be drawn.T\n\nhe researcher will use to come\nup the exact number of people to respond to the questionnaire for quantitative data.\n\n3.4.3 SOURCES OF DATA\nPrimary and secondary sources has both provide data for the collection. Using specially created\nquestionnaires, the primary data will be gathered from the sample population that was\ndetermined in table I above. The maintained organization's internal records are another source of\nsecondary data, such enhanced by information taken from journals, newspapers, websites, books\non procurement, and other library-accessible sources.\n3.5 DATA COLLECTION INSTRUMENTS\nData collection instruments are tools used to collect data and record during research. The\nresearcher will use a questionnaire guide to collect necessary information for the study.\nCollecting data involves using a certain method of inquiry to establish facts in instances when\nthe knowledge that is already accessible is sufficient. There will be in-depth interviews with the\nproject officer, field officers, local council representatives, community organizers, and lastly the\nchildren and teenagers to get the needed data. The rationale for conducting in-depth interviews\nwas to facilitate a greater level of engagement between the researcher and the respondents, so\nyielding more information. Data was later transcribed after the interview was recorded.\n\nThe researcher obtained a letter of authorization to carry out the study from Uganda Christian\nUniversity's Research Ethics Committee. The researcher informed DHL that she had been\nassigned to perform a study in their company with an introductory letter from the School of\nBusiness at Uganda Christian University. These letters were submitted in order to move on with\nand carry out the research.", "word_count": 280, "start_char": 47566, "end_char": 49452}
{"chunk_id": "DOC0074__00019", "doc_id": "DOC0074", "chunk_index": 19, "text": "he researcher informed DHL that she had been\nassigned to perform a study in their company with an introductory letter from the School of\nBusiness at Uganda Christian University.T\n\nhese letters were submitted in order to move on with\nand carry out the research.\n\n3.6 QUESTIONNAIRE GUIDE\nQuestionnaire involved the researcher formulating a set of questions on the study's subject and\nproviding them to participants to complete online, offline, or orally, or digitally. Because this\napproach is user-friendly and reasonably priced, it is convenient for researchers.\nBoth closed-ended and open-ended questionnaires will be used in the study as a fundamental\nmethod of data collection. Researchers utilize both closed-ended and open-ended questionnaires\nbecause they provide for easy access to respondents and can span a broad geographic range via\nquestionnaires more than with any other technique.\nA questionnaire is a research instrument that consists of a set of questions or other types of\nprompts that aims to collect information from a respondent. A research questionnaire is typically\na mix of close-ended questions and open-ended questions. (scribbr, 2021 )\n3.7 DATA ANALYSIS\nDescriptive statistics was used to summarize and modify the data acquired since they guarantee\ncorrectness, completeness, sufficiency, and reliability and allow the researcher to properly\ncharacterize measurements using a limited number of indices.\nThis happened after data had been collected, the researcher had to analyze data and present it. It\nwas done manually. It was done using pie charts, graphs, tables, figures, or diagrams. The data\nwas presented according to the study objectives.\n\n3.8 ETHICAL CONSIDERATION\nThe management of DHL has given the researcher complete information and authority to\nconduct the study. To allay any suspicions, the researcher will obtain an introduction letter from\nthe institution. After that, the researcher will keep choosing respondents, set up times for\ndelivering surveys, picking them up, and scheduling interviews. The researcher will guarantee\nthe respondents' privacy about the information they submit and promise not to share it with\noutside parties.\n\nCHAPTER FOUR\n\n4.0 INTRODUCTION\nThis chapter deals with data presentation, interpretation and analysis of the study. It has two\nmain parts: the first part is demography of the respondents; the second part consist of data\ncollected from the respondents through questionnaires. In order to address the research questions\nand hypothesis, 30 questionnaires were prepared and distributed to DHL employees, out of these\nquestionnaires 20 were filled and returned and no questionnaires were discarded due to missing\ndata.\n\n4.1 FINDINGS ON BIO DATA OF THE RESPONDENTS\nGENDER\nFREQUENCY\nPERCENTAGE\nMale\nFemale\nTOTAL", "word_count": 417, "start_char": 49192, "end_char": 51976}
{"chunk_id": "DOC0074__00020", "doc_id": "DOC0074", "chunk_index": 20, "text": "n order to address the research questions\nand hypothesis, 30 questionnaires were prepared and distributed to DHL employees, out of these\nquestionnaires 20 were filled and returned and no questionnaires were discarded due to missing\ndata.\n\n4.1 FINDINGS ON BIO DATA OF THE RESPONDENTS\nGENDER\nFREQUENCY\nPERCENTAGE\nMale\nFemale\nTOTAL\n\nFrom the information provided on findings on the respondents’ gender, the distribution of\nrespondents according to their gender was equal. The males were 11(55%) and so were the\nfemales 9 (45%) This means that there is gender equality and sensitivity through women\nemancipation, instigation, and empowerment in DHL.\nmale\nFemale\n\n4.1.1 ACADEMIC QUALIFICATIONS\nAcademic qualifications\nFrequency\nPercentage\nPost graduate\nGraduate\nTertiary\nSecondary\n\nTotal\n\nFrom the information shown above on academic qualifications of respondents, it is clear that\nrespondents at post graduate level are 3(15%), graduate level are 11(55%) and tertiary are\n6(30%). The implication is that DHL hires for competency in that knowledgeable and skillful\npeople are taken in to avail the best of their abilities and produce quality output since they have\nexperience and are good at what they do. It also shows a high level of hiring for diversity in that\npeople at all levels are taken up to ensure productivity and efficiency at the workplace besides\nhaving internship practice ongoing within DHL.\nSales\npost graduate\ngraduate\ntertiary\nsecondary\n\n4.1.2 YEARS OF SERVICE\nYEARS\nFREQUENCY\nPERCENTAGE\nless than a year\n1-5 years\n6-10 years\n0ver 10 years\ntotal\n\nFrom the information analyzed and presented on findings on years of experiences that\nrespondents have in, there is a vivid picture of years spent working in the organization unlike\nothers. For instance, less that year has 1(5%), 1-5 years has 8(40%), 6 – 10 years has 7(35%),\nover 10 years has 3(10%), as shown on the chart. This information shows the experience most of\nthe respondents have from working at DHL\n\n4.1.2 DEPARTMENTS THAT WERE ABLE TO RESPOND\nDuring the course of the research there were a wide range of respondents from many\ndepartments as follows; operations, human resource, customer service, finance, accounts,\nimports, sale department, data processing customs and clearing, IT department. These\ndepartments participated in the collection of the data in this research study\n\nless than a year\n1-5 years\n6-10 years\nover 10 years\n\n4.2 FINDINGS ON THE CHALLENGES FACED WHILE USING\nTECHNOLOGY IN LAST MILE DELIVERY\nBelow are responses from respondents in relation to the challenges faced while using technology\nto enhance service delivery in DHL. It is categorized in A=Agree, S/A=Strongly Agree, D/A=\nDon’t Agree, and N/S= Not Sure.", "word_count": 424, "start_char": 51648, "end_char": 54356}
{"chunk_id": "DOC0074__00021", "doc_id": "DOC0074", "chunk_index": 21, "text": "t is categorized in A=Agree, S/A=Strongly Agree, D/A=\nDon’t Agree, and N/S= Not Sure.\n\nCHALLENGES\nA\nS/A\nA\nData security and privacy concerns can hinder trust and\nconfidence needed for efficient technology-driven deliveries.\n65% 30% 5%\nB\nTechnical issues and downtime (e.g., system glitches,\nfailures) can disrupt delivery operations.\n30% 65% 5%\nC\n55% 30% 15% 0\nD\n25% 75% 0\n\nBasing on the above analysis and presented data on findings on challenges encountered while\nusing technology to enhance last mile delivery, it is clear that the majority of the respondents\nagreed to the challenges encountered while using technology whereas a minority disagreed and\nwere not sure. In relation to the above information, the challenges faced while using technology\nto enhance service delivery in DHL were measured in responses of agree, strongly agree,\ndisagree, and not sure as elaborated below.\nIt was revealed that 65% of the respondents agreed, and 30% strongly agreed 5% of the\nrespondents disagreed that data security and privacy is a challenge.\nWhile 30% strongly agreed while 65% strongly agreed and 5% disagreed of technical issues and\ndowntime being another challenge.\n55% of the respondents agreed 30% who strongly agreed and 15% disagreed that using\ntechnology raises ethical concerns related to privacy, transparency, and fairness in delivery\n\nIn addition, 25% of the respondents agreed, 75% strongly agreed that inadequate knowledge or\ntraining on operating different technological tools used in deliveries can be a barrier.\n\nThis indicates that the employees in DHL require regular sensitization and training on aspects of\ntechnology so as to eradicate the levels at which challenges are encountered. With proper and\nregular sensitization and training of employees, more efficiency and productivity in the service\ndelivery bit will be increased and achieved effectively since the required skills and knowledge\nwill be availed in abundance at the employees’ exposure.\n\n4.3 FINDINGS ON THE EFFECTIVENESS OF TECHNOLOGY IN LAST MILE\nDELIVERY\n\nA\nS/A\nA\nRoute optimization using algorithms with GPS tracking and\nreal-time data can significantly reduce delivery times.\n65% 15% 15% 5%\nB\nAutomation and optimization tools can help reduce labor\n35% 20% 45% 0\nC\nTechnology allows customers to track deliveries and offers\nflexible delivery options, improving their experience.\n30% 70% 0\nData security and privacy\nconcerns can hinder trust\nand confidence needed for\nefficient technology-driven\ndeliveries.\nTechnical issues and\ndowntime (e.g., system\nglitches, failures) can\ndisrupt delivery\noperations.\nUsing technology raises\nethical concerns related to\nprivacy, transparency, and\nfairness in delivery\nUsing technology raises\nethical concerns related to\nprivacy, transparency, and\nfairness in delivery\nagree\nstrongle agree\ndisagree\nnot sure\n\nD\nTechnology adoption has the potential to reduce the carbon\nfootprint of last-mile delivery operations.\n90% 5%\n5%", "word_count": 445, "start_char": 54271, "end_char": 57217}
{"chunk_id": "DOC0074__00022", "doc_id": "DOC0074", "chunk_index": 22, "text": "sing technology raises\nethical concerns related to\nprivacy, transparency, and\nfairness in delivery\nUsing technology raises\nethical concerns related to\nprivacy, transparency, and\nfairness in delivery\nagree\nstrongle agree\ndisagree\nnot sure\n\nD\nTechnology adoption has the potential to reduce the carbon\nfootprint of last-mile delivery operations.\n90% 5%\n5%\n\nThe data collected above shows that in relation to the effectiveness encountered while using\ntechnology in service delivery at DHL, below are some of the responses based on agreement\nparameters of agree, strongly agree, disagree, and not sure.\nIt was revealed that 65% of the respondents agreed to 15% strongly agreed 15% of the total\nrespondents and 5% not sure on the notion of Route optimization using algorithms with GPS\ntracking and real-time data can significantly reduce delivery times.\nIn addition, 35% of the respondents, 20% strongly agreed, 45% disagreed and 0% were not sure.\n17% of the respondents agreed that Automation and optimization tools can help reduce labor\nFurthermore, 30% Technology allows customers to track deliveries and offers flexible delivery\noptions, improving their experience.70% strongly agreed, 0 % disagreed and 0% were not sure.\n90% of the respondents agreed, 5% strongly agreed, 0% disagreed and 0% were not sure\naccepted that Technology adoption has the potential to reduce the carbon footprint of last-mile\ndelivery operations.\nThe implication is that the respondents were strongly adhering to technological usage in service\ndelivery but rather opted for manual means other than automated ones as per the results.\nTechnology adherence and usage should be considered more so as to enhance productivity and\nefficiency thus improving performance operationally and strategically while eradicating\nabsenteeism from work since technology offers opportunities of virtual working.", "word_count": 278, "start_char": 56864, "end_char": 58731}
{"chunk_id": "DOC0074__00023", "doc_id": "DOC0074", "chunk_index": 23, "text": "echnology adherence and usage should be considered more so as to enhance productivity and\nefficiency thus improving performance operationally and strategically while eradicating\nabsenteeism from work since technology offers opportunities of virtual working.\n\n4.4 FINDINGS ON THE FACTORS IN MEASURING THE SUCCESS OF\nTECHNOLOGY ADOPTION INITIATIVES IN LAST MILE DELIVERY\nS/N\nV/I\nI\nS/I\nN/I\nA\nTrack user adoption rate by monitoring logins,\nusage frequency, and training completion.\n65% 25%\n5%\n5%\nB\nMeasure the time and resources saved (e.g., number\nof deliveries completed per hour) compared to\nprevious methods.\n65% 30%\n5%\nC\nConduct feedback sessions to gauge user\nsatisfaction with the new technology.\n50% 50%\nD\nEvaluate the Return on Investment (ROI) of the\ntechnology adoption initiative by comparing the\nbenefits gained against the costs incurred.\n65% 30%\n5%\nE\nAnalyze data generated by the technology to\nidentify inefficiencies, optimize processes, and\nmake informed strategic decisions.\n85% 15%\nRoute optimization using\nalgorithms with GPS\ntracking and real-time\ndata can significantly\nreduce delivery times.\nAutomation and\noptimization tools can\nhelp reduce labor costs,\nfuel expenses, and vehicle\nwear and tear.\nTechnology allows\ncustomers to track\ndeliveries and offers\nflexible delivery options,\nimproving their\nexperience.\nTechnology adoption has\nthe potential to reduce\nthe carbon footprint of\nlast-mile delivery\noperations.\nagree\nstrongly agree\ndisagree\nnotsure", "word_count": 214, "start_char": 58474, "end_char": 59945}
{"chunk_id": "DOC0074__00024", "doc_id": "DOC0074", "chunk_index": 24, "text": "utomation and\noptimization tools can\nhelp reduce labor costs,\nfuel expenses, and vehicle\nwear and tear.T\n\nechnology allows\ncustomers to track\ndeliveries and offers\nflexible delivery options,\nimproving their\nexperience.T\n\nechnology adoption has\nthe potential to reduce\nthe carbon footprint of\nlast-mile delivery\noperations.\nagree\nstrongly agree\ndisagree\nnotsure\n\nThe data collected above shows factors in measuring the success of technology adoption\ninitiatives in last mile delivery at DHL, below are some of the responses based on agreement\nparameters of very important, important, somewhat important, and not important\nThe study exposed that 65% of the respondents very important to track user adoption rate by\nmonitoring logins, usage frequency, and training completion and 25% found it important. 5% of\nthe respondents somewhat important to track user adoption rate by monitoring logins, usage\nfrequency, and training completion delivery, 0% not important.\n65% very important and 30% found measure the time and resources saved (e.g., number of\ndeliveries completed per hour) compared to previous methods very important. 5% of the\nrespondents agreed that measuring the time and resources saved (e.g., number of deliveries\ncompleted per hour) compared to previous methods somewhat important.\n50% found very important, 50% important and 0% somewhat important and 0% not important\nthat Conduct feedback sessions to gauge user satisfaction with the new technology.\nIn addition, 65% of the respondents found it very important evaluate the Return on Investment\n(ROI) of the technology adoption initiative by comparing the benefits gained against the costs\nincurred. 30% found it important, 0% somewhat important and 5% found it not important.\nFurthermore, 85% of the respondents found that analyze data generated by the technology to\nidentify inefficiencies, optimize processes, and make informed strategic decisions, 15% found it\nimportant, 0% somewhat important and 0%found it not important . The implication from the\nabove responses is that there is a great possibility and potential of technology improving service\ndelivery despite the fact that is a complex kind of relationship. Technology can improve\naccuracy, improve efficiency, increase convenience, customer satisfaction, and personalization if\nadequately adhered to in the delivery of services since the relationship is a promising one.", "word_count": 352, "start_char": 59585, "end_char": 61980}
{"chunk_id": "DOC0074__00025", "doc_id": "DOC0074", "chunk_index": 25, "text": "he implication from the\nabove responses is that there is a great possibility and potential of technology improving service\ndelivery despite the fact that is a complex kind of relationship.T\n\nechnology can improve\naccuracy, improve efficiency, increase convenience, customer satisfaction, and personalization if\nadequately adhered to in the delivery of services since the relationship is a promising one.\n\n4.4 ADDITIONAL INFORMATION ACQUIRED\n4.4.1Qn: \"In case there is any other challenges, measurements and key performance indicators\n(Kpi's) to track the success of technology adoption initiatives and the effectiveness of technology\non delivery efficiency at DHL apart from those mentioned above.\" Some of the respondents had\nextra information to add to the research and here are some of the answers.\nSome of the challenges that that respondents added on some remarks such as; network\nfluctuations being a problem. The respondents stated that the network fluctuations a challenges\nthat DHL faces since the network connections are beyond control this becomes a challenges in\ntaking the proper and accurate data collection.\nOne other challenge that was mentioned by the respondents at DHL was that all frequent training\nof the technology becomes costly for the organization to maintain and have to incur a lot of\nexpenses to educate the new employees on how the technology works late alone adopting it.\nTrack user adoption\nrate by monitoring\nlogins, usage\nfrequency, and\ntraining completion.\nMeasure the time\nand resources saved\n(e.g., number of\ndeliveries completed\nper hour) compared\nto previous methods.\nConduct feedback\nsessions to gauge\nuser satisfaction with\nthe new technology.\nEvaluate the Return\non Investment (ROI)\nof the technology\nadoption initiative by\ncomparing the\nbenefits gained\nagainst the costs\nincurred.\nAnalyze data\ngenerated by the\ntechnology to\nidentify\ninefficiencies,\noptimize processes,\nand make informed\nstrategic decisions.\nvery important\nimportant\nsomewhat important\nnot important\n\nOn the other hand some of the other things that were identified as how effectiveness of\ntechnology on last mile delivery is that it has been more cost and time saving for the organization\nand has produced more environmental awareness. This has created more sustainable practices\nand more environmental awareness at DHL. Technology has also improved on the efficiency of\nthe workers at DHL which has gradually shown the adoption rate of technology to change\nshowing process and progress.", "word_count": 377, "start_char": 61577, "end_char": 64073}
{"chunk_id": "DOC0074__00026", "doc_id": "DOC0074", "chunk_index": 26, "text": "his has created more sustainable practices\nand more environmental awareness at DHL.T\n\nechnology has also improved on the efficiency of\nthe workers at DHL which has gradually shown the adoption rate of technology to change\nshowing process and progress.\n\nCHAPTER FIVE\nSUMMARY OF THE FINDINGS, CONCLUSION AND\nRECOMMENDATIONS\n5.0 Introduction\nThis chapter presents a summary of the study findings, conclusion of the topic,\nrecommendations and areas for further research on the effect of the adoption of technology on an\norganization’s last mile delivery\n5.1 SUMMARY OF THE STUDY FINDINGS\nThe study was done to analyze the effect of the adoption of emerging technology on last mile\ndelivery operations of DHL. The research was guided by three specific objectives that focused\non certain aspects associated with the use of technology within organizations. These aspects\nincluded the effectiveness of technology to last mile delivery such as DHL Uganda. Those\naspects were used while referring to DHL as a case study for the research. The specific\nobjectives included I. To examine the effectiveness of technology to last mile delivery, to\nexamine create measurements and key performance indicators (KPIs) to track the success of\ntechnology adoption initiatives and their effects on delivery efficiency and to examine the\nchallenges that come with implementing technology in the companies. The study findings with\nregards to those objectives are summarized below;\n\n5.2 THE FINDINGS OF THE CHALLENGES FACED WHILE USING\nTECHNOLOGY ON LAST MILE DELIVERY OPERATIONS DHL.\n\nIt was revealed that 65% of the respondents agreed, and 30% strongly agreed that data security\nand privacy is a challenge. This is in agreement with (Tawalbeh, 2020) who exposes the bit that\ncomplex services require trust and confidence to efficiently get the delivery done with the help of\ntechnology. 30% of the respondents agreed, 65% strongly agreed while 5% disagreed and 0%\nwere not sure of technical issues and downtime being another challenge. (Boggs, 2009)\nemphasizes that technology requires sustained investment and strong alignment with systemic", "word_count": 326, "start_char": 63822, "end_char": 65940}
{"chunk_id": "DOC0074__00027", "doc_id": "DOC0074", "chunk_index": 27, "text": "changes. Failure to deal with technical issues and systems poses a very big gap and challenge\nthus being in agreement with the above scholar. Furthermore, 55% of the respondents agreed that\nusing technology raises ethical concerns related to privacy, transparency, and fairness in delivery\npractices with 30% who strongly agreed and 15% disagreed. (Gregory, 2019) kept in mind that\nin the world of business, last mile delivery is the basis for which strategic businesses develop\nassociations within their environment and much more so planned for a new competitive edge.\nThe fact that not everyone in DHL was adapting to the new trends in competitiveness posed a\nhindrance and highlighted a strong agreement that user adoption and training became a big\nchallenge if not planned for adequately. 25 % of the respondents agreed to inadequate knowledge\nor training on operating different technological tools used in deliveries can be a barrier being a\nchallenge, 75% strongly agreed, 0% disagreed and 0% were not sure (Harahap, 2019) categorizes\nlast mile delivery. All these categories require monetary terms to be effectively and efficiently\ndone and adhered to which may either positively or negatively affect the cost and return on\ninvestments of the business. In agreement with the scholar, it brought about negative impacts for\ninstance more costs were incurred in integrating different systems.\n\n5.3 FINDINGS ON THE EFFECTIVENESS OF TECHNOLOGY ON\nLASTMILEDELIVERY OPERATIONS AT DHL\nIt was revealed that 65% of the respondents agreed to route optimization using alogorithims with\nGPS tracking and real time data can significantly reduce delivery time and 15% strongly agreed\n3% disagreed ad 5% were not sure (Žunic, 2020) In agreement with the above scholar, existence\nof automation proves a relationship between technology and last delivery. 35% of the\nrespondents agreed automation and optimizing tools can help reduce labor cost, fuel expenses\nand vehicle wear and tear in last mile delivery, 20% strongly agreed, 45% disagreed and 0%\nwere not sure. Technology has contributed and continues to contribute to enhanced performance\nand performance in of last mile delivery (Burke, 2002)In agreement with the scholars cited,\ndigital transformation is proof that technology and last mile delivery bear a relation based on the\noutcome which is performance. In addition, 30% of the respondents agreed that technology\nallows customers to track deliveries and offers flexible delivery options, improving their\nexperience delivery, 70% strongly agreed, 0% disagreed and 0% were not sure. In agreement", "word_count": 401, "start_char": 65940, "end_char": 68534}
{"chunk_id": "DOC0074__00028", "doc_id": "DOC0074", "chunk_index": 28, "text": "n addition, 30% of the respondents agreed that technology\nallows customers to track deliveries and offers flexible delivery options, improving their\nexperience delivery, 70% strongly agreed, 0% disagreed and 0% were not sure.I\n\nn agreement\n\nwith rapid growth brought by IT transforms generations in the way they do things. This\ngeneration prefers so much branding, personalization, and customization in which technology\nenables service providers to personalize and customize their offerings according to individual\ncustomer preferences. Customer or client data and analytics help in understanding customer\nbehavior, needs, and preferences. 90% of the respondents agreed to technology adoption has\npotential to reduce the carbon footprint of last mile delivery, 5% strongly agreed, 0% disagreed\nand 0% were not sure. In agreement (MARIKI, 2021) with technology is vital for process. This\nimproves environmental support, and ability to improve the environment and enhances\ncollaboration between organizations that promotes a green environment leading to better\ndelivery.\n5.4 FINDINGS ON THE FACTORS IN MEASURING THE SUCCESS OF\nTECHNOLOGY ADOPTION INITIATIVES LAST MILE DELIVERY AT DHL\nIt was revealed that 65% of the respondents found it very important tracking user adoption rate\nby monitoring logins usage frequency and training completion and 25% found it important 5%\nfound it somewhat important and 5% not important. In agreement (Froehlich, 2007) with who\ndiscovered that at mobile phone, has been adopted faster than any other provides rich qualitative\naccounts of device usage and human on user experience, we surveyed users after they completed\nDHL. 65% of the total respondents agreed it very important measure the time and resource saved\ncompared to previous methods, 30% found it important, and 5% found it somewhat important.\nIn addition, 50% of the respondents agreed conduct feedback sessions to gauge user satisfaction\nwith the new technology as a very important measure to competitive advantage being a benefit,\n50%found it important, 0% disagreed and 0% were not sure. In agreement with (Uzir, 2021)\nwhen technology is used in the last mile delivery of services, it can be very useful to all\nemployees at DHL. This gives an upper hand to be ahead of competitors since the employees are\nelectronically sensitized and vital information is easily shared with automation in place.\nFurthermore, 65% of the respondents agreed that evaluating the return on investment of the\ntechnology adoption initiative by comparing the benefits gained against the costs incurred, 30%\nfound it important and 0% found it somewhat important and 5% found it as not important. In\nagreement with (Lucas Jr, 1999) return from specific programs, projects and new initiatives\nstandard cost–benefit techniques to assess large investments. Those notes were later compared", "word_count": 434, "start_char": 68295, "end_char": 71151}
{"chunk_id": "DOC0074__00029", "doc_id": "DOC0074", "chunk_index": 29, "text": "n\nagreement with (Lucas Jr, 1999) return from specific programs, projects and new initiatives\nstandard cost–benefit techniques to assess large investments.T\n\nhose notes were later compared\n\nand matched against the ... This leads to increased goal and target achievement that comes as a\nresult of mutual trust, rapport, and understanding among employees.\n\n5.5 SUMMARY OF FINDINGS\nThe first goal, which looked at the difficulties in adopting technology for last-mile delivery at\nDHL, revealed that most respondents—65% of the total—agreed that there were difficulties in\nutilizing technology to improve last-mile delivery. Of all respondents, 75% strongly agreed and\n15% disagreed with the difficulties encountered when utilizing technology to improve last-mile\ndelivery. It may be inferred that a majority of the total respondents were aware of the challenges\nand their consequences, including but not limited to technological problems, insufficient\nexpertise, and higher expenses. The survey, which looked at how effective technology is in lastmile delivery at DHL, revealed that 90% of respondents overall agreed that technology is\neffective in last-mile delivery at DHL, while 5% strongly agreed and were unsure. This\nsuggested and demonstrated that the responders had knowledge of the benefits and efficiency of\nlast-mile delivery. Enhanced productivity, increased customer happiness, a competitive edge, etc.\nare some of these advantages. The study's goal was to look into the benefits of technology use in\nDHL's service delivery. Out of all the respondents, 77% felt that it was important to track the rate\nat which technology is used when it comes to last-mile delivery at DHL, while 23% disagreed.\nThis implies that the participants have a comprehensive comprehension of the standards required\nto evaluate the efficacy of technological adoption programs for last-mile delivery.\n\n5.6 RECOMMENDATIONS\nIn light of the study's conclusions, the researcher advised businesses to think about potential\nsolutions for problems that could arise from implementing technology and related practices. For\nexample, educating staff members on the value and use of IT techniques prior to their adoption\nmight help overcome resistance to change. That would allow the businesses to reap the complete\nrewards of implementing technological techniques, such as enhanced performance effectiveness\nand greater stakeholder transparency, among many other advantages.\n\nAPPENDIX\nCONSENT FORM\nDear Sir/Madam,\nMy name is.............................................. A student of Uganda Christian University\nSchool of Business. I am conducting a study on the \"Impact of Emerging Technology on Last\nMile Delivery Operations\"\nThe answers you give will be strictly confidential and will be used strictly for academic\npurposes.\n\nI agree/ disagree to participate in this study\n\nBIO DATA\n1. Gender\na) Male\nb) Female\n2. Academic qualifications\na) Post graduate\nb) Graduate\nc) Tertiary\nd) Secondary", "word_count": 435, "start_char": 70963, "end_char": 73930}
{"chunk_id": "DOC0074__00030", "doc_id": "DOC0074", "chunk_index": 30, "text": "am conducting a study on the \"Impact of Emerging Technology on Last\nMile Delivery Operations\"\nThe answers you give will be strictly confidential and will be used strictly for academic\npurposes.I\n\nagree/ disagree to participate in this study\n\nBIO DATA\n1.G\n\nender\na) Male\nb) Female\n2.A\n\ncademic qualifications\na) Post graduate\nb) Graduate\nc) Tertiary\nd) Secondary\n\nOthers.......................................................................\n3. Years of service in the organization\na) Less than I year\nb) 1-5 years\nc) 6-10 years\nd) Over 10 years\n4. Department in which you work\n...................................................................................................\nINSTRUCTIONS: Please rate your level of agreement with the following statements\nregarding challenges of using technology in last-mile delivery. Select one option for each\nstatement.\nTick appropriately A=Agree, S/A=Strongly Agree, D/A= Don’t Agree, N/S= Not sure.\n\nCHALLENGES\nA\nS/A D/A N/S\nA\nData security and privacy concerns can hinder trust and\nconfidence needed for efficient technology-driven deliveries.\n\nB\nTechnical issues and downtime (e.g., system glitches, failures)\ncan disrupt delivery operations.\n\nC\n\nD\nInadequate knowledge or training on operating different\ntechnological tools used in deliveries can be a barrier.\n\nINSTRUCTIONS: Please rate your level of agreement with the following statements\nregarding the effectiveness of technology in last-mile delivery. Select one option for each\nstatement.\nTick appropriately, A=Agree, S/A=Strongly Agree, D/A= Don’t Agree, N/S=Not Sure.\n\nA\nS/A\n\nA\nRoute optimization using algorithms with GPS tracking and\nreal-time data can significantly reduce delivery times.\n\nB\nAutomation and optimization tools can help reduce labor\n\nC\nTechnology allows customers to track deliveries and offers\nflexible delivery options, improving their experience.\n\nD\nTechnology adoption has the potential to reduce the carbon\nfootprint of last-mile delivery operations.\n\nINSTRUCTIONS: Please rate the importance of the following factors in measuring the\nsuccess of technology adoption initiatives in last-mile delivery.\nSelect one option for each statement. V/I=Very Important, I= Important, S/I=Somewhat\nImportant, N/I=Not Important)\n\nS/N\nV/I\nI\nS/I\nN/I\nA\nTrack user adoption rate by monitoring logins,\nusage frequency, and training completion.\n\nB\nMeasure the time and resources saved (e.g., number\nof deliveries completed per hour) compared to\nprevious methods.\n\nC\nConduct feedback sessions to gauge user\nsatisfaction with the new technology.\n\nD\nEvaluate the Return on Investment (ROI) of the\ntechnology adoption initiative by comparing the\nbenefits gained against the costs incurred.\n\nE\nAnalyze data generated by the technology to\nidentify inefficiencies, optimize processes, and\nmake informed strategic decisions.\n\nF) In case there is any other challenges, measurements and key performance indicators (Kpi's) to\ntrack the success of technology adoption initiatives and the effectiveness of technology on\ndelivery efficiency at DHL apart from those mentioned above.\nPlease Specify:", "word_count": 427, "start_char": 73569, "end_char": 76658}
