{"chunk_id": "DOC0081__00000", "doc_id": "DOC0081", "chunk_index": 0, "text": "LAND LAW REFORM IN UGANDA: Exploring the loose ends\nBy Anthony C.K. Kakooza*\n\nAbstract\nThis paper addresses the present composition of land laws in Uganda and the\nneed for reform. It does not particularly provide a critique on each of the land\nlaw legislations neither does it particularly focus on case law principles on the\nsame, a venture which is quite lengthy, to say the least. It however attempts to\nhighlight the pertinent concerns on the most notorious provisions under some of\nthe prevalent land law legislations which can and should be simplified for the\nconvenience of the public. It also provides a doorway for new legislations and\nregulations that can be harmonized within the present land laws with a view of\nbringing the general land law up to date with the present concerns.\n\nThe Paper thus serves the general purpose of convincing on the need to\nharmonize or replace archaic and sometimes discordant land sector laws, so as to\nbring them in line with the new legal order and thus to implement the new\nconstitutional provisions for protection of land and property rights.\n\nIntroduction.\nLand is every household’s most important asset. Under Article 237 of the 1995\nConstitution, its states: “Land in Uganda belongs to the citizens of Uganda and\n\n* LL.B (Hons) (M.U), Dip. L.P (LDC), LL.M (Warwick), Advocate and Lecturer in Law. A paper\npresented at the Uganda Christian University Law Society Workshop on the theme, “The Future of Uganda\nin the Legal, Political and Social Spheres”, dated 18th January 2008. The writer is presently a subconsultant and Research Associate with M/s Kalenge, Bwanika, Kimuli Advocates, as part of the on-going\nproject on “The Review of the Legal Framework for Land Administration” for the Private Sector\nFoundation, Uganda & the Ministry of Lands, Housing and Urban Development. As such, in addition to his\nown material, the writer has also made reference to a compilation of research from other Consultants on the\nproject, notably Prof. Peter Butt, Dr. John Mugambwa, Mr. Robert Ssawa, Dr. Moses Musinguzi and Mr.\nPeter Walubiri among others.\n\nshall vest in them in accordance with the land tenure systems provided for in this\nConstitution”1.\n\nThe same article goes on to provide for the general exceptions under which the\naforementioned right of ownership may be curtailed2 and mentions the land\ntenure systems under which land can be owned in Uganda3. These are:\nCustomary; freehold; mailo; and leasehold.", "word_count": 402, "start_char": 0, "end_char": 2456}
{"chunk_id": "DOC0081__00001", "doc_id": "DOC0081", "chunk_index": 1, "text": "he same article goes on to provide for the general exceptions under which the\naforementioned right of ownership may be curtailed2 and mentions the land\ntenure systems under which land can be owned in Uganda3.T\n\nhese are:\nCustomary; freehold; mailo; and leasehold.\n\nFollowing the passing of the Constitution of Uganda, 1995, and the Land Act,\n19984, and with the development of the Land Sector Strategic Plan 2001-2011\n(LSSP), the insecurity of property rights that can arise from inappropriate or\nunclear legislation was addressed by Government. The pertinent issues are now\nwithin the premise of:\n\n• non-existent or ambiguous land records; and\n• the inability to enforce existing land rights.\n\nToday, the most commonly referred to legislations in land law practice and\nconveyance matters are the Registration of Titles Act5, the Land Act6 and the\nMortgage Act7. This is principally because the interests pertaining to the\naforementioned tenure systems are mainly addressed in these laws, though\ninevitably, the same interests cut across all the other relevant laws, such as the\nLand Acquisition Act8 and the Survey Act9. Loopholes and uncertainties in these\nlaws adversely affect, inter alia, business competitiveness, private sector\n\n1 Sub-article 1, article 237\n2 Sub-article 2\n3 Sub-article 3\n4 Chapter 227, Laws of Uganda, Revised Edition, 2000, as amended by the Land (Amendment) Act No.1 of\n5 Cap. 230, Laws of Uganda, 2000 Ed.\n6 Supra, note 5\n7 Cap. 229, Laws of Uganda, 2000 Ed.\n8 Cap. 226\n9 Cap. 232\n\ndevelopment, and Uganda’s economic life in general. This paper thus mainly\nfocuses on the Registration of Titles Act (R.T.A) and advocates for a modification\nand harmonizing of this law with the Land Act and the Mortgage Act because the\nRegister of titles which is regulated by the R.T.A, is currently the main record and\nsource of land information. Limited reference will also be made to the impending\namendments to the Land Act and the Mortgage Act since these are still subject to\nfurther debate.\n\nIt should further be noted, that Uganda is presently experiencing an inefficient title\nregistration system characterized by poor administration and maintenance. The\ninadequate security of the physical files has paved way for fraudulent and corrupt\nactivity negatively affecting the integrity of the title registry. Such challenging\nfactors in the land registry derail proper verification of the status of the land which\ninevitably affects the ability to sell the land and associated real estate.\nFurthermore, financial institutions also find it difficult to transact with\nunsatisfactory land interests presented as collateral10.", "word_count": 418, "start_char": 2193, "end_char": 4833}
{"chunk_id": "DOC0081__00002", "doc_id": "DOC0081", "chunk_index": 2, "text": "uch challenging\nfactors in the land registry derail proper verification of the status of the land which\ninevitably affects the ability to sell the land and associated real estate.F\n\nurthermore, financial institutions also find it difficult to transact with\nunsatisfactory land interests presented as collateral10.\n\nThis paper therefore specifically addresses a few common aspects in the\nRegistration of Titles Act, the Land Act and the Mortgage Act, and attempts at\noffering suggestions as to how these laws can be modified to create better\nharmony and practical convenience in land law matters.\n\nOverview of the law and the need for reform\nThe Registration of Titles Act, Cap. 230, has been in force in Uganda since 1924\nand is based on a 1915 Statute from the Australian State of Victoria. It is a “Torrens\nTitle” Statute, that is, it reflects the underpinning concept of State-guaranteed title\n\n10 Project Appraisal Document on a Proposed Credit to the Government of Uganda for a Second Private Sector\nCompetitiveness\nProject,\nReport\nNumber:\n29639-UG,\ndated\nJuly\n7,2004\navailable\nat\nhttp://go.worldbank.org/T8HCFC4KC0\nor\nat\nhttp://wwwwds.worldbank.org/external/default/main (last visited 8/7/07)\n\n(usually called “indefeasibility of title”)11. This is a stagnant law that needs to be\nmodified and brought up to date with Torrens statutes in other jurisdictions. As\nwe focus on harmonizing this law inter alia, with the Land Act and the Mortgage\nAct, areas requiring modification include the following:\n\n(a)\nComputerization\nThe Register is kept entirely in manual form as reflected in the Act. However, with\ndue consideration to the technology age we are in, our land laws, particularly the\nRegistration of Titles Act, need to be amended to cater for technological progress\nsuch as paperless conveyance, on-line transactions and searches, and lodging of\ndocuments electronically. This would allow for the development of a\ncomprehensive Land Information System as well as help to curb down on\nfraudulent practices in the Land Registry as shall be discussed further below. The\ndevelopment of an integrated Land Information System (LIS) which combines all\nmajor land-related information would go at great lengths in simplifying the\noperation of the Land Registry.", "word_count": 345, "start_char": 4520, "end_char": 6782}
{"chunk_id": "DOC0081__00003", "doc_id": "DOC0081", "chunk_index": 3, "text": "his would allow for the development of a\ncomprehensive Land Information System as well as help to curb down on\nfraudulent practices in the Land Registry as shall be discussed further below.T\n\nhe\ndevelopment of an integrated Land Information System (LIS) which combines all\nmajor land-related information would go at great lengths in simplifying the\noperation of the Land Registry.\n\n(b)\nDecentralization of the Land Registry\nAnother consideration is the amendment of the Registration of Titles Act or in the\nalternative, coming up with new legislation on land to cater for the\ndecentralization of the land registry. This would involve dislocating it from a few\ncentral locations and having it strategically located in various localities. This, as a\ngovernment policy, should obviously bear in mind challenges in management and\ncoordination. However, with a well established and coordinated Land\nInformation System, this obstacle would be easily overcome. Implementing this\nrecommendation would make accessibility to the registry easier by the poorer\nmembers of the community for whom basic costs and transport are important\nissues.\n\n11 Section 64, Registration of Titles Act, Cap.230\n\n(c)\nAddressing fraud in the operation of the land registry\nIncidences of fraud are every land law practitioner’s worst nightmare. The two\nmost common incidences are illustrated below:\n\n•\nSituation 1: A person acquires an interest in land by means of their own\nfraud. To illustrate: assume that A is the registered proprietor of land. Now\nassume that X steals A’s certificate of title, then forges A’s signature on a transfer of\nthe land in favour of himself (X) and then becomes registered as proprietor of the\nland. In this situation, the Registration of Titles Act does not guarantee X’s title: A\nmay set it aside on the ground of X’s fraud12.\n\n•\nSituation 2: An innocent person acquires an interest in land by means of the\nfraud of a third party. To illustrate: assume that A is the registered proprietor of\nland. Now assume that a third party (X) steals A’s certificate of title, impersonates\nA to sell the land to B who is ignorant of the fraud, and then forges A’s signature\non a transfer in favour B, who becomes registered. Here, the Registration of Titles\nAct guarantees B’s title. A cannot set it aside13.", "word_count": 377, "start_char": 6402, "end_char": 8701}
{"chunk_id": "DOC0081__00004", "doc_id": "DOC0081", "chunk_index": 4, "text": "ow assume that a third party (X) steals A’s certificate of title, impersonates\nA to sell the land to B who is ignorant of the fraud, and then forges A’s signature\non a transfer in favour B, who becomes registered.H\n\nere, the Registration of Titles\nAct guarantees B’s title.A\n\ncannot set it aside13.\n\nThe result in Situation 1 is straightforward, and accords with justice and common\nsense. X cannot acquire a good title by means of his or her own fraud. By way of\ndistinguishing, this was discussed in the case of John Katarikawe v W.\nKatwiremu & Ors14 in which it was held that: If a person procures registration to\ndefeat an existing unregistered interest on the part of another person of which he\nis proved to have knowledge, then such a person is guilty of fraud.\n\nHowever, the result in Situation 2 is more controversial. Someone must lose out\nbecause of X’s fraud: but is it to be A or B? Over the years, courts have come to\ndifferent conclusions.\n\n12 Sections 176 & 177 R.T.A\n13 Sec. 181, R.T.A\n14 (1977) H.C.B 187\n\nIn the case of F. Zaabwe v Orient Bank Ltd, Mars Trading Co. Ltd & Ors15,\nwhile addressing the issue of a purchaser bona fide or not vis-a vis third party\nrights, the Court pointed out two underlying principles. Katureebe, JSC, for\ninstance, followed the decision in David Sejjaka Nalima v Rebecca Musoke16, to\nthe effect that: The principle that a bonafide purchaser for value cannot have his\ntransfer defeated by fraud only applies where the purchaser was not a party to the\nfraud or he had no knowledge of the fraud at the time when he purchased.\n\nIn the Zaabwe case, the first defendants’ Counsel had full knowledge of the\ndispute and the allegations of fraud on the suit property. The Honourable\nKatureebe, JSC thus stated: “The Sejjaka case supra, is authority for the principle\nthat where an Advocate acts for a party and he has knowledge or notice of alleged\nfraud, that knowledge or notice will be imputed to his client unless the client\nhimself is defrauded by the advocate”.\n\n(d) The need for effective compensation for loss of land\nMost Torrens title statutes provide that persons who lose land, or an interest in\nland, through the workings of the registration system, should have access to\nstatutory compensation17. Often, the compensation is payable out of a statutory\nfund, called the “Assurance Fund”. The right to compensation is seen as an\nimportant parallel to “immediate” indefeasibility of title. The following example\nillustrates the need for compensation:", "word_count": 433, "start_char": 8403, "end_char": 10903}
{"chunk_id": "DOC0081__00005", "doc_id": "DOC0081", "chunk_index": 5, "text": "ften, the compensation is payable out of a statutory\nfund, called the “Assurance Fund”.T\n\nhe right to compensation is seen as an\nimportant parallel to “immediate” indefeasibility of title.T\n\nhe following example\nillustrates the need for compensation:\n\nAssume that A is the registered proprietor. X steals A’s certificate of title and\nforges A’s signature on a transfer of the land in favour of B, an innocent\npurchaser. B pays the full purchase price to X, who then disappears. B\nregisters and obtains an (immediately) indefeasible title. A has lost the land.\nTechnically, A has an action against X, but X has disappeared. A has no action\n\n15 Supreme Court Civil Appeal No. 4 of 2006\n16 SCCA 12/85 [1992]V KALR\n17 Sec. 178, R.T.A\n\nagainst B. Therefore, under standard Torrens title provisions, A can recover\nfrom the Assurance Fund the value of the land under a scheme of statutory\ncompensation.\n\nThe Registration of Titles Act has a series of sections that, together, would give A\nrights to recover from the Government: sections 178, 179, 180, 183-187. This\nequates to a right to recover from a “fund”. However, these provisions appear\nexcessively complex and (in some respects) unclear in their operation. This can\nundermine confidence in the land registration system, for a person deprived of\nland by fraud is uncertain of the right to compensation.\n\nIt can therefore be argued that in order to underpin confidence in Uganda’s title\nregistration system, the compensation provisions of the Registration of Titles Act\nshould be redrafted in order to free up access to compensation and to make clear\nthe circumstances in which claims can be made.\n\nThe assumption is that one reason why people do not make claims for\ncompensation is because they believe that it is only through court proceedings that\nthey can effect recovery. This belief is not entirely correct, as section 186 (R.T.A)\nallows the Registrar (if the Minister agrees) to pay a claim before court action is\ninitiated.\n\nHowever, in order to expedite the process and cut on the bureaucracies, the\nRegistration of Titles Act should be amended to allow the Registrar to pay claims,\nwithout needing Ministerial approval. It should not be necessary for parties to\nbear the costs or suffer the delays in court proceedings for recovery. The Office of\nthe Registrar should be given the confidence to exercise the expertise in deciding\n\non claims. Where this expertise is abused, there would remain the right under the\nexisting Act to challenge the Registrar’s decision in court18.\n\n(e) Registered interests vis-à-vis unregistered interests\nThis is a controversial issue that cuts across the Registration of Titles Act, Mortgage\nAct and the Land Act. A few practical examples would suffice:", "word_count": 449, "start_char": 10653, "end_char": 13396}
{"chunk_id": "DOC0081__00006", "doc_id": "DOC0081", "chunk_index": 6, "text": "here this expertise is abused, there would remain the right under the\nexisting Act to challenge the Registrar’s decision in court18.\n\n(e) Registered interests vis-à-vis unregistered interests\nThis is a controversial issue that cuts across the Registration of Titles Act, Mortgage\nAct and the Land Act.A\n\nfew practical examples would suffice:\n\n• Example 1: Assume that the owner of land (A) has given a mortgage to a\nlender (B). Assume that the mortgage is unregistered, and that B has not\nprotected the mortgage by caveat or by taking possession of the certificate\nof title. Now assume that A sells the land to a purchaser (P), who has\nnotice of the mortgage. P becomes registered. Does P take free of the\nmortgage?\n\n• Example 2’: Assume that the owner of land (A) enters into a contract to sell\nthe land to a purchaser, P, who does not register or lodge a caveat. Now\nassume that the owner then enters into a contract to sell the same land to\nanother purchaser, Q. Assume that Q knows of P’s interest. Q becomes\nregistered. Does Q take free of P’s interest?\n\nSome Ugandan case law would hold that in examples such as these, the registered\ninterest would defeat the unregistered. Specifically, they would hold that in\nExample 1, P takes free of B’s interest, and that in Example 2, Q takes free of P’s\ninterest. The reasoning is that, under the Registration of Titles Act, a registered\ninterest defeats an unregistered interest, despite notice—and that to take with\nnotice of an unregistered interest is not to act fraudulently (as the term “fraud” is\nunderstood in the context of Torrens title statutes).19 But other Ugandan case law\nwould hold to the contrary: namely, that in Example 1, P takes subject to B’s\n\n18 See Sec. 185 R.T.A\nAn example is Shah v Modern Sweet Mart Ltd (1956-1957) 8 ULR 99, discussed in Mugambwa,\nPrinciples of Land Law in Uganda, Fountain Publishers, 2000, p 76.\n\ninterest and in Example 2, Q takes subject to P’s interest. This is based on the\nreasoning that registration in the face of knowledge of an unregistered interest is\nfraudulent.20\n\nIn the appreciation of legal interests versus equitable interests, I would argue that\nthe former view is correct. That is, a registered interest defeats an unregistered\ninterest, despite notice. Specifically, to become registered as the holder of an\ninterest with notice of an existing unregistered interest is not to act fraudulently\n(as the term “fraud” is understood in the context of Torrens title statutes). This\nresult is compelled by section 136 of the Registration of Titles Act.", "word_count": 436, "start_char": 13055, "end_char": 15614}
{"chunk_id": "DOC0081__00007", "doc_id": "DOC0081", "chunk_index": 7, "text": "hat is, a registered interest defeats an unregistered\ninterest, despite notice.S\n\npecifically, to become registered as the holder of an\ninterest with notice of an existing unregistered interest is not to act fraudulently\n(as the term “fraud” is understood in the context of Torrens title statutes).T\n\nhis\nresult is compelled by section 136 of the Registration of Titles Act.\n\nFurthermore, it is evident that this result not only accords with the philosophy of\nthe Torrens system but also helps promote a confident land market. The Torrens\ntitle system assumes that persons will register the interests they acquire in land—or\nelse take the risk of losing out at the hands of a later interest-holder who becomes\nregistered (even with notice). One of the system’s strengths is the premise that\npersons acquiring an interest in land should be able to rely on the Register as a\n“mirror” of the title: that is, they should be able to assume that the land is bound\nonly by the interests currently registered or caveated, and therefore ascertainable\nby search of the Register. They should not be bound by interests that are\nunregistered or uncaveated—and which, by definition, are not ascertainable by\nsearch of the Register. In short, they should not be concerned about unregistered\ninterests whose holders have not sought the protection of registration or caveat.\n\nTherefore, the considered view is one of exercising due diligence. In other words,\nunder the Registration of Titles Act a person taking an interest in land should be\nexpected to register it, to avoid losing out to someone who later acquires a\n\nAn early example is Katarikawe v Katwiremu [1977] HCB 187. This seems now to be the\napproach taken generally: for example, see per Odoki CJ and other members of the Supreme\nCourt, in Kampala District Land Board v N.H.C.C (Civil Appeal No 2 of 2004). Also see sec. 64\n(1) R.T.A\n\nregistered interest in the land. The unregistered holder’s remedy lies in their own\nhands: they can register21. Of course, some interests are inherently unregistrable;\nand other interests, though inherently registrable, might be embodied in\ndocuments that, for one reason or another, are not in registrable form22. But such\ninterests can always be protected by caveat—a protection which, though not\nequivalent to registration, is sufficient to prevent extinction of the interest as a\nresult of registration of a competing interest through exercise of due diligence by\nsomeone intending to register his or her interest on the land.", "word_count": 410, "start_char": 15240, "end_char": 17751}
{"chunk_id": "DOC0081__00008", "doc_id": "DOC0081", "chunk_index": 8, "text": "ut such\ninterests can always be protected by caveat—a protection which, though not\nequivalent to registration, is sufficient to prevent extinction of the interest as a\nresult of registration of a competing interest through exercise of due diligence by\nsomeone intending to register his or her interest on the land.\n\nThis result, of course, would not affect the operation of the principles relating to\nfraud. If the later interest holder has been fraudulent in acquiring the interest,\nthen their registered title is liable to defeasance for fraud. But, as section 136 of\nthe Registration of Titles Act states, notice, of itself, is not fraud. Nor would the\nresult affect the principles relating to “personal equities”. That is, if the later\nholder has engaged in unconscionable conduct of a kind that would lead a court\nto require his or her title to be subject to an earlier unregistered interest, then\nregistration of the later interest will not destroy the earlier. But subject to such\nmatters, section 136 of the Registration of Titles Act should be allowed free reign.\nIt is central to the aim of encouraging a confident land market.\nHowever, this argument leaves vulnerable persons unprotected. Uganda has seen\na proliferation of unregistered interests, whose owners will know little or nothing\nof the need to register or caveat to protect the interests from defeat at the hands\nof later registered holders. Such vulnerable persons fall within or include the\nbracket of the so-called “bibanja” owners and other customary land owners\nconstituting over 60% of land holders in Uganda.\n\n21 Lawful and bonafide occupants on land (tenants by occupancy) can also register their interests under the\nprovision of section 38 of the Land Act.\n22 Such as Land bequeathed through the registered proprietor’s last will and testament.", "word_count": 296, "start_char": 17437, "end_char": 19261}
{"chunk_id": "DOC0081__00009", "doc_id": "DOC0081", "chunk_index": 9, "text": "However, it is impossible to protect all \"vulnerable\" persons; if we tried to do so,\nthe Registration of Titles Act and the Land Act would become unworkable, to the\ndetriment of persons dealing in land and to Uganda's land market. There must be\na balance between competing interests (ie, between dealers or potential land\ndealers and other claimants).\nThe \"numerous\" unregistered interests include interests of \"bona fide\" and \"lawful\noccupants\" under sec. 29 of the Land Act. There are new proposals under the Land\n(Amendment) Bill23 to protect such interests on registered land. However, and\nimportantly, those interests are already protected as exceptions to indefeasibility\nunder the amendments to section 64 of the Registration of Titles Act proposed by\nthe 2005 amending legislation24. Similarly the rights in relation to “family land”\nare protected under the new section 64(3), inserted by the same amending\nlegislation (Family land is also protected in the Mortgage Bill, 2007 discussed\nbelow).\nFurthermore, the aforementioned provisions in the proposed Land (Amendment)\nBill seem to contradict the provisions of sections 64 and 136 of the Registration of\nTitles Act in as far as the estate of the registered proprietor is concerned. Much as\nthe Land Act would seem to override the Registration of Titles Act, this is\nnevertheless likely to cause unnecessary public confusion.\n(f)\nThe need for spousal consent in dealings with family land\nThis is also yet another contentious issue. Recent amendments proposed to the\nRegistration of Titles Act (by the Registration of Titles (Amendment) Bill 2005)\nintroduce a requirement for spousal consent to dealings with family land. These\namendments affect, inter alia, the following sections of the Registration of Titles\nAct:\n• section 92 (no transfer of family land without spousal consent)\n\n23 Bill No. 27 of 2007\n24 The Registration of Titles (Amendment) Bill, 2005\n\n• sections 101 and 109 (no lease or sublease of family land without spousal\nconsent)\n• sections 115 and 129 (no mortgage, including equitable mortgage, of family\nland without spousal consent)\n\nThese amendments were presumably made with section 39 of the Land Act in\nmind. However, there are some important differences between section 39 and\nthe relevant provisions of the Registration of Titles Act. In particular:\n\n• section 39 (as amended)25 protects a much wider category of persons than\nmerely spouses (eg, it protects dependent children of majority age; and in\nsome circumstances protects minors and orphans);\n• Section 39 expressly makes transactions without consent void, even in\nfavour of innocent purchasers; whereas the Registration of Titles Act is\nsilent on the effect of the absence of consent.26", "word_count": 430, "start_char": 19261, "end_char": 21989}
{"chunk_id": "DOC0081__00010", "doc_id": "DOC0081", "chunk_index": 10, "text": "Again, as aforementioned, the assumption is that given the importance of the\nLand Act in Ugandan social and legislative history, if an inconsistency occurs\nbetween the provisions of the Land Act and the provisions of the Registration of\nTitles Act, the Land Act was intended to prevail. Accordingly, the law should be\nstreamlined to avoid the apparent conflict in relation to spousal consent within\nthe two laws and to ensure that the provisions of the Land Act are paramount.\n\nSection 39 of the Land Act also places mortgages in a special realm as far as\nspousal consent is concerned27. It is on the strength of this provision that her\nLordship Justice Arach Amoko rejected the Respondent’s claim to an equitable\n\nThe Land (Amendment) Act, No. 1 of 2004\nUnder normal Torrens title principles, an innocent purchaser under a transaction where consent\nappeared to have been given but was not in fact given (eg, where a spouse’s consent was obtained\nby deception or duress, or where a person impersonated the spouse), would take free of the need\nfor consent: see, eg, Boyd v Mayor of Wellington [1924] NZLR 1174.\n27 See sub Section 3 thereof\n\ninterest in the suit property in the case of Sentongo Producers & Coffee\nFarmers Ltd v Rose Nakafuma Muyiisa28. The Respondent had claimed an\nequitable interest on the suit property on the basis of having contributed money\nand materials for the construction of the house thereon. The Court’s holding was\nto the effect that the restrictions on land transfer under section 39 of the Land Act\ndo not affect a legal mortgage and secondly, that co-ownership can not be\nconferred by marriage.\n\nAs a further comment on this issue, I would add that the Mortgage Bill, which was\ndrafted partly in response to the recommendations of the Uganda Law Reform\nCommission29, is yet to be passed in Parliament. However, the Commission had\nrecommended, in part30, that section 39 of the Land Act be amended to provide\nfor co-ownership of family land.", "word_count": 335, "start_char": 21989, "end_char": 23961}
{"chunk_id": "DOC0081__00011", "doc_id": "DOC0081", "chunk_index": 11, "text": "s a further comment on this issue, I would add that the Mortgage Bill, which was\ndrafted partly in response to the recommendations of the Uganda Law Reform\nCommission29, is yet to be passed in Parliament.H\n\nowever, the Commission had\nrecommended, in part30, that section 39 of the Land Act be amended to provide\nfor co-ownership of family land.\n\nIt is understandable that the rationale behind this recommendation is to protect\nthe rights of women to land interests and avoid court decisions similar to that of\nRose Nakafuma Muyiisa above and it is truly supported. However, it can be\nargued that this automatic co-ownership is impracticable. This is because it would\nintroduce substantial complexity to land holdings. It would import into the\nrelationship between spouses the entire law of co-ownership—an area of law that\nis renowned for its complexity and difficulty. As such, on the contrary, the\nspousal right to lodge a caveat, granted by section 39 of the Land Act, is sufficient\nprotection. If a caveat is lodged, no mortgagee can claim to be ignorant of the\nneed for consent; and under clause 5(2) of the Mortgage Bill, through due\ndiligence, it is the mortgagee’s obligation to satisfy itself whether a prospective\nmortgagor has a spouse or not.\n\n28 HC MSC No. 690 of 1999\n29 Study Report on Reform of the Laws Relating to Mortgage Transactions (U Law Reform Commission\nPublication No 22 of 2004)\n30 Ibid, Commission recommendation No. 12\n\n(g)\nCreating a general property law statute outside the Registration of Titles\nAct\nMost jurisdictions with Torrens title registration principles comparable to those in\nUganda separate the registration of titles legislation from general property law\nlegislation. This makes for a convenient division of subject-matter: the Torrens\nstatute deals with the registration of interests in land, while the general property\nlaw statute (or statutes, for often there is more than one) deals with more\ntechnical and discrete property law principles. A reader who wants to find out\nabout the registration of title goes to the registration of titles Act; but a reader\nwho wants to find out about more general and underlying principles relating to\nland—such as the general principles regulating leases, mortgages, easements,\ncovenants, and the like—goes to the general property statute.\n\nUnusually, the Ugandan Registration of Titles Act covers both registration of title\nand general property law issues. This makes it a large, complex and somewhat\nunwieldy statute, and one that needs to be amended every time an amendment is\ndesired to any of the “general” property law issues it covers. Streamlining the\nlegislation, by stripping out general property law provisions, would make it easier\nto amend—as well as easier to use.", "word_count": 446, "start_char": 23617, "end_char": 26377}
{"chunk_id": "DOC0081__00012", "doc_id": "DOC0081", "chunk_index": 12, "text": "his makes it a large, complex and somewhat\nunwieldy statute, and one that needs to be amended every time an amendment is\ndesired to any of the “general” property law issues it covers.S\n\ntreamlining the\nlegislation, by stripping out general property law provisions, would make it easier\nto amend—as well as easier to use.\n\nApparently, the process of stripping-out is already happening. For example, the\nMortgage Decree (1974), while it existed, regulated some aspects of mortgage\nlaw. More recently, the Mortgage Bill takes from the Registration of Titles Act\nalmost all of the general provisions regulating mortgages and puts them into a\nstand-alone mortgage statute. Likewise, the Uganda Law Reform Commission’s\nrecent work on landlord and tenant law is likely to lead to a “stand-alone” code\nof landlord and tenant law, divorced from the registration of titles legislation.\n\nConclusion:\nAs mentioned at the onset, there are a variety of land laws that need to be\n\naddressed to bring them into conformity with the Constitution and the Land Act.\nThis paper can not exhaustively cover all these laws. However, an appreciation\nneeds to be made of the fact that even the constant amendments made to the\nmost significant laws, that is, the Registration of Titles Act, the Land Act and the\nMortgage Act, should be in line with the “needs” of the people of Uganda and\nnot necessarily their “wants”. The laws should also be drafted so as to ensure that\nall interests are taken care of in a balanced and convenient manner.", "word_count": 252, "start_char": 26057, "end_char": 27571}
