{"chunk_id": "DOC0159__00000", "doc_id": "DOC0159", "chunk_index": 0, "text": "NUTRIENT COMPOSITION AND CONSUMER ACCEPTABILITY OF INSTANT\nCOWPEA LEAF BASED SOUP\n\nALPHA BONIFACE SSONKO\nS21B52/010\n\nA DISSERTATION SUBMITTED TO THE FACULTY OF AGRICULTURAL SCIENCES IN\nPARTIAL FULFILMENT OF THE REQUIREMENTS FOR THE AWARD OF THE DEGREE OF\nBACHELOR OF SCIENCE IN FOOD SCIENCE AND TECHNOLOGY OF UGANDA CHRISTIAN\nUNIVERSITY\nJune,2025\n\nii\n\nDECLARATION\nI Ssonko Alpha Boniface, a student of Uganda Christian University pursuing a Bachelor\nof Science in Food Science and Technology do declare that the work in this\ndissertation is my original work to the best of my knowledge. The dissertation has\nbeen made based on the skills and knowledge I have acquired at the Uganda Christian\nUniversity while doing the Special Project course.\n\nSignature\nDate..................11/06/2025....\nSsonko Alpha Boniface\nS21B52/010\n\niii\n\nABSTRACT\nCowpea leaves are a nutritious vegetable important in African diets, particularly in\nUganda. The research indicated that their utilization is limited by post-harvest losses\nand nutrient loss during traditional preparation. This study aimed to enhance the\nsensory and nutritional attributes of an instant cowpea leaf-based soup. The\nresearch investigated the impact of incorporating additives such as monosodium\nglutamate, mono- and di-glycerides of fatty acids, and whey protein on the soup's\nphysicochemical properties and consumer acceptability. The research employed the\nuse of cowpea leaf and orange-fleshed sweet potato flour as starch-based sources,\nand the soup was processed using extrusion cooking. Proximate and mineral\ncomposition were analyzed according AOAC methods, and sensory evaluation\ndetermined consumer preferences. This research sought to improve the nutritional\nvalue and consumer appeal of cowpea leaf soup, to promote its consumption and\naddress micronutrient deficiencies.\n\niv\n\nAPPROVAL\nThis dissertation has been prepared by Ssonko Alpha Boniface under my supervision\nand is ready for submission to Uganda Christian University for the award of a degree\nof Bachelor of Science in food Science and Technology.\nSignature\nDate...11/06/2025.....................................\nMadam Kwikiriza Mbabazize\n\nv", "word_count": 304, "start_char": 0, "end_char": 2166}
{"chunk_id": "DOC0159__00001", "doc_id": "DOC0159", "chunk_index": 1, "text": "ignature\nDate...11/06/2025.....................................M\n\nadam Kwikiriza Mbabazize\n\nv\n\nACKNOWLEDGEMENTS\nTo the Almighty God, who gave me the strength and good mental health during the\nentire research period. Sincere gratitude to my biological mother, Ms. Betty Mugerwa\nfor her unwavering emotional and financial support.\nTo my supervisor, Madam Kwikiriza Mbabazize, for her guidance and patience. For\nthe time that she offered to supervise me and ensure I was on the right track.\nTo my Head of Department, Dr Martin Mutambuka for his input and wide span of\nvaluable knowledge that informed the research work. To Ms Norah Akaba, a master’s\nstudent at Uganda Christian University, for the support offered during production,\nand corrections even with her busy work schedule.\nTo the National Agricultural Research Laboratories (NARL)- Kawanda, the\nmanagement of Food Biosciences and Agribusiness Division for allowing the use of\nthe facility under the pilot plant section. To Peak value incubation center, Mukono\nfor opening up your premises for the extrusion process especially.\nFinally, my sister, Nalutaaya Alexis Cindy, my classmates in the Food Science class\nfor the continuous encouragement throughout this research process.\n\nvi\n\nContents\nDECLARATION ....................................................................................................................................... ii\nABSTRACT ............................................................................................................................................. iii\nAPPROVAL ............................................................................................................................................ iv\nACKNOWLEDGEMENTS ........................................................................................................................ v\nCHAPTER ONE ...................................................................................................................................... 1\n1.0 BACKGROUND ........................................................................................................................... 1\nPROBLEM STATEMENT ..................................................................................................................... 2\n1.2 RESEARCH OBJECTIVES .......................................................................................................... 5\n1.2.1 Main Objective: ................................................................................................................ 5\n1.2.2 RESEARCH QUESTIONS ........................................................................................................ 5\n1.3 JUSTIFICATION .......................................................................................................................... 5\n1.4 SIGNIFICANCE ............................................................................................................................ 6\nCONCEPTUAL FRAMEWORK ............................................................................................................... 7\nCHAPTER TWO ..................................................................................................................................... 9\n2.0 LITERATURE REVIEW ............................................................................................................... 9\n2.1 Cowpea production worldwide and in Uganda ............................................................. 9\n2.2 Nutritional Significance of Cowpea Leaves ................................................................... 9\n2.3 Post-harvest handling of cowpea leaves ...................................................................... 11\nImportance of Functional Additives in Food Processing .................................................. 12\n2.4 Impact of Processing on Nutrient Retention ............................................................... 12\n2.5 Consumer Acceptability and Market Trends ................................................................ 12\nCHAPTER THREE ................................................................................................................................ 14\n3.0 METHODOLOGY ...................................................................................................................... 14\n3.1 Raw materials ..................................................................................................................... 14\n3.2 Preparation of cowpea leaves grits. ............................................................................. 14\n3.3 Preparation of orange-fleshed sweet potato (OFSP) flour ...................................... 14\n3.4 Extrusion Cooking Technology ........................................................................................ 15\n3.5 Proximate Composition .................................................................................................... 15\n3.6 Mineral composition (Zinc, Iron, Calcium) .................................................................. 15\n3.7 Sensory Evaluation ............................................................................................................ 16\n3.8 Cooking procedures of soup powders and Consumer Acceptability Tests ........... 16\nStatistical Analysis .................................................................................................................... 16\nCHAPTER FOUR .................................................................................................................................. 18\n\nvii", "word_count": 370, "start_char": 2073, "end_char": 7666}
{"chunk_id": "DOC0159__00002", "doc_id": "DOC0159", "chunk_index": 2, "text": "4.0 RESULTS ................................................................................................................................... 18\nTable 1: Mineral Content by Treatment Type ........................................................................ 18\nTable 2: A table showing consumer acceptability scores by means and standard\ndeviations for each Treatment Group. ................................................................................... 19\nTable 3. A table showing proximate composition across the treatment groups ............. 19\nREFERENCES ....................................................................................................................................... 23\nAPPENDIX ............................................................................................................................................. 28\nTable 1.1: Nutritional composition of cowpea leaves and mature seeds (100g\nedible portions). ....................................................................................................................... 28\nTable 2 Anova table for protein ................................................................................................... 28\nTable 3 Anova table for moisture content. ................................................................................ 28\nTable 4 t-table for mineral analysis ............................................................................................ 29", "word_count": 91, "start_char": 7666, "end_char": 9138}
{"chunk_id": "DOC0159__00003", "doc_id": "DOC0159", "chunk_index": 3, "text": "table showing proximate composition across the treatment groups ............. 19\nREFERENCES ....................................................................................................................................... 23\nAPPENDIX ............................................................................................................................................. 28\nTable 1.1: Nutritional composition of cowpea leaves and mature seeds (100g\nedible portions). ....................................................................................................................... 28\nTable 2 Anova table for protein ................................................................................................... 28\nTable 3 Anova table for moisture content. ................................................................................ 28\nTable 4 t-table for mineral analysis ............................................................................................ 29\n\nCHAPTER ONE\n1.0 BACKGROUND\nCowpea (Vigna unguiculata) is a global vegetable whose cultivation is believed to\nhave begun from Africa more than 5000 years ago. It belongs to kingdom (Plantae),\ngenus (Vigna), and Species (unguiculata). Cowpea is a valuable component in the\nfarming systems of the majority of resource poor rural households in Sub-Saharan\nAfrica (SSA) for its various attributes. It is cultivated majorly as a vegetable as well\nas a cover and fodder crop. The cowpea leaves, immature pods and mature pods are\nan important source of micro and macro nutrients like protein, crude fibre, minerals\nlike (calcium, iron, zinc, phosphorus), and vitamins. The tender green leaves contain\n15 times more minerals, micro and macronutrients than in grains(Kizito, 2022)\nCowpea leaves are widely consumed in Africa due to their rich nutritional profile,\nparticularly their high levels of vitamins, minerals, and dietary fiber. Cowpea leaves\nare consumed by up to 99.4% of households in Uganda and are often served during\nimportant occasions such as funerals, child naming ceremonies, and visits. In\nUganda, cowpea is ranked third in importance, and the Kumi district in Eastern\nUganda is the largest producer and consumer of the crop, with 90% of the country’s\nproduction (Kizito, 2022). The consumption of cowpea as a fresh vegetable has\nrapidly increased in the semi-arid zone of Africa. There are no released varieties on\nrecord for vegetable use in Africa. (Kizito, 2022). However, traditional preparation\nmethods often lead to significant nutrient loss and compromise sensory attributes\nsuch as texture, taste, and color.\nA soup is a flavorful and nutritious liquid food usually served at the beginning of a\nmeal or a snack. The flavor of the main ingredient used should remain prominent\n(Fern et al., 2020). Green leafy vegetables are widely used in the preparation of\nvegetable soups, the most common being spinach and chard. Green leafy vegetables\nare a good source of dietary fiber and are rich in chlorophyll, vitamins C, K, iron,\nand folic acid, among others. Different types of soup powders are available on the\nmarket. Most of the soup powders are usually made from combination starch-rich\nraw materials and mixed with different vegetables. Corn flour is used as a thickener", "word_count": 421, "start_char": 8144, "end_char": 11427}
{"chunk_id": "DOC0159__00004", "doc_id": "DOC0159", "chunk_index": 4, "text": "reen leafy vegetables\nare a good source of dietary fiber and are rich in chlorophyll, vitamins C, K, iron,\nand folic acid, among others.D\n\nifferent types of soup powders are available on the\nmarket.M\n\nost of the soup powders are usually made from combination starch-rich\nraw materials and mixed with different vegetables.C\n\norn flour is used as a thickener\n\nand stabilizer agent in soups. Spices in powder form can be added to improve the\npalatability of soup.\nAn instant soup is a pre-packaged, ready-to-make soup that requires minimal\npreparation. Typically, it comes in powder, paste, or dehydrated form and only needs\nthe addition of hot water (or sometimes milk) to be ready for consumption. The key\nFeatures include quick preparation usually, shelf-Stable due to dehydration or\npreservation techniques, convenient that is; Ideal for people looking for fast meal\noptions. It has a variety of forms, available as powder, granules, freeze-dried\ningredients, or concentrated paste.\nFood additives are substances added to food to preserve flavor or enhance its taste,\nappearance, or other qualities and are inevitable in packaged food. The proper use\nof food additives plays an important role in modern food industry. Firstly, food\nadditives not only function in food preservation, but also help to enhance certain\nqualities of food such as color, flavor and flexibility, as well as improving the\nnutrition of food. For example, proper food nutrition enhancers can be added to\nmake up nutrition loss during food processing. Food additives have been used by man\nsince the earliest times. The safety of food additives is an important issue related\nto the food industry, so the use of additives in food should be controlled by laws in\nmany countries.(ELshreif et al., 2023)\nIn Uganda, where 29% of children under five are stunted (Uganda Bureau of Statistics\n[UBOS], 2021) and micronutrient deficiencies are prevalent, improving the\nnutritional quality of commonly consumed foods like cowpea leaves is essential.\nThis study aims to improve the sensory properties, reconstitution quality, and\nnutrient retention of instant cowpea leafy soup by optimizing its formulation and\nprocessing conditions.\nPROBLEM STATEMENT\nDespite the availability and affordability of cowpea leaves, the average dietary\nintake of essential vitamins and minerals remains below the recommended daily\nallowance, partly due to the improper preparation of these vegetables (FAO, 2020).\nFor example, the loss of vital nutrients during cooking can reach 50% for some\nvitamins and minerals. Traditional preparation methods, such as overcooking and", "word_count": 403, "start_char": 11071, "end_char": 13684}
{"chunk_id": "DOC0159__00005", "doc_id": "DOC0159", "chunk_index": 5, "text": "ROBLEM STATEMENT\nDespite the availability and affordability of cowpea leaves, the average dietary\nintake of essential vitamins and minerals remains below the recommended daily\nallowance, partly due to the improper preparation of these vegetables (FAO, 2020).F\n\nor example, the loss of vital nutrients during cooking can reach 50% for some\nvitamins and minerals.T\n\nraditional preparation methods, such as overcooking and\n\nboiling without appropriate seasoning, often lead to significant nutrient losses and\nreduce the sensory qualities of this soup. The current practices result in the\ndegradation of heat-sensitive nutrients like vitamin C and affect the bioavailability\nof minerals, thus reducing the nutritional benefits of the leafy vegetable.\nThe current cowpea leafy vegetable soup that was prepared by extrusion cooking, a\nhigh-temperature short-time method (HTST) targeted women of reproductive age as\nwell as children 5 years and below to provide a healthy, easy-to-prepare dish to\nreduce the prevalence of nutritional deficiencies.\nHowever, the sensory attributes do not meet consumer expectations such as texture,\nas the soup lumps upon reconstitution, smoothness, taste, and aroma as compared\nto common soups prepared traditionally. The nutritional value of the soup also does\nnot provide the recommended daily intake of the main nutrients for the target group\nsuch as iron, zinc, folic acid, dietary fiber was all halved after analysis of the final\nproduct (Akaba et al., 2024 unpublished).\nThere is also a noticeable gap in research and development focused on utilizing and\nadding value to cowpea leaves. This neglect leaves consumers without adequate\nsupport in accessing nutritious food products derived from this valuable resource.\nConsequently, opportunities to address nutritional deficiencies through cowpea\nleaves are being missed.\nTo mitigate post-harvest losses and enhance the utilization of cowpea leaves, an\ninstant cowpea soup was developed using extrusion cooking, a high-temperature\nshort-time (HTST) processing method. While extrusion cooking offers advantages in\nterms of nutrient retention and microbial safety, there are still unknowns and\nchallenges specific to its application in cowpea-based instant soups. These include:\nImpact of Extrusion Parameters: The precise effects of varying extrusion parameters\n(e.g., temperature, screw speed, feed rate) on the nutritional composition, sensory\nattributes, and reconstitution properties of cowpea-based soups are not fully\nunderstood. Optimizing these parameters to maximize nutrient retention while\nmaintaining desirable sensory qualities requires further investigation.\nIngredient Interactions During Extrusion: The interactions between cowpea leaves\nand other ingredients, including fortificants and additives, during the extrusion", "word_count": 392, "start_char": 13265, "end_char": 16079}
{"chunk_id": "DOC0159__00006", "doc_id": "DOC0159", "chunk_index": 6, "text": "ptimizing these parameters to maximize nutrient retention while\nmaintaining desirable sensory qualities requires further investigation.I\n\nngredient Interactions During Extrusion: The interactions between cowpea leaves\nand other ingredients, including fortificants and additives, during the extrusion\n\nprocess are complex. It is unclear how these interactions affect the stability of\nnutrients and the overall quality of the final product.\nEffect on Bioavailability: While HTST processing can help retain certain nutrients,\nits effect on the bioavailability of key nutrients like iron and zinc in cowpea-based\nsoups needs further study. It is crucial to ensure that the processing method not only\nretains nutrients but also preserves their availability for absorption by the body.\nBeyond the extrusion process itself, the current prototype of this instant cowpea\nleaf-based soup faces several challenges that impede its consumer acceptance and\nmarket potential. These challenges include:\nInadequate Sensory Characteristics: The soup exhibits unsatisfactory flavor, texture,\nand aroma, negatively impacting the overall consumption experience. Specifically,\nthe flavor lacks depth and balance, and the color deteriorates during processing.\nPoor Reconstitution Quality: The soup's texture is problematic, as it does not\nreconstitute properly, often resulting in lumpiness and incomplete dissolution.\nNutritional Insufficiency: The nutritional composition of the soup does not\nadequately meet the recommended dietary allowances, particularly for key\nnutrients such as zinc, iron, and protein.\nThese limitations, stemming from both processing and formulation issues, prevent\nthe instant cowpea leaf-based soup from effectively addressing nutritional needs\nand gaining widespread consumer acceptance. Therefore, this research is necessary\nto investigate ingredient enhancements and processing modifications, with a focus\non optimizing the extrusion process, to improve the soup's sensory qualities,\nnutritional value, consumer appeal, and usability. This initiative will involve\nfortifying the soup and incorporating stabilizers and emulsifiers to enhance its\ntexture, stability, and shelf life. For example, monosodium glutamate will be\nexplored for its potential to enhance umami flavor and allow for sodium reduction,\na mixture of mono- and diglycerides of fatty acids will be used to improve\nreconstitution and prevent phase separation, and whey protein will be added to\nimprove creaminess, mouthfeel, and protein content.\n\nTherefore, this research aimed at improving the nutritional (iron, zinc and folic acid)\nand sensory quality (smoothness) of the product to enhance its acceptability and\nconsumption.", "word_count": 367, "start_char": 15780, "end_char": 18482}
{"chunk_id": "DOC0159__00007", "doc_id": "DOC0159", "chunk_index": 7, "text": "herefore, this research aimed at improving the nutritional (iron, zinc and folic acid)\nand sensory quality (smoothness) of the product to enhance its acceptability and\nconsumption.\n\n1.2 RESEARCH OBJECTIVES\n1.2.1 Main Objective:\nTo determine the contribution of selected enhancers to the sensory and nutritional\nattributes of the instant cowpea leaf-based soup.\nSpecific objectives\n1.To determine the physicochemical characteristics of the instant cowpea leaf-based\nsoup across the three treatment groups.\n2. To determine the consumer acceptability of the instant cowpea leaf-based soup\nacross the three treatment groups.\n1.2.2 RESEARCH QUESTIONS\n1.What are the physicochemical characteristics of the instant cowpea leaf-based\nsoup across the three treatment groups?\n2.What is the consumer acceptability of the instant cowpea leaf-based soup across\nthe three treatment groups?\n1.3 JUSTIFICATION\nUganda has a high prevalence of micronutrient deficiencies, particularly among\nchildren and women of reproductive age. The study seeks to improve the\nbioavailability of Vitamin A, iron, zinc, and folic acid in an instant cowpea leafy\nsoup, addressing critical nutritional gaps. In developing countries, especially African\ncountries, malnutrition remains a major health problem in infants and pre- school\nchildren.(Olapade et al., 2012)\nHigh Post-Harvest Losses affecting cowpea leaves, despite their nutritional value,\nhave a short shelf life, leading to significant post-harvest losses of 10-50%.\nDeveloping an instant soup will enhance preservation, reduce wastage, and increase\nutilization.", "word_count": 219, "start_char": 18302, "end_char": 19889}
{"chunk_id": "DOC0159__00008", "doc_id": "DOC0159", "chunk_index": 8, "text": "n developing countries, especially African\ncountries, malnutrition remains a major health problem in infants and pre- school\nchildren.(Olapade et al., 2012)\nHigh Post-Harvest Losses affecting cowpea leaves, despite their nutritional value,\nhave a short shelf life, leading to significant post-harvest losses of 10-50%.D\n\neveloping an instant soup will enhance preservation, reduce wastage, and increase\nutilization.\n\nLimited Research on Cowpea Leaves for Instant Soup. While cowpea leaves are\nwidely consumed in Africa, there is limited research on their use in processed food\nproducts like instant soup. This study will provide insights into optimizing processing\ntechniques for better retention of nutrients and sensory attributes.\nConsumer Acceptability Issues. Previous formulations of instant cowpea soup faced\nchallenges in texture, flavor, and reconstitution quality, leading to low consumer\nacceptance. This study aims to enhance these properties by incorporating functional\nadditives.\nMarket Potential and Convenience. The demand for instant, easy-to-prepare, and\nnutrient-dense foods is increasing. This research aims to develop a shelf-stable,\nhighly nutritious soup product that meets consumer needs for convenience and\nhealth benefits.\nMeeting the Demand for Convenient and Nutritious Foods: There is a growing demand\nfor convenient, easy-to-prepare, and nutrient-dense food products. This research\naligns with this market trend by developing a shelf-stable, highly nutritious soup that\nmeets consumer needs for convenience and health benefits. Such a product has the\npotential to address both nutritional deficiencies and consumer preferences in a\nrapidly changing food environment\n1.4 SIGNIFICANCE\nImproved Nutritional Intake. By enhancing the bioavailability of iron, zinc, and folic\nacid, the study contributes to reducing malnutrition and anemia among vulnerable\npopulations.\nIron regulates several biochemical processes such as electron transfer reactions,\ngene regulation, binding and transport of oxygen, and regulation of cell growth and\ndifferentiation. Its deficiency contributes to anemia. It is essential for fetal growth\nand development, and thus iron demand is high during pregnancy and any shortage\nonsets the intrauterine growth restriction, premature delivery, low birth weight and\npostpartum depression, to name a few. South Asia and Sub-Saharan Africa account\nfor the highest anemia prevalence in pregnant women and pre-school children of\n47.7 and 55.1 %, and 45.8 and 59.9%, respectively(Janaswamy et al., 2021)", "word_count": 353, "start_char": 19474, "end_char": 22019}
{"chunk_id": "DOC0159__00009", "doc_id": "DOC0159", "chunk_index": 9, "text": "outh Asia and Sub-Saharan Africa account\nfor the highest anemia prevalence in pregnant women and pre-school children of\n47.7 and 55.1 %, and 45.8 and 59.9%, respectively(Janaswamy et al., 2021)\n\nEnhanced Shelf Life and Marketability. The development of a stable, fortified soup\nproduct will extend the usability of cowpea leaves and create economic\nopportunities for farmers and food processors.\nBetter Sensory and Functional Properties. The study will optimize the soup’s\nformulation to improve texture, flavor, and overall acceptability, increasing its\npotential for commercialization.\nContribution to Food Security and Value Addition. The research supports food\nsecurity by promoting the use of underutilized but nutrient-rich vegetables. It also\nadds value to agricultural produce, supporting rural livelihoods.\nScientific Contribution. The findings will provide data on optimizing processing\ntechniques for cowpea leaf-based products, potentially influencing future food\nformulation and processing strategies.\n1.5 CONCEPTUAL FRAMEWORK\nIndependent Variables: These are the factors you are manipulating or changing in\nyour experiment.\nTypes and levels of additives: Caramel (for color), Whey protein isolate, MSG\n(Monosodium glutamate)\nPoint of additive addition: Pre-extrusion or Post-extrusion\nExtrusion Cooking Parameters\nTemperature\nScrew speed\nDependent Variables: These are the outcomes being measured to determine if they\nare affected by the independent variables.\nPhysicochemical Characteristics of the Soup:\nProximate composition (dry matter, ash, crude protein)\nMineral content (Zinc, Iron, Calcium)\nViscosity (related to texture)\n\nSensory Attributes of the Soup: Appearance, Color, Aroma, Flavor, Taste,\nTexture/Mouthfeel and Overall acceptability.\nControl Variables: These are factors that you keep constant to ensure that only the\nindependent variables are affecting the dependent variables.\nBase ingredients (cowpea leaf powder, OFSP flour, maize flour)\nExtruder type\nBasic extrusion process\nCooking procedure of soup powders\nPanelists (sampling is used to control this)", "word_count": 281, "start_char": 21826, "end_char": 23913}
{"chunk_id": "DOC0159__00010", "doc_id": "DOC0159", "chunk_index": 10, "text": "ontrol Variables: These are factors that you keep constant to ensure that only the\nindependent variables are affecting the dependent variables.B\n\nase ingredients (cowpea leaf powder, OFSP flour, maize flour)\nExtruder type\nBasic extrusion process\nCooking procedure of soup powders\nPanelists (sampling is used to control this)\n\nCHAPTER TWO\n2.0 LITERATURE REVIEW\n2.1 Cowpea production worldwide and in Uganda\nCowpea, Vigna unguiculata (L.) is the most important legume grown in the semi-arid\ntropics and one of the world's major legumes. It is adapted to the Sahelian climate\nwhich is characterized by low rainfall and poor soil fertility. It originated and was\nfirst domesticated in Southern Africa and was later moved to East and West Africa\nand Asia. It is a multi-purpose indigenous crop that grows largely in the tropics of\nsub-Saharan Africa (SSA). It is reported that 95.6% of the area under cultivation of\ncowpea leaves worldwide in 2017 was in Sub Saharan Africa. Uganda is ranked the\n8th largest producer of cowpea in Africa, grown by over 2.2 million smallholder\nfarmers with total annual production of nearly 22,000 tons. Cowpea in Uganda is\ngrown throughout the country but Eastern and Northern region being the 1st and 2nd\nlargest producers in the country.(Pokhrel, 2024)\n2.2 Nutritional Significance of Cowpea Leaves\nCowpea leaves are an excellent source of vitamins A, C, and K, minerals like iron\nand calcium, and dietary fiber. Their high antioxidant content provides health\nbenefits such as improved immunity and reduced oxidative stress. However,\nimproper processing can lead to significant nutrient losses, necessitating optimized\ncooking and formulation strategies to retain their full nutritional potential.\nCowpea leaves possess a rich nutritional profile, serving as a crucial reservoir of\nessential nutrients such as proteins, vitamins, and minerals. Cowpea leaves possess\nsignificant levels of carotenoids, including lutein, violaxanthin, α-carotene, 9-cis-βcarotene, and zeaxanthin. They contain a considerable amount of phytochemicals\nsuch as flavonoids and phenolic acids. These leaves are also characterized by their\nlow-fat content and significant contribution to dietary fibre intake(Mungofa &\nBeswa, 2024)\nConsumption of cowpea leaves improves the activity of both micro and macronutrients in the human body by preventing iron and protein-calorie deficiencies\n(Pottorff et al., 2012; Alemu et al., 2016). Organoleptically, cowpea leaves are mild\nand good tasting compared favorably with other tropical vegetables like amaranth,", "word_count": 379, "start_char": 23589, "end_char": 26147}
{"chunk_id": "DOC0159__00011", "doc_id": "DOC0159", "chunk_index": 11, "text": "rganoleptically, cowpea leaves are mild\nand good tasting compared favorably with other tropical vegetables like amaranth,\n\nspinach, pumpkins, lettuce, and sweet potatoes (Mamiro et al., 2011). Cowpea\nleaves also compare well nutritionally with other tropical leaf vegetables like\nSolanum nigrum, Amaranthus sp., Ipomoea batatas, and Cucurbita moschata\n(Gonçalves et al., 2016). Cowpea leafy vegetables can increase the nutrient content\nof less nutrient-dense foods due to their significantly high nutrient content (Wasswa,\n2021). A study by Prange (2012) reported that with an increase in age, cowpea leaves\nindicated an increase in carbohydrates, and a reduction in their protein content\nwhile maintaining a consistent level of fat and ash content. Cowpea leaves are\npriced lower than animal protein Devi (2020) and possess a higher protein content\nthan seeds during the cropping season, with protein percentages ranging from 24.7%\nto 25.7% for seeds and 29.4% to 33.1% for leaves (Prange, 2012). A study by Mamiro\net al. (2011) found that cowpea leaves produce 9 times as many calories, 1.5 times\nas much protein, 90 times more calcium, and 1,000 times more ascorbic acid and\nbeta carotene than the crop's grains.\n\nCowpea is a rich source of proteins (28-42 g/100 g), total essential amino acids\n(0.027-0.031 mg/100g), crude fiber (10.09-25g/100g), carotenoids (32.74-\n36.55mg/100g), iron (66-75 mg/100g), calcium (17.1-39.87 mg/100 g) and, zinc\n(5.22-12.91mg/100g). According to Carneiro da Silva et al. (2018), cowpea is a\nsignificant dietary protein source that nutritionally complements low-protein cereal\nand tuber crops and is extremely important to millions of people in developing\nnations, estimated 38 million families, or 194 million individuals (Davis et al., 2007;\nOwade et al., 2019). Larochelle et al. (2013) showed that cowpea crude protein\nconcentrations of 561 cowpea leaf samples taken from 10 accessions and around 10\nlandraces in Tanzania and Uganda ranged from 21.5% to 40.3%.\n\nCowpea leaves contain vitamins and minerals, that are uncommon in most exotic\nplants, and consuming AIVs helps poor rural households combat malnutrition (Ojiako\n& Kayode, 2014; Okello et al., 2015; Osho & Olasanmi, 2019; Omomowo & Babalola,\n2021). Leafy cowpea contain trace amounts of zinc, copper, manganese, sodium,\niron, and selenium (Hamid et al., 2015). A study by Kim et al. (2014), reported that\nthe mineral content of various cowpea cultivars varied greatly. Okonya (2014),\n\nshowed that young cowpea obtained from Tanzania and Uganda had carotene values\nranging from 4.1 to 30.5 mg/100 g and iron concentrations ranging from 140.5 to\n3994.7 g/100g. In comparison to cooked cowpea seeds, cooked cowpea leaves have\na calcium content that is seven times higher, an iron content that is three times\nhigher, and the phosphorus concentration of cooked cowpea leaves is equivalent to\n50% of that found in cooked seeds.", "word_count": 448, "start_char": 26026, "end_char": 28947}
{"chunk_id": "DOC0159__00012", "doc_id": "DOC0159", "chunk_index": 12, "text": "n comparison to cooked cowpea seeds, cooked cowpea leaves have\na calcium content that is seven times higher, an iron content that is three times\nhigher, and the phosphorus concentration of cooked cowpea leaves is equivalent to\n50% of that found in cooked seeds.\n\nCowpea is rich in essential vitamins like B vitamins (B6 &B9), riboflavin, thiamin,\nniacin, and pantothenic acid, as well as β - Carotene, Ascorbic acid (Asare et al.,\n2013; Ngalamu et al., 2014). The amount of readily available nutrients, such as\nvitamin C, in leafy cowpea, is decreased by sun-drying before cooking, adding crude\nsodium carbonate salt to the cooking water, and heating them for an extended\nperiod (Gonçalves et al., 2016). Also, Okonya, (2014), reported that children who\nate cowpea leaves had higher blood hemoglobin levels and more bioavailable betacarotene. Vitamins C and E are crucial for women of reproductive age because they\nfunction as antioxidants, which are substances that disarm free radicals and shield\ncells and tissues from oxidative deterioration (Otunchieva et al., 2022). When\ncomparing raw cowpea seeds to raw cowpea leaves (not dried), the cowpea leaves\ncontain around 20% more thiamine and twice as much riboflavin. Similar to cowpea\nseeds, cowpea leaves are a highly valuable reservoir of folic acid, with quantities of\n334 μg and 2012 μg of free and total folate per 100 g of solids in their raw form (B.B.\nSingh, 1997).\n2.3 Post-harvest handling of cowpea leaves\nRole of Orange Flesh Sweet Potato (OFSP) Flour\nOFSP flour is rich in beta-carotene, which enhances vitamin A intake, a critical\nnutrient for vision and immune health. It also improves the texture and color of food\nproducts, making it an ideal ingredient for fortifying cowpea soup while enhancing\nits sensory appeal.\nSweet potato (Ipomoea batatas) is of great nutritional and health significance,\nmainly due to its beta-carotene and anthocyanin properties(Omoba et al., 2020)", "word_count": 312, "start_char": 28686, "end_char": 30631}
{"chunk_id": "DOC0159__00013", "doc_id": "DOC0159", "chunk_index": 13, "text": "t also improves the texture and color of food\nproducts, making it an ideal ingredient for fortifying cowpea soup while enhancing\nits sensory appeal.S\n\nweet potato (Ipomoea batatas) is of great nutritional and health significance,\nmainly due to its beta-carotene and anthocyanin properties(Omoba et al., 2020)\n\nImportance of Functional Additives in Food Processing\nAdditives play a crucial role in food formulation by enhancing flavor, texture, and\nstability. The following additives are particularly relevant to this study:\nMonosodium Glutamate (MSG): Commonly used to enhance umami flavor, MSG\nimproves overall taste perception and consumer acceptance. Commercially\nprepared soup mixes are usually made using (MSG) Monosodium Glutamate to\nenhance desired flavor. MSG restores some of the original flavors, increases\npalatability and raises overall flavor level while reducing sodium chloride\nconcentration (Abeysinghe & Illeperuma, 2006)\nMono- and Di-Glycerides of Fatty Acids: These emulsifiers help improve texture by\npreventing phase separation and ensuring smooth consistency.\nWhey Protein: Enhances the mouthfeel and protein content of the soup, making it\nmore nutritious and appealing.\nCaramel: Caramel, defined as coloring agent and as an anti- oxidant, is being used\nin several kinds of food products.(Sengar & Sharma, 2014) Used for color\nenhancement, caramel provides an appealing golden-brown hue, improving the\nvisual acceptability of the soup.\n2.4 Impact of Processing on Nutrient Retention\nHigh-temperature, short-time (HTST) processing techniques such as extrusion\ncooking help retain heat-sensitive nutrients like vitamin C while ensuring microbial\nsafety. This method minimizes nutrient loss while maintaining a desirable texture\nand consistency in instant soups.\n2.5 Consumer Acceptability and Market Trends\nConsumer panels are composed of individuals from the target market, providing\nfeedback that reflects real-world consumer preferences. This type of panel is crucial\nin consumer acceptance studies, which aim to predict market success based on\nconsumer reactions to sensory attributes (Maurya, 2024).\nConsumer studies indicate that texture, flavor, and ease of preparation significantly\ninfluence the acceptability of instant soup products. Research suggests that the\n\nincorporation of nutrient-dense ingredients and functional additives enhances\noverall consumer satisfaction and repeat purchases.\nFor biofortification to be effective, it must align with consumer preferences. Studies\nunderscore the importance of sensory evaluation in determining the acceptability of\nbiofortified products (Mbwana et al., 2021). In regions where cowpea is not\ntraditionally used in soups, its integration must consider local culinary practices and\ntaste preferences.", "word_count": 382, "start_char": 30323, "end_char": 33099}
{"chunk_id": "DOC0159__00014", "doc_id": "DOC0159", "chunk_index": 14, "text": "or biofortification to be effective, it must align with consumer preferences.S\n\ntudies\nunderscore the importance of sensory evaluation in determining the acceptability of\nbiofortified products (Mbwana et al., 2021).I\n\nn regions where cowpea is not\ntraditionally used in soups, its integration must consider local culinary practices and\ntaste preferences.\n\nCHAPTER THREE\n3.0 METHODOLOGY\n3.1 Raw materials\nIngredient Selection and Formulation\nBase Ingredients: Cowpea leaf powder, Orange Flesh Sweet Potato (OFSP) flour,\nmaize flour, and selected spices.\nFunctional Additives: MSG, Mono- and Di-Glycerides of Fatty Acids, Whey Protein,\nand Caramel were purchased from suppliers around Kampala and Nairobi\nFortificants: to improve iron and zinc bioavailability were purchased from suppliers\naround Kampala such as Wami Quality Chemicals, Wandegeya.\n3.2 Preparation of cowpea leaves grits.\nFresh cowpea leaves were plucked and washed with clean running water. The water\nwas drained, and cowpea leaves were blanched and dried in an air-conventional\ndryer at 65°C for 6 hours at the National Agricultural Research Laboratories Kawanda\nFBA Incubation Centre. After drying, the pieces were allowed to cool and milled into\npowder and stored a in polythene packet at room temperature.\n3.3 Preparation of orange-fleshed sweet potato (OFSP) flour\nOFSP tubers were washed with clean water to remove soil and dirt, peeled using a\nkitchen knife, chopped to about 0.2-0.4 cm width, 2-5 cm length, and 0.1-0.3 cm\nthick, and dried in an air conventional dryer at 65 ̊C for 48 h. The dried chips were\nmilled into powder to pass through a 0.5 mm mesh screen and then stored in a\npolythene packet at room temperature.\nFormulation Composition\nProcessing\n\nA (Control)\n7% cowpea, 46.5% OFSP, 46.5%\nmaize\nExtrusion\nat\n180°C\n\nB (Modified) A + 2% caramel, 1.5% calcium\ncarbonate\nCo-extrusion\n\nA07\nB + 5% whey protein isolate\nPost-extrusion addition", "word_count": 293, "start_char": 32745, "end_char": 34666}
{"chunk_id": "DOC0159__00015", "doc_id": "DOC0159", "chunk_index": 15, "text": "he dried chips were\nmilled into powder to pass through a 0.5 mm mesh screen and then stored in a\npolythene packet at room temperature.F\n\normulation Composition\nProcessing\n\nA (Control)\n7% cowpea, 46.5% OFSP, 46.5%\nmaize\nExtrusion\nat\n180°C\n\nB (Modified) A + 2% caramel, 1.5% calcium\ncarbonate\nCo-extrusion\n\nA07\nB + 5% whey protein isolate\nPost-extrusion addition\n\n3.4 Extrusion Cooking Technology\nThe formulations were extruded using a single screw extruder at Food Bioscience\nand Agribusiness incubation center powered by a 7.5 HP motor (Model So sejin). The\nextruder's barrel had a diameter of 19 mm, and after the feeding section, the barrel\ntemperature was maintained at 150oC. The extruder was operated at a temperature\nof 180oC, the main screw speed of 1450 rpm, and the knife motor speed of 150 rpm,\nand the cooked product was forced through a round-shaped die. The cooking\ntemperatures were controlled using an automatic cooler and monitored using an\ninfrared thermometer. When the die pressure and screw speed were constant,\nextrudates emerging from the die were collected and allowed to stand for 30\nminutes on a cooling conveyor to aid sufficient cooling. The cool extrudates were\nthen milled in a hammer mill, and mounted with a 0.5 mm screen to obtain the\ninstant flour. The instant flour was packaged into sealed plastic HDPE Ziploc bags\nand stored at ambient temperature, in a cool dry place.\n3.5 Proximate Composition\nThe proximate composition including dry matter, ash content, crude protein of the\ninstant soup was determined according to the Association of Official Analytical\nChemists (AOAC), (2005). The results were presented as an average of duplicate\ndeterminations. The protein content (CP) was determined by protocol Adopted from\nAOAC Method 978.02, 16th Ed. Using the Kjeldahl apparatus, A factor of 6.25 was\nused to convert from total nitrogen to CP (%).Dry matter was determined by oven\ndrying method 925.10 (AOAC, 2005)\n3.6 Mineral composition (Zinc, Iron, Calcium)\nThe mineral content of samples was determined according to Schroeder et al.\n(2015), using a Bruker S1 TURBO hand-held XRF analyzer with a silicon drift detector\nthat operated at 45 kV and 30 mA, with a Ti/Al filter. The XRF spectrometer was\ncontrolled via a Hewlett Packard PDA using XBruker Elemental S1 software with a\nresolution was approximately 145 eV at 200,000 cps. Three SRM samples (0.80\ng/sample) were analyzed thrice each for 30 seconds. The sample cup was put on a\nsafety platform mounted to the instrument's tip to guarantee equal distance for\nanalysis. The data obtained was in parts per million (PPM).", "word_count": 423, "start_char": 34306, "end_char": 36916}
{"chunk_id": "DOC0159__00016", "doc_id": "DOC0159", "chunk_index": 16, "text": "hree SRM samples (0.80\ng/sample) were analyzed thrice each for 30 seconds.T\n\nhe sample cup was put on a\nsafety platform mounted to the instrument's tip to guarantee equal distance for\nanalysis.T\n\nhe data obtained was in parts per million (PPM).\n\n3.7 Sensory Evaluation\nA panel of 60 untrained panelist with an average age of 20 ± 8.2 was evaluate the\nsamples based on flavor, texture, color, and overall acceptability using a descriptive\nanalysis or hedonic scale.\nPurposive sampling was employed as the sampling approach, and panelists were\nchosen based on their availability, willingness to participate, and consumption of\ncowpea vegetables. The samples were distributed to the panelists using a research\nrandomizer, which distributes the treatments among the panelists so that each is\nrepeated the same number of times, and each treatment appears precisely once in\neach row and column in the design, reducing Systemic error. A complete randomized\ndesign (CRD) was applied that indicated samples were distributed to the panelists\nrandomly.\nPanelists were asked to provide their honest judgments after tasting the instant\ncowpea leaves based product. Each participant was asked verbally to agree to\nparticipate and to disclose any allergies they might have to any of the processed\nfood items.\n3.8 Cooking procedures of soup powders and Consumer Acceptability Tests\nThe instant soup was prepared using 200 grams of instant cowpea soup and salt (2g)\nthen added into 1500 ml hot water and boiled for 5 min (to pasteurize) ready for\nevaluation. Appearance, color, aroma, flavor, texture (mouth feel), taste, and\noverall acceptability of the sensory qualities were assessed using a 9-point Hedonic\nscale, (1= \"I extremely dislike it\" and 9 being \"I enjoy it extremely\"). The following\nitems were given to each panelist: serviettes, 5 samples of the instant soup, and\nwater to rinse the palate before and after testing the samples. The test used 200 ml\ndisposable white cups containing 40–50 ml of instant soup. Sensory evaluation was\nconducted in sensory booths that separated the panelists; one sample was given to\nthe panelists at a time. The different samples were assigned three-digit codes.\nStatistical Analysis\nAll data collected from the survey was expressed as means and standard deviation\n(SD) for the individual nutrient. All the nutritional and sensory analyses were\nperformed in triplicate, and data were analyzed using EXCELSTAT version\n\n2012.10.7.01 Addinsoft, Paris France). The statistically significant difference was\nstated at p < 0.05.\n\nCHAPTER FOUR\n4.0 RESULTS\nTable 1: Mineral Content by Treatment Type", "word_count": 409, "start_char": 36672, "end_char": 39291}
{"chunk_id": "DOC0159__00017", "doc_id": "DOC0159", "chunk_index": 17, "text": "ll the nutritional and sensory analyses were\nperformed in triplicate, and data were analyzed using EXCELSTAT version\n\n2012.10.7.01 Addinsoft, Paris France).T\n\nhe statistically significant difference was\nstated at p < 0.05.C\n\nHAPTER FOUR\n4.0 RESULTS\nTable 1: Mineral Content by Treatment Type\n\nMineral\nTreatment A\nTreatment B\nP\n1713.00 ± 156.81\n1713.67 ± 83.80\nK (%)\n1.41 ± 0.11\n1.24 ± 0.13\nCa\n3942.33 ± 342.96\n4280.33 ± 476.91\nMg\n6100.00 ± 458.26\n6433.33 ± 965.02\nS\n2011.67 ± 141.80\n1805.33 ± 222.72\nFe\n744.67 ± 436.03\n532.33 ± 343.93\nZn\n86.33 ± 95.33\n202.33 ± 20.84\nCu\n14.33 ± 7.77\n11.00 ± 7.55\n\nTable 2: A table showing consumer acceptability\nscores by means and standard deviations for each\nTreatment Group.\n\nTreatment Group\nAppea\nrance\nColou\nr\nArom\na\nFlavo\nr\nTaste\nMout\nhfeel\nGeneral\nAcceptabi\nlity\nA07(Base+\nadditives)\n+whey\nprotein\n(post\nextrusion)\n5.94a ±\n2.14\n5.98a\n±\n2.25\n5.74a\n±\n2.34\n5.87a\n±\n2.36\n5.78a ±\n2.33\n5.41a\n±\n2.20\n5.89a\n±\n1.93\nA (Base ingredients\nwithout additives)\n6.20a ±\n2.20\n5.91a\n±\n2.18\n6.27a\n±\n1.97\n6.11a\n±\n1.94\n5.80a ±\n2.15\n5.79a\n±\n1.96\n6.23a\n±\n1.80\nB (Base + additives\nadded\npreextrusion)\n6.45a ±\n2.12\n6.26a\n±\n2.00\n6.35a\n±\n2.10\n6.01a\n±\n2.01\n5.94a ±\n2.21\n5.85a\n±\n2.05\n6.26a\n±\n1.91\n\nNo statistically significant differences were found between\ntreatment groups for any parameter (p > 0.05)\n\nTable 3. A table showing proximate composition across the treatment\ngroups\n\nA\nB\nA07\nprotein(%)\n29.450a ± 1.187\n52.294b ± 2.815\n65.795c ± 2.596\nmoisture(%)\n4.421a ± 0.396\n4.131a ± 0.168\n4.138a ± 0.422", "word_count": 266, "start_char": 39000, "end_char": 40514}
{"chunk_id": "DOC0159__00018", "doc_id": "DOC0159", "chunk_index": 18, "text": "table showing proximate composition across the treatment\ngroups\n\nA\nB\nA07\nprotein(%)\n29.450a ± 1.187\n52.294b ± 2.815\n65.795c ± 2.596\nmoisture(%)\n4.421a ± 0.396\n4.131a ± 0.168\n4.138a ± 0.422\n\nCHAPTER FIVE\n5.0 Discussion of Results\nTable 1.\nThere were no statistically significant differences found for any of the minerals (all\np-values > 0.05).\nTreatment B had higher Calcium, Magnesium, and Zinc levels while treatment A had\nhigher Potassium, Sulfur, Iron, and Copper levels.\nThe zinc content in Sample B was notably higher, though not statistically significant\n(p = 0.107) which was attributed to the fortificant used. However, the levels of\nfortificants were not high enough to create a significant difference due to maximum\nlevels allowed according to US_EAS_786_2019 standard\nTable 2.\nThe B samples generally had the highest mean scores across most sensory attributes.\nThe A07 sample consistently had the lowest scores, especially in mouthfeel (5.41)\nand aroma (5.74) which indicates a slight preference for fortified samples and other\nA samples over A07.\nThe high standard deviations across all groups indicate wide variation in individual\nresponses, making it harder to detect significant differences.\nNo statistically significant differences were found between treatment groups for any\nsensory attribute (p > 0.05). While fortified samples (B) scored slightly higher, the\ndifferences were not strong enough to be considered meaningful statistically.\nThe color of the soup is not ideally representative of common soups on the market.\nCowpea leaf powder was common to these two soup formulations and so contained\nchlorophyll pigments that imparted a dark green color to the soup, and the intensity\nof the green color increased as the concentration of composite mixes increased in\nthe formulations to 10% and then 15%(Mungofa & Beswa, 2024)", "word_count": 284, "start_char": 40326, "end_char": 42169}
{"chunk_id": "DOC0159__00019", "doc_id": "DOC0159", "chunk_index": 19, "text": "owpea leaf powder was common to these two soup formulations and so contained\nchlorophyll pigments that imparted a dark green color to the soup, and the intensity\nof the green color increased as the concentration of composite mixes increased in\nthe formulations to 10% and then 15%(Mungofa & Beswa, 2024)\n\nTable 3\nGroup A (Base Treatment):\nMinimal processing and no protein additives were used thus lower protein suggests\nno whey fortification.\nGroup B (Additives Pre-Extrusion):\nThis contained whey protein, MSG, colorants, and fortificants added before\nextrusion.\nDuring extrusion, whey protein was exposed to high heat (120–185°C), causing\npartial denaturation and reduced solubility thus may explain the moderate protein\nretention compared to A07.\nGroup A07 (Additives Post-Extrusion):\nWhey protein was added after extrusion, avoiding heat-induced denaturation. This\npreserved protein integrity and functionality, leading to higher measurable protein\ncontent. Whey protein is highly sensitive to heat, especially during extrusion:\nDenaturation: At temperatures above 70°C, whey proteins (e.g., β-lactoglobulin)\nunfold, losing solubility and forming gels.\nExtrusion Challenges: Pre-extrusion whey addition (Group B) risks over-browning,\ndense texture, and reduced solubility due to prolonged heat exposure.\nPost-Extrusion Advantage: Adding whey post-extrusion (A07) bypasses these issues,\npreserving protein quality and boosting measurable content.\nMoisture Stability\nAll groups show similar moisture levels (~4.1–4.4%).\nExtrusion parameters (e.g., controlled water flow) and formula adjustments likely\nstabilized moisture, preventing fungal/bacterial growth.\n\n5.1 Conclusions.\nThe use of selected additives did not serve the purpose of improving the soup quality.\nFor biofortification to be effective, it must align with consumer preferences. Studies\nunderscore the importance of sensory evaluation in determining the acceptability of\nbiofortified products (Mbwana et al., 2021).\n5.2 Recommendations.\nInvestigate the use of additives at higher levels according to good manufacturing\npractices (GMPs) to enhance sensory characteristics further in B samples to create a\nclearer distinction.\nThe use of a larger sample size or a more focused sensory panel (e.g., trained\npanelists) to reduce variability and detect precise differences.\nThe additives may be beneficial, but their levels need to be optimized to determine\nthe levels that give the best outcome. This should be coupled with a cost benefit\nanalysis to ensure benefits outweigh costs.", "word_count": 354, "start_char": 41866, "end_char": 44411}
