{"chunk_id": "DOC0023__00000", "doc_id": "DOC0023", "chunk_index": 0, "text": "EVALUATING THE EFFECTIVENESS OF DRIP IRRIGATION USING DRIP\nBOTTLES ON TOMATO GROWING IN KABALE DISTRICT - UGANDA\n\nKANERY ARINAMUKAMA\nS21/BBUC/BASE/010\n\nA DISSERTATION SUBMITTED TO THE FACULTY OF AGRICULTURAL SCIENCES IN\nPARTIAL FULFILLMENT OF THE REQUIREMENTS FOR THE AWARD OF THE DEGREE OF\nBACHELOR OF SCIENCE IN AGRICULTURAL SCIENCE AND ENTREPRENEURSHIP OF\nUGANDA CHRISTIAN UNIVERSITY\nJuly,2025\n\nv\n\nvi\n\nvii\nDEDICATION\nI dedicate this research to my beloved parents, my brothers and sisters, my fellow\nstudents, and my supervisor\nMay God bless them all?\n\nviii\nABSTRACT\nThis research report is about the implementation of drip irrigation using drip bottles for\ntomato growing. A study to assess the effectiveness of tomato growth and yields was\nconducted by drip irrigation using drip bottles for 6 months, ranging from planting to\nharvesting.\nIt describes clearly the activities that were done during this research project, which are\narranged in chapters, and each chapter indicates how the activities were performed.\nTomato production in Kabale District, Uganda, faces challenges due to water scarcity\nand inefficient irrigation methods. This study investigated the implementation of drip\nirrigation using drip bottles to improve tomato yields.\nThe project was conducted at the Uganda Christian University, Bishop Barham College\nfarm, located in Rugarama, Southern Division, Kabale Municipality, Kabale District. Data\nwas collected through experimental design, field observations, and measurements of\ntomato plant growth and yields.\nThe results showed a significant increase in tomato yields using drip irrigation with drip\nbottles compared to traditional irrigation methods. Water usage was also reduced, and\ncrop water stress was minimized.\nBased on the findings, it is recommended that the adoption of drip irrigation using drip\nbottles be considered as a sustainable and efficient irrigation method for tomato\nproduction in Kabale District. Farmers can benefit from increased yields, reduced water\nusage, and improved crop resilience to drought.\n\nix\nTABLE OF CONTENTS\nDECLARATION\nAPPROVAL\nDEDICATION\nvii\nABSTRACT\nviii\nCHAPTER ONE:\n1.0. Introduction\n1.1. Background of the study\n1.2. Problem statement\n1.3. Objectives\n1.4. General objective\n1.5. Specific objectives\n1.6. Research questions\n1.7. Scope of the study\n1.8. Significance of the study\n1.9 Justifications of the study\n1.10 Conceptual Framework\nCHAPTER TWO:\nLITERATURE REVIEW\n2.1 Introduction\n2.2 Factors influencing the adoption of drip Irrigation among tomato farmers. Error!\nBookmark not defined.\n2.3 Challenges faced by farmers in implementing Drip Irrigation using drip bottles\n2.4 Cost-effectiveness of drip bottle Irrigation compared to conventional methods\n2.5 Conclusion\nCHAPTER THREE:\nMETHODS AND MATERIALS\n3.1 Research Approach\n3.2 Research Design", "word_count": 406, "start_char": 0, "end_char": 2821}
{"chunk_id": "DOC0023__00001", "doc_id": "DOC0023", "chunk_index": 1, "text": "rror!B\n\nookmark not defined.\n2.3 Challenges faced by farmers in implementing Drip Irrigation using drip bottles\n2.4 Cost-effectiveness of drip bottle Irrigation compared to conventional methods\n2.5 Conclusion\nCHAPTER THREE:\nMETHODS AND MATERIALS\n3.1 Research Approach\n3.2 Research Design\n\nx\n3.3 Area of the Study\n3.4 Plot area\n3.5 Tools used\n3.6 Data Analysis (analysis of variance)\nCHAPTER FOUR:\nDATA ANALYSIS AND PRESENTATION OF THE FINDINGS\n4.0 Introduction\n4.1 Germination performance\n4.2 Plant Height, Leaf Area, and Stem Girth\n4.3 Yield and Fruit Quality\n4.4 Economic Implications\n4.5 Correlation Analysis\n4.6\nFactors influencing the adoption of drip bottle irrigation among tomato farmers.\n4.7 Challenges faced by farmers in implementing drip bottle irrigation\n4.10 Cost-effectiveness of drip bottle irrigation compared to conventional irrigation\n4.11 In conclusion\nCHAPTER FIVE:\nSUMMARY OF FINDINGS, DISCUSSION, CONCLUSIONS, AND RECOMMENDATIONS\n5.1 Summary of findings\n5.1 Discussions\n5.2 Conclusions\n5.3 Recommendations", "word_count": 144, "start_char": 2534, "end_char": 3562}
