{"chunk_id": "DOC0009__00000", "doc_id": "DOC0009", "chunk_index": 0, "text": "EFFECT OF TEENAGE PREGNANCY ON FAMILY STABILITY IN BUBAARE\nSUBCOUNTY, RUBANDA DISTRICT\n\nNOREEN AKATUKUNDA\nS22/BBUC/BSW/022\n\nA DISSERTATION SUBMITTED TO THE SCHOOL OF SOCIAL SCIENCES IN PARTIAL\nFULFILLMENT OF THE REQUIREMENTS FOR THE AWARD OF THE DEGREE OF\nBACHELOR OF SOCIAL WORK OF UGANDA CHRISTIAN UNIVERSITY\nJuly,2025\n\nDECLARATION\nI hereby certify that I am the author of the report and confirm that it has not yet\nbeen submitted for consideration for another degree or professional certification.\nFurthermore, this work explicitly acknowledged both my contributions to this work\nas well as those made by the other writers.\nAkatukunda Noreen\nStudent\n\nAPPROVAL\nThis report titled effect of teenage pregnancy on family stability in Bubaare subcounty, Rubanda District by Akatukunda Noreen is approved as fulfilling part of the\nrequirements for the award of the degree in Social Work and Social Administration\nof Uganda Christian University.\nMr.Mbalema Apollo\nSupervisor\nUganda Christian University\n\nDEDICATION\nThis research report is dedicated to my parents Mr. Asiimwe Davis and Ms. Shallon\nNiwamasiko who have been supporting me throughout my studies. May they live\nlonger and may God bless you.\n\nACKNOWLEDGEMENTS\nI extend my thanks to a number of people who unreservedly, contributed towards\nthe accomplishment of this research work. In a special way I would like to\nacknowledge the assistance and role played by my brothers and sisters to the\nsuccessful completion of this research. To you I say thank You.\nI cannot say exactly how grateful I am to my supervisor, Mr. Mbalema Appolo his\nguidance in this study was beyond measure. Thank you also for providing me with\nprofessional advice, encouragement and your time that has spurred me to success.\nI cannot forget the efforts of the staff of Bishop Barham University for their input\nand effort that made me acquire the invaluable knowledge. Your contribution can\nnever be quantified but will always be reminiscent whenever I look through this\nbook.\nMay the Almighty God bless you all.\n\nTABLE OF CONTENTS\nDECLARATION ................................................................................... 1\nAPPROVAL ....................................................................................... 2\nDEDICATION ..................................................................................... 3\nACKNOWLEDGEMENTS ......................................................................... 4\nABSTRACT ....................................................................................... 9\nCHAPTER ONE: INTRODUCTION ............................................................. 9\n1.1 Introduction .............................................................................. 11\n1.2 Background of the Study ............................................................... 11\n1.2.1 Historical Background ................................................................ 11\n1.2.2 Theoretical Background .............................................................. 13\n1.2.3 Conceptual Background .............................................................. 13\n1.2.4 Contextual Background .............................................................. 15\n1.3 Problem Statement ..................................................................... 16\n1.4 Objectives of the Study ................................................................ 17\n1.4.1 General Objective .................................................................... 18\n1.4.2 Specific Objectives ................................................................... 18\n1.5 Research Questions ..................................................................... 18\n1.6 Scope of the Study ...................................................................... 19\n1.6.1 Geographical Scope .................................................................. 19\n1.6.2 Content Scope ......................................................................... 19", "word_count": 419, "start_char": 0, "end_char": 3978}
{"chunk_id": "DOC0009__00001", "doc_id": "DOC0009", "chunk_index": 1, "text": "1.6.3 Time Scope ............................................................................ 19\n1.7 Significance of the Study ............................................................... 20\n1.9 Definition of Key Terms ................................................................ 22\n1.10 Chapter review ......................................................................... 24\nCHAPTER TWO: LITERATURE REVIEW ................................................... 25\n2.1 Introduction .............................................................................. 25\n2.2 Theoretical Review ..................................................................... 25\n2.2.1 Ecological Systems Theory .......................................................... 25\n2.2.2 Strain Theory .......................................................................... 25\n2.3 Empirical Review ........................................................................ 26\n2.3.1 Causes of Teenage Pregnancy among Teenagers ................................. 27\n2.4 Research Gaps ........................................................................... 33\nCHAPTER THREE: METHODOLOGY ....................................................... 35\n3.0 Introduction .............................................................................. 35\n3.1 Study Area ................................................................................ 35\n3.2 Research Approach ...................................................................... 35\n3.3 Research Design ......................................................................... 35\n3.4 Research Procedure ..................................................................... 36\n3.5 Target Population ....................................................................... 37\n3.6 Sample size determination ............................................................ 37\n3.7 Sampling techniques .................................................................... 38\n\n3.8 Methods of Data Collection ............................................................ 39\n3.9 Data Collection Instruments ........................................................... 41\n3.11 Quality Control ......................................................................... 42\n3.11.1 Validity of the Instrument ......................................................... 43\n3.11.1.1 Internal validity of the research instrument .................................. 44\n3.11.1.2 External validity of the research instrument ................................. 44\n3.13 Limitations of the study .............................................................. 45\n3.14 Chapter review ......................................................................... 45\nCHAPTER FOUR .............................................................................. 48\nPRESENTATION, ANALYSIS AND INTERPRETATION OF RESULTS .................... 48\n4.0 Introduction .............................................................................. 48\n4.1 Demographic characteristics of respondents ........................................ 48\n4.1.1 Age of the respondents .............................................................. 48\n4.1.2 Gender of the respondents .......................................................... 49\n4.1.3 Education level of the respondent ................................................. 50\n4.1.4 Occupation of the respondents ..................................................... 51\n4.1.5 Religion of the respondents ......................................................... 52\n4.2 Causes of teenage pregnancy among teenagers in Bubaare Sub-County ........ 53\n4.3 Effect of teenage pregnancy on family stability in Bubaare Sub-County ....... 58\n4.4 Coping strategies families use to deal with the challenges posed by teenage\npregnancy in Bubaare Sub-County ......................................................... 62\n\nCHAPTER FIVE ............................................................................... 69\nDISCUSSION, CONCLUSION AND RECOMMENDATIONS ................................. 69\n5.0 Introduction .............................................................................. 69\n5.1 Causes of teenage pregnancy among teenagers in Bubaare Sub-County ........ 69\n5.2 Effects of teenage pregnancy on family stability in Bubaare Sub-County ...... 69\n5.3 Coping strategies families use to deal with the challenges posed by teenage\npregnancy in Bubaare Sub-County ......................................................... 73\n5.2 Conclusion ................................................................................ 74\n5.3 Recommendations ....................................................................... 75\n5.6 Areas for further research ............................................................. 78\nREFERENCES .................................................................................. 79\nQUESTIONNAIRE .............................................................................. 86", "word_count": 351, "start_char": 3978, "end_char": 9009}
{"chunk_id": "DOC0009__00002", "doc_id": "DOC0009", "chunk_index": 2, "text": "ABSTRACT\nThe study assessed the impact of teenage pregnancy on family stability in Bubaare\nSub-County, Rubanda District. The objectives of the study were; to investigate the\ncauses of teenage pregnancy among teenagers in Bubaare Sub-County, to assess the\neffects of teenage pregnancy on family stability in Bubaare Sub-County and to\nidentify coping strategies families use to deal with the challenges posed by teenage\npregnancy in Bubaare Sub-County. A qualitative research approach was used and\ndata was collected using interviews and questionnaires. The study findings on causes\nof teenage pregnancy among teenagers in Bubaare Sub-County were; peer pressure\ncontributes to teenage pregnancy, lack of sex education leads to teenage pregnancy,\npoverty drives many teens into early sexual activity. The study findings on effects\nof teenage pregnancy on family stability in Bubaare Sub-County were; teenage\npregnancy increases economic burden on families, teenage pregnancy leads to\nschool dropout. The study findings on coping strategies families use to deal with the\nchallenges posed by teenage pregnancy in Bubaare Sub-County were; families seek\ncounseling services to handle teenage pregnancies. It was suggested in this research\nthat policymakers create and introduce comprehensive sexuality education policies\nthat are culturally sensitive as well as age-appropriate to manage the core causes\nof adolescent pregnancy.\nIn summary, research unveiled that adolescent pregnancy impacts family stability in\nRubanda District's Bubaare Sub-County considerably through added economic\npressures, emotional distress, school dropouts, inter-family disagreements, and\ndamage to reputation. The research identified significant contributing factors as\npeer pressure, poverty, absence of sexual education, fragmented households, as\nwell as media influence. Families counter these through seeking counseling,\n\nenlisting religious leaders' involvement, aid from extended family members,\neducation priority on the adolescent mother's part, as well as in a few instances\nthrough early marriage.", "word_count": 288, "start_char": 9009, "end_char": 11088}
{"chunk_id": "DOC0009__00003", "doc_id": "DOC0009", "chunk_index": 3, "text": "he research identified significant contributing factors as\npeer pressure, poverty, absence of sexual education, fragmented households, as\nwell as media influence.F\n\namilies counter these through seeking counseling,\n\nenlisting religious leaders' involvement, aid from extended family members,\neducation priority on the adolescent mother's part, as well as in a few instances\nthrough early marriage.\n\nCHAPTER ONE: INTRODUCTION\n1.1 Introduction\nAdolescent pregnancy remains a common experience worldwide, impacting\nindividuals, families, and communities. Adolescent pregnancy disrupts the usual\ndevelopment of young individuals towards becoming adults and thus leads to\neconomic hardship, emotional distress, and social stigma. Teenage motherhood\nfamilies may face substantial disruption, particularly among rural societies with\nsocioeconomic circumstances like Bubaare Sub-County, Rubanda District. Taking into\nconsideration the cause, effect, and adaptations of the affected families, this\nresearch aimed at assessing the impact of teenage pregnancy on family stability.\n1.2 Background of the Study\n1.2.1 Historical Background\nTeenage pregnancy is socio-economical and public health issue for a long time,\nmainly due to the gendered, cultural and economic dynamics that are historical to\nit. The childbearing of adolescents has been a phenomenon that has left a mark on\nthe underprivileged people throughout the world and it has been most common in\nlow and middle-income countries. The international organizations, among them the\nUnited Nations Population Fund (UNFPA) and the World Health Organization (WHO),\nhave acknowledged the continuous rise of teenage pregnancies over the years,\nespecially in the areas where access to economic, medical, and educational\nopportunities is very limited (UNFPA, 2021). Teenage pregnancy has caused many\nproblems in family life in South America which has been mostly due to poverty,\ncultural expectations, and limited access to education (Del Mastro, 2023). In the", "word_count": 278, "start_char": 10691, "end_char": 12691}
{"chunk_id": "DOC0009__00004", "doc_id": "DOC0009", "chunk_index": 4, "text": "eenage pregnancy has caused many\nproblems in family life in South America which has been mostly due to poverty,\ncultural expectations, and limited access to education (Del Mastro, 2023).I\n\nn the\n\npast, having a child at a young age was acceptable in extended family settings but\nthe coming of colonizers brought strict religious beliefs that condemned pregnancy\noutside marriage. The growing urbanization and widening economic gap during the\n20th century saw a rise in adolescent pregnancies particularly in the poorer areas.\nThese pregnancies were one of the factors that led to unstable family structures as\nthey cut off people's economic and educational prospects. The problems of poverty,\ngender inequality, and weak enforcement of policies are still prevalent even though\nthere are today's fertility health initiatives (Smith & Sinkford, 2022). Hence, teenage\npregnancy continues to put a strain on families by keeping the cycles of dependency\nand low social mobility alive. In the past, teenage pregnancy had been more\nprevalent in countries with traditional customs and gender norms that promoted\nearly marriage and little female autonomy. These customs have been able to survive\nin Sub-Saharan Africa where they are the ones with the most pronounced impact on\nthe issue of teenage pregnancy. In Uganda, although population control and\neducation programs have changed over time, the rate of teenage pregnancies has\nnot been completely reduced. Uganda continues to have one of the highest rates of\nteenage pregnancies worldwide, according to the Uganda Bureau of Statistics (UBOS,\n2022). Teenage pregnancy is a persistent issue with deep historical roots that has\nnot yet been adequately addressed by policy or practice in rural areas like Western\nUganda, where poverty and traditional values are prevalent. Teenage pregnancy is\nstill a significant problem in Bubaare Sub-county, Rubanda District, where poverty\nand traditional beliefs are still prevalent.", "word_count": 299, "start_char": 12497, "end_char": 14459}
{"chunk_id": "DOC0009__00005", "doc_id": "DOC0009", "chunk_index": 5, "text": "eenage pregnancy is a persistent issue with deep historical roots that has\nnot yet been adequately addressed by policy or practice in rural areas like Western\nUganda, where poverty and traditional values are prevalent.T\n\neenage pregnancy is\nstill a significant problem in Bubaare Sub-county, Rubanda District, where poverty\nand traditional beliefs are still prevalent.\n\n1.2.2 Theoretical Background\nThe Ecological Systems Theory (Bronfenbrenner, 1979) and the Strain Theory\n(Merton, 1938) served as the study's guiding theories.\nEcological Systems Theory\nAccording to Bronfenbrenner's Ecological Systems Theory, which was developed in\n1979, human development is impacted by many environmental system levels that\ninteract with a person's biological potential to shape experiences and behavior\n(Bronfenbrenner, 1979). The microsystem, mesosystem, exosystem, macrosystem,\nand chronosystem are the five interconnected systems described in the theory.\nThrough their connections with peers, family, the community, and societal\ninstitutions, these systems together impact a person's development (Neal & Neal,\n2019).\nHuman development takes place inside nested environmental structures, and\ninteractions between these systems continuously influence an individual's\ndevelopment, according to the Ecological Systems Theory's underlying presumptions.\nAnother presumption is that people are impacted by their immediate and extended\ncontexts rather than developing independently. Additionally, according to the idea,\ndevelopment is a lively process, and the duration of the changes like the stability of\nthe family or the financial steady can greatly affect the outcomes of one's life\n(Tudge, 2019). This theory has something in common with the study examining the\neffects of teenage pregnancy on family stability in Bubaare Sub-County, as it points\nto the environmental factors that lead to it and the afterward impacts on families.\nAt the microsystem level, the support or lack thereof from family may determine", "word_count": 280, "start_char": 14091, "end_char": 16091}
{"chunk_id": "DOC0009__00006", "doc_id": "DOC0009", "chunk_index": 6, "text": "his theory has something in common with the study examining the\neffects of teenage pregnancy on family stability in Bubaare Sub-County, as it points\nto the environmental factors that lead to it and the afterward impacts on families.A\n\nt the microsystem level, the support or lack thereof from family may determine\n\nhow a young woman will cope with her pregnancy. The teenager's along with\neducation or support seeking capacity is determined by the mesosystem, which\nconsists of the home, school, and community interactions. The financial\nmanagement of young pregnancy strains by families is determined by the exosystem\ncomprising factors like parents' employment status and local economic stability\n(Bronfenbrenner, 2005). At the macrosystem level, family reactions and the overall\nstability of the home depend on the coming of an early pregnancy; in such cases,\ncultural and societal conventions that dictate the roles of the genders and marriage\ngreatly influence these reactions. Besides, the historical and life transitions, such as\nchanges in socioeconomic conditions or policy regarding youth reproductive health,\naffect the trend of teenage pregnancy and family adaptability (Darling, 2020). The\nproposed framework allows the researcher to systematically assess the multiple\nfactors that lead to teenage pregnancy and their interactions with family stability\nin Bubaare Sub-County. Strain Theory Robert K. Merton, a sociologist, developed the\nStrain Theory in 1938. He provides a model that helps to explain the impact of social\nfactors on deviant behavior. The idea is that people are compelled to go for different\nmeans to reach their ends when the society's virtue is blocked to them.\n1.2.3 Conceptual Background\nTeenage pregnancy is the term used to describe the pregnancy of a girl who is still\nin her teens, specifically between the ages of 10 and 19. The present research\nconsiders teenage pregnancy an issue that is rich in factors and henceforth it is\nacknowledged not only as a reproductive health problem but also as having\nsocioeconomic and psychological implications. The primary aspects being discussed\nare the interlinked repercussions of teenage pregnancy which include, among", "word_count": 336, "start_char": 15778, "end_char": 17977}
{"chunk_id": "DOC0009__00007", "doc_id": "DOC0009", "chunk_index": 7, "text": "he present research\nconsiders teenage pregnancy an issue that is rich in factors and henceforth it is\nacknowledged not only as a reproductive health problem but also as having\nsocioeconomic and psychological implications.T\n\nhe primary aspects being discussed\nare the interlinked repercussions of teenage pregnancy which include, among\n\nothers, early sexual initiation the cycle of unplanned pregnancies, school dropouts\nand family disintegration.\nFamily stability in this regard means the capacity of a family to keep up functional\nrelationships, emotional support networks and economic viability. Especially in the\ncase of Rubanda district where resources are quite limited, teenage pregnancy\ndisturbs family stability by Introducing unanticipated caregiving responsibilities,\nfinancial burden, and social stigma. However, families after an case of teenage\npregnancy soon experience emotional strain, intergenerational conflict, and\nbreakdown (Banke-Thomas et al., 2020).\nMoreover, one of the most crucial conceptual pillars is access to reproductive health\ninformation and services. In most cases, young individuals living in rural regions are\nnot provided with complete sexual education, which results in wrong sexual behavior\ndecisions. If such teenagers lack proper support and information, they are at a higher\nrisk of engaging in unprotected sex and getting pregnant accidentally (Habumugisha\net al., 2021). The last but not the least is the concept of social support networks\nthat plays an important role in mitigating the consequences of teenage pregnancy.\nThe mentioned support systems may include schools, hospitals, peers, religious\nplaces, and NGOs. The availability and accessibility of such services have a\nsignificant impact on whether young mothers will be able to continue their\neducation, access healthcare or get integrated back into their community.", "word_count": 266, "start_char": 17643, "end_char": 19513}
{"chunk_id": "DOC0009__00008", "doc_id": "DOC0009", "chunk_index": 8, "text": "he mentioned support systems may include schools, hospitals, peers, religious\nplaces, and NGOs.T\n\nhe availability and accessibility of such services have a\nsignificant impact on whether young mothers will be able to continue their\neducation, access healthcare or get integrated back into their community.\n\n1.2.4 Contextual Background\nTeenage pregnancy is still a significant challenge to the growth and development of\nUganda. According to UBOS (2022), one-fourth of girls aged 15 to 19 years in the\ncountry are already pregnant or have gone through childbirth at least once. One of\nthe most affected areas is Western Uganda's rural areas where the aforementioned\nfactors coupled with high poverty and illiteracy levels continue to prevail. Bubaare\nSub-County, located in the Rubanda District, is one such area where these\nnationwide trends can be clearly seen. It is a place that can be characterized by low\neducational levels, extreme poverty, and strong gender stereotypes.\nThe health centers in the area are reporting increased teenage births based on\nanecdotal and observational evidence. Among the reasons for this change, that the\nde facto parents are not taking care of their kids, the economic situation is difficult,\nand the kids are not taught about sex. Girls who become pregnant are often reported\nas being stigmatized socially and, as a result, are expelled from schools and are\nsometimes forced to rely on their older partners or families. The government and\nNGOs have been providing youth-friendly health services and community trainings as\npart of a strategy to reduce cases of teenage pregnancies in Bubaare.\nHowever, these actions have not reduced the number of pregnancies among\nteenagers appreciably indicating that more serious structural issues might be at\nplay. Muwonge et al. (2020) identify these as deep-rooted poverty, lack of job\nopportunities for the youth, and weak enforcement of child protection laws. Societal\nand familial factors surrounding teenage pregnancy need an urgent investigation,\nsince it is still very much a crime against family structures in the Rubanda District.", "word_count": 326, "start_char": 19209, "end_char": 21319}
{"chunk_id": "DOC0009__00009", "doc_id": "DOC0009", "chunk_index": 9, "text": "uwonge et al. (2020) identify these as deep-rooted poverty, lack of job\nopportunities for the youth, and weak enforcement of child protection laws.S\n\nocietal\nand familial factors surrounding teenage pregnancy need an urgent investigation,\nsince it is still very much a crime against family structures in the Rubanda District.\n\nThis research was designed to assess the impact of teenage pregnancy on family\nstability in Bubaare Sub-County.\n1.3 Problem Statement\nTeenage pregnancy is an issue of great concern for the public health and socioeconomic aspects all over the world, especially in the low- and middle-income\ncountries where the majority of teenage girls are prone to vulnerability. As per the\nUnited Nations Population Fund's assessment (UNFPA, 2021), there are around 16\nmillion births every year to girls in the age group of 15-19, with Sub-Saharan Africa\nbeing the most affected, that is, experiencing the highest rates of teenage births\ndue to factors like poverty, cultural beliefs, and practices like early marriages, and\nlow access to reproductive health services. East Africa, Kenya, Tanzania, and\nUganda are some of the areas that continue to report teenage pregnancy as a major\nconcern, which in turn has a negative impact on maternal health, makes it difficult\nfor girls to stay in school, and leads to instability in family life. In Uganda, according\nto the Uganda Bureau of Statistics (UBOS, 2022), one-fourth of girls in the teenage\nage group have had their first child at the most, which is even more in the western\nregion, 27%, thus, making it apparent that rural areas have a larger population of\nthese girls who are more vulnerable. In the Rubanda District, and specifically in the\nBubaare Sub-County, teenage pregnancy is an issue that community development\nand family stability are at risk of being threatened by. The trouble is mainly for girls\nwho are 13-19 years old and from very poor rural backgrounds that hardly access\neducational and health services. The outcomes are school dropout, early marriage,\nreliance on parents, mental distress, and the family system getting more strained.\nSchool dropout, early marriages, economic dependence, psychological distress, and", "word_count": 347, "start_char": 20994, "end_char": 23195}
{"chunk_id": "DOC0009__00010", "doc_id": "DOC0009", "chunk_index": 10, "text": "he trouble is mainly for girls\nwho are 13-19 years old and from very poor rural backgrounds that hardly access\neducational and health services.T\n\nhe outcomes are school dropout, early marriage,\nreliance on parents, mental distress, and the family system getting more strained.S\n\nchool dropout, early marriages, economic dependence, psychological distress, and\n\nincreased strain on extended family systems are just a few of the negative\nconsequences of teenage pregnancy. Still, the methods used for government and\nNGO interventions such as reproductive health education and youth-friendly services\nhave so far failed to bring down teenage pregnancy rates in rural Bubaare. This can\nbe interpreted as either the existing strategies being ineffective, lacking in\naccessibility, or not being culturally sensitive. The problem is also shaped by parents'\nand teens'\n1.4 Objectives of the Study\n1.4.1 General Objective\nTo investigate teenage pregnancy on family stability in Bubaare Sub-County,\nRubanda District\n1.4.2 Specific Objectives\n1. To investigate the causes of teenage pregnancy among teenagers in Bubaare Sub-\nCounty.\n2. To assess the effects of teenage pregnancy on family stability in Bubaare Sub-\nCounty.\n3. To identify coping strategies families use to deal with the challenges posed by\nteenage pregnancy in Bubaare Sub-County.\n1.5 Research Questions\n1. What are the causes of teenage pregnancy among teenagers in Bubaare Sub-\nCounty?\n2. How does teenage pregnancy affect family stability in Bubaare Sub-County?", "word_count": 226, "start_char": 22836, "end_char": 24355}
{"chunk_id": "DOC0009__00011", "doc_id": "DOC0009", "chunk_index": 11, "text": "o identify coping strategies families use to deal with the challenges posed by\nteenage pregnancy in Bubaare Sub-County.\n1.5 Research Questions\n1.W\n\nhat are the causes of teenage pregnancy among teenagers in Bubaare Sub-\nCounty?\n2.H\n\now does teenage pregnancy affect family stability in Bubaare Sub-County?\n\n3. What coping strategies can families adopt to manage the challenges of teenage\npregnancy?\n1.6 Scope of the Study\n1.6.1 Geographical Scope\nThe study was conducted in Bubaare Sub-County, Rubanda District, a rural area with\na high prevalence of teenage pregnancy. The district borders with Kisoro to the west,\nRukungiri and Kanungu to the north, Kabale to the East, and the Republic of Rwanda\nto the south. Rubanda District lies on the main highway from Kabale to Kisoro,\nconnecting to Rwanda and DRC. Rubanda District was curved out of Kabale following\nthe Act of Parliament of 3rd September 2015 and it became operational on 1 July\n2016. The area was chosen because of the high rate of cases of teenage pregnancies\nwhich have been reported to the in the sub county. In Bubaare Sub County, the\nmajority of men and women have finished basic school, while a small percentage\nhave graduated from senior four, senior six, and tertiary institutions, respectively\n(Mukiza, 2020). The majority's low educational attainment prevents them from\nhaving formal employment opportunities. Because they are unable to provide for all\nof the family's fundamental necessities, they have turned to low-paying, informal\nwork, which exposes many to unnecessary behavior.\n1.6.2 Content Scope\nThe scope of the content of this study was limited to the investigation of the issue\nof teenage pregnancy in Bubaare Sub-County, intending to uncover its underlying\ncauses, how it impacts family stability, and the coping mechanisms employed by the\nfamilies concerned. More precisely, the study aims to investigate the reasons of the", "word_count": 302, "start_char": 24050, "end_char": 25959}
{"chunk_id": "DOC0009__00012", "doc_id": "DOC0009", "chunk_index": 12, "text": "ore precisely, the study aims to investigate the reasons of the\n\nadolescent pregnancies in the locality, to evaluate the impact of such pregnancies\non the family stability and functioning, and to discover the different means through\nwhich these families manage andget past the difficulties connected with them.\n1.6.3 Time Scope\nThe study examined teenage pregnancy trends and their impact on family stability\nwithin the last five years (2019–2024) to provide relevant and up-to-date data.\n1.7 Significance of the Study\nPolicymakers\nThe potential impact of the research on the social and health aspects of teenage\npregnancy in rural areas is very significant. In addition, the information derived from\nthe study will not only be a basis but also help activate the progressive policies and\nthe like social supportive measures that would contribute to the overall health and\ngrowth of the society. Healthcare Providers the research will probably cover a wide\nrange of aspects including the psychological, reproductive, and general health needs\nof adolescents mothers.\nThis possibly would be one way towards the setting up and operating of health\nservices that is said to be youth-friendly and that concerns issues such as counseling\nand education on reproductive health for teenagers. Community Leaders and Local\nGovernment The research is likely to specifically offer a model for community-based\nmethods and awareness campaigns. Community leaders will be able to advocate for\nchanges in culture and behavior through informed by social factors that lead to\nteenage pregnancies being identified and their actions that are guided by advocacy\nand local actions. Families and Community Members The research can possibly\n\nsuggest coping strategies and approaches to support that families can adopt. This\ncould be a situation where the emotional, financial, and social aspects attached to\nteenage pregnancy are handled which in turn allows the affected families to be more\nresilient and have better quality of life.\nResearchers and Academics\nNot only the literature is unmasked by the study but also it is pointed out as a\nreference for subsequent researchers investigating comparable problems. The work\ndone here might ultimately trigger more research in the sphere of rural\nreproductive health, family dynamics, and youth development. The conceptual\nframework underpinning this study utilizes socio-ecological model, which explores\nthe influences of individual, family, community, and societal factors on teenage\npregnancy and family stability.\n\n1.8 Conceptual framework", "word_count": 385, "start_char": 25896, "end_char": 28459}
{"chunk_id": "DOC0009__00013", "doc_id": "DOC0009", "chunk_index": 13, "text": "he work\ndone here might ultimately trigger more research in the sphere of rural\nreproductive health, family dynamics, and youth development.T\n\nhe conceptual\nframework underpinning this study utilizes socio-ecological model, which explores\nthe influences of individual, family, community, and societal factors on teenage\npregnancy and family stability.\n\n1.8 Conceptual framework\n\nSource: Author, 2025\nNarrative of the conceptual framework\nThe reasons behind teenage pregnancy, which include the absence of comprehensive\nsex education, peer pressure, early sexual activity, and restricted access to\ncontraceptives, have a direct effect on the reproductive choices of teenagers.\nNevertheless, these reasons do not work separately; they are influenced and\nintermixed by the factors of the economy, culture, and policy. Poverty and lack of\neducation, for instance, can lead one to become pregnant at a very young age, while\ncultural practices such as the acceptance of early marriages or the prohibition of\nIndependent Variables\nCauses of Teenage Pregnancy\n Lack of comprehensive\nsex education,\n Peer pressure,\n Early exposure to\nsexual activity, and\nlimited access to\ncontraceptives,\n Directly influence\nadolescent reproductive\n Economic well-being\n Emotional well-being\n Social well-being\nDependent Variable\nFamily Stability\nIntervening Variables\npolicy factors\n\ncontraceptives might make the issue worse. Moreover, poor execution of\nreproductive health education policies and no youth-friendly health services may\nprevent the adoption of preventive strategies.\nTogether, these intervening variables determine the extent of the long-term impact\nof teenage pregnancy on family stability, which then, as one of the sources of\nfinancial strain, affects the economic, emotional, and social well-being of the\nfamily. Thus, a holistic approach that acknowledges these broader systemic\ninfluences as well as the promotion of stability and resilience in the affected families\nis required to tackle the issue of teenage pregnancy.\n1.9 Definition of Key Terms\nTeenage Pregnancy: Teenage pregnancy refers to a situation where a girl becomes\npregnant between the ages of 13 and 19.\nFamily Stability: Family stability refers to the consistency, security, and resilience\nwithin a family structure that enables its members to function effectively and\nsupport one another emotionally, socially, and economically.\nCoping Strategies: Mechanisms adopted by families to manage the effects of\nteenage pregnancy\nSocioeconomic Factors: Economic and social conditions that influence individuals\nand communities.\n\n1.10 Chapter review\nThe study examined the effect of teenage pregnancy on family stability in Bubaare\nSub-County, Rubanda District. The background was arranged based on the historical\nbackground, theoretical, conceptual background and contextual background,\nproblem statement, objectives of the study, specific objectives, research questions,\nscope of the study, significance of the study, definition of key terms.", "word_count": 422, "start_char": 28082, "end_char": 31089}
{"chunk_id": "DOC0009__00014", "doc_id": "DOC0009", "chunk_index": 14, "text": "he background was arranged based on the historical\nbackground, theoretical, conceptual background and contextual background,\nproblem statement, objectives of the study, specific objectives, research questions,\nscope of the study, significance of the study, definition of key terms.\n\nCHAPTER TWO: LITERATURE REVIEW\n2.1 Introduction\nGlobally, teenage pregnancy is still a major social and public health concern,\nespecially in low-income areas where socioeconomic and cultural factors play a role\nin its incidence. Teenager pregnancy has effects on families, communities, and the\nadvancement of the country in addition to the individual. This chapter reviews\nexisting literature related to teenage pregnancy and its impact on family stability in\nBubaare\nSub-County,\nRubanda\nDistrict.\nThe review\nincludes\ntheoretical\nperspectives, key conceptual discussions, empirical evidence on the causes and\neffects of teenage pregnancy on family stability, coping strategies employed by\nfamilies, research gaps, and a conclusion.\n2.2 Theoretical Review\nThe Ecological Systems Theory (Bronfenbrenner, 1979) and the Strain Theory\n(Merton, 1938) served as the study's guiding theories.\n2.2.1 Ecological Systems Theory\nAccording to Bronfenbrenner's Ecological Systems Theory, which was established in\n1979, human development is a result of the interplay of various environmental\nsystem levels that interact with the individual's biological potential so that the\nperson's experiences and behavior are literally shaped (Bronfenbrenner, 1979). The\nmodel consists of five systems that are interconnected: microsystem, mesosystem,\nexosystem, macrosystem, and chronosystem. Each system in turn influences the\ndevelopment of an individual through the interactions of the individual with their\npeers, family, community, and societal institutions (Neal & Neal, 2019).", "word_count": 250, "start_char": 30808, "end_char": 32647}
{"chunk_id": "DOC0009__00015", "doc_id": "DOC0009", "chunk_index": 15, "text": "he\nmodel consists of five systems that are interconnected: microsystem, mesosystem,\nexosystem, macrosystem, and chronosystem.E\n\nach system in turn influences the\ndevelopment of an individual through the interactions of the individual with their\npeers, family, community, and societal institutions (Neal & Neal, 2019).\n\nThe Ecological Systems Theory is based on the idea that human development unfolds\nin an environment that consists of different levels and that the interactions played\nout among these systems constantly affect the individual's development. A person is\nviewed as being affected by both the immediate and extended environments and\nnot as developing in a vacuum. The theory also postulates that development is\ndynamic, meaning that changes over time such as variations in family stability or\nincome can significantly alter a person's life outcomes (Tudge, 2019). This theory\nnot only points out the connection between the environmental factors coming to the\npregnancy of a young girl and their impacts on her family, but also echoes the study\nabout the influence of teenage pregnancy on family stability in Bubaare Sub-County.\nThe manner in which a young girl copes with her pregnancy may be greatly\ndependent on the presence or absence of family support at the microsystem level.\nThe young girl's ability to continue her studies or to look for support networks is\ndetermined by the ecosystem comprising of the home, school, and neighborhood\ninteractions. To what extent families are capable of coping with the financial\nburdens of a teenage pregnancy.\n2.2.2 Strain Theory\nOverview Sociologist Robert K. Merton developed Merton's Strain Theory in 1938. It\nprovides a method for understanding how social elements affect abnormal\nbehaviors. The theory asserts that people are pushed to seek other ways of attaining\nthe missed legal methods of success such as risky or criminal activities by social\npressures and lack of access to legal means of success (Agnew, 2019). Among these\noutcomes, early sexual engagement and teenage pregnancies are the most common,", "word_count": 320, "start_char": 32330, "end_char": 34401}
{"chunk_id": "DOC0009__00016", "doc_id": "DOC0009", "chunk_index": 16, "text": "he theory asserts that people are pushed to seek other ways of attaining\nthe missed legal methods of success such as risky or criminal activities by social\npressures and lack of access to legal means of success (Agnew, 2019).A\n\nmong these\noutcomes, early sexual engagement and teenage pregnancies are the most common,\n\nparticularly for teens living in poverty-stricken areas. The core concept of Merton's\nStrain Theory states that although society communicates the need for certain things\nlike financial well-being and stability, not everyone has the same rights to access\nthe legal means of achieving them. Some people, however, use drugs, crime, and\nvice to succeed due to the stress and anomie their circumstances cause (Agnew,\n2019). Merton has classified the ways of coping with stress into five categories:\nconformity—where one abides by the social norms and goals; innovation—the means\nto success are through illegal activities; ritualism—the norms are abandoned while\nthe customs are still followed; retreatism—the rejection of norms and means both;\nand finally, rebellion—striving to overthrow the present social order and replace it\nwith a new one (Passas & Agnew, 2020). The Strain Theory is good for studying\nsocioeconomic problems and deviance even as these adaptations explain the variety\nin deviant behavior and the social reactions to inequality. Merton's Strain Theory\nindicates that the cultural expectations, limited educational opportunities, and\nfinancial strain could all contribute to stress caused by the issue of teenage\npregnancy in the case of low-income communities, especially the teenagers (Bunting\net al., 2020; Madkour et al., 2021).\n2.3 Empirical Review\n2.3.1 Causes of Teenage Pregnancy among Teenagers\nPoverty and financial difficulties are the leading factors that result in teenage\npregnancy. Economic insecurity is one of the reasons why many teenage girls end up\nengaging in transactional sex, which is exchanging sex for money or basic needs like\nfood and other essentials (UNFPA, 2020). Many teenage females in places like Bubare\nSub-County are driven to seek financial support by marrying young or through", "word_count": 327, "start_char": 34084, "end_char": 36231}
{"chunk_id": "DOC0009__00017", "doc_id": "DOC0009", "chunk_index": 17, "text": "conomic insecurity is one of the reasons why many teenage girls end up\nengaging in transactional sex, which is exchanging sex for money or basic needs like\nfood and other essentials (UNFPA, 2020).M\n\nany teenage females in places like Bubare\nSub-County are driven to seek financial support by marrying young or through\n\nrelationships with older men because of the lack of job opportunities and poverty in\nthe families. Poverty is a very strong factor to preterm birth but no studies have yet\ninvestigated the direct impact of such economic vulnerabilities on the stability of\nfamilies, especially in rural areas of Uganda. By looking into the issue, the researcher\naims to fill the gap by investigating how pregnancies caused by poverty affect the\nrelationships of parents, the resources of the family, and the family responsibilities\nin Bubare Sub-County. The lack of access to comprehensive sexual and reproductive\nhealth education is another vital factor that contributes to this issue. Many young\npeople are still not well-informed about STIs, contraceptives, and the negative\nconsequences of getting pregnant very young. This lack of knowledge increases the\nrisk of unplanned pregnancies and sexual acts without protection (Guttmacher\nInstitute, 2021).\nDespite the fact that this educational gap has been highlighted by previous studies,\nthere are hardly any that have investigated the effects of this ignorance on the\nteenage girl and the family as a whole, which includes stress, increased dependency,\nand social stigma. Moreover, teenage pregnancy is significantly accelerated by\ncultural and religious practices. In Uganda and some other African countries, early\nmarriage and childbearing are often promoted as a way of preserving family honor,\nlineage, and cultural practices (Mugisha & Mugisa, 2021).\nEarly sexual activity and childbearing are encouraged by cultural views that define\na woman's worth via motherhood, which can limit girls' access to education and\nemployment prospects. However, little empirical study has been done to determine\nhow these cultural factors interact with family structures and whether they\nstrengthen or impair family stability when early motherhood occurs.", "word_count": 333, "start_char": 35914, "end_char": 38112}
{"chunk_id": "DOC0009__00018", "doc_id": "DOC0009", "chunk_index": 18, "text": "arly sexual activity and childbearing are encouraged by cultural views that define\na woman's worth via motherhood, which can limit girls' access to education and\nemployment prospects.H\n\nowever, little empirical study has been done to determine\nhow these cultural factors interact with family structures and whether they\nstrengthen or impair family stability when early motherhood occurs.\n\nTeenage pregnancy is also caused by media exposure and peer pressure. Teenagers\nfrequently copy the actions of their friends or celebrities, particularly when those\nactions are presented as contemporary or socially acceptable (Kalule & Ochen,\n2019). Teenagers may engage in dangerous sexual conduct to fit in due to peer\npressure, and media outlets usually glorify sexual relationships without emphasizing\nthe negative effects. However, the impact of peer and media-driven pregnancies on\nhome stability whether through interrupted education, strained parent-child\nrelationships, or financial strains is not adequately examined in the literature\ncurrently in publication.\nAnother important factor is family background, especially dysfunctional family\nsettings. Teenagers from households where there is parental abuse, neglect, or\nabsence frequently don't receive the right kind of emotional support and direction\n(Ninsiima et al., 2020). These teenagers are more likely to engage in early sexual\nactivity and become pregnant if they go to other sources for affection or financial\nsupport. Although the overall literature acknowledges these dynamics, local\nresearch on the ways in which teenager pregnancies from broken households lead to\nlong-term instability within extended families particularly in rural communities like\nBubare Sub-County are lacking.\nAdditionally, one underappreciated factor contributing to teenager pregnancy is the\nlack of access to youth-friendly health services. In the rural parts of Uganda, the\nyoungsters do not go for sexual and reproductive health treatments due to the\nunavailability of teenager-centered care, skilled personnel, and privacy at many\nhealth facilities. The likelihood of unwanted pregnancies for girls increases if they\nare completely cut off from counseling and contraceptive services.", "word_count": 313, "start_char": 37725, "end_char": 39947}
{"chunk_id": "DOC0009__00019", "doc_id": "DOC0009", "chunk_index": 19, "text": "n the rural parts of Uganda, the\nyoungsters do not go for sexual and reproductive health treatments due to the\nunavailability of teenager-centered care, skilled personnel, and privacy at many\nhealth facilities.T\n\nhe likelihood of unwanted pregnancies for girls increases if they\nare completely cut off from counseling and contraceptive services.\n\nThe trickle-down effect of this gap in the system has been widely acknowledged\n(WHO, 2022), although its impact on family stability through increased caring\nresponsibilities, financial pressure, and intergenerational disputes is not well\ndocumented. This research will investigate the overlooked repercussions on families\ndue to teenage pregnancy in Bubare Sub-County.\n2.3.2 Effects of Teenage Pregnancy on Family Stability\nOne of the major impacts of teenage pregnancy is the financial pressure it puts on\nfamilies. Typically, teenage mothers do not have enough money to take care of\nthemselves and their infants and always rely on their parents. Thus, the families are\nleft to handle the expenses for baby-sitting, food, clothes, and even medical care.\nThis financial burden could push households in so-called 'resource-constrained' areas\nlike Bubare Sub-County deeper into poverty since poverty rates in such regions are\nalready high. Teenage pregnancy leads to increased household expenditure, which\nin turn reduces the family's capability to support the welfare and education of other\nchildren (UNICEF, 2021). On top of this, there is still no local research about the\neconomic pressure that young parentage would cause in rural communities of\nsouthwestern Uganda, as most of the studies on this issue focus on urban or national\nsettings.\nEmotional and Psychological Distress\nA study that was recently published, showed that more often than not families of\nteen mothers go through emotional and psychological hardships. The parents might\nfeel the whole spectrum of emotions like anxiety, shame, or disappointment,\nespecially in places where teen pregnancy is socially unacceptable. These negative", "word_count": 304, "start_char": 39602, "end_char": 41650}
{"chunk_id": "DOC0009__00020", "doc_id": "DOC0009", "chunk_index": 20, "text": "motional and Psychological Distress\nA study that was recently published, showed that more often than not families of\nteen mothers go through emotional and psychological hardships.T\n\nhe parents might\nfeel the whole spectrum of emotions like anxiety, shame, or disappointment,\nespecially in places where teen pregnancy is socially unacceptable.T\n\nhese negative\n\nfeelings could even lead to social withdrawal, poor communication between the\nparents and the child, and conflicts among the family members (Kagimu, Sekiwunga,\n& Atuhaire, 2021).\nBeing stigmatized further aggravates the already existing emotional difficulties,\nthus, ironically, the communities that are affected by teenage pregnancy do not get\nto enjoy their rights under the law. Still, only a handful of studies have been\nconducted on the impact of emotional turmoil on the parenting styles and family\ncohesion in rural Uganda. Besides, by revealing the emotional burden and mental\npressure that teenage pregnancy inflicts on families in Bubare Sub-County, the\nearlier reference underscored an area that needs more exploration. Delineation of\nFamily Roles and Responsibilities Teenage pregnancies quite often result in\nalterations within family structure, that is, similar to the case when a pregnant\nteenager had to take over the mother’s duties. A change in family dynamics can also\nbe brought about through sibling neglect or siblings being forced to assist in raising\nthe child, with the grandparents possibly having to co-parent the grandchildren.\nFamilies might face a variety of issues such as disagreement, anxiety, and bitterness\ndue to these sudden changes in roles (Nabukalu, Lwanga, & Tumwine, 2019). Such\nrole disturbances are often neither well-studied nor reflected in policy responses.\nYet, the fact that the research of Nabukalu, Lwanga, and Tumwine (2019) did not\nshow how the reassignments caused by teenage pregnancy impact the long-term\nhousehold harmony and stability in Bubare Sub-County, contributes to the existing\nresearch gap.", "word_count": 299, "start_char": 41292, "end_char": 43308}
{"chunk_id": "DOC0009__00021", "doc_id": "DOC0009", "chunk_index": 21, "text": "uch\nrole disturbances are often neither well-studied nor reflected in policy responses.Y\n\net, the fact that the research of Nabukalu, Lwanga, and Tumwine (2019) did not\nshow how the reassignments caused by teenage pregnancy impact the long-term\nhousehold harmony and stability in Bubare Sub-County, contributes to the existing\nresearch gap.\n\nEducational Disruption and Intergenerational Poverty\nIn Uganda, one of the main reasons why females drop out of school is teenage\npregnancy. Due to their inability to manage parenthood and study, many young\nwomen are compelled to drop out of school (MoES, 2020). This results in fewer work\noptions and a lifetime of reliance on family or low-wage informal labor. A cycle of\npoverty that impacts the teenager mother and her extended family is the long-term\neffect. There is a dearth of precise data demonstrating how teenager mothers'\ndisruption of their education affects family ambitions, production, and long-term\nstability in rural regions like Rubanda, despite national reports indicating this\ntendency. This study will look at how early pregnancy-related school dropouts\nimpact the socioeconomic trajectory of families in Bubare Sub-County.\nLimited Social Support Systems\nAnother underestimated impact of teenage pregnancy is the lack or insufficiency of\nofficial and informal support networks for impacted families. There are nongovernmental organizations that offer interventions in urban areas, but usually,\nthese services are non-existent in the countryside. Psychosocial and financial\nsupport are not available and thus families have to manage the complicated realities\nof teenage pregnancy (Gahongayire et al., 2022). This situation creates wider\ndysfunction within the family as it increases feelings of helplessness and isolation.\nEven though the issue of teenage reproductive health is gaining more national\nattention, there is no research-based evidence that support networks in Rubanda\nDistrict are available and effective in preventing family separation.", "word_count": 292, "start_char": 42968, "end_char": 44981}
{"chunk_id": "DOC0009__00022", "doc_id": "DOC0009", "chunk_index": 22, "text": "his situation creates wider\ndysfunction within the family as it increases feelings of helplessness and isolation.E\n\nven though the issue of teenage reproductive health is gaining more national\nattention, there is no research-based evidence that support networks in Rubanda\nDistrict are available and effective in preventing family separation.\n\n2.3.3 Coping Strategies Families Use to Deal with Challenges of Teenage\nPregnancy\nWhen faced with teenager pregnancy, families frequently seek support from\ncommunity organizations, religious communities, and extended family members.\nThese social networks offer practical, financial, and emotional support, which can\nlessen the strain on the family. Support from informal networks is a very important\npart of life for many families in the community facing the burden of prettifying a\nteenager (Muwonge et al., 2021).\nThere are still some families that are ready to sacrifice just about everything to\nkeep their daughters in school so that they can get a decent job after the birth.\nThey may push their daughters to go back to school or take vocational training as a\nway to increase their chances of getting a steady job after the birth. Usually, these\nactivities are very crucial to the young mother getting greater opportunity for selfreliance and a more secure future (Nalwoga & Namuli, 2021).\nTo the large extent, families are looking for various means of generating money to\ncover the expenses of parenting a teenager when the pregnancy was not initially\nplanned. Among these means could be running small businesses, taking on extra\nwork, or working together in a community-based revenue-generating activity. The\ninitiatives also help the family to take care of the increased costs of healthcare and\nchildcare that are associated with the teenage mother (Atuhaire et al., 2021). To\nsum up, some families are seeking professional therapy or psychosocial support to\nhelp them get through the psychological and emotional impacts of teenage\npregnancy. The teenage mother is the one who benefits the most from the\ncounseling service as it enables her to manage her stress, depression, and guilt. WHO", "word_count": 333, "start_char": 44639, "end_char": 46780}
{"chunk_id": "DOC0009__00023", "doc_id": "DOC0009", "chunk_index": 23, "text": "o\nsum up, some families are seeking professional therapy or psychosocial support to\nhelp them get through the psychological and emotional impacts of teenage\npregnancy.T\n\nhe teenage mother is the one who benefits the most from the\ncounseling service as it enables her to manage her stress, depression, and guilt.W\n\nHO\n\n(2021) states that psychosocial support not only helps the young mother to be\naccepted back into the family but also strengthens the relationships between family\nmembers and improves the overall health of the family.\n2.4 Research Gaps\nLiterature review reveals that social, cultural, and economic factors individually or\ncollectively contribute to sculpture the teenager pregnancy issue. Mental anguish,\nfinancial pressure, and inversion of roles Family are among the problems that\npregnancy brings, and all these are big contributors to family instability. Families\nare employing a wide range of coping strategies but their effectiveness remains\nunknown. In targeting Bubaare Sub-County, Rubanda District with its rural setting,\nthe study has filled in the gaps left by previous research by telling local tales about\nthe impacts of teenage pregnancy on family stability and suggested even medical\ntreatments that might help.\n\nCHAPTER THREE: METHODOLOGY\n3.0 Introduction\nThe approach of the research dealing with the impact of teenage motherhood on\nthe family and the living conditions of the families in Bubaare Sub-County, Rubanda\nDistrict is outlined in this section. The study used a systematic approach for data\ncollection and analysis which guaranteed reliability and accuracy in the attainment\nof the research objectives.\n3.1 Study Area\nThe Western Region of Uganda's Rubanda District, notably Bubaare Sub-County, was\nthe main focus of the research. The sub-county has numerous primary and secondary\nschools, health facilities, and community centers that contributed valuable\ninformation to our study. The incidence of teenage pregnancy is a major problem in\nBubaare, a rural area with a population mostly relying on agriculture. Bubaare's\ngeographical position and socio-economic factors are suited for the investigation of\nthe consequences of teenage pregnancies on family stability, as the district has a\nhigher rate of teenage pregnancies than the national average.\n3.2 Research Approach\nQualitative research methodology was used for a study aimed at uncovering the\ngenuine experiences of families undergoing the adolescent pregnancy process. The\nqualitative method was responsible for painting a vivid picture of the difficulties and\noften absurd social issues relating to teenage pregnancy and its impact on family", "word_count": 394, "start_char": 46464, "end_char": 49109}
{"chunk_id": "DOC0009__00024", "doc_id": "DOC0009", "chunk_index": 24, "text": "he\nqualitative method was responsible for painting a vivid picture of the difficulties and\noften absurd social issues relating to teenage pregnancy and its impact on family\n\nties. Individual experiences, perceptions, and social influences all contributed to\nthe understanding of family stability.\n3.3 Research Design\nDescriptive research designs are the main methods used in the systematic\ndescription of populations, situations, or phenomena without the researcher\nintervening (Ellis & Hart, 2023). Through the descriptive research design, the study\nwas able to thoroughly investigate the connection between adolescent pregnancy\nand family disruption. This approach was utilized in Bubaare Sub-County since it\noffered the researcher insight into the features of teenage pregnancy and its effects\non family divisions. The descriptive study provided a full picture of the problems and\nthe solutions employed by the families in the area due to teenage pregnancy.\n3.4 Research Procedure\nThe very first thing that the researcher did was to go through the existing literature\nto find out the causes of teenage pregnancies and the consequences for family\nstability. After that, the researcher got in touch with local leaders, health workers,\nteachers, and parents of teenage mothers to ask for their cooperation and, at the\nsame time, to get permission for the collection of data.\nPrimary data was then collected through field visits to households, community\nleaders, and institutions. Informed consent was obtained from all participants prior\nto data collection.", "word_count": 232, "start_char": 48937, "end_char": 50494}
{"chunk_id": "DOC0009__00025", "doc_id": "DOC0009", "chunk_index": 25, "text": "rimary data was then collected through field visits to households, community\nleaders, and institutions.I\n\nnformed consent was obtained from all participants prior\nto data collection.\n\n3.5 Target Population\nThe study's target population of 65 individuals consisted of families with adolescent\nmothers living in Bubaare Sub-County, and in addition, community leaders, teachers,\nand health care personnel. The focus being more so on mothers of the age bracket\nof 13 to 19 years who had at least one child, and also their immediate family of\nparents, guardians, and siblings. Furthermore, community leaders, inclusive of local\ncouncil officials and religious leaders, as well as secondary school teachers, and\nhealth workers in the local health centers, were to be part of the study. This target\npopulation was selected because they were the ones who experienced teenage\npregnancies directly, thus giving the researchers a lot of insights into the matter of\nthe social, economic, and psychological impact on family stability.\n3.6 Sample size determination\nUsing Slovin's formula, the researcher calculated the proper sample size because the\ntotal population is 65 people. When working with a known population and a\npredetermined margin of error, Slovin's formula was used to determine a\nrepresentative sample size. Using a 95% confidence level and a 5% margin of error\nto account for any non-responses, the sample size was determined by estimating the\nprevalence of poverty among the semi-illiterate population in comparable\nsituations. Slovin’s formula is expressed as:\nn=\nN\n(1 + Ne2)\nn=\n(1 + 65 ∗0.0025)\nn=\n(1 + 65 ∗0.0025)\n\nn= 65\n1.16\nn= 56\nAdding 10% for non-response\nNew Sample Size = 56 respondents\nUsing Slovin’s formula above, the sample size of 56 will be calculated plus 10% nonresponse rate\n3.7 Sampling techniques\nThe study employed purposive sampling for all categories of participants. This nonprobability sampling technique was appropriate because it allowed the researcher\nto intentionally select individuals who were most relevant to the objectives of the\nstudy and provided rich, in-depth information on the issue of teenage pregnancy and\nits implications for family stability.\nTable 3.1: Showing sample size\nCategory\nNumber of\nparticipants\nDescription\nSampling\ntechnique\n1.\nTeenage mothers\nParticipants aged 13 to 19 years who\nhave experienced teenage\npregnancy.\n2.\nParents/guardians\nof teenage\nmothers\nParents or guardians of teenage\nmothers, providing insights into\nfamily dynamics.\n\n3.\nCommunity\nleaders\nLeaders in the community who can\noffer perspectives on social and\ncultural factors.\n4.\nTeachers from\nlocal secondary\nschools\nEducators from local secondary\nschools who interact with teenager\nstudents\n5.\nHealth workers\nfrom local health\ncenters\nHealth professionals from local\nhealth centers, providing insights on\nhealth services for teenage mothers.\nTotal", "word_count": 434, "start_char": 50312, "end_char": 53190}
{"chunk_id": "DOC0009__00026", "doc_id": "DOC0009", "chunk_index": 26, "text": "ommunity\nleaders\nLeaders in the community who can\noffer perspectives on social and\ncultural factors.\n4.T\n\neachers from\nlocal secondary\nschools\nEducators from local secondary\nschools who interact with teenager\nstudents\n5.H\n\nealth workers\nfrom local health\ncenters\nHealth professionals from local\nhealth centers, providing insights on\nhealth services for teenage mothers.T\n\notal\n\n3.8 Methods of Data Collection\nQualitative data collection methods were mainly employed in the study to\nunderstand thoroughly the causes, effects, and coping mechanisms corresponding to\nadolescent pregnancy and the resultant family instability in Bubaare Sub-County,\nRubanda District. The main data was drawn through two principal methods: i.e., indepth interviews and focus group discussions (FGDs).\nIn-depth Interviews\nThe data collection process involved the purposive sampling method whereby key\ninformants such as teachers, community leaders, health care providers, parents or\nguardians of young mothers, and mothers themselves were interviewed using the\nsemi-structured in-depth interview technique. The semi-structured method gave the\n\nresearcher the opportunity to move in and out of the different experiences of\nindividuals while at the same time considering the objectives of the study. The\ninterviews talked about young mothers’ life histories, the situations that finally\nbrought about pregnancy, and the help of the family or the lack of it. Parents and\nguardians were inquired about the emotional, financial, and social consequences\nthat teenage pregnancy had on the family. Teachers and health workers shared their\nopinions on the broader consequences of this issue for education and health,\nwhereas community leaders spoke about their community's perception and the\nreactions that were elicited. The interviews were held in a private and confidential\nsetting to reassure the participants of their safety and the freedom to share their\nviews without restraint. The interviews were recorded (with the interviewees'\nconsent) and then transcribed for thematic analysis.\nFocus Group Discussions (FGDs)\nTo better comprehend the community’s perspectives, cultural norms, and social\ndynamics that impact adolescent pregnancy and family stability, focus group\ndiscussions were conducted with parents, community leaders, and local opinion\nleaders. A total of 6-10 participants were involved in each FGD, and the sessions\nwere moderated with a discussion guide conforming to the study objectives. The\ndiscussions centered on community-related issues such as early sexual activity and\nmarriage, the stigma of teenage pregnancy, and the provision of family support\nsystems. The FGDs were held at places that were easy to reach and suitable for the\nparticipants, and each session was recorded in audio (with permission) and later\ntranscribed and analyzed to detect recurring themes and the insights of the group.", "word_count": 418, "start_char": 52814, "end_char": 55706}
{"chunk_id": "DOC0009__00027", "doc_id": "DOC0009", "chunk_index": 27, "text": "he FGDs were held at places that were easy to reach and suitable for the\nparticipants, and each session was recorded in audio (with permission) and later\ntranscribed and analyzed to detect recurring themes and the insights of the group.\n\nSecondary data collection methods\nDocument review\nRelevant documents, including reports from health centers, schools, and local\ngovernment, were reviewed to understand the institutional responses to teenage\npregnancy and their role in mitigating its impact on family stability.\n3.9 Data Collection Instruments\nPrimary data collection instruments\nThe primary data collection methods of the study aimed at obtaining rich and\nelaborate insights from different stakeholders. The interview guides were\nformulated for conducting one-on-one deep interviews with parents, teachers,\ncommunity leaders, health care professionals, and teenage mothers. The openended questions in these guides allowed the subjects to provide their viewpoints,\nexperiences, and views in a very extensive style. By using open-ended\nquestionnaires, the research intended to get a great variety of factual and personal\ncharacteristics that might influence teenage pregnancy and family stability.\nMoreover, the guides for focus group discussions (FGDs) with parents and community\nleaders were also designed. These discussions, which were largely centered on the\nsocial, economic, and psychological aspects of teenage pregnancy on family\nrelationships, encouraged the participants to think and communicate with one\nanother. Finally, an observation checklist was employed to record human behavior,\nsilent communication, and other environmental facts during the fieldwork that could\nsupport the comprehension of the scenario and contribute to data triangulation.", "word_count": 247, "start_char": 55470, "end_char": 57233}
{"chunk_id": "DOC0009__00028", "doc_id": "DOC0009", "chunk_index": 28, "text": "inally, an observation checklist was employed to record human behavior,\nsilent communication, and other environmental facts during the fieldwork that could\nsupport the comprehension of the scenario and contribute to data triangulation.\n\nSecondary data collection instruments\nThe study was supported by secondary data which contributed to the broader\ninstitutional perspective. The analysis was done through a document that conferred\nthe records and reports emanating from the health and educational institutions in\norder to look into institutional policies, resources, and services for the young\nmothers, as well as the difficulties encountered by the institutions in combating\nteenage pregnancy. Reviewed key documents were the Uganda Demographic and\nHealth Survey (UDHS) 2022, which pinpoints the national prevalence and health\nrepercussions of teenage pregnancy, and the Ministry of Education and Sports Annual\nPerformance Report (2023), which mentions its influence on school attendance and\ndropout rates. Also, the policy papers like the National Teenager Health Policy\n(2019) and the Revised Guidelines for the Prevention and Management of Teenage\nPregnancy in School Settings (MoES, 2020) will be scrutinized for institutional\nresponse mechanisms. By looking into these sources together with health service\nreports and school records, the investigation created a clear picture of the external\nfactors influencing teenage pregnancies and their impacts on family stability. The\ncombination of primary data gathered in the field with secondary data from\ninstitutional sources led to a more complete and nuanced analysis of the topic.\n3.10 Data Analysis\nThematic analysis was utilized to assess the data due to the nature of the research\nbeing qualitative. Thematic analysis is one of the most common techniques for\ndelineating, analyzing, and interpreting the basic meanings in qualitative research\n(Braun & Clarke, 2006). The researcher got the opportunity to scrutinize the\ninterview transcripts and field notes for the purpose of discovering the different", "word_count": 298, "start_char": 56998, "end_char": 59060}
{"chunk_id": "DOC0009__00029", "doc_id": "DOC0009", "chunk_index": 29, "text": "hematic analysis is one of the most common techniques for\ndelineating, analyzing, and interpreting the basic meanings in qualitative research\n(Braun & Clarke, 2006).T\n\nhe researcher got the opportunity to scrutinize the\ninterview transcripts and field notes for the purpose of discovering the different\n\nthemes that the impact of teenage pregnancy on family stability was incorporated.\nThe data were extracted from the audiotapes of the interviews, which also had prior\nconsent from the participants to be taped.\nThe employment of a digital recorder not only secured the accuracy and the\ncompleteness of the data capture but also supported the field notes that were taken\nduring the interactions. The generation of themes was done in accordance with the\nstudy variables and then classification into coding categories was done. A plan for\nanalysis was made which included direct citations and the concepts that frequently\noccurred to ensure a rich interpretation of the results. According to Noel et al.\n(2017), thematic analysis is still recommended in qualitative research due to its\nclarity and simplicity; thus it is deemed suitable for this study. This technique\nrevealed the institutional, social, and economic factors that were playing a role in\nthe way adolescent pregnancy was impacting family tie-ups, roles, and support\nsystems in Bubare Sub-County. Quantitative data was processed via Microsoft Excel\nto create frequency and percentage distributions, while the qualitative data was\nsubjected to content analysis technique.\n3.11 Quality Control\nIn order to provide quality and valid data several steps were implemented. First, a\nsmall sample containing respondents from a neighboring sub-county was used for a\npilot study that aimed at testing the data collection instruments and procedures,\nand feedback was utilized to make the interview and FGD guides better. The use of\nmultiple data sources namely interviews, FGDs, and document analysis brought\nabout triangulation thus guaranteeing very strong findings that are supported by", "word_count": 309, "start_char": 58758, "end_char": 60799}
{"chunk_id": "DOC0009__00030", "doc_id": "DOC0009", "chunk_index": 30, "text": "he use of\nmultiple data sources namely interviews, FGDs, and document analysis brought\nabout triangulation thus guaranteeing very strong findings that are supported by\n\ndifferent viewpoints. One of the methods used in the process was member checking\nwhich involved sharing preliminary findings with chosen participants in order to\nconfirm accuracy and relevance. Besides, the research assistants being regularly\nsupervised ensured that there was uniformity in the conducting of interviews and\ndiscussions at all times during the data collection phase.\n3.11.1 Validity of the Instrument\n3.11.1.1 Internal validity of the research instrument\nInternal validity in research refers to the extent to which a study's design, methods,\nand procedures accurately measure what they are intended to measure (Kimberlin,\n& Winterstein, (2008). It is the degree to which a study is free from bias and\nconfounding variables, allowing researchers to confidently attribute any observed\neffects to the variables being studied. The internal reliability of the instruments was\nexamined by the researcher. Content validity data was used for the measurement\nof internal validity. By consulting with my research supervisor, the reliability of the\ninquiries being investigated was confirmed, and the researcher advised on what\nneeded to be corrected.\n3.11.1.2 External validity of the research instrument\nAccording to Khirsan and Crawford (2014), External validity is the extent to which\ngeneralization of the findings of the research to other situations, people, measures\nand setting. In this study, the external validity was used to determine whether the\nfindings of the study were generalized in other contexts. The sampling technique in\ntable 3.1 above, the findings from the selected population was used to give a general\noverview of the entire population.", "word_count": 273, "start_char": 60632, "end_char": 62468}
{"chunk_id": "DOC0009__00031", "doc_id": "DOC0009", "chunk_index": 31, "text": "n this study, the external validity was used to determine whether the\nfindings of the study were generalized in other contexts.T\n\nhe sampling technique in\ntable 3.1 above, the findings from the selected population was used to give a general\noverview of the entire population.\n\n3.12 Ethical Considerations\nThe researcher sought clearance from the Faculty of Social Sciences at Uganda\nChristian University. An introductory letter was obtained from the Social Sciences\nDepartment at Uganda Christian University, which permited the researcher to\nproceed to the field for data collection. Permission was also sought from the Sub-\nCounty Chief of Bubaare Sub-County, who authorized the researcher to collect data\nfrom the targeted respondents. Prior to data collection, the respondents were given\ninformation about the study and were assured of the confidentiality of their\ninformation using a participant information sheet. Additionally, the researcher\nmaintained confidentiality by using a clean dataset that was not contained any\nidentifying information. This approach helped to ensure that respondents were\nprotected and their responses remained unbiased.\nInformed consent was sought from each respondent by requesting them to sign\nconsent forms indicating their willingness to participate in the study. The\nquestionnaires were interviewer-administered, and after completion, the researcher\ncollected them on the same day and prepared them for analysis at the end of each\nworking day. Interviews were conducted with selected respondents to clarify\nsignificant issues that arised from the questionnaire responses. The researcher also\nconducted at least two Focus Group Discussions (FGDs) in every parish within\nBubaare Sub County, with each FGD composed of 10 participants.\n3.13 Limitations of the study\nThe research was limited in its scope and its ability to be widely accepted, this was\na substantial methodological limitation, as it was only concerned with Bubare Sub-", "word_count": 291, "start_char": 62193, "end_char": 64162}
{"chunk_id": "DOC0009__00032", "doc_id": "DOC0009", "chunk_index": 32, "text": "he researcher also\nconducted at least two Focus Group Discussions (FGDs) in every parish within\nBubaare Sub County, with each FGD composed of 10 participants.\n3.13 Limitations of the study\nThe research was limited in its scope and its ability to be widely accepted, this was\na substantial methodological limitation, as it was only concerned with Bubare Sub-\n\nCounty in Rubanda District. Such a geographic limitation made it impossible to use\nthe results in other regions of Uganda. Moreover, the particular cultural, economic,\nand social features of Bubare might have been different from those of other\ncommunities, thus further restricting the generalization of the results outside the\nspecific area of study. Nevertheless, the researcher made it clear where the\nlimitations were in both the scope and methodology sections of the report and\nadvised to be careful in generalizing the findings, while also recommending that\nsimilar studies be conducted in different districts for comparison and wider\napplicability.\nSampling limitations were one of the main factors that impacted the reliability of\nthe findings of the study. With the use of a small sample size, the results could not\nbe considered statistically indicative of the larger population. Moreover, the nonprobability sampling method applied in this research was probably going to bring\nabout sampling bias, and so it was difficult to be objective and generalize the study's\nresults. The researcher made the effort to include different individuals within the\nchosen sample, acknowledging the sampling limitations, and at the same time,\nsuggesting that future studies with larger, probability-based sampling techniques\nmight result in more representative results. Data collection was one of the\nchallenges faced by the study and it had a negative impact on the accuracy of the\nfindings.\nRespondents did not give true answers because they considered the issue of teenage\npregnancy socially undesirable and hence the community's stigma would affect\nthem, resulting in social desirability bias. Moreover, the practice of obtaining\ninformation directly from teenage mothers or their families boosted the risk of", "word_count": 330, "start_char": 63805, "end_char": 65971}
{"chunk_id": "DOC0009__00033", "doc_id": "DOC0009", "chunk_index": 33, "text": "espondents did not give true answers because they considered the issue of teenage\npregnancy socially undesirable and hence the community's stigma would affect\nthem, resulting in social desirability bias.M\n\noreover, the practice of obtaining\ninformation directly from teenage mothers or their families boosted the risk of\n\ngetting answers that might be exaggerated or understated, hence the validity and\nreliability of the collected data were compromised. To lessen the impact of this\nbias, the researcher gave the participants the assurance of complete confidentiality\nand anonymity, the interviews were conducted in private and safe places, and the\nuse of trained data collectors who are competent in dealing with sensitive issues\nwas promoted so that honest disclosure might be encouraged. The study employed\na cross-sectional design, which restrained it from being able to establish causal\nrelationships between teenage pregnancy and family stability over a period of time.\nNo longitudinal data made it tough to follow changes and long-term impacts, thus\nlimiting the analysis and the understanding of how teenage pregnancy affected\nfamily dynamics through different stages.\n3.14 Chapter review\nThis chapter outlines the research methodology adopted to assess the impact of\nteenage pregnancy on family stability in Bubaare Sub-County, Rubanda District. It\ndescribes the study area, qualitative research approach, and descriptive design\nemployed. The target population includes teenage mothers and key community\nstakeholders, selected purposively. Data collection methods included in-depth\ninterviews, focus group discussions, and document reviews. Slovin’s formula\ndetermined a sample size of 62. Data analysis followed thematic analysis to identify\nrecurring patterns.\n\nCHAPTER FOUR\nPRESENTATION, ANALYSIS AND INTERPRETATION OF RESULTS\n4.0 Introduction\nThis chapter gives a detailed presentation, interpretation and discussion of findings\nbased on the order according to the objectives of the study.\n4.1 Demographic characteristics of respondents\nA total of fifty six (56) respondents were selected for the study. The researcher\nconsidered the age, gender, marital status, education level, occupation and religion\nof the respondents. This demographic data was very essential for the researcher and\nthe study in order to describe the best respondents that were selected for the study\nas presented below.\n4.1.1 Age of the respondents\nIn a bid to record the bio data of respondents, the researcher considered the age of\nrespondents and the results in Table 4.1.1 below were recorded\nTable 4.1.1: Showing the age of the respondents\nAge\n12–14\n15–17\n18–19\n20 and above\nTotal", "word_count": 391, "start_char": 65651, "end_char": 68323}
{"chunk_id": "DOC0009__00034", "doc_id": "DOC0009", "chunk_index": 34, "text": "Based on the results presented in Table 4.1.1, the largest proportion of respondents\n(48%) were aged 20 years and above. This age group was selected due to their\nextensive life experiences and ability to provide informed and mature insights\nrelated to the study topic. Respondents aged 18–19 years constituted 21% of the\nsample, as they were considered to have emerging perspectives and some level of\nexposure relevant to the subject. Another 18% were between 15–17 years,\nrepresenting teenagers with growing awareness and the ability to contribute\nmeaningfully, though with less experience. The smallest group, making up 13%, were\naged 12–14 years, as their limited exposure and developing understanding made\nthem less likely to provide in-depth responses, thus forming a smaller portion of the\nsample. The researcher considered age as an important factor to ensure data was\ngathered from individuals whose knowledge and experiences were appropriate to\nthe objectives of the study.\n4.1.2 Gender of the respondents\nThe researcher also considered the gender of respondents and the results in table\n4.1.2 below were recorded:\nTable 4.1.2: Showing the gender of the respondents\nGender\nMale\nFemale\nTotal\n\nThe study results presented in Table 4.1.2 above indicated that 66% the highest\nnumbers of respondents were females because these had more available, accessible\nand more directly affected by the study topic, leading to their higher representation\nwhereas 34% the least number of respondents were males because these were less\navailable, less involved and less willing to participate in the study. The researcher\nconsidered the gender of respondents in order to ensure gender balance in the study.\n4.1.3 Education level of the respondent\nThe researcher further considered the education level of the respondent and the\nresults presented below in Table 4.1.3 were recorded.\nTable 4.1.3: Showing the education level of the respondent\nEducation Level\nNo formal education\nPrimary\nSecondary\nTertiary\nTotal\nAccording to the results presented in Table 4.1.3 above, 42% the highest numbers of\nthe respondents had tertiary level of education and were much involved in the study\nbecause they were more informed and had the desired information for the study\nwhereas 4% the lowest number of respondents had primary level and this was\nbecause majority of the primary school children would not be affected by teenage\npregnancy since they were still young. The respondents with 16% had secondary", "word_count": 385, "start_char": 68323, "end_char": 70802}
