{"chunk_id": "DOC0109__00000", "doc_id": "DOC0109", "chunk_index": 0, "text": "ASSESSING THE EFFECT OF TEBUCUNAZOLE ON ASPERGILLUS FLAVUS\nAND FUSARIUM VERTICILLIOIDES GROWTH IN MAIZE SEEDS IN UGANDA\n\nRITAH MUTAMBI\nS21B26/ 023\n\nA DISSERTATION SUBMITTED TO THE FACULTY OF AGRICULTURAL SCIENCES IN\nPARTIAL FULFILLMENT FOR THE REQUIREMENTS FOR THE AWARD OF A DEGREE OF\nBACHELOR OF AGRICULTURAL SCIENCE AND ENTREPRENEURSHIP OF UGANDA\nCHRISTIAN UNIVERSITY\nApril, 2025\n\ni\n\nABSTRACT\nTebuconazole, a triazole fungicide is used for effective control of the fungal\npathogens in other crops. Little information regarding the use of tebuconazole\nfungicide is known. Therefore, this study aims at evaluating the effect of\ntebuconazole on growth of A. flavus and F. verticillioides in maize seeds. Completely\nrandomized design (CRD) with three replications was used to determine fungal growth\nand changes in physical traits of maize seeds and the germination rate. Data was\ncollected on fungal growth (colonies, capping, and abnormal seeds) and seedling\ngrowth. The results showed that was a significant difference (p< 0.004) among the\ntebuconazole concentrations on the fungal growth, physical traits and germination\nrate of maize seeds. The high dose had the highest normal seeds (72.65 ± 16.14a)\nwith the lowest number of abnormal seeds (23.47 ± 15.14c) and capping (5.13 ±\n8.45ab) while Control had the lowest number normal seeds (50.57 ± 28.33c) with\nhighest number of abnormal seeds (44.40 ± 27.57a) and capping (7.94 ± 8.04a). White\nfungal colonies were present in 100% of the samples across all treatments, high dose\nwas the most effective in reducing presence of yellow, green, grey and brown fungal\ncolonies. The highest germination percentage (96.67 ± 4.880c) was recorded in the\ncontrol while the recommended dose had the lowest germination percentage (63.33 ±\n9.759a). Since, the recommended dose (0.5ml) of tebuconazole effectively controlled\nthe fungus, it is the most effective dosage for controlling of A. flavus and F.\nverticillioides in maize seeds.\n\nii\n\nDEDICATION\nI dedicate my research to my family, my parents Miss Korweto Leonida and Mr\nMuhwezi John Wilbroad, and my sisters who supported me financially and spiritually\nthroughout my studies.\n\niii\n\nDECLARATION\nI, Mutambi Ritah, declare that this research dissertation is done by me and it’s my\noriginal work and has not been submitted by any other institute for a degree award.\nSignature: ..............................................\nDate: ..............................................\n\nv", "word_count": 370, "start_char": 0, "end_char": 2472}
{"chunk_id": "DOC0109__00001", "doc_id": "DOC0109", "chunk_index": 1, "text": "ignature: ..............................................D\n\nate: ..............................................\n\nv\n\nACKNOWLEDGEMENT\nI thank the Almighty GOD for his unending grace, wisdom and strength throughout this\njourney of my Bachelor’s degree.\nI thank my supervisor, Madam Namutosi Winnie, for her guidance, insightful feedback\nand unwavering support.\nI am also grateful to Prof. Elizabeth Kizito to the guidance and support throughout\nthe proposal to dissertation writing. Thanks to the Faculty of Agriculture lecturers for\nproviding a supportive academic environment. I also appreciate Miss linet for support\nand providing materials to carry out my in-virto experiment.\nI appreciate Dr. Jennifer Bisikwa and Mr. Ian Benywanira of Makerere University for\nthe opportunity given to work with them in this research. They provided the facilities\nand resources necessary for conducting this research.\n\nMay the Almighty GOD Bless You Abundantly!\n\nvi\n\nTABLE OF CONTENTS.\nABSTRACT ............................................................................................ i\nDEDICATION ......................................................................................... ii\nDECLARATION ...................................................................................... iii\nAPPROVAL .......................................................................................... iv\nACKNOWLEDGEMENT ............................................................................... v\nCHARPTER ONE ...................................................................................... 1\n1.1 Background. .................................................................................. 1\n1.2 Statement of the problem. ................................................................ 4\n1.3 Main objective. .............................................................................. 6\n1.3.1 Specific objectives. .................................................................... 6\n1.3.2 Hypothesis. .............................................................................. 6\n1.4 Significance. ................................................................................. 6\n1.5 Justification. ................................................................................. 7\n1.6 Scope of the study. ......................................................................... 7\n1.7 Theoretical framework. .................................................................... 8\n1.7.1 Conceptual framework. .................................................................. 9\nCHARPTER TWO ................................................................................... 10\n2.0 Literature review. ......................................................................... 10\n2.1.1 Importance of maize ................................................................. 10\n2.1.2 Storage conditions for maize quality preservation. ............................. 11\n2.1.3 Fungal community dynamics influencing aflatoxin contamination. .......... 11\n2.1.4 Morphological and toxigenic variability in A. flavus populations. ............ 12\n\nvii\n\n2.1.5 Climatic drivers of fungal proliferation and aflatoxin production. ........... 12\n2.1.6 Fusarium pathogens: Prevalence and genetic diversity in maize. ............ 12\n2.1.7 Deterioration of seed quality due to fungal colonization. ..................... 13\n2.1.8 Musty odor development as an indicator of fungal activity. .................. 13\n2.1.9 Current control methods of A. flavus and F. verticillioides in maize seeds 13\n2.1.10 Tebuconazole: Efficacy, regional variations, and resistance. ............... 14\n2.2 Identification of the fungal growth in maize seeds. .............................. 14\n3.0 CHARPTER THREE ............................................................................ 15\n3.1 Specific objective 1. To assess the effect of tebuconazole dosage on A.flavus\nand F.verticillioides growth and physical traits in maize seed. ........................ 15\n3.1.2 Study site. ............................................................................. 15\n3.1.3 Materials. .............................................................................. 15\n3.1.4 Experimental design. ................................................................ 15\n3.1.5 Data collection........................................................................ 16\n3.1.6 Data analysis. ......................................................................... 17\n3.2 Specific objective 2. To assess the effect of tebuconazole dosage on the\ngermination of maize seeds. ................................................................. 17\n3.2.1 Study site .............................................................................. 17\n3.2.2 Materials. .............................................................................. 18\n3.2.3 Experimental design. ................................................................ 18\n3.2.4 Data collection........................................................................ 19\n3.2.5 Data analysis. ......................................................................... 19\n\nviii", "word_count": 421, "start_char": 2359, "end_char": 7539}
{"chunk_id": "DOC0109__00002", "doc_id": "DOC0109", "chunk_index": 2, "text": "o assess the effect of tebuconazole dosage on the\ngermination of maize seeds. ................................................................. 17\n3.2.1 Study site .............................................................................. 17\n3.2.2 Materials. .............................................................................. 18\n3.2.3 Experimental design. ................................................................ 18\n3.2.4 Data collection........................................................................ 19\n3.2.5 Data analysis. ......................................................................... 19\n\nviii\n\nCHARPTER FOUR .................................................................................. 20\n4.1 For objective One: To assess the effect of tebuconazole dosage on A.flavus and\nF.verticillioides growth and physical traits in maize seed. ............................. 20\n4.1.1 Effect of tebuconazole on fungal growth. .......................................... 20\n4.1.2 Effect of tebuconazole dosage fungal growth and appearance of physical\ntraits. ............................................................................................ 21\n4.2 For Objective 2: To assess the effect of tebuconazole dosage on the germination\nof maize seeds. ................................................................................. 22\n4.2.1 Effect of tebuconazole dosage on germination percentage. ..................... 22\nCHAPTER FIVE ..................................................................................... 23\n5.0 DISCUSSION. ................................................................................ 23\nCHAPRTER SIX ..................................................................................... 25\n6.1 Conclusions. ................................................................................ 25\n6.2 Recommendations. ........................................................................ 25\nReferences ...................................................................................... 27\nAppendices ...................................................................................... 30\n\nix\n\nLIST OF TABLES\nTable 1: Effect of tebuconazole on fungal growth ......................................... 20\nTable 2: Effect of tebuconazole dosage fungal growth and appearance of physical\ntraits ................................................................................................ 21\nTable 3: Effect of tebuconazole dosage on germination percentage and seedling\ngrowth .............................................................................................. 22\n\nx\n\nLIST OF FIGURES\nFigure 1: Experimental layout .................................................................. 16\n\nxi\n\nLIST OF ABREVIATIONS.\nF.verticilliodes Fusarium verticillioides.\nA.flavus Aspergillus flavus.\nFH High dose of tebuconazole.\nFL Low dose of tebuconazole.\nFR Reference dose\nPC Recommended dose of tebuconazole.\nNC Control.", "word_count": 228, "start_char": 6899, "end_char": 9896}
{"chunk_id": "DOC0109__00003", "doc_id": "DOC0109", "chunk_index": 3, "text": ".verticilliodes Fusarium verticillioides.A\n\n.flavus Aspergillus flavus.F\n\nH High dose of tebuconazole.F\n\nL Low dose of tebuconazole.F\n\nR Reference dose\nPC Recommended dose of tebuconazole.N\n\nC Control.\n\nCHARPTER ONE\n1.0 INTRODUCTION\n1.1 Background.\nMaize is one of the staple food crops for most of the population in African including\nUganda. Maize is the one of the most important cereal crops cultivated throughout\nthe year. It is used as feed (63.0%), food 23.0%) and in starch industries (12.0%), and\nalso widely used for the production of biofuels and industrial products. It is used in\nmanufacturing starch and glucose in industries dealing with poultry and animal feeds.\n(Tang et al., 2022). The demand for starch consumption in food is growing at 10−12%\nyearly. It has greater calorific value and rich in amino acids with less toxins compared\nto grains like millet and broken rice. (Buyinza & Wambede, 2008)\nDespite the economic importance of Maize, more than 60 diseases attack maize\nduring production and storage hence reducing the production and productivity of\nmaize. (Xu et al., 2023) Fungi are one of the principal causes of deterioration and\nyield loss to maize farmers and seed companies during storage. Maize is susceptible to\ncontamination by aflatoxin, which are produced by fungi called Aspergillus flavus\n(Sserumaga et al., 2020). During seed storage, the common fungal species include:\nAspergillus flavus and fusarium verticillioides. These fungus mostly affect seed\nquality through production of mycotoxins that cause discoloration of seeds,\nreduction in seed viability and germination where the mycotoxins can directly damage\nthe embryo leading to decreased germination rates and also increase susceptibility to\ndiseases which makes them more vulnerable to fungal diseases thus reducing quality\nand yield in maize production.(Sserumaga et al., 2020) Aspergillus flavus thrives and", "word_count": 288, "start_char": 9695, "end_char": 11599}
{"chunk_id": "DOC0109__00004", "doc_id": "DOC0109", "chunk_index": 4, "text": "multiplies in storage areas with high moisture and temperature and it is a major\nproducer of aflatoxin which is a toxic secondary metabolites that pose serious health\nrisks to both humans and animals. (Mateo et al., 2017).Aspergillus flavus has L Morph\ntype with large sclerotia that produces fewer conidia compared to the S morph type.\nThe L morph type of Aspergillus flavus is the most prevalent type found in Uganda.\nAspergillus flavus colonies have varying appearances with green, yellow and black\nmycelium. (El-Dawy et al., 2024) Aspergillus flavus destroys stored seeds causing loss\nof viability which impacts the ability of the seeds to germinate successfully, and a\nmusty odor which indicates spoilage and potential health risks. The prevalence and\nseverity of aflatoxin in maize depend on the composition of Aspergillus populations\npresent. The toxigenicity of There are varying levels of aflatoxin in the Aspergillus\nflavus strains where some strains produce high levels of aflatoxin while others\nproduce little or nothing hence the maize stored is affected by a specific strain\ndepending on its ability to produce the aflatoxin.(Massomo, 2020). Aspergillus ssp\nproduces different aflatoxin for example Aspergillus flavus produces B1and B2\naflatoxin while A.parasiticus produces G1 and G2 aflatoxin which is known as the most\npotent in potent aflatoxin production.\nThe color colonies for fusarium verticillioides are pink, grey and white and it is the\nmost prevalent disease in the Ugandan maize exhibited with a genetic differentiation\nfrom the strains that are in other countries. (Wokorach et al., 2021 The infection\ncaused by F.verticilliodes during the maize seed storage is severe and leads to high\nlevels of damage where it damages embryo and endosperm which causes low levels of\ngermination when the seeds are planted. (Moharana et al., 2020) It also causes other", "word_count": 293, "start_char": 11599, "end_char": 13480}
{"chunk_id": "DOC0109__00005", "doc_id": "DOC0109", "chunk_index": 5, "text": "symptoms like visible rotting on the seeds which affects their quality and produces\nFumonisin that are toxic to human health and the animals. The Fumonisin\ncontamination known as a group of mycotoxins. F. verticillioides causes visible rot\nsymptoms on stored seeds hence affecting their quality and produces fumonisins\nknown as a group of mycotoxins that pose serious health risks to humans and animals.\nIn addition, Uganda fusarium strains exhibit a unique haplotype diversity which leads\nto a localized evolutionary patterns and adaptation. (Xu et al., 2023)\nThere are different methods of seed treatments to control fungal diseases which\ninclude biological methods like use of trichoderma harzianum which can parasitize\nand kill other fungi including Aspergillus and Fusarium. Physical methods like hot\nwater treatment where seeds are soaked in hot water to kill fungal spores on the seed\nsurface for a specific time and temperature and also seed sorting and selection where\ndamaged, discolored, or moldy seeds are removed visibly before storage to reduce\noverall fungal load. Chemical seed treatments include: Carboxyl a systemic fungicide\nthat controls seed-borne diseases like smuts, Thiram a contact fungicide that protects\nthe seed surface from fungal infections and prodione a broad-spectrum fungicide\neffective against a wide range of fungi, including Aspergillus and Fusarium. Chemical\nseed protectants have been recommended for the control of seed borne diseases, but\nhave not been completely effective and can also cause phytotoxicity and negative\ngrowth. The storage resistance of seeds that have been treated with saromyl\nfungicide was used as a reference for maize storage seeds (Rahmawati and Aqil,\n2021).", "word_count": 260, "start_char": 13480, "end_char": 15202}
{"chunk_id": "DOC0109__00006", "doc_id": "DOC0109", "chunk_index": 6, "text": "hemical\nseed protectants have been recommended for the control of seed borne diseases, but\nhave not been completely effective and can also cause phytotoxicity and negative\ngrowth.T\n\nhe storage resistance of seeds that have been treated with saromyl\nfungicide was used as a reference for maize storage seeds (Rahmawati and Aqil,\n2021).\n\nTebuconazole is a triazole systemic fungicide that is used worldwide in the agriculture\nsector to protect the crops from a variety of fungal pathogens. (Rajasekar et al.,\n2015) Its efficacy it affected by the regional variation for example in India which is\nsubtropical, tebuconazole has shown significant efficacy against fungal pathogens\nwhile in warmer climates , studies have shown resistance rates of up to 95% in treated\ncorn seeds under high dosages. (Smith et al., 2023). This research evaluated the\nimpact of different tebuconazole dosages on the growth of A. flavus and F.\nverticillioides in stored maize seeds, as well as its effects on seed germination rates\nand physical traits, to determine optimal application strategies in Uganda.\n1.2 Statement of the problem.\nMaize is one of the most important crops in Uganda that highly contributes to food\nsecurity and economic stability though its production and storage is greatly damaged\nby fungal pathogens especially Aspergillus flavus and fusarium verticillioides. These\ntwo fungi affect the quality of the seeds and also reduce its germination rates, they\nalso produce aflatoxin that are harmful to both humans and animals. Despite the\neconomic importance of maize to our country, the contamination caused by these two\nfungi during maize seed storage still remains a significant challenge leading to post\nharvest losses and reduced market value (Sserumaga et al., 2020; Xu et al., 2023).\nAspergillus flavus and Fusarium verticillioides are the predominant fungal species\naffecting maize during storage in Uganda. These fungi thrive in warm and humid\nconditions, which are common in the region, and their presence leads to seed\ndiscoloration, reduced germination rates, and mycotoxin contamination (Massomo,\n2020; Wokorach et al., 2021).", "word_count": 328, "start_char": 14868, "end_char": 17001}
{"chunk_id": "DOC0109__00007", "doc_id": "DOC0109", "chunk_index": 7, "text": "spergillus flavus and Fusarium verticillioides are the predominant fungal species\naffecting maize during storage in Uganda.T\n\nhese fungi thrive in warm and humid\nconditions, which are common in the region, and their presence leads to seed\ndiscoloration, reduced germination rates, and mycotoxin contamination (Massomo,\n2020; Wokorach et al., 2021).\n\nThe control methods used include: Biological, physical and chemical methods that are\nused to manage fungal growth. Tebuconazole, a triazole fungicide that is a chemical\nmethod has shown efficacy in the control of the fungal pathogens in other crops and\ncountries. (Rajasekar et al., 2015; Gxasheka et al., 2020). However the effectiveness\nof tebuconazole in controlling A.flavus and F. verticillioides in maize under the\nUgandan storage conditions is still not known though it is widely used in control of\nfungal pathogens, there is limited information on its effectiveness in managing of\nAspergillus flavus and fusarium verticillioides. The optimal dosage of tebuconazole\nfor controlling these two fungi is not well established. There is lack of the\nstandardized dosage level with no negative effect on the germination and physical\ntraits of maize seeds (Tang et al., 2022).\nThere is a need to determine the efficacy of tebuconazole in controlling Aspergillus\nflavus and Fusarium verticillioides growth in stored maize under Ugandan conditions.\nSpecifically, the optimal dosage of tebuconazole that effectively inhibits fungal\ngrowth while maintaining or improving seed germination rates and physical\ncharacteristics must be established though the impact of tebuconazole on seed\nquality during storage needs to be evaluated to provide practical recommendations\nfor maize farmers and storage facility managers. (Sserumaga et al., 2020) This study\naims at evaluating the effect of tebuconazole on the growth of Aspergillus flavus and\nfusarium verticillioides in the stored maize seeds and finding out the impact it has on\nthe germination rate and physical traits. This experiment will consist of varying doses\nof tebuconazole in order to identify the optimal concentration that will effectively\ncontrol these two fungi growth without affecting the seed quality. The findings of this", "word_count": 331, "start_char": 16653, "end_char": 18884}
{"chunk_id": "DOC0109__00008", "doc_id": "DOC0109", "chunk_index": 8, "text": "his experiment will consist of varying doses\nof tebuconazole in order to identify the optimal concentration that will effectively\ncontrol these two fungi growth without affecting the seed quality.T\n\nhe findings of this\n\nstudy will provide a clear view on how to develop am effective seed treatment\nstrategy to mitigate fugal contamination in the maize seed storage in order to\nimprove food security.\n1.3 Main objective.\n To evaluate the effect of tebuconazole on fungal growth and seed quality of\nmaize for effective management of fungal diseases and reduce the yield losses\ncaused during storage.\n1.3.1 Specific objectives.\n1. To assess the effect of tebuconazole dosage on Aspergillus flavus and Fusarium\nverticillioides growth and physical traits in maize seed.\n2. To assess the effect of tebuconazole dosage on the germination percentage of\nmaize seeds.\n1.3.2 Hypothesis.\n1. Increased dosages of tebuconazole reduce the growth of A. flavus and F.\nverticillioides in maize seeds.\n2. Low to moderate dosages of tebuconazole affect the germination percentage of\nmaize seeds negatively.\n1.4 Significance.\nThe results of this study will provide scientific evidence for the efficacy of\ntebuconazole in controlling local fungal growth and its impact on maize seed quality\nduring storage. The results will provide valuable information for policymakers and\nregulatory agencies involved in setting standards for the use of fungicides in", "word_count": 219, "start_char": 18666, "end_char": 20097}
{"chunk_id": "DOC0109__00009", "doc_id": "DOC0109", "chunk_index": 9, "text": "he results of this study will provide scientific evidence for the efficacy of\ntebuconazole in controlling local fungal growth and its impact on maize seed quality\nduring storage.T\n\nhe results will provide valuable information for policymakers and\nregulatory agencies involved in setting standards for the use of fungicides in\n\nagriculture. The study will also benefit maize farmers, food and feed industries,\nresearchers and extension workers by providing them with practical recommendations\nfor the safe and effective use of tebuconazole to prevent fungal contamination of\n1.5 Justification.\nTebuconazole, a triazole fungicide has shown promising results in controlling a wide\nrange of fungal pathogens including Fusarium species in various crops. (Gxasheka et\nal., 2020). Previous studies have demonstrated the efficacy of tebuconazole in\ninhibiting mycelia growth of F. verticillioides and reducing fumonisin production in\nvitro(Falca & Mycotoxin, 2011).However, there is a lack of information regarding the\nuse of tebuconazole as a seed dressing agent for maize in Uganda due to the varying\nclimatic conditions. This research will address this knowledge gap by investigating the\neffects of different tebuconazole concentrations on fungal growth, specifically\ntargeting the dominant A. flavus and fusarium verticillioides. The study will also\nexamine the impact of tebuconazole on seed germination and other crucial physical\ncharacteristics of maize seeds. The findings will provide a practical solution for fungal\ncontrol and the optimal dosage will reduce wastage and develop effective fungicide\napplication guidelines that will have no negative effect on maize seed physical\ncharacteristics and germination rate valuable information for developing effective\nseed treatment strategies.\n1.6 Scope of the study.\nThis study will be conducted to evaluate the effect of tebuconazole on fungal growth\nand maize seed characteristics and germination. The focus will be on maize seeds\ntreated with tebuconazole during storage. The study will be conducted at Makerere", "word_count": 298, "start_char": 19772, "end_char": 21834}
{"chunk_id": "DOC0109__00010", "doc_id": "DOC0109", "chunk_index": 10, "text": "his study will be conducted to evaluate the effect of tebuconazole on fungal growth\nand maize seed characteristics and germination.T\n\nhe focus will be on maize seeds\ntreated with tebuconazole during storage.T\n\nhe study will be conducted at Makerere\n\nagricultural research institute at kabanyolo. The fungi used in the study will be\nisolated from maize samples collected from different storage facilities in Uganda.\n1.7 Theoretical framework.\nDependent variables: Seed weight was assessed by using a weighing scale in grams.\nThe color of the fungal colonies growing on the seeds were assessed visually. Seeds\nwere visually assessed for any abnormalities including discoloration, shriveling and\nrotting. Normal seeds are classified as healthy and had no signs of fungal growth or\nany other physical damage. Capping were assessed visually by counting the number of\ncapped seeds. Germination percentage is determined by counting the number of\nseeds that have germinated expressing this as a percentage of the total number of\nseeds (10). (Moharana et al., 2020)\nIndependent variables : A range of tebuconazole concentration were used 0ml for no\ncontrol, 0.5ml as high dose, 0.6ml as recommended dose, 0.8ml as lower dose and\n1.125 dose as reference dose. Distilled water was used to dilute the tebuconazole\nfungicide.\nControl variable: Light was controlled during the experiment in the laboratory.\n(Moharana et al., 2020)\n\n1.7.1 Conceptual framework.\n\nCHARPTER TWO\n2.0 Literature review.\n2.1.1 Importance of maize\nMaize (Zea mays) is a critical staple food for many populations worldwide,\nparticularly in Sub-Saharan Africa, including Uganda. It serves as the most significant\ncereal crop and a staple food for the majority of households, contributing over 40% to\ntotal calorie intake through versatile consumption as fresh cobs, \"posho,\" and\nporridge, and as a key food source for institutions. Economically, it stands as the\nprimary income source for numerous farmers, especially smallholders, supporting the\nlivelihoods of over two million households, traders, and millers, and has evolved into\na major non-traditional export crop boosting foreign exchange and underpinning\nindustries like brewing and livestock feed. Agriculturally, maize is widely cultivated\nacross Uganda, predominantly by smallholder farmers who account for the majority of\nproduction and marketable surplus, making it a government priority for enhanced\noutput. (Tang et al., 2022)\nAflatoxin contamination in maize in Uganda.\nHowever, maize crops are highly susceptible to fungal infections, which can lead to\nsignificant yield losses and pose severe health risks due to aflatoxin contamination\n(Sserumaga et al., 2020). Aflatoxins, a group of carcinogenic and immunosuppressive\nmycotoxins produced primarily by Aspergillus flavus, contaminate maize during\nstorage, especially in warm and humid environments. Several reports indicate\nalarming levels of aflatoxin contamination in maize from various regions in Uganda,", "word_count": 439, "start_char": 21586, "end_char": 24572}
{"chunk_id": "DOC0109__00011", "doc_id": "DOC0109", "chunk_index": 11, "text": "flatoxins, a group of carcinogenic and immunosuppressive\nmycotoxins produced primarily by Aspergillus flavus, contaminate maize during\nstorage, especially in warm and humid environments.S\n\neveral reports indicate\nalarming levels of aflatoxin contamination in maize from various regions in Uganda,\n\nleading to economic losses from trade restrictions and reduced market value\n(Sserumaga et al., 2020).\n2.1.2 Storage conditions for maize quality preservation.\nMaintaining maize seed quality and preventing spoilage require adherence to specific\nstorage conditions. Proper post-harvest management is essential, with a target\nmoisture content of 13% recommended to inhibit fungal growth (Campos et al., 2015).\nWell-ventilated storage structures, such as raised platforms, are crucial for promoting\nair circulation and preventing moisture accumulation. Effective drying methods, like\nsun drying, should be employed to remove excess moisture and prevent mold growth.\nThese practices reduce the risk of fungal growth and aflatoxin contamination during\nstorage (Campos et al., 2015).\n2.1.3 Fungal community dynamics influencing aflatoxin contamination.\nAspergillus section Flavus communities are composed of diverse individuals exhibiting\nvarying phenotypic and genotypic characteristics (Sserumaga et al., 2020). The\ncomposition of these communities significantly influences the incidence and severity\nof aflatoxin contamination. Understanding the interactions and dynamics within these\nfungal communities is crucial for developing effective control strategies. Factors such\nas fungal strain, environmental conditions and agricultural practices can all impact\nthe prevalence and toxigenicity of Aspergillus species in stored maize (Sserumaga et\nal., 2020).", "word_count": 228, "start_char": 24276, "end_char": 26024}
{"chunk_id": "DOC0109__00012", "doc_id": "DOC0109", "chunk_index": 12, "text": "he\ncomposition of these communities significantly influences the incidence and severity\nof aflatoxin contamination.U\n\nnderstanding the interactions and dynamics within these\nfungal communities is crucial for developing effective control strategies.F\n\nactors such\nas fungal strain, environmental conditions and agricultural practices can all impact\nthe prevalence and toxigenicity of Aspergillus species in stored maize (Sserumaga et\nal., 2020).\n\n2.1.4 Morphological and toxigenic variability in A. flavus populations.\nAspergillus flavus strains are categorized into different morph types, including the L\nand S morph types. In Uganda, the L morph type is more prevalent, accounting for\napproximately 6.66% of the A. flavus population (Massomo, 2020). The S morph type is\nknown to produce higher levels of aflatoxin compared to the L morph type, posing a\ngreater risk of contamination (Massomo, 2020).\n2.1.5 Climatic drivers of fungal proliferation and aflatoxin production.\nClimatic conditions play a significant role in the growth and aflatoxin production of A.\nflavus. A relatively hot and dry weather with an optimal growth rate of around 31°C\nfavors fungal proliferation. High temperatures (exceeding 25°C) and high humidity\n(above 70%) create conducive environments for the spread of infection and the\ngrowth of aflatoxin (Marín et al., 2013).\n2.1.6 Fusarium pathogens: Prevalence and genetic diversity in maize.\nFusarium verticillioides is another common fungal pathogen in maize, often found in\nmultiple haplotype groups (Marín et al., 2013). This pathogen is prevalent in Ugandan\nmaize, exhibiting genetic differentiation from strains found in other countries\n(Wokorach et al., 2021). F. verticillioides can cause severe damage to maize seeds\nduring storage, leading to the production of fumonisins, which are toxic to human and\nanimal health (Moharana et al., 2020). The unique haplotype diversity of Ugandan\nFusarium strains indicates localized evolutionary patterns and adaptation, requiring\nregion-specific management strategies (Xu et al., 2023).", "word_count": 294, "start_char": 25580, "end_char": 27639}
{"chunk_id": "DOC0109__00013", "doc_id": "DOC0109", "chunk_index": 13, "text": ". verticillioides can cause severe damage to maize seeds\nduring storage, leading to the production of fumonisins, which are toxic to human and\nanimal health (Moharana et al., 2020).T\n\nhe unique haplotype diversity of Ugandan\nFusarium strains indicates localized evolutionary patterns and adaptation, requiring\nregion-specific management strategies (Xu et al., 2023).\n\n2.1.7 Deterioration of seed quality due to fungal colonization.\nThe invasion and growth of A. flavus in maize seeds result in a loss of seed viability\n(Moharana et al., 2020). The fungus uses the seed's stored reserves as a food source,\nleading to a decline in the seed’s ability to germinate. Fungal activity degrades the\nseed's physical and biochemical composition, resulting in an overall decline in seed\nquality (Moharana et al., 2020).\n2.1.8 Musty odor development as an indicator of fungal activity.\nThe metabolic activity of A. flavus during its growth and colonization processes\nproduces volatile compounds, resulting in a musty odor (Moharana et al., 2020). These\ncompounds are byproducts of the fungus breaking down the seed’s components. The\npresence of a musty odor serves as an indicator of fungal activity and potential\nspoilage of stored maize. (Moharana et al., 2020).\n2.1.9 Current control methods of A. flavus and F. verticillioides in maize seeds\nVarious methods exist for controlling fungal diseases in stored maize, including\nbiological, physical, and chemical approaches. Biological methods involve using\nbeneficial microorganisms like Trichoderma harzianum to parasitize and kill other\nfungi (Xu et al., 2023). Physical methods include hot water treatments and seed\nsorting to reduce the fungal load. Chemical seed treatments, such as carboxyl,\nthiram, and prodione, have been used to control seed-borne diseases (Rahmawati and\nAqil, 2021). Tebuconazole, a triazole systemic fungicide, has shown promise in\nprotecting crops from fungal pathogens. It has curative and protective properties. It is\na large class of compounds that were developed in 1960s to solve the problem of\nfungal growth which causes diseases in plants, it is widely used in agriculture sector", "word_count": 325, "start_char": 27273, "end_char": 29426}
{"chunk_id": "DOC0109__00014", "doc_id": "DOC0109", "chunk_index": 14, "text": "ebuconazole, a triazole systemic fungicide, has shown promise in\nprotecting crops from fungal pathogens.I\n\nt has curative and protective properties.I\n\nt is\na large class of compounds that were developed in 1960s to solve the problem of\nfungal growth which causes diseases in plants, it is widely used in agriculture sector\n\nwith the aim of protecting crops from a variety of fungal pathogens (Rajasekar et al.,\n2015).\n2.1.10 Tebuconazole: Efficacy, regional variations, and resistance.\nTebuconazole's efficacy is influenced by regional variations and climatic conditions. In\nsubtropical regions like India, it has demonstrated significant efficacy against fungal\npathogens (Rajasekar et al., 2015). However, in warmer climates, studies have\nreported resistance rates of up to 95% in treated corn seeds under high dosages (Smith\net al., 2023) Fusarium species, particularly F. verticillioides, are highly prevalent in\nUgandan maize and exhibit significant genetic differentiation from strains in other\ncountries, evidenced by variations in the TEF-α1 gene sequence. (Wokorach et al.,\n2021).\n2.2 Identification of the fungal growth in maize seeds.\nCapping: High number of maize seeds that were capped indicated high levels of fungal\ncolonization while lower number of capped seeds indicated low levels of fungal\ngrowth. (Moharana et al., 2020). Fungal colonies: Presence of different fungal color\ncolonies indicated the presence or incidence of the fungal species. (Adolph, 2016)\nNormal seeds: High number of normal seeds indicated tebuconazole effectiveness to\ncontrol fungal growth and maintain seed quality and lower number of normal seeds\nindicated the resistance of fungal pathogens and changes in the seed quality.\nAbnormal seeds: High number of abnormal seeds indicated the resistance of fungal\npathogens and changes in the seed quality while lower number of abnormal seeds\nindicated tebuconazole effectiveness to control fungal growth and maintain seed\nquality. (Moharana et al., 2020).", "word_count": 293, "start_char": 29104, "end_char": 31096}
{"chunk_id": "DOC0109__00015", "doc_id": "DOC0109", "chunk_index": 15, "text": "bnormal seeds: High number of abnormal seeds indicated the resistance of fungal\npathogens and changes in the seed quality while lower number of abnormal seeds\nindicated tebuconazole effectiveness to control fungal growth and maintain seed\nquality. (Moharana et al., 2020).\n\n3.0 CHARPTER THREE\n3.1 Specific objective 1. To assess the effect of tebuconazole dosage on A.flavus\n3.1.2 Study site.\nThe study was conducted at Makerere University Agricultural Research Institute\nKabanyolo. MUARIK is located on spatial coordinates 0 ̊27'60''N, 32 ̊36'24'' E at an\naltitudinal range of 1250 m to 1320 m above mean sea level. The study site is within\nthe administrative boundaries of Nangabo Sub County, Wakiso district and about 14\nkm north of Kampala, Uganda’s capital city. Kabanyolo is part of the Lake Victoria\nbasin that receives an average annual precipitation of 1218 mm and slightly drier\nperiods in June to July and December to February. The average annual temperature is\n21.5 ̊C. (Makerere University et.at. 2025)\n3.1.3 Materials.\nHealthy maize seeds, tebuconazole fungicide, reference chemical (metalaxyl), 75\nplastic tins, syringe, weighing scale and distilled water.\n3.1.4 Experimental design.\nCompletely Randomized Design (CRD) with three replications for statistical validity\nincluding treatment groups. (Moharana et al., 2020) Healthy maize seeds were\nobtained from a maize storage facility.300g of maize seed was weighed for each\nplastic tin using a weighing scale. Treatments were inoculated with the infected\nmaize seed except the control treatment group.\n\nThe tebuconazole treatments groups included; 0ml (control), 0.5ml (recommended\ndose), 0.6ml (low dose), 0.8ml (high dose) and 1.125ml (reference dose) which were\ndiluted with distilled water (3ml). (Moharana et al., 2020)\nThe solution was mixed with the seeds, shaking manually in plastic bags for the\nuniform distribution of the fungicide. The maize seeds were then placed in the\nplastic tins to observe the fungal growth. Maize seeds in the tins were monitored for\nfungal growth and changes in physical traits of the seeds every after 7days for a\nmonth. (Moharana et al., 2020).\nExperimental layout.\n\nFigure 1: Experimental layout\n3.1.5 Data collection.\nData collected: Quantitative and qualitative data was collected.", "word_count": 344, "start_char": 30824, "end_char": 33112}
{"chunk_id": "DOC0109__00016", "doc_id": "DOC0109", "chunk_index": 16, "text": "he maize seeds were then placed in the\nplastic tins to observe the fungal growth.M\n\naize seeds in the tins were monitored for\nfungal growth and changes in physical traits of the seeds every after 7days for a\nmonth. (Moharana et al., 2020).E\n\nxperimental layout.F\n\nigure 1: Experimental layout\n3.1.5 Data collection.D\n\nata collected: Quantitative and qualitative data was collected.\n\nVariables: Independent variable (tebuconazole concentration), dependent variables\n(fungal colonies, capping, abnormal seeds and normal seeds), control variable (light)\nA sample of 100 maize seeds were chosen to assess the number of abnormal seeds,\nnormal seeds and capping visually. The color of the fungal colonies growing on the\nseeds were assessed visually. (Adolph, 2016). Seeds were visually assessed for any\nabnormalities including discoloration, shriveling and rotting. (Moharana et al., 2020).\nNormal seeds were classified as healthy and had no signs of fungal growth or any\nother physical damage. (Moharana et al., 2020)\n3.1.6 Data analysis.\nData was entered in excel then imported to Genstat 12edition for analysis. Descriptive\nstatistics was done to calculate mean and standard deviation for numerical variables\n(normal, abnormal seed and capping), and for categorical variables (high dose, low\ndose, reference dose, Control, and recommended dose. (Moharana et al., 2020). One\nway ANOVA was done to compare means of dependent variables across different\ntreatment groups. This was followed by Duncan's multiple range test was used to\ndetermine which treatments are significantly different from each other.\n3.2 Specific objective 2. To assess the effect of tebuconazole dosage on the\n3.2.1 Study site\nThis study was conducted from Uganda Christian University, Mukono main campus\nwith approximately 8,000 students, is in the town of Mukono, approximately 25\nkilometers (16 mi), by road, east of Uganda's capital city, Kampala, on the Kampala-\n\nJinja Highway. The coordinates of the main campus are 0°21'27.0\"N, 32°44'29.0\"E\n(Latitude: 0.357500; Longitude: 32.741389) with a tropical rainforest climate. (Uganda\nChristian Unversity.et al., 2025)\n3.2.2 Materials.", "word_count": 317, "start_char": 32731, "end_char": 34883}
{"chunk_id": "DOC0109__00017", "doc_id": "DOC0109", "chunk_index": 17, "text": "he coordinates of the main campus are 0°21'27.0\"N, 32°44'29.0\"E\n(Latitude: 0.357500; Longitude: 32.741389) with a tropical rainforest climate. (Uganda\nChristian Unversity.et al., 2025)\n3.2.2 Materials.\n\nHealthy maize seeds, tebuconazole fungicide, reference chemical (metalaxyl), 75\nsterilized petri dishes, pipettes, gloves, cotton and distilled water\n3.2.3 Experimental design.\nCompletely Randomized Design (CRD) with three replications for statistical validity\nincluding treatment groups.\nHealthy maize seeds were obtained from storage maize facilities. Maize seeds were\nsoaked in distilled water for 12 hours to improve germination.\nTebuconazole concentrations were prepared, low dose(0.5ml),high dose(0.8ml),\nrecommended dose (0.6ml) and reference dose (1.125ml) that were diluted with\n0.3ml of distilled water. (Moharana et al., 2020). The maize seeds were treated,\napart from control group where the mixture and the seeds were put in polyethene bag\nand shaken manually for uniform distribution of the fungicide.\nTreated 10 maize seeds, apart from control group were placed in each petri dish.\nMoist cotton was placed in the petri dishes where the treated seeds were placed. The\nseeds were then covered with a black polyethene back to trap moisture and prevent\ndirect light from inhibiting germination. (Moharana et al., 2020)\n\nMoisture of the cotton was monitored daily and watered to prevent inhibition of seeds\ncausing by drying of the seeds. The germination process took 7days. (Moharana et al.,\n2020) (figure 1).\n3.2.4 Data collection.\nData collected: Quantitative data was collected.\nVariables: Independent variable (tebuconazole concentrations, distilled water),\ndependent variable (germination percentage, root length and shoot length), control\nvariable (light)\nThe number of maize seeds that germinated were recorded after 7days using the\nexcel sheet.\nGermination percentage was calculated by dividing the number of germinated seeds\nby the total number of seeds in each petri dish, which expressed the result as a\npercentage. The root and shoot length data was collected using a ruler in cm by\nmeasuring the root and length of the seedlings. (Moharana et al., 2020)\n3.2.5 Data analysis.\nData was entered in excel then imported to Genstat 12edition for analysis. Descriptive\nstatistics was done to calculate mean and standard deviation for numerical variables\n(germination percentage, shoot length and root length), and for categorical variables\n(high dose, low dose, reference dose, Control, and recommended dose. One way\nANOVA to compare means of dependent variables across different treatment groups\nand correlation analysis to determine the relationship between germination\npercentages, root and shoot lengths. Duncan's multiple range test used to determine\nwhich treatments are significantly different from each other. (Moharana et al., 2020)", "word_count": 411, "start_char": 34682, "end_char": 37543}
{"chunk_id": "DOC0109__00018", "doc_id": "DOC0109", "chunk_index": 18, "text": "ne way\nANOVA to compare means of dependent variables across different treatment groups\nand correlation analysis to determine the relationship between germination\npercentages, root and shoot lengths.D\n\nuncan's multiple range test used to determine\nwhich treatments are significantly different from each other. (Moharana et al., 2020)\n\nCHARPTER FOUR\n4.0 RESULTS\n4.1 For objective One: To assess the effect of tebuconazole dosage on A.flavus\n4.1.1 Effect of tebuconazole on fungal growth.\nThe results showed that there was a significant difference at p- 0.004 among the\ndosages of tebuconazole on fungal growth on maize seeds (Table 1). White fungal\ncolonies were present in 100% of the samples across all treatments, suggesting\npotential resistance to tebuconazole. The high dose of tebuconazole appeared to be\nmost effective in reducing the presence of yellow, green, grey, and brown fungal\ncolonies.\nTable 1: Effect of tebuconazole on fungal growth\nWhite (%) Yellow (%) Green (%)\nGrey (%)\nBrown (%)\nRecommended\nDose\n100.0\n24.4\n6.7\n0.0\n17.8\nReference dose\n93.3\n2.2\n0.0\n0.0\n0.0\n95.6\n13.3\n20.0\n31.1\n22.2\n100.0\n13.3\n6.7\n8.9\n11.1\n100.0\n11.1\n28.9\n48.9\n17.8\nP-value\n< 0.05\n< 0.01\n< 0.001\n< 0.001\n< 0.01\n\n4.1.2 Effect of tebuconazole dosage fungal growth and appearance of physical\ntraits.\nThe results showed that there was a significant difference at p- 0.001 among the\ndosages of tebuconazole on physical traits of maize seeds (normal seeds, abnormal\nand capping) table 2. High dose of tebuconazole resulted in the highest number of\nnormal seeds (72.65 ± 16.14a) and the lowest number of abnormal seeds (23.47 ±\n15.14c), hence there was effective control of fungal growth. The control group had\nthe lowest number of normal seeds (50.57 ± 28.33c) and the highest number of\nabnormal seeds (44.40 ± 27.57a), hence there was significant fungal impact in the\nabsence of treatment.\nTable 2: Effect of tebuconazole dosage fungal growth and appearance of physical\ntraits\nNormal Seeds\nAbnormal Seeds\nCapping\nRecommended dose\n65.73 ± 21.39b\n29.97 ± 20.76b\n6.86 ± 7.45ab\nReference dose\n62.42 ± 25.84b\n34.83 ± 24.87ab\n3.84 ± 4.31b\n53.14 ± 26.77c\n42.77 ± 20.62a\n7.80 ± 7.59a\n72.65 ± 16.14a\n23.47 ± 15.14c\n5.13 ± 8.45ab\n50.57 ± 28.33c\n44.40 ± 27.57a\n7.94 ± 8.04a\nP-value\n<0.001\n<0.001\n<0.01\nLSD\n8.24\n7.95\n2.47\nP=0.004 shows significant difference, a, b, c ab separates means of the different\ntreatments\n\n4.2 For Objective 2: To assess the effect of tebuconazole dosage on the\n4.2.1 Effect of tebuconazole dosage on germination percentage.", "word_count": 412, "start_char": 37211, "end_char": 39729}
{"chunk_id": "DOC0109__00019", "doc_id": "DOC0109", "chunk_index": 19, "text": "The results showed that there was a significant difference at p- 0.004 among the\ndosages of tebuconazole on germination of maize seeds and seedling traits. Table 3\nindicates that low dose of tebuconazole resulted in the highest germination\npercentage (96.67 ± 4.880c), shoot length (5.327 ± 3.619b) and root length (7.247 ±\n4.391c) while the recommended dose of tebuconazole resulted in the lowest\ngermination percentage (63.33 ± 9.759a), shoot length (3.420 ± 2.723a) and root\nlength (5.200 ± 1.715b).\nTable 3: Effect of tebuconazole dosage on germination percentage and seedling\ngrowth\nGermination %\nShoot length\nRoot length\n70.00 ± 8.452b\n4.387 ± 1.230ab\n2.987 ± 1.183a\n96.67 ± 4.880c\n5.327 ± 3.619b\n7.247 ± 4.391c\nReference\nDose\n80.00 ± 22.361b\n4.493 ± 1.702ab\n4.193 ± 1.688b\n83.33 ± 4.880b\n4.213 ± 1.409a\n3.800 ± 1.440b\nRecommended\nDose\n63.33 ± 9.759a\n3.420 ± 2.723a\n5.200 ± 1.715b\nP value\n0.001\n0.001\n0.01\nLSD\n5.737\n1.3727\n1.662\nP=0.004 shows significant difference, a, b, c, ab separates means of different\ntreatments.\n\nCHAPTER FIVE\n5.0 DISCUSSION.\n5.1 For objective one: To assess the effect of tebuconazole dosage on A.flavus\nThe findings of this study confirm tebuconazole's effectiveness in reducing fungal\ngrowth and maintaining the physical quality of maize seeds during storage.\nSpecifically, the high dose of tebuconazole led to a higher number of normal seeds\nand a lower number of abnormal seeds, indicating effective control of fungal growth.\nThis aligns with previous research demonstrating tebuconazole's ability to protect\ncrops from various fungal pathogens. (Rajasekar et al. (2015) which shows that\ntebuconazole's efficacy in protecting crops from fungal pathogens. However, the\nconsistent presence of white fungal colonies across all treatments, as observed in this\nstudy, suggests potential resistance or the presence of non-targeted fungal species\nwhich is the same observation that was reported in warmer climates with resistance\nrates of up to 95% in treated corn seeds under high dosages. (Smith et al. 2023)\nImplication.\nTebuconazole significantly affects the growth of A. flavus and F. verticillioides, as\nwell as the physical traits of maize seeds.\nFor objective two: To assess the effect of tebuconazole dosage on the\nThe results indicated that low to moderate dosages of tebuconazole (0.5–0.6 ml) had\nminimal negative effects on germination percentage hence safe for seed viability.", "word_count": 376, "start_char": 39729, "end_char": 42146}
{"chunk_id": "DOC0109__00020", "doc_id": "DOC0109", "chunk_index": 20, "text": "ebuconazole significantly affects the growth of A. flavus and F. verticillioides, as\nwell as the physical traits of maize seeds.F\n\nor objective two: To assess the effect of tebuconazole dosage on the\nThe results indicated that low to moderate dosages of tebuconazole (0.5–0.6 ml) had\nminimal negative effects on germination percentage hence safe for seed viability.\n\nThis finding is consistent with the broader understanding that while fungicides can\nprotect seeds from fungal pathogens, they must do so without compromising the\nseed's ability to germinate. However, the reference dosage (1.125 ml) negatively\nimpacted germination due to phytotoxicity which can damage the seed embryo and\ninhibit germination. The same observation was reported regarding the importance of\nestablishing optimal tebuconazole dosages to avoid negative effects on germination\nand physical traits of maize seeds where high doses of tebuconazole affected\ngermination with an incidence of 10-20% (Tang et al. 2022).\nImplication.\nLow to moderate dosages of tebuconazole have minimal negative effects on seed\ngermination and they are safe for seed viability.\nLimitations.\nThe study observed white fungal colonies in 100% of the samples across all\ntreatments, suggesting potential resistance to tebuconazole or the presence of nontargeted fungal species.\nThe research did not include field trials in different environmental conditions and\nwith different maize varieties, which could limit the generalizability of the results.\n\nCHAPRTER SIX\n6.0 CONCLUSIONS AND RECOMMENDATIONS\n6.1 Conclusions.\nThe results from objective one for assessing the effect of tebuconazole dosage on\nA.flavus and F.verticillioides growth and physical traits in maize seed showed that\nthere was a significant difference (<0.004) among the tebuconazole concentrations on\nthe fungal growth and physical traits of maize seeds, therefore I fail to reject my\nhypothesis which states that increased dosages of tebuconazole reduce the growth of\nA. flavus and F. verticillioides in maize seeds.\nThe results from objective two for assessing the effect of tebuconazole dosage on the\ngermination percentage of maize seeds showed that was a significant difference (<\n0.004) among the tebuconazole concentrations on germination percentage, therefore\nI fail to reject my hypothesis which states that low to moderate dosages of\ntebuconazole affect the germination percentage of maize seeds.\n6.2 Recommendations.\nA recommended dose of tebuconazole (0.5ml) is recommended for usage due to its\neffectiveness to control fungal growth and minimal effect on the germination\npercentage.\nInvestigate long-term effects of tebuconazole on maize crop performance and explore\nintegrated approaches combining chemical and biological treatments.\nFiled trials should be conducted in different environmental conditions and with\ndifferent maize varieties to ensure generalizability. The presence of white fungal\n\ncolonies across all treatments suggests potential resistance to tebuconazole hence it\nis recommended to conduct further investigations to identify the specific fungal\nspecies present and their susceptibility to tebuconazole.", "word_count": 450, "start_char": 41781, "end_char": 44933}
