{"chunk_id": "DOC0025__00000", "doc_id": "DOC0025", "chunk_index": 0, "text": "Vol. 13(1), pp. 1-12, January-March 2021\nDOI: 10.5897/JEIF2020.1093\nArticle Number: 054911F65534\nISSN 2006-9812\nCopyright©2021\nAuthor(s) retain the copyright of this article\nhttp://www.academicjournals.org/JEIF\n\nJournal of Economics and International Finance\n\nFull Length Research Paper\n\nFinancial inclusion: Is it a precursor to agricultural\ncommercialization amongst smallholder farmers in\nUganda? A comparative analysis between Lango and\nBuganda sub-regions\n\nMarus Eton1*, Fabian Mwosi2, Mary Ejang3 and Sammy Godfrey Poro4\n\n1Department of Business, Faculty of Economics and Management Science, Kabale University, Kabale, Uganda.\n2Department of Postgraduate Studies, Bishop Barham University College, Kabale Uganda.\n3Department of Public Administration and Management, Faculty of Management Sciences, Lira University, Lira, Uganda.\n4Basic Education and Adolescences Development Section, UNICEF, Uganda.\n\nReceived 24 September, 2020; Accepted 17 November, 2020\n\nThis\nstudy\nexamines\nthe\ncontributions\nof\nin\nsupporting\ncommercialization amongst smallholder farmers in Uganda in Lango and Buganda sub-regions. The\nresearcher adopted a comparative study and cross-sectional survey design where descriptive, bivariate\nand multivariate data analysis was used. Chi square procedure was run to test the hypothesis that\nfinancial inclusion does not affect agricultural commercialization amongst smallholder farmers in\nLango and Buganda sub-regions. Regression analysis was specifically used to predict the level of\nchange in agricultural commercialization due to changes in financial inclusion. The study identified\nfinancial inclusion as one variable that can predict the success of agricultural commercialization,\nthough it varies from one region to another. In Lango, efforts by government to increase financial\naccess is a positive factor to agricultural commercialization while in Buganda, it is a negative factor. In\nLango, land is communal and not individually owned. Therefore, smallholder farmers need to access\nfinances to purchase land for commercial farming. In Buganda, however, land is freehold, which makes\nsmallholder farmers to own chunks of land from their parents. The study has established some\ncommon factors that limit agricultural commercialization in both Lango and Buganda, that is, expensive\nequipment and fluctuating prices while poor infrastructure is no longer a big worry. This paper\nrecommends that, financial service providers should revise their lending terms downwards to reach\nsmallholder farmers, some of whom lack collateral security to pledge for credit. While the government\ntakes credit for improving infrastructure, government, through her policy organs like ministry of\nagriculture, should provide buffer prices against price fluctuations.\n\nKey words: Financial inclusion, agricultural commercialization, smallholder farmers.\n\nINTRODUCTION\n\nMany agencies, development partners and governments\nthe world over have adopted financial inclusion as having\nthe ability to support inclusive transformation in the\ncommunity and rural areas (IFAD, 2016). Financial\ninclusion is a cross cutting issue where the policy makers\nneed to develop policies that are linked to those\n\n2 J. Econ. Int. Finance", "word_count": 434, "start_char": 0, "end_char": 3224}
{"chunk_id": "DOC0025__00001", "doc_id": "DOC0025", "chunk_index": 1, "text": "NTRODUCTION\n\nMany agencies, development partners and governments\nthe world over have adopted financial inclusion as having\nthe ability to support inclusive transformation in the\ncommunity and rural areas (IFAD, 2016).F\n\ninancial\ninclusion is a cross cutting issue where the policy makers\nneed to develop policies that are linked to those\n\n2 J.E\n\ncon.I\n\nnt.F\n\ninance\n\noperating in the financial sector. Demirguc-kunt et al.\n(2015) note that adequate progress has been achieved in\nraising financial inclusion levels globally where the\nunbanked people have drastically reduced by 20% to two\nbillion in the period 2011-2015.In Uganda, the number of\nadults who could access formal financial services rose\nfrom 28% in 2009 to 54% in 2013 (CARE International,\n2014). Mobile money brought about a sharp rise in\nfinancial inclusion. This report further reveals that about\n15% of the adults have no access to formal financial\nservices. In 2018, financial inclusion in Uganda stood at\n58%, which is almost double of what it was in 2009. The\nintroduction of Agent Banking in 2016 and shared agent\nplatform/switch to facilitate access to bank agents in 2018\naccount for the notable rise in financial inclusion (Alliance\nfor Financial Inclusion, 2019). However, the position\nremains low if compared to the global position of 69% in\n2017 and 63% in Sub Saharan Africa. The same report\nestablishes that 77% of the adults in rural areas have\nformal financial inclusion, majority of who are men (63%).\nThese statistics imply potential contributions of financial\ninclusion to the agricultural sector in Uganda, where 43%\nof household-based enterprises belong (Uganda Bureau\nof Statistics, 2016).\nUganda‟s\neconomy\npredominantly\ndepends\non\nagriculture since the 1920s, where cotton and coffee\naccounted for 90% of the total exports (Goobi et al.,\n2017). Around the years of independence, economic\ngrowth and development in Uganda was impressive,\ngrowing at an average annual rate of 6.7%. Around the\nsame period, agriculture contributed more than one-third\nof the country‟s GDP. The expansion in the food\nprocessing industries at that time gave rise to this\nhistorical rate of economic growth and development\n(Uganda Bureau of Statistics, 2016). From mid-1960s,\nUganda implemented agricultural and lending schemes\nthat resulted in the establishment of two public sector\nbanks (Uganda Commercial Bank and Cooperative Bank)\nto serve as a conduit for government lending schemes.\nThese banks made losses for failure to follow commercial\npractices (Kilimani, 2007). However, political instability,\npoor governance and economic mismanagement that\nswept the country in the 1970s and early 1980s saw\nUganda‟s persistent decline in the economy, casting it\namong the world‟s poorest and least developed\ncountries. The real decline in GDP stood at 38%, with a\ngreater effect on agriculture and trade sectors. The\nincreasing insecurity at the time and the unattractive\nprices paid to farmers affected coffee prices significantly\n(Ministry\nof\nFinance,\nPlanning\nand\nEconomic\nDevelopment, 2010; Brownbridge, 1996; Goobi et al.,\n2017). According to Uganda Bureau of Statistics (2016),\nagriculture contributed 24.0% to Uganda‟s GDP in 2014/", "word_count": 489, "start_char": 2859, "end_char": 6061}
{"chunk_id": "DOC0025__00002", "doc_id": "DOC0025", "chunk_index": 2, "text": "he\nincreasing insecurity at the time and the unattractive\nprices paid to farmers affected coffee prices significantly\n(Ministry\nof\nFinance,\nPlanning\nand\nEconomic\nDevelopment, 2010; Brownbridge, 1996; Goobi et al.,\n2017).A\n\nccording to Uganda Bureau of Statistics (2016),\nagriculture contributed 24.0% to Uganda‟s GDP in 2014/\n\n2015 year and 80% of Uganda‟s exports, with coffee\nalone contributing 20% (Goobi et al., 2017).\nThe integration of smallholder farmers into agricultural\nis\nsignificant\nto\nagriculture‟s\ncontribution to economic growth thus enhancing financial\ninclusiveness. Dehaas (2016) states that Uganda\nregistered 12 percent of smallholder farmers as the\nsellers of farms products and the net buyers stood at 66\npercent; therefore, accessibility to the market and\ntransiting from subsistence farming to commercial\nfarming can lead to economic growth. Uganda Bureau of\nStatistics (UBOS) (2015) observes that agricultural sector\nhad grown faster by contributing 26 percent from 24\npercent to the GDP of Uganda, which is commendable as\nafter embracing value addition. The importance of\nagricultural commercialization has significantly grown\nwith the development of various strategies, which shifted\nfrom subsistence to commercial (FAO, 2013). Agriculture\nprovides the primary source of income for the world\neconomy and supporting agricultural commercialization\nmay lead to an inclusive model for economic growth.\nGashu et al. (2019) justifiably assert that a significant\ninvestment and creativity in agriculture is highly needed\nto achieve a sustainable economic growth. One way\ntowards sustainable economic growth and development\nis\nand\nstimulating\nhousehold incomes. Agriculture commercialization is the\nprocess of transition from subsistence farming to\nproduction-oriented marketing (Pradhan et al., 2010). The\nconcentrations of commercial agriculture in Uganda\nconsist of the following: Livestock farming, crop farming,\nfishing, forestry and recently horticulture, which have\ngained prominence. Majority of the population in Uganda\ndepend on agriculture for their livelihood. They thus need\nan inclusive financial system to accelerate economic\ntransaction, manage daily resources, improve lifestyle,\nand make investment to support growth. The Government\nof Uganda has supported agriculture by providing special\nincentives which included duty free tax on importation of\nplant\nand\nmachinery,\nresearch\nand\ndevelopment\nexpenditures are exempt, training and capital allowances\non plant and machinery between 50-70% are exempted\n(Uganda Investment Authority (UIA), 2015). Agricultural\nmodernization in Uganda may support change from\nsubsistence agricultural system to a modern and\ncommercialized system, though it calls for adoption of\nadequate interventions.\nAgricultural industry is significant to the society\nespecially where it accounts for a larger share of the\neconomic output. Most importantly, financial inclusiveness\nhas not been emphasized in support to small holder\ncommercialization of agriculture. Insufficient amount of\ncommercialization of agriculture. Insufficient amount of\n\n*Corresponding author. E-mail: emarus@kab.ac.ug, eton.marus@gmail.com.", "word_count": 433, "start_char": 5736, "end_char": 8907}
{"chunk_id": "DOC0025__00003", "doc_id": "DOC0025", "chunk_index": 3, "text": "gricultural industry is significant to the society\nespecially where it accounts for a larger share of the\neconomic output.M\n\nost importantly, financial inclusiveness\nhas not been emphasized in support to small holder\ncommercialization of agriculture.I\n\nnsufficient amount of\ncommercialization of agriculture.I\n\nnsufficient amount of\n\n*Corresponding author.E\n\n-mail: emarus@kab.ac.ug, eton.marus@gmail.com.\n\nAuthor(s) agree that this article remain permanently open access under the terms of the Creative Commons Attribution\nLicense 4.0 International License\n\nmoney has always been exerted to promote agricultural\nsustainability\nand\ndevelopment\nand\nmajority\nof\nand\nentrepreneurs\nfocus\non\nproduction and technology which has not been consistent\n(Seidel et al., 2013). Agricultural financial sector has also\nbeen associated to the land rush growing globally.\nFairbairn (2014) argues that financial investors intending\nto acquire land for large scale farming is on the rise and\nthis is a major challenge facing commercial farmers.\nThese challenges are unique to smallholder commercial\nagriculturalist and financial institution face similar hurdles,\nwhich may include but not limited to high transaction\ncosts, regulatory framework and unfavorable climatic\nenvironment (IFC, 2012). The market dynamics currently\nfaced by smallholder farmers does not support market\naccess\nfor\nthe\nrural\ndwellers\nthus\nundermining\nagricultural commercialization.\nEconomists\nand\nagriculturalist\nhave\nlinked\nthe\nchallenges in adopting innovation and technology in\nagricultural sector to access to credit. FAO (2015)\nestablishes that inadequate infrastructure in the rural\nareas has made it difficult to support processing of\nagricultural produce for value addition, and other\nproduces are perishable like vegetables, fruits, dairy\nproducts and others. Barnett et al. (2008) link the\ninadequate\nfinance,\nwhich\nre-enforces\npoverty traps, and in essence, advocates for the riskbased finance programs. Despite the increasing attention\nand efforts by many developing countries where Uganda\nfalls, environmental issues not withstanding delays in the\nadoption of technology affects smallholder agricultural\ncommercialization (World Bank, 2016). Much emphasis\non investing resources in domestic or smallholder\nagriculture is evident, Uganda‟s spending on agriculture\nhas continuously declined despite its key role in the\neconomy. In this respect, the low budget on this sector\nhas negatively affected it and this affects the research on\nvalue addition, quality and regulation standards. The\nchallenges\nthe\ntwo\nregions\nface\nin\ncommercialization amongst small holder farmers are not\nany different from other region. This study will help to\nidentify key institutional issues that may support the\ntransformation of smallholder farmers into large scale and\nmodern agro-processing markets to achieve economic\ngrowth.\n\nObjectives", "word_count": 397, "start_char": 8502, "end_char": 11390}
{"chunk_id": "DOC0025__00004", "doc_id": "DOC0025", "chunk_index": 4, "text": "he\nchallenges\nthe\ntwo\nregions\nface\nin\ncommercialization amongst small holder farmers are not\nany different from other region.T\n\nhis study will help to\nidentify key institutional issues that may support the\ntransformation of smallholder farmers into large scale and\nmodern agro-processing markets to achieve economic\ngrowth.O\n\nbjectives\n\n(i) To establish the relationships between financial\ninclusion and agricultural commercialization amongst\nsmallholder farmers in Lango and Buganda sub-regions\n(ii) To assess the role of financial inclusion in supporting\nAgricultural\nfarmers in Lango and Buganda sub-regions.\n(iii) To examine the factors hindering the growth of\nagricultural commercialization amongst the smallholder\nEton et al. 3\n\nfarmers in of Lango and Buganda sub-regions.\n\nHypothesis\n\ndoes\nnot\ncommercialization amongst smallholder farmers in Lango\nand Buganda sub-regions.\n\nLITERATURE REVIEW\n\nConceptualizing financial inclusion", "word_count": 126, "start_char": 11055, "end_char": 11992}
{"chunk_id": "DOC0025__00005", "doc_id": "DOC0025", "chunk_index": 5, "text": "ypothesis\n\ndoes\nnot\ncommercialization amongst smallholder farmers in Lango\nand Buganda sub-regions.L\n\nITERATURE REVIEW\n\nConceptualizing financial inclusion\n\nFinancial inclusion (FI) is the provision of affordable,\ntimely and appropriately regulated access to financial\nservices and products to all categories of people with the\naim of improving and promoting the well-being of the\npopulation (OECD/INFE, 2012).The usage, adequacy,\nconvenience,\nproduct\nknowledge,\naffordability\nand\naccessibility are some of the factors brought forward by\nmany authors in describing financial inclusion (Aro-\nGordon, 2016).Financial inclusion (FI) emerged as a\nmajor player in delivering financial services to the\ncommunity and the disadvantaged poor at an affordable\nterms and conditions (Iqbal and Sami, 2017). It is\nimportant that the regulators, financial sectors and\ngovernment create a conducive and enabling environment\nthat supports the capacity of financial service providers\nthrough identification of the market demands by designing\naffordable products and services, which support financial\ninclusion (Arnold and Rhyne, 2016). Uganda has adopted\nthe usage of mobile money services and technology that\nhas significantly strengthened financial inclusion amongst\nthe farmers in the rural and peri-urban areas. Digital cash\ntransfers are most cost-effective methods of transferring\nmoney to small-scale farmers, which are scattered in\nrural areas. Finscope (2018) argues that mobile money\nservices have driven financial inclusiveness to Ugandans.\nOut of the 58% of the population who have access to\nformal financial services, only 56% conduct their\ntransaction through mobile money services.\nAccessibility to digital financing is critical for the\ntransformation of smallholder agricultural sector. Finscope\n(2018) states that 22% of Ugandan adults are using\ninformal channels in accessing financial services whereas\n22% are excluded financially therefore meaning that 44%\nof Ugandan adults are not getting the deserved services\nfrom the financial sector. Just like other developing\ncountries in the world, Uganda has adopted the usage of\ntelephone banking, whose penetration stands at 10%\n(Bruhn and Love, 2014). This is still low; however, the\nusage is likely to increase if most Ugandans are\ncontinuously sensitized. Callen et al. (2014) note that\ntechnology can improve savings; this can be done by\nusing mobile point service centers to collect weekly\ndeposits and this increases higher saving rates and\n\n4 J. Econ. Int. Finance", "word_count": 361, "start_char": 11837, "end_char": 14356}
{"chunk_id": "DOC0025__00006", "doc_id": "DOC0025", "chunk_index": 6, "text": "his is still low; however, the\nusage is likely to increase if most Ugandans are\ncontinuously sensitized.C\n\nallen et al. (2014) note that\ntechnology can improve savings; this can be done by\nusing mobile point service centers to collect weekly\ndeposits and this increases higher saving rates and\n\n4 J.E\n\ncon.I\n\nnt.F\n\ninance\n\nincreases household income. Kast and Pomeranz (2014)\nargue that the reduction in the barriers to a formal saving\nby individuals offering free bank accounts may result in a\ndecrease in short term debt and increased ability of\ncoping with consumption shocks. Serrao et al. (2013)\nstate that inequality amongst the community is widening\nand believed that limited access to financial services is\nseen as a factor responsible for the persistent and\nwidening income inequality and slow economic growth.\nUNCDF (2015) notes that policy makers hope that the\nrising level of financial inclusiveness would reduce\ninequality and raise growth. Kotler and Keller (2015)\nobserves that there are non-financial institutions legally\noperating in the community offering financial products\nand services to clients without a regulatory framework\ngiven by a financial authority.\nTania and Adalbert (2018) point out the challenges\nassociated to financial inclusion that are linked to\nunfavorable business environment and ever rising\ntransaction cost, which makes it very difficult for the\nsustainability of formal financial institution. DeOlloqui et\nal. (2015) argue that the challenges that limit financial\ninclusion are especially those population who are\nexcluded, and majority are in the rural areas. The rural\nenvironment faces multiple risks such as lower rates for\nformal property ownership, which may lead to reduction\nin the range of collateral security and these affect the\ncoverage and the quality of the availability of the\ninfrastructure (Valenzuela and Cruz, 2017). Access to\nfinancial service providers and bank branches has proved\nto be problematic especially to smallholder farmers and\nagriculturalist who are based in rural areas where\nbanking services are not easily available; whereas urban\ndwellers can access these financial services as and when\nthey need them (World Bank, 2015). Credit services,\nsaving and member‟s deposits remain the basic financial\nservices, which can be accessible while others are\noutreach like networks and retail location (World Bank,\n2014). Financial experts argue that access to a\nreasonable credit, at affordable rates to the poor will\nincrease financial inclusiveness to the disadvantaged\npoor (Abdulkareem, 2019).It is significant to note that\nfinancial exclusion in developing countries affects mostly\nthe rural dwellers and therefore it is important to applause\nthe contribution of informal financial lenders in filling this\ngap. Therefore the concerned authority should provide a\nmonitoring and supervisory role to protect the borrowers\n(Eton et al., 2019). Similarly, Akinlo (2014) establishes\nthat access to financial services is a major role in the\ndevelopment of the rural poor by increasing income and\nfacilitating investment in various sectors creates an\nopportunity for employment therefore reducing the\nvulnerability of the poor. Tambi (2018) states that\ndevelopment partners, private sector especially formal\nfinancial institution and governments should sensitize the\nsmallholder farmers on the availability and existence of\nfinancial services.", "word_count": 507, "start_char": 14035, "end_char": 17444}
{"chunk_id": "DOC0025__00007", "doc_id": "DOC0025", "chunk_index": 7, "text": "ambi (2018) states that\ndevelopment partners, private sector especially formal\nfinancial institution and governments should sensitize the\nsmallholder farmers on the availability and existence of\nfinancial services.\n\nConceptualizing agricultural commercialization\n\nAgricultural development economics establishes ways of\nbreakthrough from semi-subsistence methods (in which\nsmallholders are trapped) to the modern ways of farming\nwhich is commercial in nature (Muamba, 2011).The\nprocess involving transforming agricultural practices from\nthe rudimentary subsistence farming to commercial\nfarming is agricultural commercialization (Justus et al.,\n2016). Smallholder farmers can engage in agricultural\ncommercialization if given all the necessary support thus,\ncontributing to economic growth of the economy.\nAgricultural commercialization operates in two folds: the\none, which includes food crops and the one of cash\ncrops, which allows for production diversity (Jennifer and\nTina, 2014). The current agricultural commercialization or\nenterprise requires investing heavily on the equipment\nand guard against risk associated with uncertainties from\nnatural disasters like droughts and floods. IPCC (2012)\nargues that farmers in sub-Saharan Africa, Uganda\ninclusive suffer climatic change that affects agricultural\nproduction capacity. Importantly, agriculture in Uganda is\nlargely rainfed therefore farmers are vulnerable to\ndrought and floods. Climatic change has proved to be a\nglobal phenomenon that greatly affects agricultural\nproduction by causing variation in weather patterns,\ndrought and alterations in pests and diseases and the\nextent of its adversity would depend on the adaptability\ncapacity of the farmers (Gornall et al., 2010).To increase\nthe income of smallholder farmers in developing\ncountries, agricultural commercialization should focus on\ndeveloping better policies that supports commercialization\nof smallholder agriculture (Muriithi and Matz, 2015).\nSmallholder agricultural commercialization faces various\nchallenges, which among others include inadequate\nfinancing for long-term growth. This is a serious\nchallenge in the agricultural growth sector where\nagriculture has turned to be capital-intensive industry\n(Eraskine, 2014). Limited farmlands and variation in\nclimatic conditions are some of the major challenges\nfaced by smallholder farmers who are involved in\ncommercial agriculture (Tambi, 2018). Technological\nbarriers have posed as a challenge to agricultural\ncommercialization that may prevent smallholder farmer‟s\naccess to credit, thus limiting productivity and income\ngeneration\n(Levine,\n2005).\nWhereas\ntechnologies\neffectively support agricultural commercialization, inability\nto access capital especially among the underprivileged\nrural dwellers hinders smallholder farmers in developing\ncountries from adopting them (Shiferaw et al., 2015).\nSmallholder farmers with smaller plots are often\nconstrained by their inability to invest in modern inputs,\nwhich affects their income. EKN (2015) observes that\nsmall-scale farmers cannot use tractors since farmers\ncannot afford the technology. As an intervention, the\nadoption of technology has helped link the smallholder\nfarmers and markets and this has enhanced the", "word_count": 428, "start_char": 17230, "end_char": 20478}
{"chunk_id": "DOC0025__00008", "doc_id": "DOC0025", "chunk_index": 8, "text": "mallholder farmers with smaller plots are often\nconstrained by their inability to invest in modern inputs,\nwhich affects their income.E\n\nKN (2015) observes that\nsmall-scale farmers cannot use tractors since farmers\ncannot afford the technology.A\n\ns an intervention, the\nadoption of technology has helped link the smallholder\nfarmers and markets and this has enhanced the\n\nproductivity by different farmers (GOP, 2015). Innovations\nin the agricultural sector is significant in lowering per unit\ncost, reduces hunger and therefore boosting the income\nof the rural dwellers (Maertens and Barrett, 2013).\nAccess to usage of technology, land, infrastructure and\nadequate amount of rainfall significantly affects the\ndecision of farmers in agricultural commercialization\n(Olwande et al., 2015). The continuous usages of poor\ntechnology, poor quality seeds, pesticides and fertilizers\nby smallholder farmers have greatly affected the\nproduction and markets prices. Herrmann (2017) argues\nthat using modern farming techniques and technology\ncan lead to production of good quality products with high\ndemand in the market and these increase their income\nlevels. This therefore changes the conditions of input and\noutput prices, marketing systems, transaction cost and\nthe risks that farmers anticipate.\nGebremedhin and Jaleta (2010) state that agricultural\nproduction has been hit by falling prices of agricultural\nproducts, inadequate technology, lack of infrastructure\nand inefficient marketing institutions that cause a high\nrisk to household income. Woolverton et al. (2014)\nobserve that smallholder farmers have continued to\nengage in subsistence agriculture, which is less\nprofitable, and therefore cannot reap from the benefits\narising from agricultural commercialization. Gashu et al.\n(2019) note that new initiatives, reforms in policies and\ninitiatives\nshould\nbe\nsupported\nwhile\nappropriate\ninvestments needed to be developed which supports\nagricultural innovation and growth. AGRA (2016) argues\nthat a number of interventions have been made by\nvarious bodies that led to the transformation of\nsmallholder farmers into a major source of income,\nemployment and food for consumption. Smallholder\nlack\nlinks\nto\nthe\nmarkets\nlocally\nand\ninternationally, making them more prone to exploitation\nby intermediaries. The public and private sector ought to\ncontribute towards agricultural commercialization through\noffering financial incentives and training (Kabiti et al.,\n2016).It is important to note that formation of agricultural\ncooperatives or partnership by farmers with already\nestablished farmers supports markets commercialization\n(Bitzernd\nand\nBijman,\n2014)\nalthough\npoor\nand\nsmallholder farmers could be left out on the argument\nthat their relevance is not felt. Olwande et al. (2015)\nargue that improving markets accessibility and reduction\nof costs affects positively the smallholder farmers market\nparticipation which my lead to marketable surplus of their\nproduce. The approach of improving smallholder farming\nmethods and improved accessibility to the market\ntransforms the household economic status (Yusuf et al.,\n2018). The integration of cash generating crops to the\nline of various crops produced by smallholder farmers will\nincrease their level of income and this motivates them\n(Rubhara and Mudhara, 2019). There is much support\nstill needed for sustainability and transformation of\nagricultural processes in the sub-Saharan Africa to meet\nEton et al. 5", "word_count": 496, "start_char": 20108, "end_char": 23574}
{"chunk_id": "DOC0025__00009", "doc_id": "DOC0025", "chunk_index": 9, "text": "he integration of cash generating crops to the\nline of various crops produced by smallholder farmers will\nincrease their level of income and this motivates them\n(Rubhara and Mudhara, 2019).T\n\nhere is much support\nstill needed for sustainability and transformation of\nagricultural processes in the sub-Saharan Africa to meet\nEton et al. 5\n\nthe sustainable development goals.\n\nand\n\nThe recent trends in developing nations have seen\nfarmers engage in agricultural commercialization, and\nadoption of financial flows into less risky industries and\ncorporations indicates that farmers are highly indebted\nand therefore creating avenues for financial partnerships\n(Sippel et al., 2017). Better financial services should\nimprove financial accessibility to the poor, which provides\nsupport for a sound and safe spread of better modes of\nfinancial service delivery that can easily reach the poor\nand upscale the successful models for poor households\nto embrace agricultural commercialization. Soederberg\n(2013) notes that financialization is expanding into areas\nbeyond\ntraditional\nexport\nnation\nas\ninternational\norganizations\nare\npromoting\ninclusiveness in most of the developing nations as a tool\nfor development of agriculture and growth. Most\ndevelopment agencies and banks encourage private\nfinancing\nto\nsupport\ncommercialization (Aitken, 2013). The government of\nUganda, its agencies and private sector have developed\nstrategies to aid the poor improve on agricultural\ncommercialization in both rural and peri urban areas and\nthis has increased incomes for the poor. The World Bank\n(2014) notes the critical areas where governments have\nto focus on lowering credit exposure to the agricultural\nsector and the supply chain and much concentration\nshould be in the geographical disadvantaged areas,\nfinancial infrastructures and inadequate training amongst\nthe smallholder commercial farmers regarding financial\nproducts and services. By lowering transaction cost in the\nagricultural sectors, money transfers and mobile money,\nusers ought to protect farmers against any risks (Jack\nand Suri, 2014). The usage of mobile money services by\nsmallholder farmers is associated with increased farm\nprofits, household income and increased input usage,\nwhich supports agricultural commercialization (Kikulwe et\nal., 2014) .The provision of payments, insurance, credits\nand savings to the financially disadvantaged and poor at\na reasonable cost remain basic to accessing formal\nfinancial services. Agricultural insurance products helps\ncommercial farmers address the constraints affecting\nthem such as limited land for cultivation, inadequate\ninputs for investment and risk associated to production\n(Norton et al., 2014).The agricultural sector globally\nsuffers from inadequate financing, which reduces the\npotential of the agriculturalist in utilizing agricultural\nresources adequately and effectively (Gupta, 2012).\nHouseholds can improve their well-being through\nadditional income from sales of foodstuff for consumption\n(Beaman et al., 2014). Investing in farm inputs will\neventually lead to increase in production sales.\n\n6 J. Econ. Int. Finance", "word_count": 442, "start_char": 23237, "end_char": 26370}
{"chunk_id": "DOC0025__00010", "doc_id": "DOC0025", "chunk_index": 10, "text": "ouseholds can improve their well-being through\nadditional income from sales of foodstuff for consumption\n(Beaman et al., 2014).I\n\nnvesting in farm inputs will\neventually lead to increase in production sales.\n\n6 J.E\n\ncon.I\n\nnt.F\n\ninance\n\nSanfo and Gerard (2012) state that various interventions\ncan mitigate the adverse effects of poor climatic\nconditions. Such initiatives increase access to financial\nservices at household level, and enhance the adaptability\ncapacity,\nwhich\nwould\nimprove\ncommercialization. The rural poor communities have\ninadequate access and insecure access to natural\nresources due to degradation, land fragmentation;\ncontinuous competition for the limited available resources\nand unfavorable government policies, which increase\nincome inequality and financial exclusion among rural\ndwellers (Prato and Longo, 2012). The high demands for\ncollateral by formal financial institutions, high-perceived\nrisks associated lending to farmers and inadequate\ncapacity in developing friendly credit instruments for\nfarmers have led to under capitalization in the agricultural\nsector. Financial credit will be a necessity for smallholder\nfarmers to increase their income and agricultural\nproductivity although they are facing a challenge to\naccess credit due to lack of collateral (World Bank, 2015).\nSubsistence farmers and smallholder farmers if given\nextensive and financial support are most likely to adopt\ncommercialization of agriculture (Rubhara and Mudhara,\n2019). Most clients have stated that high transaction cost\nhas been a major challenge faced by households in\nobtaining credits from formal financial institution such as\nloan applications while evaluating collateral security,\nmonitoring servicing of the loans and these eventually\ndelays farmers which affects the planting periods (Ali et\nal., 2014). Banks assess loan applications for agricultural\ncommercial farmers by taking into consideration the cash\nflow streams and availability of sources of income (ABA,\n2014). The reduction to barriers to formal savings by\noffering free accounts to individuals would decrease the\nshort-term debt and increase ability to comply with the\nconsumption shocks and well-being of the households\n(Kast and Pomeranz, 2014). Subsidization of savings by\nelimination of minimum balances for the customers will\nprovide a temporary interest bonus to increase bank\naccount opening and household income (Schaner, 2015).\nInformal financial services have proved to be costly,\nrestricted farmers in a particular value chain, lack\ndiversity and this affects the processors and traders who\nmay be operating at small scale (FAOAcademic de\nCentro_ America, 2016).\n\nMETHODOLOGY", "word_count": 378, "start_char": 26135, "end_char": 28807}
{"chunk_id": "DOC0025__00011", "doc_id": "DOC0025", "chunk_index": 11, "text": "nformal financial services have proved to be costly,\nrestricted farmers in a particular value chain, lack\ndiversity and this affects the processors and traders who\nmay be operating at small scale (FAOAcademic de\nCentro_ America, 2016).M\n\nETHODOLOGY\n\nThe researchers adopted a comparative study and cross-sectional\nsurvey design. The opinions, trends and attitudes of the participants\nwere collected at one point in time on financial inclusion and\nagricultural commercialization. This study adopted the qualitative\napproach to obtain naturalistic experiences of commercial farmers\nin both Lango and Buganda sub-regions. The study adopted the\nquantitative approaches to obtain quantifiable information on\ncommercial farmers that would easily be analyzed and generalized.\nPrimary and secondary data collection methods were also used in\nthe study. Secondary data were majorly from government and\nprivate institutions reports.", "word_count": 129, "start_char": 28559, "end_char": 29480}
{"chunk_id": "DOC0025__00012", "doc_id": "DOC0025", "chunk_index": 12, "text": "he study adopted the\nquantitative approaches to obtain quantifiable information on\ncommercial farmers that would easily be analyzed and generalized.P\n\nrimary and secondary data collection methods were also used in\nthe study.S\n\necondary data were majorly from government and\nprivate institutions reports.\n\nClose-ended self-administered questionnaires were developed to\nprovide uniformity of measurement. Bird (2009) states that a\nclosed-ended question is easily admissible, easy to code and\nanalyze and therefore produces a complete question that avoids\nirrelevant responses. The instrument was pretested on commercial\nfarmers in some Kayunga district in Buganda sub-region. The\ninstrument indicated a reliability coefficient of (α =.749). This was\nabove 0.7, which is acceptable. Therefore, the instrument used was\ninternally stable. The instrument had 11 items measuring financial\ninclusion, 13 items measuring agricultural commercialization, and\n11 items describing challenges in agricultural commercialization.\nOpen-ended questions were developed and administered to\ncommercial farmers that show excellence in National Agricultural\nand Research Organization (NARO) demonstration projects in\nLango and Buganda sub-regions. This study identified these\nfarmers from district reports, which constituted secondary\ninformation for this study.\nThe study was conducted in the districts of Dokolo, Apac, and\nLira in Lango sub-region while in Buganda sub-region, the study\nwas conducted in the districts of Luwero, Masaka and Wakiso,\nrespectively. The choice of the districts under study was due to the\nfact that the promotion of agricultural commercialization had taken\nshape as a result of the availability of market, land and increase in\nthe number of prominent entrepreneurs engaging in smallholder\nagriculture for commercialization. Agricultural commercialization in\nLango is characteristic of annual crops (millet, maize, simsim,\ngroundnuts, and maize). On the other hand, agricultural\ncommercialization in Buganda is characteristic of perennial crops\n(banana, pineapples, coffee, and sugarcane).\nA target population of 1700 was sought for in the study and 313\nrespondents were considered against the total population of 6320\nfrom which the target was drawn (Uganda Bureau of Statistics\n(UBOS), 2018). The sample size of the respondents was from the\nselected districts which included Dokolo 44, Apac 55 and Lira 60\nfrom Lango sub-region while from Buganda sub-region Luwero 44,\nWakiso 54 and Masaka. 58 districts were considered and it is from\nthese districts where the sample size was determined using Krejcie\nand Morgan 1970 Table. The varying sample size per district was\nbased on the premise that the population size of each district varied\nand the number of smallholder farmers dealing in commercial\nagriculture was also not the same. To identify the right participants,\nthe researchers visited the office of the District Agricultural Officers,\nwho availed lists of potential commercial farmers. Using simple\nrandom sampling procedures, sample sizes proportional to the\ntargeted populations were drawn from each district. Creswell\n(2013) believes that simple random sampling eliminates potential\nselection bias that is likely to occur in the process of selecting\nparticipants. This procedure of sample selection was used because\nthe population appeared finite (Amin, 2005). Numerical data\ncollected through questionnaires were cleaned and validated to\nensure accuracy and consistence. Descriptive, bivariate and\nmutivariate data analysis techniques were applied. Chi square\nprocedure was run to test the hypothesis that financial inclusion\ndoes not affect agricultural commercialization amongst smallholder\nin Lango and Buganda sub-region. Regression analysis was\nadopted\nto\npredict\nthe\nlevel\nof\nin\ncommercialization due to changes in financial inclusion. Verbatim\nstatements from key informants supported quantitative data\nanalysis.", "word_count": 556, "start_char": 29177, "end_char": 33114}
{"chunk_id": "DOC0025__00013", "doc_id": "DOC0025", "chunk_index": 13, "text": "escriptive, bivariate and\nmutivariate data analysis techniques were applied.C\n\nhi square\nprocedure was run to test the hypothesis that financial inclusion\ndoes not affect agricultural commercialization amongst smallholder\nin Lango and Buganda sub-region.R\n\negression analysis was\nadopted\nto\npredict\nthe\nlevel\nof\nin\ncommercialization due to changes in financial inclusion.V\n\nerbatim\nstatements from key informants supported quantitative data\nanalysis.\n\nRESULTS AND DISCUSSION\n\nIn both Lango, and Buganda, most of the participants\nwere male constituting 51.4% and 48.6% were female\nrespectively. In most part of Uganda, productive resource\nlike land is majorly owned by men. Therefore, it comes as\n\nEton et al. 7\n\nTable 1. Correlation test.\n\nVariable list\nOutput\nAgricultural commercialization\n(Lango)\nAgricultural commercialization\n(Buganda)\nFinancial Inclusion\nCorrelation\n0.314\n-0.340\n\np-value\n0.000\n0.003\n\nN\n\n**Correlation is significant at the 0.01 level (2-tailed).", "word_count": 132, "start_char": 32664, "end_char": 33633}
{"chunk_id": "DOC0025__00014", "doc_id": "DOC0025", "chunk_index": 14, "text": "n most part of Uganda, productive resource\nlike land is majorly owned by men.T\n\nherefore, it comes as\n\nEton et al. 7\n\nTable 1.C\n\norrelation test.V\n\nariable list\nOutput\nAgricultural commercialization\n(Lango)\nAgricultural commercialization\n(Buganda)\nFinancial Inclusion\nCorrelation\n0.314\n-0.340\n\np-value\n0.000\n0.003\n\nN\n\n**Correlation is significant at the 0.01 level (2-tailed).\n\nno surprise that men dominate commercial agriculture.\nEven though women might have access to financial\nservices, they lack securities to pledge to financial\nservices providers. The lack of collateral security needed\nby formal financial institutions before extending credit\nsupports Ali et al. (2014). These authors showed that the\nhigh cost of transacting loans affects households from\nobtaining credit, of which women are most affected. In\nterms of age, most of the participants from Lango were of\n35-49 (44.3%) while in Buganda, most of the participants\nwere of age 18–34 (45.2%). The difference in\nparticipation according to age suggests differences in\nland tenure systems. In Lango, land is communally\nowned. Therefore, the adults and the old are likely to own\nland. In Buganda, land is freehold and highly inheritable,\nwhich has seen young people owning large chunks of\nland. Though ownership of land may not imply\nparticipation in commercial agriculture, those with land\nhave high chances of engaging in commercial agriculture.\nIn both Lango and Buganda, most of the participants had\nattained a university degree constituting 34.4% and\n39.7% respectively. In the past, participation in agriculture\nwas an activity left to the rural poor and uneducated. With\nthe increasing number of university graduates that are\nunemployed, many are turning to commercial agriculture\nas a source of employment. The educated are likely to\ntransfer knowledge, and adopt improved technologies\neasily than the less educated. Secondly, the educated\nare likely to exploit the increasing opportunities of access\nto financial services than the less educated. In both\nLango and Buganda, most of the participants used\nmobile money services between 5 to 9 times a week\nconstituting 38.8% and 50.7% respectively. Though\nparticipants do not use mobile money services for\ncommercializing agricultural practices, the mere fact that\nthe service is available enhances commercial agriculture.\nThis coincides with the findings on financial services\ncommonly used by commercial farmers. In both Lango\nand Buganda, mobile money constituting 66.1% and\n80.8% were the most used financial services. Commercial\nagriculture is commonly practiced in rural area where\nmobile money services are more common than other\nfinancial services. Though village banking might be\naccessible in rural areas, they are not attractive to\neducated farmers. Food crop constitute agricultural\ncommercialization in Lango and Buganda, constituting\n(66.1%) and 54.8% respectively. In Uganda, there is a\nthin line between food crops and cash crops since almost\nall food crops are marketable. Secondly, it is cheaper to\ncultivate food crops on small farmland than cash crops.", "word_count": 464, "start_char": 33257, "end_char": 36349}
{"chunk_id": "DOC0025__00015", "doc_id": "DOC0025", "chunk_index": 15, "text": "ood crop constitute agricultural\ncommercialization in Lango and Buganda, constituting\n(66.1%) and 54.8% respectively.I\n\nn Uganda, there is a\nthin line between food crops and cash crops since almost\nall food crops are marketable.S\n\necondly, it is cheaper to\ncultivate food crops on small farmland than cash crops.\n\nThe relationships between financial inclusion and\nagricultural commercialization amongst smallholder\nfarmers in Lango and Buganda sub-regions\n\nThe study employed a correlation test to establish the\nrelationship between financial inclusion and agricultural\nfarmers.\nCorrelation coefficient ranges from zero (no relationship)\nto one (perfect relationship). Correlation coefficients very\nclose to zero indicate weak relationships while those very\nclose to one indicate very strong relationships. Positive\ncorrelation coefficients indicate that the two variables\nchange in the same direction while negative correlation\ncoefficients indicate that the two variables change in\nopposite directions. The findings are based on a\nresponse rate of 81.8% (256 out of 313) (Table 1).\nIn Lango, the relationship between financial inclusion\nand agricultural commercialization (r =0.314; p-value\n=0.000) was weak. The statistics imply government‟s\neffort to promote financial inclusion is associated to a\nweak change to commercialization. However, the p-value\nshows\nthat\nand\nare\nlinearly\nrelated\nwith\n99%\nconfidence. In Buganda, the relationship between\nfinancial inclusion and agricultural commercialization\namongst small holder famers (r =-0.340; p-value =0.003)\nwas weak and negative. The statistics imply that an effort\nby government to promote financial access is associated\nwith a reduction in commercialization in Buganda.\nHowever, the p-value shows that financial inclusion and\nagricultural commercialization in Buganda are linearly\nrelated with 99% confidence. The findings support The\nWorld Bank (2014), which recommends that governments\nshould\nfocus\non\nlowering\ncredit\nexposure\nto\ngeographically disadvantaged areas where commercial\nfarmers have inadequate training in financial products\nand services. The report suggests that commercial\nfarmers are not educated enough on financial products to\ntake advantage of them. In Uganda, not all commercial\nfarmers have enough information on agricultural financing\n\n8 J. Econ. Int. Finance\n\nTable 2. Regression coefficients.\n\nModel summary\nLango\nR\n0.314(a)\n-0.340(a)\nR square\n0.099\n0.115\nAdjusted R square\n0.094\n0.103\nStd. error of the estimate\n6.8653\n8.42049\n\naPredictors: (Constant), Financial Inclusion, bDependent Variable: Agricultural Commercialization", "word_count": 359, "start_char": 36037, "end_char": 38645}
{"chunk_id": "DOC0025__00016", "doc_id": "DOC0025", "chunk_index": 16, "text": "n Uganda, not all commercial\nfarmers have enough information on agricultural financing\n\n8 J.E\n\ncon.I\n\nnt.F\n\ninance\n\nTable 2.R\n\negression coefficients.M\n\nodel summary\nLango\nR\n0.314(a)\n-0.340(a)\nR square\n0.099\n0.115\nAdjusted R square\n0.094\n0.103\nStd. error of the estimate\n6.8653\n8.42049\n\naPredictors: (Constant), Financial Inclusion, bDependent Variable: Agricultural Commercialization\n\nin commercial banks, except in Buganda, where the\npractice is gradually penetrating among the educated.\nHowever, the experience seems to disagree with\n(Kikulwe et al., 2014) who established that using mobile\nmoney services is associated with increased farm profits,\nhousehold income, and input usage. These related\nbenefits of financial inclusion to agriculture take shape in\nan environment that has less barriers to agricultural\nproduction than financial access. Otherwise, this study\nshows that a number of factors limit agricultural\ncommercialization beyond finances. The present findings\ndisagree with Norton et al. (2014) who draw findings from\ndeveloped economics regarding agricultural insurance. In\nUganda, very few commercial farmers have insured their\nfarms against natural factors. One key informant\nobserved:\n\n“...our effort to take a living out of agriculture is very\nconstrained...the loans are available but tagged with\nexorbitant\ninterest\nrates...this\ncoupled\nwith\nthe\nunpredictable weather may lead to complete losses at\ntimes...”\nThe\nstudy\nobserves\nthat\ncommercialization in Uganda is growing under tides of\nnature and the volatile economy. When the season is\nbumper, prices drop drastically making it difficult to repay\nagricultural loans. When weather conditions threaten crop\nperformance, the loss is severe that repaying agricultural\nloans is very difficult.\n\nThe role of financial inclusion in supporting\nagricultural commercialization amongst smallholder\nfarmer’s in Lango and Buganda sub-regions", "word_count": 266, "start_char": 38261, "end_char": 40167}
{"chunk_id": "DOC0025__00017", "doc_id": "DOC0025", "chunk_index": 17, "text": "hen the season is\nbumper, prices drop drastically making it difficult to repay\nagricultural loans.W\n\nhen weather conditions threaten crop\nperformance, the loss is severe that repaying agricultural\nloans is very difficult.T\n\nhe role of financial inclusion in supporting\nagricultural commercialization amongst smallholder\nfarmer’s in Lango and Buganda sub-regions\n\nTo assess the role that financial inclusion plays in\nsupporting\nsmallholder farmers in Lango and Buganda sub-regions,\nthe study adopted regression analysis. Regression is a\nmathematical relationship between the independent and\ndependent variables. The model uses R Square to assess\nthe variation in the dependent variable accountable to the\nindependent variable (Table 2).\nFinancial inclusion explains only 10% (R Square\n=0.099) of the variation of agricultural commercialization\nin Lango. In Buganda, financial inclusion explains only\n11.5% (R Square =0.115) of the variation of agricultural\ncommercialization. The statistics imply absence of\nsignificant differences in the effect of financial inclusion\non agricultural commercialization amongst small holder\nfamers in the two sub-regions. Secondly, the effect of\nfinancial inclusion on agricultural commercialization\namongst small holder farmers is low, which suggests the\ninterplay of other factors in both regions. It should be\nnoted that though the effects of financial inclusion appear\nto be low in both communities, financial inclusion\nincreases agricultural commercialization in Lango and\ndecreases in Buganda. These findings seem to agree\nwith Rubhara and Mudhara (2019) who established that\nsubsistence farmers are likely to adopt commercial\nagriculture if given financial support. While it is true that\ninadequate financial support is one limiting factor to\ncommercial agriculture amongst small holder farmers, it\nis just a microcosm to the many barriers to agriculture\ndevelopment in Uganda. The findings further support\nPrato and Longo (2012) who identified inadequate and\ninsecure access to natural resources as responsible for\nthe increasing income inequality and financial exclusion\namong rural dwellers. Not to suggest that commercialized\nagriculture is an activity of the rural poor, financial\nexclusion affects mostly the poor.\nThe negative\nrelationship between financial inclusion and agricultural\nin\nBuganda supports FAOAcademic de Centro-America\n(2016) who observed that informal financial services tend\nto be costly, lack diversity, and affects borrowers on small\nscale. The costs associated with transacting credit tend\nto inch on the profits commercial farmers are likely to get.\nHowever, whether informal or formal financial services,\naccessing credit in Uganda is still costly, especially\namong the low-income earners.\n\nFactors\nhindering\nthe\ngrowth\nof\ncommercialization amongst smallholder farmers in\nLango and Buganda sub-regions\n\nTo\nassess\nthe\nfactors\naffecting\ncommercialization amongst the smallholder farmers, the\nstudy subjected descriptive measures on a set of factors\ndrawn from the Ugandan environment. The study used\n„arithmetic mean‟ to show where participants‟ views\nclustered mostly, and „standard deviation‟ to show where\n\nEton et al. 9", "word_count": 450, "start_char": 39806, "end_char": 42996}
{"chunk_id": "DOC0025__00018", "doc_id": "DOC0025", "chunk_index": 18, "text": "he study used\n„arithmetic mean‟ to show where participants‟ views\nclustered mostly, and „standard deviation‟ to show where\n\nEton et al. 9\n\nTable 3. Factors affecting agricultural commercialization.\n\nVariable List\nLango, N = 183\nBuganda, N = 73\nMean\nStd.\nMean\nStd.\nExpensive equipment\n4.5\n0.718\n4.44\n0.957\nWeather changes\n4.19\n0.851\n4.41\n0.955\nDroughts\n3.85\n1.042\n3.84\n1.269\nFloods\n3.9\n1.003\n3.82\n1.358\nPests and diseases\n4.45\n0.738\n4.36\n0.903\nInadequate financing for long-term growth\n4.27\n0.75\n4.41\n0.879\nLimited farmland\n3.97\n1.141\n3.79\n1.354\nInadequate technology\n4.27\n0.755\n4.15\n0.923\nInability to access capital\n4.04\n0.997\n4.23\n0.993\nInability to invest in modern inputs\n4.11\n0.811\n4.11\n1.061\nFluctuating prices\n4.31\n0.918\n4.48\n0.818\nInefficient marketing institutions\n3.73\n1.186\n3.85\n1.232\nPoor infrastructure\n3.97\n1.266\n3.81\n1.478\n\nSource: Field data (2020).", "word_count": 133, "start_char": 42859, "end_char": 43724}
{"chunk_id": "DOC0025__00019", "doc_id": "DOC0025", "chunk_index": 19, "text": "participants‟ opinions deviated mostly (Table 3). These\nscores were computed from a 5-point likert scale.\nIn Lango, the high mean scores point to expensive\nequipment (mean = 4.5; Std. =0.718), pests and diseases\n(mean = 4.45; Std. =0.738), and fluctuating prices (mean\n= 4.31; Std. =0.918) as key among the limiting factors to\nagricultural commercialization. In Buganda, high mean\nscores point to fluctuating prices (mean = 4.48; Std.\n=0.818), expensive equipment (mean = 4.44; Std.\n=0.957), weather changes (mean = 4.41; Std. =0.955),\nand inadequate financing for long-term growth (mean =\n4.41; Std. =0.878) as key among the limiting factors to\ncommercialization.\nThe\nfactors\nlimiting\nagricultural commercialization in both communities,\nbased on mean scores are expensive equipment, and\nfluctuating prices. While the mean scores do not reveal\nunique\npatterns\nof\nconcentration\nof\nopinions,\na\ncomparison of standard deviations shows fluctuating\nprices as the most important factor limiting agricultural\nin\nboth\ncommunities.\nIn\nboth\ncommunities, standard deviations indicate that poor\ninfrastructure is not a worrying problem to agricultural\ncommercialization. The findings seem to disagree with\nIPCC (2012) and Tambi (2018) who argued that climatic\nchange has the greatest effect on agricultural production.\nClimatic\naffects\nproductivity\ncontextually. For instance, farmers who cultivate in\nwetlands are least likely to be affected by climatic\nchanges since wetlands do not dry completely. Similarly,\nfarmers in mountainous areas are least likely to be hit by\nclimatic changes, especially those that are situated on\nthe windward side of the mountain. The findings in\nBuganda region agree with Levine (2005) and Shiferaw\net al. (2015) who relate agricultural productivity to access\nto credit. Buganda region is near Uganda‟s capital city,\nKampala, where financial services are easily available.\nHowever, there are isolated pockets of commercial\nagriculture in Luwero and Masaka, which are known for\npineapples, and coffee production respectively. Wakiso\nfor example is a city suburb with very small pockets of\ncommercial agriculture on limited farmland. Therefore,\naccess to finance in this region is negatively associated\nto agricultural commercialization.\n\nHypothesis\ntesting\non\nand\nagricultural commercialization", "word_count": 336, "start_char": 43724, "end_char": 46037}
{"chunk_id": "DOC0025__00020", "doc_id": "DOC0025", "chunk_index": 20, "text": "owever, there are isolated pockets of commercial\nagriculture in Luwero and Masaka, which are known for\npineapples, and coffee production respectively.W\n\nakiso\nfor example is a city suburb with very small pockets of\ncommercial agriculture on limited farmland.T\n\nherefore,\naccess to finance in this region is negatively associated\nto agricultural commercialization.H\n\nypothesis\ntesting\non\nand\nagricultural commercialization\n\nThe study adopted Chi-Square results under cross\ntabulation procedure to test whether financial inclusion\nand agricultural commercialization are independent. As a\nguide to interpretation, an asymptotic significant value\n(Asymp. Sig. <0.05) indicates that the variables are\nrelated while Asympt. Sig. >0.05 indicates that the\nvariables are independent (Table 4).\nIn Lango, Asympt. Sig. <0.05, therefore rejecting the\nnull hypothesis, which indicates that financial inclusion\nand\nare\nrelated.\nIn\nBuganda, Asympt. Sig. <0.05, which also leads to the\nrejection of the null hypothesis, indicating that financial\ninclusion and agricultural commercialization are related.\nBased on the asymptotic significant values of the cross\ntabulation,\nand\ncommercialization are related in both Lango and\nBuganda. The study rejected the null hypothesis that\ndoes\nnot\ncommercialization amongst smallholder farmers in both\nLango and Buganda sub-regions; and accepted the\nalternative hypothesis that financial inclusion affects\nagricultural commercialization amongst small holder\n\n10 J. Econ. Int. Finance\n\nTable 4. Chi-Square results.\n\nLango\nAsymp. Sig. (2-sided)\nAsymp. Sig. (2-sided)\nPearson Chi-square\n0.000\n0.000\nLikelihood ratio\n0.774\n1.000\nLinear-by-linear association\n0.000\n0.003\nNumber of valid cases\n\nThe study set HO: = Null hypothesis, and HA: = Alternative hypothesis. HO: Financial inclusion does not affect agricultural\ncommercialization amongst smallholder farmers in Lango and Buganda sub-regions; HA: Financial inclusion affects agricultural\ncommercialization amongst smallholder‟s farmers in Lango and Buganda sub-regions.\nSource: Field data (2020)\n\nfarmers in both Lango and Buganda sub-regions. The\nstudy is likely to obtain the same conclusion from over\n95% of the sampled objects. Notwithstanding, directional\nmeasures indicate that financial inclusion positively\naffects agricultural commercialization in Lango, and not in\nBuganda.\n\nCONCLUSION AND POLICY IMPLICATIONS", "word_count": 322, "start_char": 45616, "end_char": 48007}
{"chunk_id": "DOC0025__00021", "doc_id": "DOC0025", "chunk_index": 21, "text": "ource: Field data (2020)\n\nfarmers in both Lango and Buganda sub-regions.T\n\nhe\nstudy is likely to obtain the same conclusion from over\n95% of the sampled objects.N\n\notwithstanding, directional\nmeasures indicate that financial inclusion positively\naffects agricultural commercialization in Lango, and not in\nBuganda.C\n\nONCLUSION AND POLICY IMPLICATIONS\n\nAgricultural commercialization is one step forward to\npoverty alleviation in a developing country like Uganda\nbut its success will persistently lean on a set of economic\nand natural variables. This study has identified financial\ninclusion as one variable that can predict the success of\nfarmers, though it varies from one region to another. In\nLango, government has a positive effect on financial\ninclusion in agricultural commercialization; while in\nBuganda, it is a negative factor. In Lango, land is\ncommunal and therefore smallholder farmers need to\naccess finances to purchase or rent land for commercial\nfarming. In Buganda, however, land is freehold, which\nmakes smallholder farmers to inherit chunks of land from\ntheir parents. They need financial assistance to boost\nproductivity than acquiring land. Nevertheless, these are\nrelative positions in both Lango and Buganda because\nthe overall input of financial access to agricultural\ncommercialization is generally low. Of course, in Lango,\nfarmers do not have collateral security to pledge before\nfinancial service providers while in Buganda, especially in\nWakiso, land is expensive for commercial farming due to\nrapid urbanization. The study has established some\ncommon factors that limit agricultural commercialization\namongst smallholder farmers in both Lango and Buganda\nthat is expensive equipment and fluctuating prices while\npoor infrastructure is no longer a big worry. The existence\nof these factors and some shadows in financial access\ngave a strong ground to reject the null hypothesis that\naccess\ndoes\nnot\ncommercialization amongst smallholder farmers in both\nLango\nand\nsub-regions.\nWe\ntherefore\nrecommend that, financial service providers should\ncontinue revising their lending terms downwards to reach\nsmallholder farmers, many of whom lack collateral\nsecurity to pledge for credit. While the government takes\ncredit for improving infrastructure, government, through\nher policy organs like Ministry of Agriculture, should\nprovide buffer prices against price fluctuations. This study\ncontributes a unique relationship between financial\ninclusion and agricultural commercialization amongst\nsmallholder farmers by drawing from a plethora of a\ncomparative analysis. Future researchers should consider\nexamining how price fluctuation could be handled to\nsupport smallholder farmers to increase productivity.\n\nCONFLICT OF INTERESTS\n\nThe authors have not declared any conflict of interests.", "word_count": 400, "start_char": 47657, "end_char": 50464}
