{"chunk_id": "DOC0043__00000", "doc_id": "DOC0043", "chunk_index": 0, "text": "MATH 221\nFIRST SEMESTER\nCALCULUS\nfall 2009\nTypeset:June 8, 2010\n\nMATH 221 – 1st SEMESTER CALCULUS\nLECTURE NOTES VERSION 2.0 (fall 2009)\nThis is a self contained set of lecture notes for Math 221. The notes were written by Sigurd Angenent, starting\nfrom an extensive collection of notes and problems compiled by Joel Robbin. The LATEX and Python files\nwhich were used to produce these notes are available at the following web site\nhttp://www.math.wisc.edu/~angenent/Free-Lecture-Notes\nThey are meant to be freely available in the sense that “free software” is free. More precisely:\nCopyright (c) 2006 Sigurd B. Angenent. Permission is granted to copy, distribute and/or\nmodify this document under the terms of the GNU Free Documentation License, Version\n1.2 or any later version published by the Free Software Foundation; with no Invariant\nSections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license is\nincluded in the section entitled ”GNU Free Documentation License”.", "word_count": 154, "start_char": 0, "end_char": 987}
{"chunk_id": "DOC0043__00001", "doc_id": "DOC0043", "chunk_index": 1, "text": "ngenent.P\n\nermission is granted to copy, distribute and/or\nmodify this document under the terms of the GNU Free Documentation License, Version\n1.2 or any later version published by the Free Software Foundation; with no Invariant\nSections, no Front-Cover Texts, and no Back-Cover Texts.A\n\ncopy of the license is\nincluded in the section entitled ”GNU Free Documentation License”.\n\nContents\nChapter 1.\nNumbers and Functions\n1.\nWhat is a number?\n2.\n3.\nFunctions\n4.\nInverse functions and Implicit functions\n5.\nChapter 2.\nDerivatives (1)\n1.\nThe tangent to a curve\n2.\nAn example – tangent to a parabola\n3.\nInstantaneous velocity\n4.\nRates of change\n5.\nExamples of rates of change\n6.\nChapter 3.\nLimits and Continuous Functions\n1.\nInformal definition of limits\n2.\nThe formal, authoritative, definition of limit\n3.\n4.\nVariations on the limit theme\n5.\nProperties of the Limit\n6.\nExamples of limit computations\n7.\nWhen limits fail to exist\n8.\nWhat’s in a name?\n9.\nLimits and Inequalities\n10.\nContinuity\n11.\nSubstitution in Limits\n12.\n13.\nTwo Limits in Trigonometry\n14.\nChapter 4.\nDerivatives (2)\n1.\nDerivatives Defined\n2.\nDirect computation of derivatives\n3.\nDifferentiable implies Continuous\n4.\nSome non-differentiable functions\n5.\n6.\nThe Differentiation Rules\n7.\nDifferentiating powers of functions\n8.\n9.\nHigher Derivatives\n10.\n11.\nDifferentiating Trigonometric functions\n12.\n13.\nThe Chain Rule\n14.\n15.\nImplicit differentiation\n16.\nChapter 5.\nGraph Sketching and Max-Min Problems\n1.\nTangent and Normal lines to a graph\n2.\nThe Intermediate Value Theorem\n3.\n4.\nFinding sign changes of a function\n5.\nIncreasing and decreasing functions\n6.\nExamples\n7.\nMaxima and Minima\n8.\nMust there always be a maximum?\n9.\nExamples – functions with and without maxima or\nminima\n10.\nGeneral method for sketching the graph of a\n11.\nConvexity, Concavity and the Second Derivative\n12.\nProofs of some of the theorems\n13.\n14.\nOptimization Problems\n15.\nChapter 6.\nExponentials and Logarithms (naturally)\n1.\nExponents\n2.\nLogarithms\n3.\nProperties of logarithms\n4.\nGraphs of exponential functions and logarithms\n5.\nThe derivative of ax and the definition of e\n6.\nDerivatives of Logarithms\n7.\nLimits involving exponentials and logarithms\n8.\nExponential growth and decay\n9.\nChapter 7.\nThe Integral\n1.\nArea under a Graph\n2.\nWhen f changes its sign\n3.\nThe Fundamental Theorem of Calculus\n4.\n5.\nThe indefinite integral\n6.\nProperties of the Integral\n7.\nThe definite integral as a function of its integration\nbounds\n8.\nMethod of substitution\n9.\nChapter 8.\nApplications of the integral\n1.\nAreas between graphs\n2.\n3.\nCavalieri’s principle and volumes of solids\n4.\nExamples of volumes of solids of revolution\n5.\nVolumes by cylindrical shells\n6.\n7.\nDistance from velocity, velocity from acceleration 113\n8.\nThe length of a curve\n9.\nExamples of length computations\n10.\n11.\nWork done by a force\n12.\nWork done by an electric current\nChapter 9.\nAnswers and Hints\nGNU Free Documentation License", "word_count": 474, "start_char": 610, "end_char": 3548}
{"chunk_id": "DOC0043__00002", "doc_id": "DOC0043", "chunk_index": 2, "text": "xamples of volumes of solids of revolution\n5.V\n\nolumes by cylindrical shells\n6.\n7.D\n\nistance from velocity, velocity from acceleration 113\n8.T\n\nhe length of a curve\n9.E\n\nxamples of length computations\n10.\n11.W\n\nork done by a force\n12.W\n\nork done by an electric current\nChapter 9.A\n\nnswers and Hints\nGNU Free Documentation License\n\n1. APPLICABILITY AND DEFINITIONS\n2. VERBATIM COPYING\n3. COPYING IN QUANTITY\n4. MODIFICATIONS\n5. COMBINING DOCUMENTS\n6. COLLECTIONS OF DOCUMENTS\n7. AGGREGATION WITH INDEPENDENT WORKS 126\n8. TRANSLATION\n9. TERMINATION\n10. FUTURE REVISIONS OF THIS LICENSE\n11. RELICENSING", "word_count": 93, "start_char": 3219, "end_char": 3818}
{"chunk_id": "DOC0043__00003", "doc_id": "DOC0043", "chunk_index": 3, "text": "PPLICABILITY AND DEFINITIONS\n2.V\n\nERBATIM COPYING\n3.C\n\nOPYING IN QUANTITY\n4.M\n\nODIFICATIONS\n5.C\n\nOMBINING DOCUMENTS\n6.C\n\nOLLECTIONS OF DOCUMENTS\n7.A\n\nGGREGATION WITH INDEPENDENT WORKS 126\n8.T\n\nRANSLATION\n9.T\n\nERMINATION\n10.F\n\nUTURE REVISIONS OF THIS LICENSE\n11.R\n\nELICENSING\n\nCHAPTER 1\nNumbers and Functions\nThe subject of this course is “functions of one real variable” so we begin by wondering what a real number\n“really” is, and then, in the next section, what a function is.\n1. What is a number?\n1.1. Different kinds of numbers. The simplest numbers are the positive integers\n1, 2, 3, 4, · · ·\nthe number zero\n0,\nand the negative integers\n· · · , −4, −3, −2, −1.\nTogether these form the integers or “whole numbers.”\nNext, there are the numbers you get by dividing one whole number by another (nonzero) whole number.\nThese are the so called fractions or rational numbers such as\n2, 1\n3, 2\n3, 1\n4, 2\n4, 3\n4, 4\n3, · · ·\nor\n−1\n2, −1\n3, −2\n3, −1\n4, −2\n4, −3\n4, −4\n3, · · ·\nBy definition, any whole number is a rational number (in particular zero is a rational number.)\nYou can add, subtract, multiply and divide any pair of rational numbers and the result will again be a\nrational number (provided you don’t try to divide by zero).\nOne day in middle school you were told that there are other numbers besides the rational numbers, and\nthe first example of such a number is the square root of two. It has been known ever since the time of the\ngreeks that no rational number exists whose square is exactly 2, i.e. you can’t find a fraction m\nn such that\n\u0000m\nn\n\u00012 = 2, i.e. m2 = 2n2.\nx\nx2\n1.2\n1.44\n1.3\n1.69\n1.4\n1.96 < 2\n1.5\n2.25 > 2\n1.6\n2.56\nNevertheless, if you compute x2 for some values of x between 1 and 2, and check if you\nget more or less than 2, then it looks like there should be some number x between 1.4 and\n1.5 whose square is exactly 2. So, we assume that there is such a number, and we call it\nthe square root of 2, written as\n√\n2. This raises several questions. How do we know there\nreally is a number between 1.4 and 1.5 for which x2 = 2? How many other such numbers\nare we going to assume into existence? Do these new numbers obey the same algebra rules\n(like a + b = b + a) as the rational numbers? If we knew precisely what these numbers (like\n√\n2) were then we could perhaps answer such questions. It turns out to be rather difficult to give a precise\ndescription of what a number is, and in this course we won’t try to get anywhere near the bottom of this\nissue. Instead we will think of numbers as “infinite decimal expansions” as follows.\nOne can represent certain fractions as decimal fractions, e.g.\n25 = 1116\n100 = 11.16.", "word_count": 514, "start_char": 3544, "end_char": 6185}
{"chunk_id": "DOC0043__00004", "doc_id": "DOC0043", "chunk_index": 4, "text": "t turns out to be rather difficult to give a precise\ndescription of what a number is, and in this course we won’t try to get anywhere near the bottom of this\nissue.I\n\nnstead we will think of numbers as “infinite decimal expansions” as follows.O\n\nne can represent certain fractions as decimal fractions, e.g.\n25 = 1116\n100 = 11.16.\n\nNot all fractions can be represented as decimal fractions. For instance, expanding 1\n3 into a decimal fraction\nleads to an unending decimal fraction\n3 = 0.333 333 333 333 333 · · ·\nIt is impossible to write the complete decimal expansion of 1\n3 because it contains infinitely many digits.\nBut we can describe the expansion: each digit is a three. An electronic calculator, which always represents\nnumbers as finite decimal numbers, can never hold the number 1\n3 exactly.\nEvery fraction can be written as a decimal fraction which may or may not be finite. If the decimal\nexpansion doesn’t end, then it must repeat. For instance,\n7 = 0.142857 142857 142857 142857 . . .\nConversely, any infinite repeating decimal expansion represents a rational number.\nA real number is specified by a possibly unending decimal expansion. For instance,\n√\n2 = 1.414 213 562 373 095 048 801 688 724 209 698 078 569 671 875 376 9 . . .\nOf course you can never write all the digits in the decimal expansion, so you only write the first few digits\nand hide the others behind dots. To give a precise description of a real number (such as\n√\n2) you have to\nexplain how you could in principle compute as many digits in the expansion as you would like. During the\nnext three semesters of calculus we will not go into the details of how this should be done.\n1.2. A reason to believe in\n√\n2. The Pythagorean theorem says that the hypotenuse of a right triangle with sides 1 and 1 must be a line segment of length\n√\n2. In\nmiddle or high school you learned something similar to the following geometric construction\nof a line segment whose length is\n√\n2. Take a square with side of length 1, and construct\na new square one of whose sides is the diagonal of the first square. The figure you get\nconsists of 5 triangles of equal area and by counting triangles you see that the larger\nsquare has exactly twice the area of the smaller square. Therefore the diagonal of the smaller square, being\nthe side of the larger square, is\n√\n2 as long as the side of the smaller square.\nWhy are real numbers called real? All the numbers we will use in this first semester of calculus are\n“real numbers.” At some point (in 2nd semester calculus) it becomes useful to assume that there is a number\nwhose square is −1. No real number has this property since the square of any real number is positive, so\nit was decided to call this new imagined number “imaginary” and to refer to the numbers we already have\n(rationals,\n√\n2-like things) as “real.”\n1.3. The real number line and intervals. It is customary to visualize the real numbers as points\non a straight line. We imagine a line, and choose one point on this line, which we call the origin. We also\ndecide which direction we call “left” and hence which we call “right.” Some draw the number line vertically\nand use the words “up” and “down.”\nTo plot any real number x one marks offa distance x from the origin, to the right (up) if x > 0, to the\nleft (down) if x < 0.\nThe distance along the number line between two numbers x and y is |x −y|. In particular, the\ndistance is never a negative number.\n−3\n−2\n−1\nFigure 1. To draw the half open interval [−1, 2) use a filled dot to mark the endpoint which is included\nand an open dot for an excluded endpoint.", "word_count": 674, "start_char": 5855, "end_char": 9442}
{"chunk_id": "DOC0043__00005", "doc_id": "DOC0043", "chunk_index": 5, "text": "he distance along the number line between two numbers x and y is |x −y|.I\n\nn particular, the\ndistance is never a negative number.\n−3\n−2\n−1\nFigure 1.T\n\no draw the half open interval [−1, 2) use a filled dot to mark the endpoint which is included\nand an open dot for an excluded endpoint.\n\n−2\n−1\n√\nFigure 2. To find\n√\n2 on the real line you draw a square of sides 1 and drop the diagonal onto the real line.\nAlmost every equation involving variables x, y, etc. we write down in this course will be true for some\nvalues of x but not for others. In modern abstract mathematics a collection of real numbers (or any other\nkind of mathematical objects) is called a set. Below are some examples of sets of real numbers. We will use\nthe notation from these examples throughout this course.\nThe collection of all real numbers between two given real numbers form an interval. The following\nnotation is used\n• (a, b) is the set of all real numbers x which satisfy a < x < b.\n• [a, b) is the set of all real numbers x which satisfy a ≤x < b.\n• (a, b] is the set of all real numbers x which satisfy a < x ≤b.\n• [a, b] is the set of all real numbers x which satisfy a ≤x ≤b.\nIf the endpoint is not included then it may be ∞or −∞. E.g. (−∞, 2] is the interval of all real numbers\n(both positive and negative) which are ≤2.\n1.4. Set notation. A common way of describing a set is to say it is the collection of all real numbers\nwhich satisfy a certain condition. One uses this notation\nA =\n\b\nx | x satisfies this or that condition\n\nMost of the time we will use upper case letters in a calligraphic font to denote sets. (A,B,C,D, . . . )\nFor instance, the interval (a, b) can be described as\n(a, b) =\n\b\nx | a < x < b\n\nThe set\nB =\n\b\nx | x2 −1 > 0", "word_count": 361, "start_char": 9156, "end_char": 10882}
{"chunk_id": "DOC0043__00006", "doc_id": "DOC0043", "chunk_index": 6, "text": "consists of all real numbers x for which x2 −1 > 0, i.e. it consists of all real numbers x for which either x > 1\nor x < −1 holds. This set consists of two parts: the interval (−∞, −1) and the interval (1, ∞).\nYou can try to draw a set of real numbers by drawing the number line and coloring the points belonging\nto that set red, or by marking them in some other way.\nSome sets can be very difficult to draw. For instance,\nC =\n\b\nx | x is a rational number\n\ncan’t be accurately drawn. In this course we will try to avoid such sets.\nSets can also contain just a few numbers, like\nD = {1, 2, 3}\nwhich is the set containing the numbers one, two and three. Or the set\nE =\n\b\nx | x3 −4x2 + 1 = 0\n\nwhich consists of the solutions of the equation x3 −4x2 + 1 = 0. (There are three of them, but it is not easy\nto give a formula for the solutions.)\nIf A and B are two sets then the union of A and B is the set which contains all numbers that belong\neither to A or to B. The following notation is used\nA ∪B =\n\b\nx | x belongs to A or to B or both.\n\nSimilarly, the intersection of two sets A and B is the set of numbers which belong to both sets. This\nnotation is used:\nA ∩B =\n\b\nx | x belongs to both A and B.\n\n2. Exercises\n1. What is the 2007th digit after the period in the expansion of 1\n7?\n2. Which of the following fractions have finite decimal\nexpansions?\na = 2\n3,\nb = 3\n25,\nc = 276937\n15625 .\n3. Draw the following sets of real numbers. Each of these\nsets is the union of one or more intervals. Find those\nintervals. Which of thee sets are finite?\nA =\n\b\nx | x2 −3x + 2 ≤0\n\nB =\n\b\nx | x2 −3x + 2 ≥0\n\nC =\n\b\nx | x2 −3x > 3\n\nD =\n\b\nx | x2 −5 > 2x\n\nE =\n\b\nt | t2 −3t + 2 ≤0\n\nF =\n\b\nα | α2 −3α + 2 ≥0\n\nG = (0, 1) ∪(5, 7]\nH =\n\u0000{1} ∪{2, 3}\n\u0001\n∩(0, 2\n√\n2)\nQ =\n\b\nθ | sin θ = 1\n\nR =\n\b\nφ | cos φ > 0", "word_count": 428, "start_char": 10882, "end_char": 12657}
{"chunk_id": "DOC0043__00007", "doc_id": "DOC0043", "chunk_index": 7, "text": "4. Suppose A and B are intervals. Is it always true that\nA ∩B is an interval? How about A ∪B?\n5. Consider the sets\nM =\n\b\nx | x > 0\n\nand N =\n\b\ny | y > 0\n\n.\nAre these sets the same?\n6. Group Problem.\nWrite the numbers\nx = 0.3131313131 . . . ,\ny = 0.273273273273 . . .\nand z = 0.21541541541541541 . . .\nas fractions (i.e. write them as m\nn , specifying m and n.)\n(Hint: show that 100x = x + 31. A similar trick\nworks for y, but z is a little harder.)\n7. Group Problem.\nIs the number whose decimal expansion after the\nperiod consists only of nines, i.e.\nx = 0.99999999999999999 . . .\nan integer?\n3. Functions\nWherein we meet the main characters of this semester\n3.1. Definition. To specify a function f you must\n(1) give a rule which tells you how to compute the value f(x) of the function for a given real number\nx, and:\n(2) say for which real numbers x the rule may be applied.\nThe set of numbers for which a function is defined is called its domain. The set of all possible numbers f(x)\nas x runs over the domain is called the range of the function. The rule must be unambiguous: the same\nxmust always lead to the same f(x).\nFor instance, one can define a function f by putting f(x) = √x for all x ≥0. Here the rule defining f is\n“take the square root of whatever number you’re given”, and the function f will accept all nonnegative real\nnumbers.\nThe rule which specifies a function can come in many different forms. Most often it is a formula, as in\nthe square root example of the previous paragraph. Sometimes you need a few formulas, as in\ng(x) =\n(\n2x\nx2\nfor x ≥0\ndomain of g = all real numbers.\nFunctions which are defined by different formulas on different intervals are sometimes called piecewise\ndefined functions.\n3.2. Graphing a function. You get the graph of a function f by drawing all points whose coordinates are (x, y) where x must be in the domain of f and y = f(x).", "word_count": 378, "start_char": 12657, "end_char": 14537}
{"chunk_id": "DOC0043__00008", "doc_id": "DOC0043", "chunk_index": 8, "text": "unctions which are defined by different formulas on different intervals are sometimes called piecewise\ndefined functions.\n3.2.G\n\nraphing a function.Y\n\nou get the graph of a function f by drawing all points whose coordinates are (x, y) where x must be in the domain of f and y = f(x).\n\nrange of f\n(x, f(x))\nx\ndomain of f\nFigure 3. The graph of a function f. The domain of f consists of all x values at which the function is\ndefined, and the range consists of all possible values f can have.\nP0\nP1\ny1 −y0\nx1 −x0\nx0\nx1\ny0\ny1\nn\nm\nFigure 4. A straight line and its slope. The line is the graph of f(x) = mx + n. It intersects the y-axis\nat height n, and the ratio between the amounts by which y and x increase as you move from one point\nto another on the line is y1−y0\nx1−x0 = m.\n3.3. Linear functions. A function which is given by the formula\nf(x) = mx + n\nwhere m and n are constants is called a linear function. Its graph is a straight line. The constants m\nand n are the slope and y-intercept of the line. Conversely, any straight line which is not vertical (i.e. not\nparallel to the y-axis) is the graph of a linear function. If you know two points (x0, y0) and (x1, y1) on the\nline, then then one can compute the slope m from the “rise-over-run” formula\nm = y1 −y0\nx1 −x0\n.\nThis formula actually contains a theorem from Euclidean geometry, namely it says that the ratio (y1 −y0) :\n(x1 −x0) is the same for every pair of points (x0, y0) and (x1, y1) that you could pick on the line.\n3.4. Domain and “biggest possible domain. ” In this course we will usually not be careful about\nspecifying the domain of the function. When this happens the domain is understood to be the set of all x\nfor which the rule which tells you how to compute f(x) is meaningful. For instance, if we say that h is the\nh(x) = √x", "word_count": 360, "start_char": 14254, "end_char": 16055}
{"chunk_id": "DOC0043__00009", "doc_id": "DOC0043", "chunk_index": 9, "text": "hen this happens the domain is understood to be the set of all x\nfor which the rule which tells you how to compute f(x) is meaningful.F\n\nor instance, if we say that h is the\nh(x) = √x\n\ny = x3 −x\nFigure 5. The graph of y = x3 −x fails the “horizontal line test,” but it passes the “vertical line test.”\nThe circle fails both tests.\nthen the domain of h is understood to be the set of all nonnegative real numbers\ndomain of h = [0, ∞)\nsince √x is well-defined for all x ≥0 and undefined for x < 0.\nA systematic way of finding the domain and range of a function for which you are only given a formula is\nas follows:\n• The domain of f consists of all x for which f(x) is well-defined (“makes sense”)\n• The range of f consists of all y for which you can solve the equation f(x) = y.\n3.5. Example – find the domain and range of f(x) = 1/x2. The expression 1/x2 can be computed\nfor all real numbers x except x = 0 since this leads to division by zero. Hence the domain of the function\nf(x) = 1/x2 is\n“all real numbers except 0” =\n\b\nx | x ̸= 0", "word_count": 219, "start_char": 15872, "end_char": 16907}
{"chunk_id": "DOC0043__00010", "doc_id": "DOC0043", "chunk_index": 10, "text": "xample – find the domain and range of f(x) = 1/x2.T\n\nhe expression 1/x2 can be computed\nfor all real numbers x except x = 0 since this leads to division by zero.H\n\nence the domain of the function\nf(x) = 1/x2 is\n“all real numbers except 0” =\n\b\nx | x ̸= 0\n\n= (−∞, 0) ∪(0, ∞).\nTo find the range we ask “for which y can we solve the equation y = f(x) for x,” i.e. we for which y can you\nsolve y = 1/x2 for x?\nIf y = 1/x2 then we must have x2 = 1/y, so first of all, since we have to divide by y, y can’t be zero.\nFurthermore, 1/y = x2 says that y must be positive. On the other hand, if y > 0 then y = 1/x2 has a solution\n(in fact two solutions), namely x = ±1/√y. This shows that the range of f is\n“all positive real numbers” = {x | x > 0} = (0, ∞).\n3.6. Functions in “real life. ” One can describe the motion of an object using a function. If some\nobject is moving along a straight line, then you can define the following function: Let x(t) be the distance\nfrom the object to a fixed marker on the line, at the time t. Here the domain of the function is the set of all\ntimes t for which we know the position of the object, and the rule is\nGiven t, measure the distance between the object and the marker at time t.\nThere are many examples of this kind. For instance, a biologist could describe the growth of a cell by\ndefining m(t) to be the mass of the cell at time t (measured since the birth of the cell). Here the domain is\nthe interval [0, T], where T is the life time of the cell, and the rule that describes the function is\nGiven t, weigh the cell at time t.\n3.7. The Vertical Line Property. Generally speaking graphs of functions are curves in the plane but\nthey distinguish themselves from arbitrary curves by the way they intersect vertical lines: The graph of\na function cannot intersect a vertical line “x = constant” in more than one point. The reason\nwhy this is true is very simple: if two points lie on a vertical line, then they have the same x coordinate, so if\nthey also lie on the graph of a function f, then their y-coordinates must also be equal, namely f(x).", "word_count": 427, "start_char": 16654, "end_char": 18732}
{"chunk_id": "DOC0043__00011", "doc_id": "DOC0043", "chunk_index": 11, "text": "he reason\nwhy this is true is very simple: if two points lie on a vertical line, then they have the same x coordinate, so if\nthey also lie on the graph of a function f, then their y-coordinates must also be equal, namely f(x).\n\n3.8. Examples. The graph of f(x) = x3 −x “goes up and down,” and, even though it intersects several\nhorizontal lines in more than one point, it intersects every vertical line in exactly one point.\nThe collection of points determined by the equation x2 + y2 = 1 is a circle. It is not the graph of a\nfunction since the vertical line x = 0 (the y-axis) intersects the graph in two points P1(0, 1) and P2(0, −1).\nSee Figure 6.\n4. Inverse functions and Implicit functions\nFor many functions the rule which tells you how to compute it is not an explicit formula, but instead an\nequation which you still must solve. A function which is defined in this way is called an “implicit function.”\n4.1. Example. One can define a function f by saying that for each x the value of f(x) is the solution y\nof the equation\nx2 + 2y −3 = 0.\nIn this example you can solve the equation for y,\ny = 3 −x2\n.\nThus we see that the function we have defined is f(x) = (3 −x2)/2.\nHere we have two definitions of the same function, namely\n(i) “y = f(x) is defined by x2 + 2y −3 = 0,” and\n(ii) “f is defined by f(x) = (3 −x2)/2.”\nThe first definition is the implicit definition, the second is explicit. You see that with an “implicit function”\nit isn’t the function itself, but rather the way it was defined that’s implicit.\n4.2. Another example: domain of an implicitly defined function. Define g by saying that for\nany x the value y = g(x) is the solution of\nx2 + xy −3 = 0.\nJust as in the previous example one can then solve for y, and one finds that\ng(x) = y = 3 −x2\nx\n.\nUnlike the previous example this formula does not make sense when x = 0, and indeed, for x = 0 our rule for\ng says that g(0) = y is the solution of\n02 + 0 · y −3 = 0, i.e. y is the solution of 3 = 0.\nThat equation has no solution and hence x = 0 does not belong to the domain of our function g.\nx2 + y2 = 1\ny = +\n√\n1 −x2\ny = −\n√\n1 −x2\nFigure 6. The circle determined by x2 + y2 = 1 is not the graph of a function, but it contains the graphs\nof the two functions h1(x) =\n√\n1 −x2 and h2(x) = −\n√\n1 −x2.", "word_count": 479, "start_char": 18506, "end_char": 20776}
{"chunk_id": "DOC0043__00012", "doc_id": "DOC0043", "chunk_index": 12, "text": "he circle determined by x2 + y2 = 1 is not the graph of a function, but it contains the graphs\nof the two functions h1(x) =\n√\n1 −x2 and h2(x) = −\n√\n1 −x2.\n\n4.3. Example: the equation alone does not determine the function. Define y = h(x) to be the\nsolution of\nx2 + y2 = 1.\nIf x > 1 or x < −1 then x2 > 1 and there is no solution, so h(x) is at most defined when −1 ≤x ≤1. But\nwhen −1 < x < 1 there is another problem: not only does the equation have a solution, but it even has two\nsolutions:\nx2 + y2 = 1 ⇐⇒y =\np\n1 −x2 or y = −\np\n1 −x2.\nThe rule which defines a function must be unambiguous, and since we have not specified which of these two\nsolutions is h(x) the function is not defined for −1 < x < 1.\nOne can fix this by making a choice, but there are many possible choices. Here are three possibilities:\nh1(x) = the nonnegative solution y of x2 + y2 = 1\nh2(x) = the nonpositive solution y of x2 + y2 = 1\nh3(x) =\n(\nh1(x)\nwhen x < 0\nh2(x)\nwhen x ≥0\n4.4. Why use implicit functions? In all the examples we have done so far we could replace the\nimplicit description of the function with an explicit formula. This is not always possible or if it is possible the\nimplicit description is much simpler than the explicit formula. For instance, you can define a function f by\nsaying that y = f(x) if and only if\n(1)\ny3 + 3y + 2x = 0.\nThis means that the recipe for computing f(x) for any given x is “solve the equation y3 + 3y + 2x = 0.”\nE.g. to compute f(0) you set x = 0 and solve y3 + 3y = 0. The only solution is y = 0, so f(0) = 0. To\ncompute f(1) you have to solve y3 + 3y + 2 · 1 = 0, and if you’re lucky you see that y = −1 is the solution,\nand f(1) = −1.\nIn general, no matter what x is, the equation (1) turns out to have exactly one solution y (which depends\non x, this is how you get the function f). Solving (1) is not easy. In the early 1500s Cardano and Tartaglia\ndiscovered a formula1 for the solution. Here it is:\ny = f(x) =\n3q\n−x +\np\n1 + x2 −\n3q\nx +\np\n1 + x2.\nThe implicit description looks a lot simpler, and when we try to differentiate this function later on, it will be\nmuch easier to use “implicit differentiation” than to use the Cardano-Tartaglia formula directly.\n4.5. Inverse functions. If you have a function f, then you can try to define a new function f −1, the\nso-called inverse function of f, by the following prescription:\n(2)\nFor any given x we say that y = f −1(x) if y is the solution to the equation f(y) = x.\nSo to find y = f −1(x) you solve the equation x = f(y). If this is to define a function then the prescription\n(2) must be unambiguous and the equation f(y) = x has to have a solution and cannot have more than one\nsolution.\n1To see the solution and its history visit\nhttp://www.gap-system.org/~history/HistTopics/Quadratic_etc_equations.html", "word_count": 584, "start_char": 20622, "end_char": 23404}
{"chunk_id": "DOC0043__00013", "doc_id": "DOC0043", "chunk_index": 13, "text": "o to find y = f −1(x) you solve the equation x = f(y).I\n\nf this is to define a function then the prescription\n(2) must be unambiguous and the equation f(y) = x has to have a solution and cannot have more than one\nsolution.\n1To see the solution and its history visit\nhttp://www.gap-system.org/~history/HistTopics/Quadratic_etc_equations.html\n\na\nf(a)\nf(a)\na\nb\nf(b)\nf(b)\nb\nc\nf(c)\nf(c)\nc\nThe graph of f\nThe graph of f −1\nFigure 7. The graph of a function and its inverse are mirror images of each other.\n4.6. Examples. Consider the function f with f(x) = 2x + 3. Then the equation f(y) = x works out to\nbe\n2y + 3 = x\nand this has the solution\ny = x −3\n.\nSo f −1(x) is defined for all x, and it is given by f −1(x) = (x −3)/2.\nNext we consider the function g(x) = x2 with domain all positive real numbers. To see for which x the\ninverse g−1(x) is defined we try to solve the equation g(y) = x, i.e. we try to solve y2 = x. If x < 0 then this\nequation has no solutions since y≥0 for all y. But if x ≥0 then y=x does have a solution, namely y = √x.\nSo we see that g−1(x) is defined for all nonnegative real numbers x, and that it is given by g−1(x) = √x.\n4.7. Inverse trigonometric functions. The familiar trigonometric functions Sine, Cosine and Tangent\nhave inverses which are called arcsine, arccosine and arctangent.\nx = f −1(y)\ny = sin x\n(−π/2 ≤x ≤π/2)\nx = arcsin(y)\n(−1 ≤y ≤1)\ny = cos x\n(0 ≤x ≤π)\nx = arccos(y)\n(−1 ≤y ≤1)\ny = tan x\n(−π/2 < x < π/2)\nx = arctan(y)\nThe notations arcsin y = sin−1 y, arccos x = cos−1 x, and arctan u = tan−1 u are also commonly used for\nthe inverse trigonometric functions. We will avoid the sin−1 y notation because it is ambiguous. Namely,\neverybody writes the square of sin y as\n\u0000sin y\n\u00012 = sin2 y.\nReplacing the 2’s by −1’s would lead to\narcsin y = sin−1 y\n?!?\n=\n\u0000sin y\n\u0001−1 =\nsin y ,\nwhich is not true!\n5. Exercises\n8. The functions f and g are defined by\nf(x) = x2 and g(s) = s2.\nAre f and g the same functions or are they different?\n9. Find a formula for the function f which is defined by\ny = f(x) ⇐⇒x2y + y = 7.\nWhat is the domain of f?\n10. Find a formula for the function f which is defined by\ny = f(x) ⇐⇒x2y −y = 6.\nWhat is the domain of f?\n11. Let f be the function defined by y = f(x) ⇐⇒y is\nthe largest solution of\ny2 = 3x2 −2xy.", "word_count": 482, "start_char": 23064, "end_char": 25335}
{"chunk_id": "DOC0043__00014", "doc_id": "DOC0043", "chunk_index": 14, "text": "hat is the domain of f?\n10.F\n\nind a formula for the function f which is defined by\ny = f(x) ⇐⇒x2y −y = 6.W\n\nhat is the domain of f?\n11.L\n\net f be the function defined by y = f(x) ⇐⇒y is\nthe largest solution of\ny2 = 3x2 −2xy.\n\nFind a formula for f. What are the domain and range of\nf?\n12. Find a formula for the function f which is defined by\ny = f(x) ⇐⇒2x + 2xy + y2 = 5 and y > −x.\nFind the domain of f.\n13.\nUse a calculator to compute f(1.2) in three decimals where f is the implicitly defined function from §4.4.\n(There are (at least) two different ways of finding f(1.2))\n14. Group Problem.\n(a) True or false:\nfor all x one has sin\n\u0000arcsin x\n\u0001\n= x?\n(b) True or false:\nfor all x one has arcsin\n\u0000sin x\n\u0001\n= x?\n15. On a graphing calculator plot the graphs of the following functions, and explain the results. (Hint: first do the\nprevious exercise.)\nf(x) = arcsin(sin x),\n−2π ≤x ≤2π\ng(x) = arcsin(x) + arccos(x),\n0 ≤x ≤1\nh(x) = arctan sin x\ncos x,\n|x| < π/2\nk(x) = arctan cos x\nsin x ,\n|x| < π/2\nl(x) = arcsin(cos x),\n−π ≤x ≤π\nm(x) = cos(arcsin x),\n−1 ≤x ≤1\n16. Find the inverse of the function f which is given by\nf(x) = sin x and whose domain is π ≤x ≤2π. Sketch\nthe graphs of both f and f −1.\n17.\nFind a number a such that the function f(x) =\nsin(x + π/4) with domain a ≤x ≤a + π has an inverse.\nGive a formula for f −1(x) using the arcsine function.\n18. Draw the graph of the function h3 from §4.3.\n19. A function f is given which satisfies\nf(2x + 3) = x2\nfor all real numbers x.\nCompute\n(a) f(0)\n(b) f(3)\n(c) f(x)\n(d) f(y)\n(e) f(f(2))\nwhere x and y are arbitrary real numbers.\nWhat are the range and domain of f?\n20. A function f is given which satisfies\nf\n\u00001\nx + 1\n\u0001\n= 2x −12.\nfor all real numbers x.\nCompute\n(a) f(1)\n(b) f(0)\n(c) f(x)\n(d) f(t)\n(e) f(f(2))\nwhere x and t are arbitrary real numbers.\nWhat are the range and domain of f?\n21. Does there exist a function f which satisfies\nf(x2) = x + 1\nfor all real numbers x?\n∗∗∗\nThe following exercises review precalculus material involving quadratic expressions ax2 + bx + c in one way or\nanother.\n22. Explain how you “complete the square” in a quadratic\nexpression like ax2 + bx.\n23. Find the range of the following functions:\nf(x) = 2x2 + 3\ng(x) = −2x2 + 4x\nh(x) = 4x + x2\nk(x) = 4 sin x + sin2 x\nl(x) = 1/(1 + x2)\nm(x) = 1/(3 + 2x + x2).\n24. Group Problem.\nFor each real number a we define a line la with\nequation y = ax + a2.\n(a)\nDraw\nthe\nlines\ncorresponding\nto\na\n=\n−2, −1, −1\n2, 0, 1\n2, 1, 2.\n(b) Does the point with coordinates (3, 2) lie on one\nor more of the lines la (where a can be any number, not\njust the five values from part (a))? If so, for which values\nof a does (3, 2) lie on la?\n(c) Which points in the plane lie on at least one of\nthe lines la?.\n25.\nFor which values of m and n does the graph of\nf(x) = mx + n intersect the graph of g(x) = 1/x in\nexactly one point and also contain the point (−1, 1)?\n26.\nFor which values of m and n does the graph of\nf(x) = mx + n not intersect the graph of g(x) = 1/x?", "word_count": 653, "start_char": 25111, "end_char": 28087}
{"chunk_id": "DOC0043__00015", "doc_id": "DOC0043", "chunk_index": 15, "text": "or which values of m and n does the graph of\nf(x) = mx + n intersect the graph of g(x) = 1/x in\nexactly one point and also contain the point (−1, 1)?\n26.F\n\nor which values of m and n does the graph of\nf(x) = mx + n not intersect the graph of g(x) = 1/x?\n\nCHAPTER 2\nDerivatives (1)\nTo work with derivatives you have to know what a limit is, but to motivate why we are going to study\nlimits let’s first look at the two classical problems that gave rise to the notion of a derivative: the tangent to\na curve, and the instantaneous velocity of a moving object.\n1. The tangent to a curve\nSuppose you have a function y = f(x) and you draw its graph. If you want to find the tangent to the\ngraph of f at some given point on the graph of f, how would you do that?\nP\nQ\ntangent\na secant\nFigure 1. Constructing the tangent by letting Q →P\nLet P be the point on the graph at which want to draw the tangent. If you are making a real paper and\nink drawing you would take a ruler, make sure it goes through P and then turn it until it doesn’t cross the\ngraph anywhere else.\nIf you are using equations to describe the curve and lines, then you could pick a point Q on the graph\nand construct the line through P and Q (“construct” means “find an equation for”). This line is called a\n“secant,” and it is of course not the tangent that you’re looking for. But if you choose Q to be very close to P\nthen the secant will be close to the tangent.", "word_count": 295, "start_char": 27834, "end_char": 29259}
{"chunk_id": "DOC0043__00016", "doc_id": "DOC0043", "chunk_index": 16, "text": "his line is called a\n“secant,” and it is of course not the tangent that you’re looking for.B\n\nut if you choose Q to be very close to P\nthen the secant will be close to the tangent.\n\nSo this is our recipe for constructing the tangent through P: pick another point Q on the graph, find the\nline through P and Q, and see what happens to this line as you take Q closer and closer to P. The resulting\nsecants will then get closer and closer to some line, and that line is the tangent.\nWe’ll write this in formulas in a moment, but first let’s worry about how close Q should be to P. We\ncan’t set Q equal to P, because then P and Q don’t determine a line (you need two points to determine a\nline). If you choose Q different from P then you don’t get the tangent, but at best something that is “close”\nto it. Some people have suggested that one should take Q “infinitely close” to P, but it isn’t clear what that\nwould mean. The concept of a limit is meant to solve this confusing problem.\n2. An example – tangent to a parabola\nTo make things more concrete, suppose that the function we had was f(x) = x2, and that the point was\n(1, 1). The graph of f is of course a parabola.\nAny line through the point P(1, 1) has equation\ny −1 = m(x −1)\nwhere m is the slope of the line. So instead of finding the equation of the secant and tangent lines we will\nfind their slopes.\n∆x\n∆y\nP\nQ\nx\nx2\nLet Q be the other point on the parabola, with coordinates (x, x2). We can\n“move Q around on the graph” by changing x. Whatever x we choose, it must be\ndifferent from 1, for otherwise P and Q would be the same point. What we want to\nfind out is how the line through P and Q changes if x is changed (and in particular, if\nx is chosen very close to a). Now, as one changes x one thing stays the same, namely,\nthe secant still goes through P. So to describe the secant we only need to know its\nslope. By the “rise over run” formula, the slope of the secant line joining P and Q is\nmP Q = ∆y\n∆x\nwhere\n∆y = x2 −1\nand\n∆x = x −1.\nBy factoring x2 −1 we can rewrite the formula for the slope as follows\n(3)\nmP Q = ∆y\n∆x = x2 −1\nx −1 = (x −1)(x + 1)\nx −1\n= x + 1.\nAs x gets closer to 1, the slope mP Q, being x + 1, gets closer to the value 1 + 1 = 2. We say that\nthe limit of the slope mP Q as Q approaches P is 2.\nIn symbols,\nlim\nQ→P mP Q = 2,\nor, since Q approaching P is the same as x approaching 1,\n(4)\nlim\nx→1 mP Q = 2.\nSo we find that the tangent line to the parabola y = x2 at the point (1, 1) has equation\ny −1 = 2(x −1), i.e. y = 2x −1.\nA warning: you cannot substitute x = 1 in equation (3) to get (4) even though it looks like that’s what we\ndid. The reason why you can’t do that is that when x = 1 the point Q coincides with the point P so “the\nline through P and Q” is not defined; also, if x = 1 then ∆x = ∆y = 0 so that the rise-over-run formula for\nthe slope gives\nmP Q = ∆x\n∆y = 0\n0 = undefined.\nIt is only after the algebra trick in (3) that setting x = 1 gives something that is well defined. But if the\nintermediate steps leading to mP Q = x + 1 aren’t valid for x = 1 why should the final result mean anything\nfor x = 1?", "word_count": 682, "start_char": 29079, "end_char": 32187}
{"chunk_id": "DOC0043__00017", "doc_id": "DOC0043", "chunk_index": 17, "text": "t is only after the algebra trick in (3) that setting x = 1 gives something that is well defined.B\n\nut if the\nintermediate steps leading to mP Q = x + 1 aren’t valid for x = 1 why should the final result mean anything\nfor x = 1?\n\nSomething more complicated has happened. We did a calculation which is valid for all x ̸= 1, and later\nlooked at what happens if x gets “very close to 1.” This is the concept of a limit and we’ll study it in more\ndetail later in this section, but first another example.\n3. Instantaneous velocity\nIf you try to define “instantaneous velocity” you will again end up trying to divide zero by zero. Here is\nhow it goes: When you are driving in your car the speedometer tells you how fast your are going, i.e. what\nyour velocity is. What is this velocity? What does it mean if the speedometer says “50mph”?\ns = 0\nTime = t\nTime = t + ∆t\ns(t)\n∆s = s(t + ∆t) −s(t)\nWe all know what average velocity is. Namely, if it takes you two hours to cover 100 miles, then your\naverage velocity was\ndistance traveled\ntime it took\n= 50 miles per hour.\nThis is not the number the speedometer provides you – it doesn’t wait two hours, measure how far you went\nand compute distance/time. If the speedometer in your car tells you that you are driving 50mph, then that\nshould be your velocity at the moment that you look at your speedometer, i.e. “distance traveled over time\nit took” at the moment you look at the speedometer. But during the moment you look at your speedometer\nno time goes by (because a moment has no length) and you didn’t cover any distance, so your velocity at that\nmoment is 0\n0, i.e. undefined. Your velocity at any moment is undefined. But then what is the speedometer\ntelling you?\nTo put all this into formulas we need to introduce some notation. Let t be the time (in hours) that has\npassed since we got onto the road, and let s(t) be the distance we have covered since then.\nInstead of trying to find the velocity exactly at time t, we find a formula for the average velocity during\nsome (short) time interval beginning at time t. We’ll write ∆t for the length of the time interval.\nAt time t we have traveled s(t) miles. A little later, at time t + ∆t we have traveled s(t + ∆t). Therefore\nduring the time interval from t to t + ∆t we have moved s(t + ∆t) −s(t) miles. Our average velocity in that\ntime interval is therefore\ns(t + ∆t) −s(t)\n∆t\nmiles per hour.\nThe shorter you make the time interval, i.e. the smaller you choose ∆t, the closer this number should be to\nthe instantaneous velocity at time t.\nSo we have the following formula (definition, really) for the velocity at time t\n(5)\nv(t) = lim\n∆t→0\ns(t + ∆t) −s(t)\n∆t\n.\n4. Rates of change\nThe two previous examples have much in common. If we ignore all the details about geometry, graphs,\nhighways and motion, the following happened in both examples:\nWe had a function y = f(x), and we wanted to know how much f(x) changes if x changes. If you change\nx to x + ∆x, then y will change from f(x) to f(x + ∆x). The change in y is therefore\n∆y = f(x + ∆x) −f(x),\nand the average rate of change is\n(6)\n∆y\n∆x = f(x + ∆x) −f(x)\n∆x\n.", "word_count": 612, "start_char": 31959, "end_char": 35075}
{"chunk_id": "DOC0043__00018", "doc_id": "DOC0043", "chunk_index": 18, "text": "f you change\nx to x + ∆x, then y will change from f(x) to f(x + ∆x).T\n\nhe change in y is therefore\n∆y = f(x + ∆x) −f(x),\nand the average rate of change is\n(6)\n∆y\n∆x = f(x + ∆x) −f(x)\n∆x\n.\n\nThis is the average rate of change of f over the interval from x to x + ∆x. To define the rate of change of\nthe function f at x we let the length ∆x of the interval become smaller and smaller, in the hope that the\naverage rate of change over the shorter and shorter time intervals will get closer and closer to some number.\nIf that happens then that “limiting number” is called the rate of change of f at x, or, the derivative of f at\nx. It is written as\n(7)\n∆x→0\nf(x + ∆x) −f(x)\n∆x\n.\nDerivatives and what you can do with them are what the first half of this semester is about. The description\nwe just went through shows that to understand what a derivative is you need to know what a limit is. In the\nnext chapter we’ll study limits so that we get a less vague understanding of formulas like (7).\n5. Examples of rates of change\n5.1. Acceleration as the rate at which velocity changes. As you are driving in your car your\nvelocity does not stay constant, it changes with time. Suppose v(t) is your velocity at time t (measured\nin miles per hour). You could try to figure out how fast your velocity is changing by measuring it at one\nmoment in time (you get v(t)), then measuring it a little later (you get v(∆t))). You conclude that your\nvelocity increased by ∆v = v(t + ∆t) −v(t) during a time interval of length ∆t, and hence\n\u001a\naverage rate at which\nyour velocity changed\n\u001b\n= ∆v\n∆τ = v(t + ∆t) −v(t)\n∆t\n.\nThis rate of change is called your average acceleration (over the time interval from t to t + ∆t). Your\ninstantaneous acceleration at time t is the limit of your average acceleration as you make the time interval\nshorter and shorter:\n{acceleration at time t} = a = lim\n∆t→0\nv(t + ∆t) −v(t)\n∆t\n.\nth the average and instantaneous accelerations are measured in “miles per hour per hour,” i.e. in\n(mi/h)/h = mi/h2.\nOr, if you had measured distances in meters and time in seconds then velocities would be measured in meters\nper second, and acceleration in meters per second per second, which is the same as meters per second2, i.e.\n“meters per squared second.”\n5.2. Reaction rates. Think of a chemical reaction in which two substances A and B react to form\nAB2 according to the reaction\nA + 2B −→AB2.\nIf the reaction is taking place in a closed reactor, then the “amounts” of A and B will be decreasing, while the\namount of AB2 will increase. Chemists write [A] for the amount of “A” in the chemical reactor (measured in\nmoles). Clearly [A] changes with time so it defines a function. We’re mathematicians so we will write “[A](t)”\nfor the number of moles of A present at time t.\nTo describe how fast the amount of A is changing we consider the derivative of [A] with respect to time,\ni.e.\n[A]′(t) = lim\n∆t→0\n[A](t + ∆t) −[A](t)\n∆t\n.\nThis quantity is the rate of change of [A]. The notation “[A]′(t)” is really only used by calculus professors. If\nyou open a paper on chemistry you will find that the derivative is written in Leibniz notation:\nd[A]\ndt\nMore on this in §1.2\nHow fast does the reaction take place? If you add more A or more B to the reactor then you would expect\nthat the reaction would go faster, i.e. that more AB2 is being produced per second. The law of mass-action", "word_count": 656, "start_char": 34888, "end_char": 38262}
{"chunk_id": "DOC0043__00019", "doc_id": "DOC0043", "chunk_index": 19, "text": "f you add more A or more B to the reactor then you would expect\nthat the reaction would go faster, i.e. that more AB2 is being produced per second.T\n\nhe law of mass-action\n\nkinetics from chemistry states this more precisely. For our particular reaction it would say that the rate at\nwhich A is consumed is given by\nd[A]\ndt\n= k [A] [B]2,\nin which the constant k is called the reaction constant.\nIt’s a constant that you could try to measure by\ntiming how fast the reaction goes.\n6. Exercises\n27. Repeat the reasoning in §2 to find the slope at the\npoint ( 1\n2, 1\n4), or more generally at any point (a, a2) on\nthe parabola with equation y = x2.\n28. Repeat the reasoning in §2 to find the slope at the\npoint ( 1\n2, 1\n8), or more generally at any point (a, a3) on\nthe curve with equation y = x3.\n29. Group Problem.\nShould you trust your calculator?\nFind the slope of the tangent to the parabola y = x2\nat the point ( 1\n3, 1\n9) (You have already done this: see\nexercise 27).\nInstead of doing the algebra you could try to compute\nthe slope by using a calculator. This exercise is about\nhow you do that and what happens if you try (too hard).\nCompute ∆y\n∆x for various values of ∆x:\n∆x = 0.1, 0.01, 0.001, 10−6, 10−12.\nAs you choose ∆x smaller your computed ∆y\n∆x ought to\nget closer to the actual slope. Use at least 10 decimals\nand organize your results in a table like this:\n∆x\nf(a)\nf(a + ∆x)\n∆y\n∆y/∆x\n0.1\n. . .\n. . .\n. . .\n. . .\n0.01\n. . .\n. . .\n. . .\n. . .\n0.001\n. . .\n. . .\n. . .\n. . .\n10−6\n. . .\n. . .\n. . .\n. . .\n10−12\n. . .\n. . .\n. . .\n. . .\nLook carefully at the ratios ∆y/∆x. Do they look like\nthey are converging to some number? Compare the values\nof\n∆y\n∆x with the true value you got in the beginning of\nthis problem.\n30. Simplify the algebraic expressions you get when you\ncompute ∆y and ∆y/∆x for the following functions\n(a) y = x2 −2x + 1\n(b) y = 1\nx\n(c) y = 2x\n31. Look ahead at Figure 3 in the next chapter. What is\nthe derivative of f(x) = x cos π\nx at the points A and B\non the graph?\n32. Suppose that some quantity y is a function of some\nother quantity x, and suppose that y is a mass, i.e. y\nis measured in pounds, and x is a length, measured in\nfeet. What units do the increments ∆y and ∆x, and the\nderivative dy/dx have?\n33. A tank is filling with water. The volume (in gallons)\nof water in the tank at time t (seconds) is V (t). What\nunits does the derivative V ′(t) have?\n34. Group Problem.\nLet A(x) be the area of an equilateral triangle whose\nsides measure x inches.\n(a) Show that dA\ndx has the units of a length.\n(b) Which length does dA\ndx represent geometrically?\n[Hint: draw two equilateral triangles, one with side x and\nanother with side x + ∆x. Arrange the triangles so that\nthey both have the origin as their lower left hand corner,\nand so there base is on the x-axis.]\n35. Group Problem.\nLet A(x) be the area of a square with side x, and let\nL(x) be the perimeter of the square (sum of the lengths\nof all its sides). Using the familiar formulas for A(x) and\nL(x) show that A′(x) = 1\n2L(x).\nGive a geometric interpretation that explains why\n∆A ≈1\n2L(x)∆x for small ∆x.\n36. Let A(r) be the area enclosed by a circle of radius\nr, and let L(r) be the length of the circle. Show that\nA′(r) = L(r). (Use the familiar formulas from geometry\nfor the area and perimeter of a circle.)\n37. Let V (r) be the volume enclosed by a sphere of radius r, and let S(r) be the its surface area. Show that\nV ′(r) = S(r).\n(Use the formulas V (r) =\n3πr3 and\nS(r) = 4πr2.)", "word_count": 737, "start_char": 38091, "end_char": 41570}
{"chunk_id": "DOC0043__00020", "doc_id": "DOC0043", "chunk_index": 20, "text": "how that\nA′(r) = L(r). (Use the familiar formulas from geometry\nfor the area and perimeter of a circle.)\n37.L\n\net V (r) be the volume enclosed by a sphere of radius r, and let S(r) be the its surface area.S\n\nhow that\nV ′(r) = S(r).\n(Use the formulas V (r) =\n3πr3 and\nS(r) = 4πr2.)\n\nCHAPTER 3\nLimits and Continuous Functions\n1. Informal definition of limits\nWhile it is easy to define precisely in a few words what a square root is (√a is the positive number whose\nsquare is a) the definition of the limit of a function runs over several terse lines, and most people don’t find it\nvery enlightening when they first see it. (See §2.) So we postpone this for a while and fine tune our intuition\nfor another page.\n1.1. Definition of limit (1st attempt). If f is some function then\nlim\nx→a f(x) = L\nis read “the limit of f(x) as x approaches a is L.” It means that if you choose values of x which are close but\nnot equal to a, then f(x) will be close to the value L; moreover, f(x) gets closer and closer to L as x gets\ncloser and closer to a.\nThe following alternative notation is sometimes used\nf(x) →L\nas\nx →a;\n(read “f(x) approaches L as x approaches a” or “f(x) goes to L is x goes to a”.)\n1.2. Example. If f(x) = x + 3 then\nlim\nx→4 f(x) = 7,\nis true, because if you substitute numbers x close to 4 in f(x) = x + 3 the result will be close to 7.\n1.3. Example: substituting numbers to guess a limit. What (if anything) is\nlim\nx→2\nx2 −2x\nx2 −4 ?\nHere f(x) = (x2 −2x)/(x2 −4) and a = 2.\nWe first try to substitute x = 2, but this leads to\nf(2) = 22 −2 · 2\n22 −4\n= 0\nwhich does not exist. Next we try to substitute values of x close but not equal to 2. Table 1 suggests that\nf(x) approaches 0.5.\nx\nf(x)\n3.000000\n0.600000\n2.500000\n0.555556\n2.100000\n0.512195\n2.010000\n0.501247\n2.001000\n0.500125\nx\ng(x)\n1.000000\n1.009990\n0.500000\n1.009980\n0.100000\n1.009899\n0.010000\n1.008991\n0.001000\n1.000000\nTable 1. Finding limits by substituting values of x “close to a.” (Values of f(x) and g(x) rounded to\nsix decimals.)", "word_count": 397, "start_char": 41290, "end_char": 43292}
{"chunk_id": "DOC0043__00021", "doc_id": "DOC0043", "chunk_index": 21, "text": "able 1 suggests that\nf(x) approaches 0.5.\nx\nf(x)\n3.000000\n0.600000\n2.500000\n0.555556\n2.100000\n0.512195\n2.010000\n0.501247\n2.001000\n0.500125\nx\ng(x)\n1.000000\n1.009990\n0.500000\n1.009980\n0.100000\n1.009899\n0.010000\n1.008991\n0.001000\n1.000000\nTable 1.F\n\ninding limits by substituting values of x “close to a.” (Values of f(x) and g(x) rounded to\nsix decimals.)\n\n1.4. Example: Substituting numbers can suggest the wrong answer. The previous example\nshows that our first definition of “limit” is not very precise, because it says “x close to a,” but how close is\nclose enough? Suppose we had taken the function\ng(x) =\n101 000x\n100 000x + 1\nand we had asked for the limit limx→0 g(x).\nThen substitution of some “small values of x” could lead us to believe that the limit is 1.000 . . .. Only\nwhen you substitute even smaller values do you find that the limit is 0 (zero)!\nSee also problem 29.\n2. The formal, authoritative, definition of limit\nThe informal description of the limit uses phrases like “closer and closer” and “really very small.” In\nthe end we don’t really know what they mean, although they are suggestive. “Fortunately” there is a good\ndefinition, i.e. one which is unambiguous and can be used to settle any dispute about the question of whether\nlimx→a f(x) equals some number L or not. Here is the definition. It takes a while to digest, so read it once,\nlook at the examples, do a few exercises, read the definition again. Go on to the next sections. Throughout\nthe semester come back to this section and read it again.\n2.1. Definition of limx→a f(x) = L. We say that L is the limit of f(x) as x →a, if\n(1) f(x) need not be defined at x = a, but it must be defined for all other x in some interval which\ncontains a.\n(2) for every ε > 0 one can find a δ > 0 such that for all x in the domain of f one has\n(8)\n|x −a| < δ implies |f(x) −L| < ε.\nWhy the absolute values? The quantity |x −y| is the distance between the points x and y on the\nnumber line, and one can measure how close x is to y by calculating |x −y|. The inequality |x −y| < δ says\nthat “the distance between x and y is less than δ,” or that “x and y are closer than δ.”\nWhat are ε and δ? The quantity ε is how close you would like f(x) to be to its limit L; the quantity δ\nis how close you have to choose x to a to achieve this. To prove that limx→a f(x) = L you must assume that\nsomeone has given you an unknown ε > 0, and then find a postive δ for which (8) holds. The δ you find will\ndepend on ε.\n2.2. Show that limx→5 2x + 1 = 11 . We have f(x) = 2x + 1, a = 5 and L = 11, and the question we\nmust answer is “how close should x be to 5 if want to be sure that f(x) = 2x + 1 differs less than ε from\nL = 11?”\nTo figure this out we try to get an idea of how big |f(x) −L| is:\n|f(x) −L| =\n(2x + 1) −11\n= |2x −10| = 2 · |x −5| = 2 · |x −a|.\nSo, if 2|x −a| < ε then we have |f(x) −L| < ε, i.e.\nif |x −a| < 1\n2ε then |f(x) −L| < ε.\nWe can therefore choose δ = 1\n2ε. No matter what ε > 0 we are given our δ will also be positive, and if\n|x −5| < δ then we can guarantee |(2x + 1) −11| < ε. That shows that limx→5 2x + 1 = 11.", "word_count": 648, "start_char": 42939, "end_char": 46032}
{"chunk_id": "DOC0043__00022", "doc_id": "DOC0043", "chunk_index": 22, "text": "e can therefore choose δ = 1\n2ε.N\n\no matter what ε > 0 we are given our δ will also be positive, and if\n|x −5| < δ then we can guarantee |(2x + 1) −11| < ε.T\n\nhat shows that limx→5 2x + 1 = 11.\n\nL −ε\nL + ε\nL\na\nHow close must x be to a for f(x) to end up in this range?\nL −ε\nL + ε\nL\na + δ\na −δ\na\nFor some x in this interval f(x) is not between L −ε and\nL + ε. Therefore the δ in this picture is too big for the\ngiven ε. You need a smaller δ.\nL −ε\nL + ε\nL\na + δ\na −δ\na\nIf you choose x in this interval then f(x) will be between\nL −ε and L + ε. Therefore the δ in this picture is small\nenough for the given ε.\n2.3. The limit limx→1 x2 = 1 and the “don’t choose δ > 1” trick. We have f(x) = x2, a = 1,\nL = 1, and again the question is, “how small should |x −1| be to guarantee |x2 −1| < ε?”\nWe begin by estimating the difference |x2 −1|\n|x2 −1| = |(x −1)(x + 1)| = |x + 1| · |x −1|.", "word_count": 224, "start_char": 45839, "end_char": 46717}
{"chunk_id": "DOC0043__00023", "doc_id": "DOC0043", "chunk_index": 23, "text": "e have f(x) = x2, a = 1,\nL = 1, and again the question is, “how small should |x −1| be to guarantee |x2 −1| < ε?”\nWe begin by estimating the difference |x2 −1|\n|x2 −1| = |(x −1)(x + 1)| = |x + 1| · |x −1|.\n\nPropagation of errors – another interpretation of ε and δ\nAccording to the limit definition “limx→R πx2 = A” is true if for every ε > 0 you can find a δ > 0 such that\n|x −R| < δ implies |πx2 −A| < ε.\nHere’s a more concrete situation in which ε and δ appear in exactly the same\nroles:\nSuppose you are given a circle drawn on a piece of\npaper, and you want to know its area. You decide to\nmeasure its radius, R, and then compute the area of\nthe circle by calculating\nArea = πR2.\nThe area is a function of the radius, and we’ll call\nthat function f:\nf(x) = πx2.\nWhen you measure the radius R you will make\nan error, simply because you can never measure anything with infinite precision. Suppose that R is the\nreal value of the radius, and that x is the number you\nmeasured. Then the size of the error you made is\nerror in radius measurement = |x −R|.\nWhen you compute the area you also won’t get the\nexact value: you would get f(x) = πx2 instead of\nA = f(R) = πR2. The error in your computed value\nof the area is\nerror in area = |f(x) −f(R)| = |f(x) −A|.\nNow you can ask the following question:\nSuppose you want to know the area\nwith an error of at most ε,\nthen what is the largest error\nthat you can afford to make\nwhen you measure the radius?\nThe answer will be something like this: if you want\nthe computed area to have an error of at most\n|f(x) −A| < ε, then the error in your radius measurement should satisfy |x −R| < δ. You have to do\nthe algebra with inequalities to compute δ when you\nknow ε, as in the examples in this section.\nYou would expect that if your measured radius\nx is close enough to the real value R, then your computed area f(x) = πx2 will be close to the real area\nA.\nIn terms of ε and δ this means that you would\nexpect that no matter how accurately you want to\nknow the area (i.e how small you make ε) you can\nalways achieve that precision by making the error\nin your radius measurement small enough (i.e. by\nmaking δ sufficiently small).\nAs x approaches 1 the factor |x −1| becomes small, and if the other factor |x + 1| were a constant (e.g. 2 as\nin the previous example) then we could find δ as before, by dividing ε by that constant.\nHere is a trick that allows you to replace the factor |x + 1| with a constant. We hereby agree that we\nalways choose our δ so that δ ≤1. If we do that, then we will always have\n|x −1| < δ ≤1, i.e. |x −1| < 1,\nand x will always be beween 0 and 2. Therefore\n|x2 −1| = |x + 1| · |x −1| < 3|x −1|.\nIf we now want to be sure that |x2 −1| < ε, then this calculation shows that we should require 3|x −1| < ε,\ni.e. |x −1| < 1\n3ε. So we should choose δ ≤1\n3ε. We must also live up to our promise never to choose δ > 1, so\nif we are handed an ε for which 1\n3ε > 1, then we choose δ = 1 instead of δ = 1\n3ε. To summarize, we are going\nto choose\nδ = the smaller of 1 and 1\n3ε.\nWe have shown that if you choose δ this way, then |x −1| < δ implies |x2 −1| < ε, no matter what ε > 0 is.\nThe expression “the smaller of a and b” shows up often, and is abbreviated to min(a, b). We could\ntherefore say that in this problem we will choose δ to be\nδ = min\n\u00001, 1\n3ε\n\u0001\n.", "word_count": 716, "start_char": 46512, "end_char": 49828}
{"chunk_id": "DOC0043__00024", "doc_id": "DOC0043", "chunk_index": 24, "text": "he expression “the smaller of a and b” shows up often, and is abbreviated to min(a, b).W\n\ne could\ntherefore say that in this problem we will choose δ to be\nδ = min\n\u00001, 1\n3ε\n\u0001\n.\n\n2.4. Show that limx→4 1/x = 1/4. Solution: We apply the definition with a = 4, L = 1/4 and\nf(x) = 1/x. Thus, for any ε > 0 we try to show that if |x −4| is small enough then one has |f(x) −1/4| < ε.\nWe begin by estimating |f(x) −1\n4| in terms of |x −4|:\n|f(x) −1/4| =\n\nx −1\n=", "word_count": 104, "start_char": 49652, "end_char": 50105}
{"chunk_id": "DOC0043__00025", "doc_id": "DOC0043", "chunk_index": 25, "text": "olution: We apply the definition with a = 4, L = 1/4 and\nf(x) = 1/x.T\n\nhus, for any ε > 0 we try to show that if |x −4| is small enough then one has |f(x) −1/4| < ε.W\n\ne begin by estimating |f(x) −1\n4| in terms of |x −4|:\n|f(x) −1/4| =\n\nx −1\n=\n\n4 −x\n4x\n= |x −4|\n|4x|\n=\n|4x| |x −4|.\nAs before, things would be easier if 1/|4x| were a constant. To achieve that we again agree not to take δ > 1.\nIf we always have δ ≤1, then we will always have |x −4| < 1, and hence 3 < x < 5. How large can 1/|4x| be\nin this situation? Answer: the quantity 1/|4x| increases as you decrease x, so if 3 < x < 5 then it will never\nbe larger than 1/|4 · 3| =\n12.\nWe see that if we never choose δ > 1, we will always have\n|f(x) −1\n4| ≤\n12|x −4|\nfor\n|x −4| < δ.\nTo guarantee that |f(x) −1\n4| < ε we could threfore require\n12|x −4| < ε,\ni.e.\n|x −4| < 12ε.\nHence if we choose δ = 12ε or any smaller number, then |x −4| < δ implies |f(x) −4| < ε. Of course we have\nto honor our agreement never to choose δ > 1, so our choice of δ is\nδ = the smaller of 1 and 12ε = min\n\u00001, 12ε\n\u0001\n.\n3. Exercises\n38. Group Problem.\nJoe offers to make square sheets of paper for Bruce.\nGiven x > 0 Joe plans to mark offa length x and cut\nout a square of side x. Bruce asks Joe for a square with\narea 4 square foot. Joe tells Bruce that he can’t measure\nexactly 2 foot and the area of the square he produces will\nonly be approximately 4 square foot. Bruce doesn’t mind\nas long as the area of the square doesn’t differ more than\n0.01 square foot from what he really asked for (namely, 4\nsquare foot).\n(a) What is the biggest error Joe can afford to make\nwhen he marks offthe length x?\n(b) Jen also wants square sheets, with area 4 square\nfeet. However, she needs the error in the area to be less\nthan 0.00001 square foot. (She’s paying).\nHow accurate must Joe measure the side of the\nsquares he’s going to cut for Jen?\nUse the ε–δ definition to prove the following limits\n39.\nlim\nx→1 2x −4 = 6\n40.\nlim\nx→2 x2 = 4.\n41.\nlim\nx→2 x2 −7x + 3 = −7\n42.\nlim\nx→3 x3 = 27\n43.\nlim\nx→2 x3 + 6x2 = 32.\n44.\nlim\nx→4\n√x = 2.\n45.\nlim\nx→3\n√\nx + 6 = 9.\n46.\nlim\nx→2\n1 + x\n4 + x = 1\n2.\n47.\nlim\nx→1\n2 −x\n4 −x = 1\n3.\n48.\nlim\nx→3\nx\n6 −x = 1.\n49.\nlim\nx→0\np\n|x| = 0\n50. Group Problem.\n(Joe goes cubic.) Joe is offering to build cubes of\nside x. Airline regulations allow you take a cube on board\nprovided its volume and surface area add up to less than 33\n(everything measured in feet). For instance, a cube with\n2 foot sides has volume+area equal to 23 + 6 × 22 = 32.\nIf you ask Joe to build a cube whose volume plus\ntotal surface area is 32 cubic feet with an error of at\nmost ε, then what error can he afford to make when he\nmeasures the side of the cube he’s making?\n51. Our definition of a derivative in (7) contains a limit.\nWhat is the function “f” there, and what is the variable?\n4. Variations on the limit theme\nNot all limits are “for x →a.” here we describe some possible variations on the concept of limit.", "word_count": 655, "start_char": 49862, "end_char": 52805}
{"chunk_id": "DOC0043__00026", "doc_id": "DOC0043", "chunk_index": 26, "text": "ur definition of a derivative in (7) contains a limit.W\n\nhat is the function “f” there, and what is the variable?\n4.V\n\nariations on the limit theme\nNot all limits are “for x →a.” here we describe some possible variations on the concept of limit.\n\n4.1. Left and right limits. When we let “x approach a” we allow x to be both larger or smaller than\na, as long as x gets close to a. If we explicitly want to study the behaviour of f(x) as x approaches a through\nvalues larger than a, then we write\nlim\nx↘a f(x) or\nlim\nx→a+ f(x) or\nlim\nx→a+0 f(x) or\nlim\nx→a,x>a f(x).\nAll four notations are in use. Similarly, to designate the value which f(x) approaches as x approaches a\nthrough values below a one writes\nlim\nx↗a f(x) or\nlim\nx→a−f(x) or\nlim\nx→a−0 f(x) or\nlim\nx→a,x<a f(x).\nThe precise definition of right limits goes like this:\n4.2. Definition of right-limits. Let f be a function. Then\n(9)\nlim\nx↘a f(x) = L.\nmeans that for every ε > 0 one can find a δ > 0 such that\na < x < a + δ =⇒|f(x) −L| < ε\nholds for all x in the domain of f.\nThe left-limit, i.e. the one-sided limit in which x approaches a through values less than a is defined in a\nsimilar way. The following theorem tells you how to use one-sided limits to decide if a function f(x) has a\nlimit at x = a.\n4.3. Theorem. If both one-sided limits\nlim\nx↘a f(x) = L+, and lim\nx↗a f(x) = L−\nexist, then\nlim\nx→a f(x) exists ⇐⇒L+ = L−.\nIn other words, if a function has both left- and right-limits at some x = a, then that function has a limit\nat x = a if the left- and right-limits are equal.\n4.4. Limits at infinity. Instead of letting x approach some finite number, one can let x become “larger\nand larger” and ask what happens to f(x). If there is a number L such that f(x) gets arbitrarily close to L\nif one chooses x sufficiently large, then we write\nlim\nx→∞f(x) = L,\nor\nlim\nx↑∞f(x) = L,\nor\nlim\nx↗∞f(x) = L.\n(“The limit for x going to infinity is L.”)\n4.5. Example – Limit of 1/x . The larger you choose x, the smaller its reciprocal 1/x becomes.\nTherefore, it seems reasonable to say\nlim\nx→∞\nx = 0.\nHere is the precise definition:\n4.6. Definition of limit at ∞. Let f be some function which is defined on some interval x0 < x < ∞.\nIf there is a number L such that for every ε > 0 one can find an A such that\nx > A =⇒|f(x) −L| < ε\nfor all x, then we say that the limit of f(x) for x →∞is L.\nThe definition is very similar to the original definition of the limit. Instead of δ which specifies how close\nx should be to a, we now have a number A which says how large x should be, which is a way of saying “how\nclose x should be to infinity.”", "word_count": 535, "start_char": 52560, "end_char": 55154}
{"chunk_id": "DOC0043__00027", "doc_id": "DOC0043", "chunk_index": 27, "text": "he definition is very similar to the original definition of the limit.I\n\nnstead of δ which specifies how close\nx should be to a, we now have a number A which says how large x should be, which is a way of saying “how\nclose x should be to infinity.”\n\n4.7. Example – Limit of 1/x (again) . To prove that limx→∞1/x = 0 we apply the definition to\nf(x) = 1/x, L = 0.\nFor given ε > 0 we need to show that\n(10)", "word_count": 86, "start_char": 54907, "end_char": 55309}
{"chunk_id": "DOC0043__00028", "doc_id": "DOC0043", "chunk_index": 28, "text": "xample – Limit of 1/x (again) .T\n\no prove that limx→∞1/x = 0 we apply the definition to\nf(x) = 1/x, L = 0.F\n\nor given ε > 0 we need to show that\n(10)\n\nx −L\n< ε for all x > A\nprovided we choose the right A.\nHow do we choose A? A is not allowed to depend on x, but it may depend on ε.\nIf we assume for now that we will only consider positive values of x, then (10) simplifies to\nx < ε\nwhich is equivalent to\nx > 1\nε.\nThis tells us how to choose A. Given any positive ε, we will simply choose\nA = 1\nε\nThen one has | 1\nx −0| = 1\nx < ε for all x > A. Hence we have proved that limx→∞1/x = 0.\n5. Properties of the Limit\nThe precise definition of the limit is not easy to use, and fortunately we won’t use it very often in this\nclass. Instead, there are a number of properties that limits have which allow you to compute them without\nhaving to resort to “epsiloncy.”\nThe following properties also apply to the variations on the limit from 4. I.e. the following statements\nremain true if one replaces each limit by a one-sided limit, or a limit for x →∞.\nLimits of constants and of x.\nIf a and c are constants, then\n(P1)\nlim\nx→a c = c\nand\n(P2)\nlim\nx→a x = a.\nLimits of sums, products and quotients.\nLet F1 and F2 be two given functions whose limits for\nx →a we know,\nlim\nx→a F1(x) = L1,\nlim\nx→a F2(x) = L2.\nThen\nlim\nx→a\n\u0000F1(x) + F2(x)\n\u0001\n= L1 + L2,\n(P3)\nlim\nx→a\n\u0000F1(x) −F2(x)\n\u0001\n= L1 −L2,\n(P4)\nlim\nx→a\n\u0000F1(x) · F2(x)\n\u0001\n= L1 · L2\n(P5)\nFinally, if limx→a F2(x) ̸= 0,\n(P6)\nlim\nx→a\nF1(x)\nF2(x) = L1\nL2\n.\nIn other words the limit of the sum is the sum of the limits, etc. One can prove these laws using the\ndefinition of limit in §2 but we will not do this here. However, I hope these laws seem like common sense:\nif, for x close to a, the quantity F1(x) is close to L1 and F2(x) is close to L2, then certainly F1(x) + F2(x)\nshould be close to L1 + L2.", "word_count": 403, "start_char": 55160, "end_char": 56997}
{"chunk_id": "DOC0043__00029", "doc_id": "DOC0043", "chunk_index": 29, "text": "ne can prove these laws using the\ndefinition of limit in §2 but we will not do this here.H\n\nowever, I hope these laws seem like common sense:\nif, for x close to a, the quantity F1(x) is close to L1 and F2(x) is close to L2, then certainly F1(x) + F2(x)\nshould be close to L1 + L2.\n\nThere are two more properties of limits which we will add to this list later on. They are the “Sandwich\nTheorem” (§9) and the substitution theorem (§10).\n6. Examples of limit computations\n6.1. Find limx→2 x2. One has\nlim\nx→2 x2 = lim\nx→2 x · x\n=\n\u0000lim\nx→2 x\n\u0001\n·\n\u0000lim\nx→2 x\n\u0001\nby (P5)\n= 2 · 2 = 4.\nSimilarly,\nlim\nx→2 x3 = lim\nx→2 x · x2\n=\n\u0000lim\nx→2 x\n\u0001\n·\n\u0000lim\nx→2 x2\u0001\n(P5) again\n= 2 · 4 = 8,\nand, by (P4)\nlim\nx→2 x2 −1 = lim\nx→2 x2 −lim\nx→2 1 = 4 −1 = 3,\nand, by (P4) again,\nlim\nx→2 x3 −1 = lim\nx→2 x3 −lim\nx→2 1 = 8 −1 = 7,\nPutting all this together, one gets\nlim\nx→2\nx3 −1\nx2 −1 = 23 −1\n22 −1 = 8 −1\n4 −1 = 7\nbecause of (P6). To apply (P6) we must check that the denominator (“L2”) is not zero. Since the denominator\nis 3 everything is OK, and we were allowed to use (P6).\n6.2. Try the examples 1.3 and 1.4 using the limit properties. To compute limx→2(x2−2x)/(x2−\n4) we first use the limit properties to find\nlim\nx→2 x2 −2x = 0 and lim\nx→2 x2 −4 = 0.\nto complete the computation we would like to apply the last property (P6) about quotients, but this would\ngive us\nlim\nx→2 f(x) = 0\n0.\nThe denominator is zero, so we were not allowed to use (P6) (and the result doesn’t mean anything anyway).\nWe have to do something else.\nThe function we are dealing with is a rational function, which means that it is the quotient of two\npolynomials. For such functions there is an algebra trick which always allows you to compute the limit even\nif you first get 0\n0. The thing to do is to divide numerator and denominator by x −2. In our case we have\nx2 −2x = (x −2) · x,\nx2 −4 = (x −2) · (x + 2)\nso that\nlim\nx→2 f(x) = lim\nx→2\n(x −2) · x\n(x −2) · (x + 2) = lim\nx→2\nx\nx + 2.\nAfter this simplification we can use the properties (P...) to compute\nlim\nx→2 f(x) =\n2 + 2 = 1\n2.", "word_count": 455, "start_char": 56717, "end_char": 58755}
{"chunk_id": "DOC0043__00030", "doc_id": "DOC0043", "chunk_index": 30, "text": "fter this simplification we can use the properties (P...) to compute\nlim\nx→2 f(x) =\n2 + 2 = 1\n2.\n\n6.3. Example – Find limx→2\n√x . Of course, you would think that limx→2\n√x =\n√\n2 and you can\nindeed prove this using δ & ε (See problem 44.) But is there an easier way? There is nothing in the limit\nproperties which tells us how to deal with a square root, and using them we can’t even prove that there is a\nlimit. However, if you assume that the limit exists then the limit properties allow us to find this limit.\nThe argument goes like this: suppose that there is a number L with\nlim\nx→2\n√x = L.\nThen property (P5) implies that\nL2 =\n\u0000lim\nx→2\n√x\n\u0001\n·\n\u0000lim\nx→2\n√x\n\u0001\n= lim\nx→2\n√x · √x = lim\nx→2 x = 2.\nIn other words, L2 = 2, and hence L must be either\n√\n2 or −\n√\n2. We can reject the latter because whatever x\ndoes, its squareroot is always a positive number, and hence it can never “get close to” a negative number like\n−\n√\n2.\nOur conclusion: if the limit exists, then\nlim\nx→2\n√x =\n√\n2.\nThe result is not surprising: if x gets close to 2 then √x gets close to\n√\n2.\n6.4. Example – The derivative of √x at x = 2. Find\nlim\nx→2\n√x −\n√\nx −2\nassuming the result from the previous example.\nSolution:\nThe function is a fraction whose numerator and denominator vanish when x = 2, i.e. the limit\nis of the form 0\n0. We use the same algebra trick as before, namely we factor numerator and denominator:\n√x −\n√\nx −2\n=\n√x −\n√\n(√x −\n√\n2)(√x +\n√\n2) =\n√x +\n√\n2.\nNow one can use the limit properties to compute\nlim\nx→2\n√x −\n√\nx −2\n= lim\nx→2\n√x +\n√\n2 =\n√\n2 =\n√\n4 .\n6.5. Limit as x →∞of rational functions. A rational function is the quotient of two polynomials,\nso\n(11)\nR(x) = anxn + · · · + a1x + a0\nbmxm + · · · + b1x + b0\n.\nWe have seen that\nlim\nx→∞\nx = 0\nWe even proved this in example 4.7. Using this you can find the limit at ∞for any rational function R(x) as\nin (11). One could turn the outcome of the calculation of limx→∞R(x) into a recipe/formula involving the\ndegrees n and m of the numerator and denominator, and also their coefficients ai, bj, which students would\nthen memorize, but it is better to remember “the trick.”\nTo find limx→∞R(x) divide numerator and denominator by xm (the highest power of x occurring in the\ndenominator).\nFor example, let’s compute\nlim\nx→∞\n3x2 + 3\n5x2 + 7x −39.", "word_count": 491, "start_char": 58659, "end_char": 60942}
{"chunk_id": "DOC0043__00031", "doc_id": "DOC0043", "chunk_index": 31, "text": "or example, let’s compute\nlim\nx→∞\n3x2 + 3\n5x2 + 7x −39.\n\nRemember the trick and divide top and bottom by x2, and you get\nlim\nx→∞\n3x2 + 3\n5x2 + 7x −39 = lim\nx→∞\n3 + 3/x2\n5 + 7/x −39/x2\n=\nlimx→∞3 + 3/x2\nlimx→∞5 + 7/x −39/x2\n= 3\nHere we have used the limit properties (P∗) to break the limit down into little pieces like limx→∞39/x2\nwhich we can compute as follows\nlim\nx→∞39/x2 = lim\nx→∞39 ·\n\u0012 1\nx\n\u00132\n=\n\u0010\nlim\nx→∞39\n\u0011\n·\n\u0012\nlim\nx→∞\nx\n\u00132\n= 39 · 02 = 0.\n6.6. Another example with a rational function . Compute\nlim\nx→∞\nx\nx3 + 5.\nWe apply “the trick” again and divide numerator and denominator by x3. This leads to\nlim\nx→∞\nx\nx3 + 5 = lim\nx→∞\n1/x2\n1 + 5/x3 =\nlimx→∞1/x2\nlimx→∞1 + 5/x3 = 0\n1 = 0.\nTo show all possible ways a limit of a rational function can turn out we should do yet another example,\nbut that one belongs in the next section (see example 7.6.)\n7. When limits fail to exist\nIn the last couple of examples we worried about the possibility that a limit limx→a g(x) actually might\nnot exist. This can actually happen, and in this section we’ll see a few examples of what failed limits look\nlike. First let’s agree on what we will call a “failed limit.”\n7.1. Definition. If there is no number L such that limx→a f(x) = L, then we say that the limit\nlimx→a f(x) does not exist.\n7.2. The sign function near x = 0 . The “sign function1” is defined by\nsign(x) =\n\n\n\n\n\n−1\nfor x = 0\nfor x > 0\nNote that “the sign of zero” is defined to be zero. But does the sign function have a limit at x = 0, i.e. does\nlimx→0 sign(x) exist? And is it also zero? The answers are no and no, and here is why: suppose that for\nsome number L one had\nlim\nx→0 sign(x) = L,\nthen since for arbitrary small positive values of x one has sign(x) = +1 one would think that L = +1. But\nfor arbitrarily small negative values of x one has sign(x) = −1, so one would conclude that L = −1. But one\nnumber L can’t be both +1 and −1 at the same time, so there is no such L, i.e. there is no limit.\nlim\nx→0 sign(x) does not exist.\n1Some people don’t like the notation sign(x), and prefer to write\ng(x) = x\n|x|\ninstead of g(x) = sign(x). If you think about this formula for a moment you’ll see that sign(x) = x/|x| for all x ̸= 0. When\nx = 0 the quotient x/|x| is of course not defined.", "word_count": 483, "start_char": 60887, "end_char": 63135}
{"chunk_id": "DOC0043__00032", "doc_id": "DOC0043", "chunk_index": 32, "text": "f you think about this formula for a moment you’ll see that sign(x) = x/|x| for all x ̸= 0.W\n\nhen\nx = 0 the quotient x/|x| is of course not defined.\n\ny = sign(x)\n−1\nFigure 1. The sign function.\nIn this example the one-sided limits do exist, namely,\nlim\nx↘0 sign(x) = 1 and lim\nx↗0 sign(x) = −1.\nAll this says is that when x approaches 0 through positive values, its sign approaches +1, while if x goes to 0\nthrough negative values, then its sign approaches −1.\n7.3. The example of the backward sine. Contemplate the limit as x →0 of the “backward sine,”\ni.e.\nlim\nx→0 sin\n\u0000π\nx\n\u0001\n.\nWhen x = 0 the function f(x) = sin(π/x) is not defined, because its definition involves division by x.\nWhat happens to f(x) as x →0? First, π/x becomes larger and larger (“goes to infinity”) as x →0. Then,\ntaking the sine, we see that sin(π/x) oscillates between +1 and −1 infinitely often as x →0. This means\nthat f(x) gets close to any number between −1 and +1 as x →0, but that the function f(x) never stays\nclose to any particular value because it keeps oscillating up and down.\ny = sin π\nx\nA\nB\nC\nD\nE\nFigure 2. Graph of y = sin π\nx for −3 < x < 3, x ̸= 0.\nHere again, the limit limx→0 f(x) does not exist. We have arrived at this conclusion by only considering\nwhat f(x) does for small positive values of x. So the limit fails to exist in a stronger way than in the example\nof the sign-function. There, even though the limit didn’t exist, the one-sided limits existed. In the present\nexample we see that even the one-sided limit\nlim\nx↘0 sin π\nx\ndoes not exist.", "word_count": 309, "start_char": 62987, "end_char": 64531}
{"chunk_id": "DOC0043__00033", "doc_id": "DOC0043", "chunk_index": 33, "text": "o the limit fails to exist in a stronger way than in the example\nof the sign-function.T\n\nhere, even though the limit didn’t exist, the one-sided limits existed.I\n\nn the present\nexample we see that even the one-sided limit\nlim\nx↘0 sin π\nx\ndoes not exist.\n\n7.4. Trying to divide by zero using a limit. The expression 1/0 is not defined, but what about\nlim\nx→0\nx?\nThis limit also does not exist. Here are two reasons:\nIt is common wisdom that if you divide by a small number you get a large number, so as x ↘0 the\nquotient 1/x will not be able to stay close to any particular finite number, and the limit can’t exist.\n“Common wisdom” is not always a reliable tool in mathematical proofs, so here is a better argument.\nThe limit can’t exist, because that would contradict the limit properties (P1) · · · (P6). Namely, suppose that\nthere were an number L such that\nlim\nx→0\nx = L.\nThen the limit property (P5) would imply that\nlim\nx→0\n\u0000 1\nx · x\n\u0001\n=\n\u0000lim\nx→0\nx\n\u0001\n·\n\u0000lim\nx→0 x\n\u0001\n= L · 0 = 0.\nOn the other hand 1\nx · x = 1 so the above limit should be 1! A number can’t be both 0 and 1 at the same\ntime, so we have a contradiction. The assumption that limx→0 1/x exists is to blame, so it must go.\n7.5. Using limit properties to show a limit does not exist. The limit properties tell us how to\nprove that certain limits exist (and how to compute them). Although it is perhaps not so obvious at first\nsight, they also allow you to prove that certain limits do not exist. The previous example shows one instance\nof such use. Here is another.\nProperty (P3) says that if both limx→a g(x) and limx→a h(x) exist then limx→a g(x) + h(x) also must\nexist. You can turn this around and say that if limx→a g(x) + h(x) does not exist then either limx→a g(x) or\nlimx→a h(x) does not exist (or both limits fail to exist).\nFor instance, the limit\nlim\nx→0\nx −x\ncan’t exist, for if it did, then the limit\nlim\nx→0\nx = lim\nx→0\n\u0000 1\nx −x + x\n\u0001\n= lim\nx→0\n\u0000 1\nx −x\n\u0001\n+ lim\nx→0 x\nwould also have to exist, and we know limx→0 1\nx doesn’t exist.\n7.6. Limits at ∞which don’t exist. If you let x go to ∞, then x will not get “closer and closer” to\nany particular number L, so it seems reasonable to guess that\nlim\nx→∞x does not exist.\nOne can prove this from the limit definition (and see exercise 72).\nLet’s consider\nx→∞\nx2 + 2x −1\nx + 2\n.\nOnce again we divide numerator and denominator by the highest power in the denominator (i.e. x)\nx→∞\nx + 2 −1\nx\n1 + 2/x\nHere the denominator has a limit (’tis 1), but the numerator does not, for if limx→∞x + 2 −1\nx existed then,\nsince limx→∞(2 −1/x) = 2 exists,\nlim\nx→∞x = lim\nx→∞\n\u0014\u0000x + 2 −1\nx\n\u0001\n−\n\u00002 −1\nx\n\u0001\u0015\nwould also have to exist, and limx→∞x doesn’t exist.", "word_count": 554, "start_char": 64278, "end_char": 66942}
{"chunk_id": "DOC0043__00034", "doc_id": "DOC0043", "chunk_index": 34, "text": "So we see that L is the limit of a fraction in which the denominator has a limit, but the numerator does\nnot. In this situation the limit L itself can never exist. If it did, then\nlim\nx→∞\n\u0000x + 2 −1\nx\n\u0001\n= lim\nx→∞\nx + 2 −1\nx\n1 + 2/x · (1 + 2/x)\nwould also have to have a limit.\n8. What’s in a name?\nThere is a big difference between the variables x and a in the formula\nlim\nx→a 2x + 1,\nnamely a is a free variable, while x is a dummy variable (or “placeholder” or a “bound variable.”)\nThe difference between these two kinds of variables is this:\n• if you replace a dummy variable in some formula consistently by some other variable then the value\nof the formula does not change. On the other hand, it never makes sense to substitute a number for\na dummy variable.\n• the value of the formula may depend on the value of the free variable.\nTo understand what this means consider the example limx→a 2x + 1 again. The limit is easy to compute:\nlim\nx→a 2x + 1 = 2a + 1.\nIf we replace x by, say u (systematically) then we get\nlim\nu→a 2u + 1\nwhich is again equal to 2a + 1. This computation says that if some number gets close to a then two times\nthat number plus one gets close to 2a + 1. This is a very wordy way of expressing the formula, and you\ncan shorten things by giving a name (like x or u) to the number which approaches a. But the result of our\ncomputation shouldn’t depend on the name we choose, i.e. it doesn’t matter if we call it x or u.\nSince the name of the variable x doesn’t matter it is called a dummy variable. Some prefer to call x a\nbound variable, meaning that in\nlim\nx→a 2x + 1\nthe x in the expression 2x + 1 is bound to the x written underneath the limit – you can’t change one without\nchanging the other.\nSubstituting a number for a dummy variable usually leads to complete nonsense. For instance, let’s try\nsetting x = 3 in our limit, i.e. what is\nlim\n3→a 2 · 3 + 1 ?\nOf course 2 · 3 + 1 = 7, but what does 7 do when 3 gets closer and closer to the number a? That’s a silly\nquestion, because 3 is a constant and it doesn’t “get closer” to some other number like a! If you ever see 3\nget closer to another number then it’s time to take a vacation.\nOn the other hand the variable a is free: you can assign it particular values, and its value will affect the\nvalue of the limit. For instance, if we set a = 3 (but leave x alone) then we get\nlim\nx→3 2x + 1\nand there’s nothing strange about that (the limit is 2 · 3 + 1 = 7, no problem.) You could substitute other\nvalues of a and you would get a different answer. In general you get 2a + 1.", "word_count": 539, "start_char": 66942, "end_char": 69497}
{"chunk_id": "DOC0043__00035", "doc_id": "DOC0043", "chunk_index": 35, "text": "or instance, if we set a = 3 (but leave x alone) then we get\nlim\nx→3 2x + 1\nand there’s nothing strange about that (the limit is 2 · 3 + 1 = 7, no problem.) You could substitute other\nvalues of a and you would get a different answer.I\n\nn general you get 2a + 1.\n\n9. Limits and Inequalities\nThis section has two theorems which let you compare limits of different functions. The properties in\nthese theorems are not formulas that allow you to compute limits like the properties (P1). . . (P6) from §5.\nInstead, they allow you to reason about limits, i.e. they let you say that this or that limit is positive, or that\nit must be the same as some other limit which you find easier to think about.\nThe first theorem should not surprise you – all it says is that bigger functions have bigger limits.\n9.1. Theorem. Let f and g be functions whose limits for x →a exist, and assume that f(x) ≤g(x)\nholds for all x. Then\nlim\nx→a f(x) ≤lim\nx→a g(x).\nA useful special case arises when you set f(x) = 0. The theorem then says that if a function g never has\nnegative values, then its limit will also never be negative.\nThe statement may seem obvious, but it still needs a proof, starting from the ε-δ definition of limit. This\nwill be done in lecture.\nHere is the second theorem about limits and inequalities.\n9.2. The Sandwich Theorem. Suppose that\nf(x) ≤g(x) ≤h(x)\n(for all x) and that\nlim\nx→a h(x).\nThen\nlim\nx→a g(x) = lim\nx→a h(x).\nThe theorem is useful when you want to know the limit of g, and when you can sandwich it between\ntwo functions f and h whose limits are easier to compute. The Sandwich Theorem looks like the first theorem\nof this section, but there is an important difference: in the Sandwich Theorem you don’t have to assume that\nthe limit of g exists. The inequalities f ≤g ≤h combined with the circumstance that f and h have the same\nlimit are enough to guarantee that the limit of g exists.\nA\nB\nC\n−1\ny = |x|\ny = −|x|\nFigure 3. Graphs of |x|, −|x| and x cos π\nx for −1.2 < x < 1.2", "word_count": 392, "start_char": 69236, "end_char": 71224}
{"chunk_id": "DOC0043__00036", "doc_id": "DOC0043", "chunk_index": 36, "text": "he inequalities f ≤g ≤h combined with the circumstance that f and h have the same\nlimit are enough to guarantee that the limit of g exists.A\n\nB\nC\n−1\ny = |x|\ny = −|x|\nFigure 3.G\n\nraphs of |x|, −|x| and x cos π\nx for −1.2 < x < 1.2\n\n9.3. Example: a Backward Cosine Sandwich. The Sandwich Theorem says that if the function\ng(x) is sandwiched between two functions f(x) and h(x) and the limits of the outside functions f and h exist\nand are equal, then the limit of the inside function g exists and equals this common value. For example\n−|x| ≤x cos 1\nx ≤|x|\nsince the cosine is always between −1 and 1. Since\nlim\nx→0 −|x| = lim\nx→0 |x| = 0\nthe sandwich theorem tells us that\nlim\nx→0 x cos 1\nx = 0.\nNote that the limit limx→0 cos(1/x) does not exist, for the same reason that the “backward sine” did not\nhave a limit for x →0 (see example 7.3). Multiplying with x changed that.\n10. Continuity\n10.1. Definition. A function g is continuous at a if\n(12)\nlim\nx→a g(x) = g(a)\nA function is continuous if it is continuous at every a in its domain.\nNote that when we say that a function is continuous on some interval it is understood that the domain\nof the function includes that interval. For example, the function f(x) = 1/x2 is continuous on the interval\n1 < x < 5 but is not continuous on the interval −1 < x < 1.\n10.2. Polynomials are continuous. For instance, let us show that P(x) = x2 + 3x is continuous at\nx = 2. To show that you have to prove that\nlim\nx→2 P(x) = P(2),\ni.e.\nlim\nx→2 x2 + 3x = 22 + 3 · 2.\nYou can do this two ways: using the definition with ε and δ (i.e. the hard way), or using the limit properties\n(P1). . . (P6) from §5 (just as good, and easier, even though it still takes a few lines to write it out – do both!)\n10.3. Rational functions are continuous. Let R(x) = P (x)\nQ(x) be a rational function, and let a be any\nnumber in the domain of R, i.e. any number for which Q(a) ̸= 0. Then one has\nlim\nx→a R(x) = lim\nx→a\nP(x)\nQ(x)\n= limx→a P(x)\nlimx→a Q(x)\nproperty (P6)\n= P(a)\nQ(a)\nP and Q are continuous\n= R(a).\nThis shows that R is indeed continuous at a.\n10.4. Some discontinuous functions. If limx→a g(x) does not exist, then it certainly cannot be equal\nto g(a), and therefore any failed limit provides an example of a discontinuous function.\nFor instance, the sign function g(x) = sign(x) from example ?? is not continuous at x = 0.\nIs the backward sine function g(x) = sin(1/x) from example ?? also discontinuous at x = 0? No, it is\nnot, for two reasons: first, the limit limx→0 sin(1/x) does not exist, and second, we haven’t even defined the\nfunction g(x) at x = 0, so even if the limit existed, we would have no value g(0) to compare it with.", "word_count": 538, "start_char": 70995, "end_char": 73662}
{"chunk_id": "DOC0043__00037", "doc_id": "DOC0043", "chunk_index": 37, "text": "o, it is\nnot, for two reasons: first, the limit limx→0 sin(1/x) does not exist, and second, we haven’t even defined the\nfunction g(x) at x = 0, so even if the limit existed, we would have no value g(0) to compare it with.\n\n10.5. How to make functions discontinuous. Here is a discontinuous function:\n(\nx2\nif x ̸= 3,\nif x = 3.\nIn other words, we take a continuous function like g(x) = x2, and change its value somewhere, e.g. at x = 3.\nThen\nlim\nx→3 f(x) = 9 ̸= 47 = f(3).\nThe reason that the limit is 9 is that our new function f(x) coincides with our old continuous function g(x)\nfor all x except x = 3. Therefore the limit of f(x) as x →3 is the same as the limit of g(x) as x →3, and\nsince g is continuous this is g(3) = 9.\n10.6. Sandwich in a bow tie. We return to the function from example ??. Consider\n(\nx cos\n\u0000 1\nx\n\u0001\nfor x ̸= 0,\nfor x = 0\nThen f is continuous at x = 0 by the Sandwich Theorem (see Example ??).\nIf we change the definition of f by picking a different value at x = 0 the new function will not be\ncontinuous, since changing f at x = 0 does not change the limit limx→0 f(x). Since this limit is zero, f(0) = 0\nis the only possible choice of f(0) which makes f continuous at x = 0.\n11. Substitution in Limits\nGiven two functions f and g one can consider their composition h(x) = f(g(x)). To compute the limit\nlim\nx→a f\n\u0000g(x)\n\u0001\nwe write u = g(x), so that we want to know\nlim\nx→a f(u) where u = g(x).\nSuppose that you can find the limits\nx→a g(x) and lim\nu→L f(u) = M.\nThen it seems reasonable that as x approaches a, u = g(x) will approach L, and f(g(x)) approaches M.\nThis is in fact a theorem:\n11.1. Theorem. If limx→a g(x) = a, and if the function f is continuous at u = L, then\nlim\nx→a f\n\u0000g(x)\n\u0001\n= lim\nu→L f(u) = f(L).\nAnother way to write this is\nlim\nx→a f\n\u0000g(x)\n\u0001\n= f\n\u0000lim\nx→a g(x)\n\u0001\n.", "word_count": 391, "start_char": 73441, "end_char": 75249}
{"chunk_id": "DOC0043__00038", "doc_id": "DOC0043", "chunk_index": 38, "text": "his is in fact a theorem:\n11.1.T\n\nheorem.I\n\nf limx→a g(x) = a, and if the function f is continuous at u = L, then\nlim\nx→a f\n\u0000g(x)\n\u0001\n= lim\nu→L f(u) = f(L).A\n\nnother way to write this is\nlim\nx→a f\n\u0000g(x)\n\u0001\n= f\n\u0000lim\nx→a g(x)\n\u0001\n.\n\n11.2. Example: compute limx→3\n√\nx3 −3x2 + 2. The given function is the composition of two functions, namely\np\nx3 −3x2 + 2 = √u, with u = x3 −3x2 + 2,\nor, in function notation, we want to find limx→3 h(x) where\nh(x) = f(g(x)), with g(x) = x3 −3x2 + 2 and g(x) = √x.\nEither way, we have\nlim\nx→3 x3 −3x2 + 2 = 2\nand\nlim\nu→2\n√u =\n√\n2.\nYou get the first limit from the limit properties (P1). . . (P5). The second limit says that taking the square\nroot is a continuous function, which it is. We have not proved that (yet), but this particular limit is the one\nfrom example 6.3. Putting these two limits together we conclude that the limit is\n√\n2.\nNormally, you write this whole argument as follows:\nlim\nx→3\np\nx3 −3x2 + 2 =\nq\nlim\nx→3 x3 −3x2 + 2 =\n√\n2,\nwhere you must point out that f(x) = √x is a continuous function to justify the first step.\nAnother possible way of writing this is\nlim\nx→3\np\nx3 −3x2 + 2 = lim\nu→2\n√u =\n√\n2,\nwhere you must say that you have substituted u = x3 −3x2 + 2.\n12. Exercises\nFind the following limits.\n52.\nlim\nx→−7(2x + 5)\n53.\nlim\nx→7−(2x + 5)\n54.\nlim\nx→−∞(2x + 5)\n55.\nlim\nx→−4(x + 3)2006\n56.\nlim\nx→−4(x + 3)2007\n57.\nlim\nx→−∞(x + 3)2007\n58. lim\nt→1\nt2 −1\n59. lim\nt↗1\nt2 −1\n60.\nlim\nt→−1\nt2 −1\n61.\nlim\nx→∞\nx2 + 3\nx2 + 4\n62.\nlim\nx→∞\nx5 + 3\nx2 + 4\n63.\nlim\nx→∞\nx2 + 1\nx5 + 2\n64.\nlim\nx→∞\n(2x + 1)4\n(3x2 + 1)2\n65.\nlim\nu→∞\n(2u + 1)4\n(3u2 + 1)2\n66. lim\nt→0\n(2t + 1)4\n(3t2 + 1)2\n67. What are the coordinates of the points labeled A, . . . ,\nE in Figure 2 (the graph of y = sin π/x).\n68. If limx→a f(x) exists then f is continuous at x = a.\nTrue or false?\n69. Give two examples of functions for which limx↘0 f(x)\ndoes not exist.\n70. Group Problem.\nIf limx→0 f(x) and limx→0 g(x) both do not exist,\nthen limx→0\n\u0000f(x) + g(x)\n\u0001 also does not exist. True or\nfalse?\n71. Group Problem.\nIf limx→0 f(x) and limx→0 g(x) both do not exist,\nthen limx→0(f(x)/g(x)) also does not exist. True or\nfalse?\n72. Group Problem.\nIn the text we proved that limx→∞1\nx = 0. Show\nthat this implies that limx→∞x does not exist. Hint:\nSuppose limx→∞x = L for some number L. Apply the\nlimit properties to limx→∞x · 1\nx.\n73. Evaluate lim\nx→9\n√x −3\nx −9 . Hint: Multiply top and bottom\nby √x + 3.", "word_count": 533, "start_char": 75025, "end_char": 77427}
{"chunk_id": "DOC0043__00039", "doc_id": "DOC0043", "chunk_index": 39, "text": "roup Problem.I\n\nn the text we proved that limx→∞1\nx = 0.S\n\nhow\nthat this implies that limx→∞x does not exist.H\n\nint:\nSuppose limx→∞x = L for some number L.A\n\npply the\nlimit properties to limx→∞x · 1\nx.\n73.E\n\nvaluate lim\nx→9\n√x −3\nx −9 .H\n\nint: Multiply top and bottom\nby √x + 3.\n\nO\nA\nB\nC\nθ\ntan θ\nsin θ\nProving lim\nx→0\nsin θ\nθ\n= 1\nThe circular wedge OAC contains the\ntriangle OAC and is contained in the right\ntriangle OAB.\nThe area of triangle OAC is 1\n2 sin θ.\nThe area of circular wedge OAC is 1\n2θ.\nThe area of right triangle OAB is 1\n2 tan θ.\nHence one has sin θ < θ < tan θ for all\nangles 0 < θ < π/2.\n74. Evaluate lim\nx→2\nx −1\nx −2 .\n75. Evaluate lim\nx→2\n√x −\n√\nx −2\n.\n76. A function f is defined by\n\n\n\n\n\nx3\nfor x < −1\nax + b\nfor −1 ≤x < 1\nx2 + 2\nfor x ≥1.\nwhere a and b are constants. The function f is continuous.\nWhat are a and b?\n77. Find a constant k such that the function\n(\n3x + 2\nfor x < 2\nx2 + k\nfor x ≥2.\nis continuous. Hint: Compute the one-sided limits.\n78. Find constants a and c such that the function\n\n\n\n\n\nx3 + c\nax + c2\nfor 0 ≤x < 1\narctan x\nfor x ≥1.\nis continuous for all x.\n13. Two Limits in Trigonometry\nIn this section we’ll derive a few limits involving the trigonometric functions. You can think of them as\nsaying that for small angles θ one has\nsin θ ≈θ\nand\ncos θ ≈1 −1\n2θ2.\nWe will use these limits when we compute the derivatives of Sine, Cosine and Tangent.\n13.1. Theorem. lim\nθ→0\nsin θ\nθ\n= 1.\nProof. The proof requires a few sandwiches and some geometry.\nWe begin by only considering positive angles, and in fact we will only consider angles 0 < θ < π/2.\nSince the wedge OAC contains the triangle OAC its area must be larger. The area of the wedge is 1\n2θ\nand the area of the triangle is 1\n2 sin θ, so we find that\n(13)\n0 < sin θ < θ for 0 < θ < π\n2 .\nThe Sandwich Theorem implies that\n(14)\nlim\nθ↘0 sin θ = 0.\nMoreover, we also have\n(15)\nlim\nθ↘0 cos θ = lim\nθ↘0\np\n1 −sin2 θ = 1.", "word_count": 445, "start_char": 77149, "end_char": 79071}
{"chunk_id": "DOC0043__00040", "doc_id": "DOC0043", "chunk_index": 40, "text": "he Sandwich Theorem implies that\n(14)\nlim\nθ↘0 sin θ = 0.M\n\noreover, we also have\n(15)\nlim\nθ↘0 cos θ = lim\nθ↘0\np\n1 −sin2 θ = 1.\n\nNext we compare the areas of the wedge OAC and the larger triangle OAB. Since OAB has area 1\n2 tan θ\nwe find that\nθ < tan θ\nfor 0 < θ < π\n2 . Since tan θ = sin θ\ncos θ we can multiply with cos θ and divide by θ to get\ncos θ < sin θ\nθ\nfor 0 < θ < π\nIf we go back to (15) and divide by θ, then we get\ncos θ < sin θ\nθ\n< 1\nThe Sandwich Theorem can be used once again, and now it gives\nlim\nθ↘0\nsin θ\nθ\n= 1.\nThis is a one-sided limit. To get the limit in which θ ↗0, you use that sin θ is an odd function.\n□\n13.2. An example. We will show that\n(16)\nlim\nθ→0\n1 −cos θ\nθ2\n= 1\n2.\nThis follows from sin2 θ + cos2 θ = 1. Namely,\n1 −cos θ\nθ2\n=\n1 −cos2 θ\nθ2\n=\nsin2 θ\nθ2\n=\n\u001asin θ\nθ\n\u001b2\n.\nWe have just shown that cos θ →1 and sin θ\nθ\n→1 as θ →0, so (16) follows.\n14. Exercises\nFind each of the following limits or show that it does not\nexist. Distinguish between limits which are infinite and\nlimits which do not exist.\n79.\nlim\nα→0\nsin 2α\nsin α (two ways: with and without the double\nangle formula!)\n80.\nlim\nx→0\nsin 3x\n2x\n.\n81.\nlim\nθ→0\ntan θ\nθ\n.\n82.\nlim\nα→0\ntan 4α\nsin 2α .\n83.\nlim\nx→0\n1 −cos x\nx sin x .\n84.\nlim\nθ→π/2\n1 −sin θ\nθ −π/2\n85.\nlim\nx→∞\n2x3 + 3x2 cos x\n(x + 2)3\n.\n86.\nlim\nx→0\nsin2 x\n1 −cos x.\n87.\nlim\nx→0\nsin(x2)\nx2\n.\n88.\nlim\nx→0\nx(1 −cos x)\ntan3 x\n.\n89.\nlim\nx→0\nsin(x2)\n1 −cos x.\n90.\nlim\nx→π/2\nx −π\ncos x .\n91.\nlim\nx→π/2(x −π\n2 ) tan x.\n92.\nlim\nx→0\ncos x\nx2 + 9.\n93.\nlim\nx→π\nsin x\nx −π .\n94.\nlim\nx→0\nsin x\nx + sin x.\n95. A = lim\nx→∞\nsin x\nx\n.\n(!!)\n96. B = lim\nx→∞\ncos x\nx\n.\n(!! again)", "word_count": 415, "start_char": 78945, "end_char": 80551}
{"chunk_id": "DOC0043__00041", "doc_id": "DOC0043", "chunk_index": 41, "text": "= lim\nx→∞\nsin x\nx\n.\n(!!)\n96.B\n\n= lim\nx→∞\ncos x\nx\n.\n(!! again)\n\n97. Is there a constant k such that the function\n(\nsin(1/x)\nfor x ̸= 0\nk\nfor x = 0.\nis continuous? If so, find it; if not, say why.\n98. Find a constant A so that the function\n\n\n\nsin x\n2x\nfor x ̸= 0\nA\nwhen x = 0\n99. Compute limx→∞x sin π\nx and limx→∞x tan π\nx . (Hint:\nsubstitute something).\n100. Group Problem.\n(Geometry & Trig review) Let An be the area of the\nregular n-gon inscribed in the unit circle, and let Bn be\nthe area of the regular n-gon whose inscribed circle has\nradius 1.\n(a) Show that An < π < Bn.\n(b) Show that\nAn = n\n2 sin 2π\nn and Bn = n tan π\nn\n(c) Compute limn→∞An and limn→∞Bn.\nHere is a picture of A12, B6 and π:\nOn a historical note: Archimedes managed to compute A96 and B96 and by doing this got the most accurate\napproximation for π that was known in his time. See also:\nhttp://www-history.mcs.st-andrews.ac.uk/\nHistTopics/Pi_through_the_ages.html", "word_count": 196, "start_char": 80490, "end_char": 81430}
{"chunk_id": "DOC0043__00042", "doc_id": "DOC0043", "chunk_index": 42, "text": "ere is a picture of A12, B6 and π:\nOn a historical note: Archimedes managed to compute A96 and B96 and by doing this got the most accurate\napproximation for π that was known in his time.S\n\nee also:\nhttp://www-history.mcs.st-andrews.ac.uk/\nHistTopics/Pi_through_the_ages.html\n\nCHAPTER 4\nDerivatives (2)\n“Leibniz never thought of the derivative as a limit”\nhttp://www.gap-system.org/~history/Biographies/Leibniz.html\nIn chapter 2 we saw two mathematical problems which led to expressions of the form 0\n0. Now that we know\nhow to handle limits, we can state the definition of the derivative of a function. After computing a few\nderivatives using the definition we will spend most of this section developing the differential calculus, which is\na collection of rules that allow you to compute derivatives without always having to use basic definition.\n1. Derivatives Defined\n1.1. Definition. Let f be a function which is defined on some interval (c, d) and let a be some number\nin this interval.\nThe derivative of the function f at a is the value of the limit\n(17)\nx→a\nx −a\n.\nf is said to be differentiable at a if this limit exists.\nf is called differentiable on the interval (c, d) if it is differentiable at every point a in (c, d).\n1.2. Other notations. One can substitute x = a + h in the limit (17) and let h →0 instead of x →a.\nThis gives the formula\n(18)\nh→0\nf(a + h) −f(a)\nh\n,\nOften you will find this equation written with x instead of a and ∆x instead of h, which makes it look like\nthis:\n∆x→0\nf(x + ∆x) −f(x)\n∆x\n.\nThe interpretation is the same as in equation (6) from §4. The numerator f(x + ∆x) −f(x) represents the\namount by which the function value of f changes if one increases its argument x by a (small) amount ∆x. If\nyou write y = f(x) then we can call the increase in f\n∆y = f(x + ∆x) −f(x),\nso that the derivative f ′(x) is\n∆x→0\n∆y\n∆x.\nGottfried Wilhelm von Leibniz, one of the inventors of calculus, came up with the idea that one should\nwrite this limit as\ndy\ndx = lim\n∆x→0\n∆y\n∆x,\nthe idea being that after letting ∆x go to zero it didn’t vanish, but instead became an infinitely small quantity\nwhich Leibniz called “dx.” The result of increasing x by this infinitely small quantity dx is that y = f(x)\nincreased by another infinitely small quantity dy. The ratio of these two infinitely small quantities is what we\ncall the derivative of y = f(x).", "word_count": 435, "start_char": 81156, "end_char": 83523}
{"chunk_id": "DOC0043__00043", "doc_id": "DOC0043", "chunk_index": 43, "text": "he ratio of these two infinitely small quantities is what we\ncall the derivative of y = f(x).\n\nThere are no “infinitely small real numbers,” and this makes Leibniz’ notation difficult to justify. In the\n20th century mathematicians have managed to create a consistent theory of “infinitesimals” which allows you\nto compute with “dx and dy” as Leibniz and his contemporaries would have done. This theory is called “non\nstandard analysis.” We won’t mention it any further1. Nonetheless, even though we won’t use infinitely small\nnumbers, Leibniz’ notation is very useful and we will use it.\n2. Direct computation of derivatives\n2.1. Example – The derivative of f(x) = x2 is f ′(x) = 2x . We have done this computation before\nin §2. The result was\nh→0\nf(x + h) −f(x)\nh\n= lim\nh→0\n(x + h)2 −x2\nh\n= lim\nh→0(2x + h) = 2x.\nLeibniz would have written\ndx2\ndx = 2x.\n2.2. The derivative of g(x) = x is g′(x) = 1 . Indeed, one has\ng′(x) = lim\nh→0\ng(x + h) −g(x)\nh\n= lim\nh→0\n(x + h) −x\nh\n= lim\nh→0\nh\nh = 1.\nIn Leibniz’ notation:\ndx\ndx = 1.\nThis is an example where Leibniz’ notation is most misleading, because if you divide dx by dx then you\nshould of course get 1. Nonetheless, this is not what is going on. The expression dx\ndx is not really a fraction\nsince there are no two “infinitely small” quantities dx which we are dividing.\n2.3. The derivative of any constant function is zero . Let k(x) = c be a constant function. Then\nwe have\nk′(x) = lim\nh→0\nk(x + h) −k(x)\nh\n= lim\nh→0\nc −c\nh\n= lim\nh→0 0 = 0.\nLeibniz would have said that if c is a constant, then\ndc\ndx = 0.\n2.4. Derivative of xn for n = 1, 2, 3, . . . . To differentiate f(x) = xn one proceeds as follows:\nx→a\nx −a\n= lim\nx→a\nx −a .\nWe need to simplify the fraction (xn −an)/(x −a). For n = 2 we have\nx2 −a2\nx −a\n= x + a.\nFor n = 1, 2, 3, . . . the geometric sum formula tells us that\n(19)\nx −a\n= xn−1 + xn−2a + xn−3a2 + · · · + xan−2 + an−1.\n1But if you want to read more on this you should see Keisler’s calculus text at\nhttp://www.math.wisc.edu/~keisler/calc.html\nI would not recommend using Keisler’s text and this text at the same time, but if you like math you should remember that it\nexists, and look at it (later, say, after you pass 221.)", "word_count": 453, "start_char": 83430, "end_char": 85626}
{"chunk_id": "DOC0043__00044", "doc_id": "DOC0043", "chunk_index": 44, "text": "If you don’t remember the geometric sum formula, then you could also just verify (19) by carefully multiplying\nboth sides with x −a. For instance, when n = 3 you would get\nx × (x2 + xa + a2)\n=\nx3\n+ax2\n+a2x\n−a × (x2 + xa + a2)\n=\n−ax2\n−a2x\n−a3\n(x −a) × (x2 + ax + a2)\n=\nx3\n−a3\nWith formula (19) in hand we can now easily find the derivative of xn:\nx→a\nx −a\n= lim\nx→a\n\b\nxn−1 + xn−2a + xn−3a2 + · · · + xan−2 + an−1\n= an−1 + an−2a + an−3a2 + · · · + a an−2 + an−1.\nHere there are n terms, and they all are equal to an−1, so the final result is\nf ′(a) = nan−1.\nOne could also write this as f ′(x) = nxn−1, or, in Leibniz’ notation\ndxn\ndx = nxn−1.\nThis formula turns out to be true in general, but here we have only proved it for the case in which n is a\npositive integer.\n3. Differentiable implies Continuous\n3.1. Theorem. If a function f is differentiable at some a in its domain, then f is also continuous at a.\nProof. We are given that\nlim\nx→a\nx −a\nexists, and we must show that\nlim\nx→a f(x) = f(a).\nThis follows from the following computation\nlim\nx→a\n\u0000f(x) −f(a) + f(a)\n\u0001\n(algebra)\n= lim\nx→a\nx −a\n· (x −a) + f(a)\n(more algebra)\n=\n\u001a\nlim\nx→a\nx −a\n\u001b\n· lim\nx→a (x −a) + lim\nx→a f(a)\n(Limit Properties)\n= f ′(a) · 0 + f(a)\n(f ′(a) exists)\n= f(a).\n□\n4. Some non-differentiable functions\n4.1. A graph with a corner. Consider the function\nf(x) = |x| =\n(\nx\nfor x ≥0,\n−x\nfor x < 0.\nThis function is continuous at all x, but it is not differentiable at x = 0.", "word_count": 324, "start_char": 85626, "end_char": 87073}
{"chunk_id": "DOC0043__00045", "doc_id": "DOC0043", "chunk_index": 45, "text": "ome non-differentiable functions\n4.1.A\n\ngraph with a corner.C\n\nonsider the function\nf(x) = |x| =\n(\nx\nfor x ≥0,\n−x\nfor x < 0.T\n\nhis function is continuous at all x, but it is not differentiable at x = 0.\n\nTo see this try to compute the derivative at 0,\nf ′(0) = lim\nx→0\n|x| −|0|\nx −0\n= lim\nx→0\n|x|\nx = lim\nx→0 sign(x).\nWe know this limit does not exist (see §7.2)\nIf you look at the graph of f(x) = |x| then you see what is wrong: the graph has a corner at the origin\nand it is not clear which line, if any, deserves to be called the tangent to the graph at the origin.\ny = |x|\nFigure 1. The graph of y = |x| has no tangent at the origin.\n4.2. A graph with a cusp. Another example of a function without a derivative at x = 0 is\np\n|x|.\nWhen you try to compute the derivative you get this limit\nf ′(0) = lim\nx→0\np\n|x|\nx\n= ?\nThe limit from the right is\nlim\nx↘0\np\n|x|\nx\n= lim\nx↘0\n√x,\nwhich does not exist (it is “+∞”). Likewise, the limit from the left also does not exist (’tis “−∞). Nonetheless,\na drawing for the graph of f suggests an obvious tangent to the graph at x = 0, namely, the y-axis. That\nobservation does not give us a derivative, because the y-axis is vertical and hence has no slope.\n4.3. A graph with absolutely no tangents, anywhere. The previous two examples were about\nfunctions which did not have a derivative at x = 0. In both examples the point x = 0 was the only point where\nthe function failed to have a derivative. It is easy to give examples of functions which are not differentiable\nat more than one value of x, but here I would like to show you a function f which doesn’t have a derivative\nanywhere in its domain.\nTo keep things short I won’t write a formula for the function, and merely show you a graph. In this\ngraph you see a typical path of a Brownian motion, i.e. t is time, and x(t) is the position of a particle which\nundergoes a Brownian motion – come to lecture for further explanation (see also the article on wikipedia).\nTo see a similar graph check the Dow Jones or Nasdaq in the upper left hand corner of the web page at\nhttp://finance.yahoo.com in the afternoon on any weekday.", "word_count": 429, "start_char": 86871, "end_char": 88988}
{"chunk_id": "DOC0043__00046", "doc_id": "DOC0043", "chunk_index": 46, "text": "o see a similar graph check the Dow Jones or Nasdaq in the upper left hand corner of the web page at\nhttp://finance.yahoo.com in the afternoon on any weekday.\n\ny =\np\n|x|\nThe tangent is vertical\nFigure 2. Tangent to the graph of y = |x|1/2 at the origin\n5. Exercises\n101. Compute the derivative of the following functions\nf(x) = x2 −2x\ng(x) = 1\nx\nk(x) = x3 −17x\nu(x) =\n1 + x\nv(x) = √x\nw(x) =\n√x\nusing either (17) or (18).\n102. Which of the following functions is differentiable at\nx = 0?\nf(x) = x|x|,\ng(x) = x\np\n|x|,\nh(x) = x + |x|,\nk(x) = x2 sin π\nx ,\nl(x) = x sin π\nx .\nThese formulas do not define k and lat x = 0. We define\nk(0) = l(0) = 0.\n103. For which value(s) is the function defined by\n(\nax + b\nx −x2\nfor x ≥0\n104. For which value(s) is the function defined by\n(\nax2 + b\nfor x < 1\nx −x2\nfor x ≥1\n105. For which value(s) is the function defined by\n(\nax2\nfor x < 2\nx + b\nfor x ≥2\n106. Group Problem.\nTrue or false:\nIf a function f is continuous at some\nx = a then it must also be differentiable at x = a?\n107. Group Problem.\nTrue or false:\nIf a function f is differentiable at\nsome x = a then it must also be continuous at x = a?\nt\nx(t)\nFigure 3. A Brownian motion. Note how the graph doesn’t seem to have a a tangent anywhere at all.", "word_count": 281, "start_char": 88830, "end_char": 90071}
{"chunk_id": "DOC0043__00047", "doc_id": "DOC0043", "chunk_index": 47, "text": "roup Problem.T\n\nrue or false:\nIf a function f is differentiable at\nsome x = a then it must also be continuous at x = a?\nt\nx(t)\nFigure 3.A\n\nBrownian motion.N\n\note how the graph doesn’t seem to have a a tangent anywhere at all.\n\n6. The Differentiation Rules\nYou could go on and compute more derivatives from the definition. Each time you would have to compute\na new limit, and hope that there is some trick that allows you to find that limit. This is fortunately not\nnecessary. It turns out that if you know a few basic derivatives (such as dxn/dx = nxn−1) the you can find\nderivatives of arbitrarily complicated functions by breaking them into smaller pieces. In this section we’ll\nlook at rules which tell you how to differentiate a function which is either the sum, difference, product or\nquotient of two other functions.\nConstant rule:\nc′ = 0\ndc\ndx = 0\nSum rule:\n(u ± v)′ = u′ ± v′\ndu ± v\ndx\n= du\ndx ± dv\ndx\nProduct rule:\n(u · v)′ = u′ · v + u · v′\nduv\ndx = du\ndxv + udv\ndx\nQuotient rule:\n\u0010u\nv\n\u0011′\n= u′ · v −u · v′\nv2\ndu\nv\ndx =\nv du\ndx −udv\ndx\nv2\nTable 1. The differentiation rules\nThe situation is analogous to that of the “limit-properties” (P1). . . (P6) from the previous chapter which\nallowed us to compute limits without always having to go back to the epsilon-delta definition.\n6.1. Sum, product and quotient rules. In the following c and n are constants, u and v are functions\nof x, and ′ denotes differentiation. The Differentiation Rules in function notation, and Leibniz notation, are\nlisted in figure 1.\nNote that we already proved the Constant Rule in example 2.2. We will now prove the sum, product and\nquotient rules.\n6.2. Proof of the Sum Rule. Suppose that f(x) = u(x)+v(x) for all x where u and v are differentiable.\nThen\nx→a\nx −a\n(definition of f ′)\n= lim\nx→a\n\u0000u(x) + v(x)\n\u0001\n−\n\u0000u(a) + v(a)\n\u0001\nx −a\n(use f = u + v)\n= lim\nx→a\n\u0012u(x) −u(a)\nx −a\n+ v(x) −v(a)\nx −a\n\u0013\n(algebra)\n= lim\nx→a\nx −a\n+ lim\nx→a\nx −a\n(limit property)\n= u′(a) + v′(a)\n(definition of u′, v′)\n6.3. Proof of the Product Rule. Let f(x) = u(x)v(x). To find the derivative we must express the\nchange of f in terms of the changes of u and v\nf(x) −f(a) = u(x)v(x) −u(a)v(a)\n= u(x)v(x) −u(x)v(a) + u(x)v(a) −u(a)v(a)\n= u(x)\n\u0000v(x) −v(a)\n\u0001\n+\n\u0000u(x) −u(a)\n\u0001\nv(a)", "word_count": 452, "start_char": 89846, "end_char": 92080}
{"chunk_id": "DOC0043__00048", "doc_id": "DOC0043", "chunk_index": 48, "text": "roof of the Product Rule.L\n\net f(x) = u(x)v(x).T\n\no find the derivative we must express the\nchange of f in terms of the changes of u and v\nf(x) −f(a) = u(x)v(x) −u(a)v(a)\n= u(x)v(x) −u(x)v(a) + u(x)v(a) −u(a)v(a)\n= u(x)\n\u0000v(x) −v(a)\n\u0001\n+\n\u0000u(x) −u(a)\n\u0001\nv(a)\n\nNow divide by x −a and let x →a:\nlim\nx→a\nx −a\n= lim\nx→a u(x)v(x) −v(a)\nx −a\n+ u(x) −u(a)\nx −a\nv(a)\n(use the limit properties)\n=\n\u0010\nlim\nx→a u(x)\n\u0011\u0010\nlim\nx→a\nx −a\n\u0011\n+\n\u0010\nlim\nx→a\nx −a\n\u0011\nv(a)\n= u(a)v′(a) + u′(a)v(a),\nas claimed. In this last step we have used that\nlim\nx→a\nx −a\n= u′(a)\nand\nlim\nx→a\nx −a\n= v′(a)\nand also that\nlim\nx→a u(x) = u(a)\nThis last limit follows from the fact that u is continuous, which in turn follows from the fact that u is\ndifferentiable.\n6.4. Proof of the Quotient Rule . We can break the proof into two parts. First we do the special\ncase where f(x) = 1/v(x), and then we use the product rule to differentiate\nf(x) = u(x)\nv(x) = u(x) ·\nv(x).\nSo let f(x) = 1/v(x). We can express the change in f in terms of the change in v\nf(x) −f(a) =\nv(x) −\nv(a) = v(x) −v(a)\nv(x)v(a) .\nDividing by x −a we get\nx −a\n=\nv(x)v(a)\nx −a\n.\nNow we want to take the limit x →a. We are given the v is differentiable, so it must also be continuous and\nhence\nlim\nx→a v(x) = v(a).\nTherefore we find\nlim\nx→a\nx −a\n= lim\nx→a\nv(x)v(a) lim\nx→a\nx −a\n= v′(a)\nv(a)2 .\nThat completes the first step of the proof. In the second step we use the product rule to differentiate f = u/v\nf ′ =\n\u0010u\nv\n\u0011′\n=\n\u0012\nu · 1\nv\n\u0013′\n= u′ · 1\nv + u ·\n\u00121\nv\n\u0013′\n= u′\nv −u v′\nv2 = u′v −uv′\nv2\n.\n6.5. A shorter, but not quite perfect derivation of the Quotient Rule . The Quotient Rule\ncan be derived from the Product Rule as follows: if w = u/v then\n(20)\nw · v = u\nBy the product rule we have\nw′ · v + w · v′ = u′,\nso that\nw′ = u′ −w · v′\nv\n= u′ −(u/v) · v′\nv\n= u′ · v −u · v′\nv2\n.\nUnlike the proof in §6.4 above, this argument does not prove that w is differentiable if u and v are. It only\nsays that if the derivative exists then it must be what the Quotient Rule says it is.\nThe trick which is used here, is a special case of a method called “implicit differentiation.” We have an\nequation (20) which the quotient w satisfies, and from by differentiating this equation we find w′.", "word_count": 495, "start_char": 91826, "end_char": 94024}
{"chunk_id": "DOC0043__00049", "doc_id": "DOC0043", "chunk_index": 49, "text": "t only\nsays that if the derivative exists then it must be what the Quotient Rule says it is.T\n\nhe trick which is used here, is a special case of a method called “implicit differentiation.” We have an\nequation (20) which the quotient w satisfies, and from by differentiating this equation we find w′.\n\n6.6. Differentiating a constant multiple of a function . Note that the rule\n(cu)′ = cu′\nfollows from the Constant Rule and the Product Rule.\n6.7. Picture of the Product Rule. If u and v are quantities which depend on x, and if increasing x\nby ∆x causes u and v to change by ∆u and ∆v, then the product of u and v will change by\n(21)\n∆(uv) = (u + ∆u)(v + ∆v) −uv = u∆v + v∆u + ∆u∆v.\nIf u and v are differentiable functions of x, then the changes ∆u and ∆v will be of the same order of magnitude\nas ∆x, and thus one expects ∆u∆v to be much smaller. One therefore ignores the last term in (21), and thus\narrives at\n∆(uv) = u∆v + v∆u.\nLeibniz would now divide by ∆x and replace ∆’s by d’s to get the product rule:\n∆(uv)\n∆x\n= u∆v\n∆x + v ∆u\n∆x.\nu\n∆u\nv\n∆v\nuv\nv∆u\nu∆v\n∆u∆v\nFigure 4. The Product Rule. How much does the area of a rectangle change if its sides u and v are\nincreased by ∆u and ∆v?\nMost of the increase is accounted for by the two thin rectangles whose areas\nare u∆v and v∆u. So the increase in area is approximately u∆v + v∆u, which explains why the product\nrule says (uv)′ = uv′ + vu′.\n7. Differentiating powers of functions\n7.1. Product rule with more than one factor. If a function is given as the product of n functions,\ni.e.\nf(x) = u1(x) × u2(x) × · · · × un(x),\nthen you can differentiate it by applying the product rule n −1 times (there are n factors, so there are n −1\nmultiplications.)\nAfter the first step you would get\nf ′ = u′\n\u0000u2 · · · un\n\u0001\n+ u1\n\u0000u2 · · · un\n\u0001′.\nIn the second step you apply the product rule to (u2u3 · · · un)′. This yields\nf ′ = u′\n1u2 · · · un + u1\n\u0002\nu′\n2u3 · · · un + u2(u3 · · · un)′\u0003\n= u′\n1u2 · · · un + u1u′\n2u3 · · · un + u1u2\n\u0000u3 · · · un\n\u0001′.", "word_count": 433, "start_char": 93725, "end_char": 95714}
{"chunk_id": "DOC0043__00050", "doc_id": "DOC0043", "chunk_index": 50, "text": "his yields\nf ′ = u′\n1u2 · · · un + u1\n\u0002\nu′\n2u3 · · · un + u2(u3 · · · un)′\u0003\n= u′\n1u2 · · · un + u1u′\n2u3 · · · un + u1u2\n\u0000u3 · · · un\n\u0001′.\n\nContinuing this way one finds after n −1 applications of the product rule that\n(22)\n\u0000u1 · · · un\n\u0001′ = u′\n1u2 · · · un + u1u′\n2u3 · · · un + · · · + u1u2u3 · · · u′\nn.\n7.2. The Power rule . If all n factors in the previous paragraph are the same, so that the function f\nis the nth power of some other function,\n\u0000u(x)\n\u0001n,\nthen all terms in the right hand side of (22) are the same, and, since there are n of them, one gets\nf ′(x) = nun−1(x)u′(x),\nor, in Leibniz’ notation,\n(23)\ndun\ndx = nun−1 du\ndx.\n7.3. The Power Rule for Negative Integer Exponents . We have just proved the power rule (23)\nassuming n is a positive integer. The rule actually holds for all real exponents n, but the proof is harder.\nHere we prove the Power Rule for negative exponents using the Quotient Rule. Suppose n = −m where\nm is a positive integer. Then the Quotient Rule tells us that\n(un)′ =\n\u0000u−m\u0001′ =\n\u0012 1\num\n\u0013′\nQ.R.\n= −(um)′\n(um)2 .\nSince m is a positive integer, we can use (23), so (um)′ = mum−1, and hence\n(un)′ = −mum−1 · u′\nu2m\n= −mu−m−1 · u′ = nun−1u′.\n7.4. The Power Rule for Rational Exponents . So far we have proved that the power law holds if\nthe exponent n is an integer.\nWe will now see how you can show that the power law holds even if the exponent n is any fraction,\nn = p/q. The following derivation contains the trick called implicit differentiation which we will study in\nmore detail in Section 15.\nSo let n = p/q where p and q are integers and consider the function\nw(x) = u(x)p/q.\nAssuming that both u and w are differentiable functions, we will show that\n(24)\nw′(x) = p\nq u(x)\np\nq −1u′(x)\nRaising both sides to the qth power gives\nw(x)q = u(x)p.\nHere the exponents p and q are integers, so we may apply the Power Rule to both sides. We get\nqwq−1 · w′ = pup−1 · u′.\nDividing both sides by qwq−1 and substituting up/q for w gives\nw′ = pup−1 · u′\nqwq−1\n= pup−1 · u′\nqup(q−1)/q = pup−1 · u′\nqup−(p/q) = p\nq · u(p/q)−1 · u′\nwhich is the Power Rule for n = p/q.\nThis proof is flawed because we did not show that w(x) = u(x)p/q is differentiable: we only showed what\nthe derivative should be, if it exists.", "word_count": 485, "start_char": 95577, "end_char": 97812}
{"chunk_id": "DOC0043__00051", "doc_id": "DOC0043", "chunk_index": 51, "text": "his proof is flawed because we did not show that w(x) = u(x)p/q is differentiable: we only showed what\nthe derivative should be, if it exists.\n\n7.5. Derivative of xn for integer n . If you choose the function u(x) in the Power Rule to be u(x) = x,\nthen u′(x) = 1, and hence the derivative of f(x) = u(x)n = xn is\nf ′(x) = nu(x)n−1u′(x) = nxn−1 · 1 = nxn−1.\nWe already knew this of course.\n7.6. Example – differentiate a polynomial . Using the Differentiation Rules you can easily differentiate any polynomial and hence any rational function. For example, using the Sum Rule, the Power Rule\nwith u(x) = x, the rule (cu)′ = cu′, the derivative of the polynomial\nf(x) = 2x4 −x3 + 7\nis\nf ′(x) = 8x3 −3x2.\n7.7. Example – differentiate a rational function. By the Quotient Rule the derivative of the\ng(x) = 2x4 −x3 + 7\n1 + x2\nis\ng′(x) = (8x3 −3x2)(1 + x2) −(2x4 −x3 + 7)2x\n= 6x5 −x4 + 8x3 −3x2 −14x\n.\nIf you compare this example with the previous then you see that polynomials simplify when you differentiate\nthem while rational functions become more complicated.\n7.8. Derivative of the square root . The derivative of f(x) = √x = x1/2 is\nf ′(x) = 1\n2x1/2−1 = 1\n2x−1/2 =\n2x1/2 =\n2√x\nwhere we used the power rule with n = 1/2 and u(x) = x.\n8. Exercises\n108. Let f(x) = (x2 + 1)(x3 + 3). Find f ′(x) in two ways:\n(a) by multiplying and then differentiating,\n(b) by using the product rule.\nAre your answers the same?\n109. Let f(x) = (1 + x2)4. Find f ′(x) in two ways, first by\nexpanding to get an expression for f(x) as a polynomial\nin x and then differentiating, and then by using the power\nrule. Are the answers the same?\n110. Prove the statement in §6.6, i.e. show that (cu)′ =\nc(u′) follows from the product rule.\nCompute the derivatives of the following functions.\n(try to simplify your answers)\n111. f(x) = x + 1 + (x + 1)2\n112. f(x) = x −2\nx4 + 1\n113. f(x) =\n\u00001\n1 + x\n\u0001−1\n114. f(x) =\np\n1 −x2\n115. f(x) = ax + b\ncx + d\n116. f(x) =\n117. f(x) =\nx\n1 + √x\n118. f(x) =\nr\n1 −x\n1 + x\n119. f(x) =\n3q\nx + √x\n120. φ(t) =\nt\n1 +\n√\nt\n121. g(s) =\nr\n1 −s\n1 + s\n122. h(ρ) =\n3q\nρ + √ρ\n123. Group Problem.", "word_count": 445, "start_char": 97670, "end_char": 99755}
{"chunk_id": "DOC0043__00052", "doc_id": "DOC0043", "chunk_index": 52, "text": "roup Problem.\n\nUsing derivatives to approximate numbers.\n(a) Find the derivative of f(x) = x4/3.\n(b) Use (a) to estimate the number\n1274/3 −1254/3\napproximately without a calculator. Your answer should\nhave the form p/q where p and q are integers. [Hint:\nNote that 53 = 125 and take a good look at equation\n(17).]\n(c) Approximate in the same way the numbers\n√\n143 and\n√\n145 (Hint: 12 × 12 = 144).\n124. Group Problem.\n(Making the product and quotient rules look nicer.)\nInstead of looking at the derivative of a function you can\nlook at the ratio of its derivative to the function itself, i.e.\nyou can compute f ′/f. This quantity is called the logarithmic derivative of the function f for reasons that\nwill become clear later this semester.\n(a) Compute the logarithmic derivative of these functions (i.e. find f ′(x)/f(x))\nF(x) = x,\ng(x) = 3x,\nh(x) = x2\nk(x) = −x2,\nl(x) = 2007x2,\nm(x) = x2007\n(b) Show that for any pair of functions u and v one\nhas\n(uv)′\nuv\n= u′\nu + v′\nv\n(u/v)′\nu/v\n= u′\nu −v′\nv\n\u0000un\u0001′\nun\n= n u′\nu\n125. (a) Find f ′(x) and g′(x) if\nf(x) = 1 + x2\n2x4 + 7,\ng(x) = 2x4 + 7\n1 + x2 .\nNote that f(x) = 1/g(x).\n(b) Is it true that f ′(x) = 1/g′(x)?\n(c) Is it true that f(x) = g−1(x)?\n(d) Is it true that f(x) = g(x)−1?\n126. Group Problem. (a) Let x(t) = (1 −t2)/(1 + t2),\ny(t) = 2t/(1 + t2) and u(t) = y(t)/x(t). Find dx/dt,\ndy/dt.\n(b) Now that you’ve done (a) there are two different ways\nof finding du/dt. What are they, and use one of both to\nfind du/dt.\n9. Higher Derivatives\n9.1. The derivative is a function. If the derivative f ′(a) of some function f exists for all a in the\ndomain of f, then we have a new function: namely, for each number in the domain of f we compute the\nderivative of f at that number. This function is called the derivative function of f, and it is denoted by f ′.\nNow that we have agreed that the derivative of a function is a function, we can repeat the process and try to\ndifferentiate the derivative. The result, if it exists, is called the second derivative of f. It is denoted f ′′.\nThe derivative of the second derivative is called the third derivative, written f ′′′, and so on.\nThe nth derivative of f is denoted f (n). Thus\nf (0) = f,\nf (1) = f ′,\nf (2) = f ′′,\nf (3) = f ′′′, . . . .\nLeibniz’ notation for the nth derivative of y = f(x) is\ndny\ndxn = f (n)(x).\n9.2. Example. If f(x) = x2 −2x + 3 then\nf(x) = x2 −2x + 3\nf ′(x) = 2x −2\nf ′′(x) = 2\nf (3)(x) = 0\nf (4)(x) = 0\n...\nAll further derivatives of f are zero.", "word_count": 516, "start_char": 99742, "end_char": 102206}
