{"chunk_id": "DOC0048__00000", "doc_id": "DOC0048", "chunk_index": 0, "text": "Prepared to Believe: The Evangelism of Preschoolers\nand Infant Baptism in African Anglican Churches\nThis article discusses the cognitive status of preschool children based\non the insights of the child psychologist Jean Piaget. Building on this, a\nstrategy is offered for the evangelism of preschoolers and the expected\noutcome of this evangelism is the formation of their worldview into a\nChristian one. This prepares them to believe the gospel when they reach\na developmental stage in which faith and unbelief become part of their\nmental posture. Given their commitment to infant baptism, African\nAnglican churches must prioritise theological studies focused on children\nin order to carry out such evangelism.\n1. Introduction\nDemographics show that Africa’s population, as is widely known round\nthe world, is youthful. This fact can obscure an important aspect of\nAfrica’s population in regard to children, viz., Africa’s population\npyramid continues to expand at the base, making children the most\npopulous age group. In Uganda, for example, 50% of the population is\nbelow the age of 18 years, whilst 25% of the population is below the\nage of 5. In consequence, the shortage of Anglican theological literature\non children puts Anglican churches in Africa at a distinct disadvantage\nfor theological education and pastoral practice. This article will propose\nways for African Anglican churches and families to evangelise their\npreschool-age children and the outcomes they should anticipate from such\nevangelism.1 These methods of evangelism are grounded in preschoolers’\ncognitive status, based upon the insights of Jean Piaget and linked to\nworldview formation. The methods are also especially appropriate for\nthe evangelism of preschoolers in Anglican churches on account of their\npractice of infant baptism.\nEvangelism is understood as the proclamation of the gospel.2 This\nis the case when the term is understood from the standpoint of its use in\nthe New Testament, or from the standpoint of the content of apostolic\npreaching, or even from the standpoint of those labelled as evangelists in\n1 In childhood studies, “preschoolers” are children aged 3–6/7 years old.\n2 This use of the term therefore does not rely on the state of the hearers, whether\nbelievers or unbelievers, baptised or not. The issue in this article is ultimately how\nto communicate the gospel to children, or “pass on the gospel to them” and we will\nuse the term evangelism as the best way to capture this.\nThe Global Anglican 134/4 (2020):299–316", "word_count": 399, "start_char": 0, "end_char": 2521}
{"chunk_id": "DOC0048__00001", "doc_id": "DOC0048", "chunk_index": 1, "text": "he issue in this article is ultimately how\nto communicate the gospel to children, or “pass on the gospel to them” and we will\nuse the term evangelism as the best way to capture this.T\n\nhe Global Anglican 134/4 (2020):299–316\n\nthe NT. This understanding of evangelism is seen, for example, in a 1944\nreport commissioned by William Temple, Archbishop of Canterbury,\nTowards the Conversion of England. The report was clear that evangelism\nconcerned the “eternal gospel” and its intelligible presentation.3 C.\nRobert Harrison has argued that this understanding is “nearly ubiquitous\nin the Church’s conversation about evangelism.”4 This ubiquitous view of\nevangelism in Anglican churches is also seen in a second Anglican plan of\nevangelism, the “Decade of Evangelism” (Lambeth 1988, resolution 43),\nwhich called on Anglican churches to close the decade “with a renewed\nand united effort at making Christ known to the people of the world.”5\nThis is also the view of evangelism in African Anglican churches where it\nis common knowledge that evangelism is taken to be preaching the gospel\nin church, market places, in the streets, in homes, etc.\nGiven that this paper is about the evangelism of preschoolers, I\nconcern myself with how the gospel can be proclaimed to preschoolers in\nAnglican churches, thereby passing on the faith to them.\nIn what follows, I will first examine children’s cognitive status,\ndrawing on studies of child psychology by Jean Piaget. I will then use\nthis discussion to propose ways in which children should be evangelised\nbefore turning to consider the outcomes of such evangelism. I will then\nrelate Anglican churches’ liturgy for infant baptism to the evangelism\nof preschoolers demonstrating thereby that these methods are highly\nappropriate for evangelism of preschoolers in Anglican churches. I will\nfinally conclude with some thoughts on what needs to happen if African\nAnglican churches are to carry out this kind of evangelism.\nSince relative to older persons children have distinct ways of thinking\nand therefore knowing, their evangelism in Anglican churches as well\nas elsewhere would be ill-informed if it were conducted in ignorance of,\namongst other things, their cognitive status. I elect to use Jean Piaget’s\ninsights in discussing children’s cognitive status because his work on child\npsychology gave the world penetrating insights into children’s cognitive\nstatus and thus continues to have considerable influence. In the remarks\nof one, “assessing the impact of Piaget on developmental psychology is\nlike assessing the impact of Shakespeare on English literature, or Aristotle\n3 Commission on Evangelism, Towards the Conversion of England (Toronto: Dent\nand Sons, 1945).\n4 C. Robert Harrison, Jr., “Competing Views of Evangelism in the Episcopal\nChurch,” AThR 75.2 (1993): 218–36.\n5 Anglican Consultative Council, The Truth Shall Make you Free: The Lambeth\nConference 1988, The Reports, Resolutions, and Pastoral Letters from the Bishops\n(London: Church House, 1988), 231. A report to the same conference defined\nevangelism as “the communication of the good news of Christ’s Kingdom” (p. 43).", "word_count": 489, "start_char": 2297, "end_char": 5430}
{"chunk_id": "DOC0048__00002", "doc_id": "DOC0048", "chunk_index": 2, "text": "report to the same conference defined\nevangelism as “the communication of the good news of Christ’s Kingdom” (p. 43).\n\nin Philosophy—impossible.”6 For these reasons a paper dealing with the\nevangelism of preschoolers in Anglican churches in the light of Piaget’s\nwork has considerable merit.\nThis merit is amplified by virtue of the fact that there is virtually no\ncritical literature available on the evangelism of children that is informed\nby understandings of children’s cognitive capacities.7 Nevertheless, in\ndiscussing the moral training of children as an aspect of evangelism,\nAttfield mentions suggestively the possibility of using the work of child\npsychologists, Piaget and Kohlberg, when he writes, “school and church\nalike are keen to develop moral thinking, possibly along the lines of\ndevelopmental theories such as those of Kohlberg and Piaget.”8 Building\non this, we will consider the cognitive status of preschoolers upon which\nmy proposal for evangelism will be based.\n2. Concrete Thinking and Capacities for Concrete Thinking:\nChildren’s Cognitive Status\nOne way to view the cognitive status of children according to the studies\nof Jean Piaget is by considering human thinking from two perspectives.\nThe first perspective is to the two ways human beings think, namely,\nconcretely and abstractly. Thinking concretely is with reference to people,\nplaces, objects, and experiences; thinking abstractly is with reference\nto ideas and immaterial concepts, to non-representational symbols (or\nsymbols not representing in appearance anything in human environment\nor life), and with reference to propositions or principles. The second\nperspective is to understand human thinking in terms of forms (or\ndistinct areas) of thinking, which are distinct mental activities, including:\njudging, interpreting, comparing and contrasting, classifying, planning,\nremembering, analysing, synthesising, problem solving, trouble shooting,\nmaking decisions, and strategising.\n6 From an anonymous reviewer in O. Lourenco, “In Defense of Piaget’s Theory: A\nReply to 10 Common Criticisms,” Psychological Review 103.1 (1996), 143.\n7 See, e.g., Franklin I. Sheeder, “Evangelism and Christian Education,” Christian\nEducation 30.4 (1947): 349–58; Gideon G. Yoder, The Nurture and Evangelism\nof Children (Scottdale, PA: Herald, 1959); Kenneth L. Chafin, “Evangelism and\nthe Child,” RevExp 60.2 (1963): 161–71; Robert A. Proctor, Jr., “Children and\nEvangelism,” RevExp 63.1 (1966): 55–63; Edward L. Hayes, “Evangelism of\nChildren,” BSac 132.527 (1975): 250–64; Perry G. Downs, “Child Evangelization,”\nCEJ 3.2 (1983): 5–13; Karen Marie Yust, “Toddler Spiritual Formation and the\nFaith Community,” International Journal of Children’s Spirituality 8.2 (2003):133–\n49; Dennis Horton, “Ministry Students Ages of Conversion with Implications for\nChildhood Evangelism and Baptism Practices,” CEJ 7.1 (2010): 30–51.\n8 D. G. Attfield, “Child-Evangelism and Religious Education,” BJRE 16.1 (1993):\n39–46 (43).", "word_count": 427, "start_char": 5313, "end_char": 8299}
{"chunk_id": "DOC0048__00003", "doc_id": "DOC0048", "chunk_index": 3, "text": "owns, “Child Evangelization,”\nCEJ 3.2 (1983): 5–13; Karen Marie Yust, “Toddler Spiritual Formation and the\nFaith Community,” International Journal of Children’s Spirituality 8.2 (2003):133–\n49; Dennis Horton, “Ministry Students Ages of Conversion with Implications for\nChildhood Evangelism and Baptism Practices,” CEJ 7.1 (2010): 30–51.\n8 D.G\n\n.A\n\nttfield, “Child-Evangelism and Religious Education,” BJRE 16.1 (1993):\n39–46 (43).\n\nIn regard to the first perspective for understanding children’s\nthinking, Piaget classified the capacity for concrete thinking in children in\nstages relative to their ages. The first stage of concrete thinking he named\n“sensori-motor,” which is found in children aged 0–2 years (infants and\ntoddlers). Sensori-motor thinking “deals only with real entities, and each\nof its actions thus involves only very short distances between subject and\nobjects,”9 and “only leads to practical satisfaction, i.e. to the success of\nthe action and not to knowledge as such.”10 The second stage of concrete\nthinking in children he called “intuitive (or preoperational) thinking”\nwhich is found in children aged 3–6/7 years (preschoolers). As we shall later\ndiscuss, intuitive thinking is concrete thinking limited to the perspective of\nthe subject, “always ‘centred’ on a particular state of the object and a point\nof view peculiar to the subject.”11 Piaget labelled the last stage of concrete\nthinking in children “concrete operational thinking” which is found in\nchildren age 7/8–12 years (school-age children). Concrete operational\nthinking is concrete thinking characterised by certain operations of\nthought. These operations of thought classify, serialise or number objects,\norder time and measure speed, and structure and measure space. In other\nwords, they are “logico-arithmetical and spatio-temporal operations”12\nperformed through thinking. We now consider in some detail, following\nPiaget’s framework, the capacities for concrete thinking of preschoolers\nand thereby seek to understand their cognitive status.\nWhen children acquire language at about 2 years old, they manifest\ntwo crucial forms of thinking which increase their concrete thinking\ncapacity, both of which are crucial for concept development. These\nforms of thinking are “comparing and contrasting” and, its corollary,\n“classifying” of things. With these forms of thinking, preschoolers are able\nto form concrete concepts (the grouping of concrete things on the basis\nof similarities or commonalities of properties, relations, characteristics,\nappearances, functions etc.). Consequently, they experience a leap in their\nknowledge of people, objects, and activities. This leap in their knowledge\nis tied to the way human beings understand, and make sense of, their\nworld, which is primarily through concepts. So, once a child has words\nand names for various objects, s/he begins to organise and group them\nin his/her mind, use the concepts as a basis for further exploration and\nknowledge of the world and extend his/her thinking of objects “beyond\nthe limits of near space and time.”13\n9 Jean Piaget, The Psychology of Intelligence, trans. Malcolm Piercy and D. E.\nBerlyne, Routledge Classics (London: Routledge, 2001), 133.\n10 Piaget, Psychology, 133.\n11 Piaget, Psychology, 156.\n12 Piaget, Psychology, 153.\n13 Piaget, Psychology, 134.", "word_count": 488, "start_char": 7869, "end_char": 11196}
{"chunk_id": "DOC0048__00004", "doc_id": "DOC0048", "chunk_index": 4, "text": "alcolm Piercy and D.E\n\n.B\n\nerlyne, Routledge Classics (London: Routledge, 2001), 133.\n10 Piaget, Psychology, 133.\n11 Piaget, Psychology, 156.\n12 Piaget, Psychology, 153.\n13 Piaget, Psychology, 134.\n\nHowever, Piaget identified four limitations in the mental operations\nof preschoolers which affect their concrete thinking capacity in the areas\nof “classification” and “interpretation.” In regard to “classification,” the\nlimitations on their mental operations make them incapable of grouping\nthe same class or relationship of things together properly. So, for example,\na dollar bill and a rough paper are classified as the same and both might\nbe thrown in the bin. In regard to “interpretation,” the limitations of\npreschoolers’ mental operations limit their inferential abilities to one,\ntransductive inference, where preschoolers do not infer “by deduction but\nby direct analogies”14 from a particular observation or experience to a\nrelated particular one. So, for example, since doctors wear white coats,\nanyone who wears a white coat is a doctor.\nThe four limitations on preschoolers’ mental operations identified\nby Piaget were centration, conservation, irreversibility, and seriation. By\ncentration, Piaget referred to preschoolers’ mental inability to decentre, or\ntake on another’s perspective. In his words, “the adult thinks socially, even\nwhen he is alone, and ... the child under 7 thinks ego-centrically, even in\nthe society of others.”15 Ego-centric thought characterises the thinking of\nchildren, hence its labelling as intuitive thinking, “i.e. its reasoning is not\nmade explicit.”16 This kind of thinking is disinterested in questions of how\nand why: “children do not talk about causality among themselves before\nthe age of 7 or 8. Such explanations as they give each other are rare and\nfactual. The questions they ask one another contain very few ‘whys,’ and\nhardly any requests for a causal explanation.”17 By conservation, Piaget\nreferred to preschoolers’ mental inability to note what does not change in\ntransformations so that they do not see that when ice melts to water or\nwhen water vaporises, the three are all the same substance; nor do they see\nthat a liquid remains of the same volume when poured from an elongated\nglass into a broad one. By irreversibility Piaget referred to preschoolers’\nmental difficulties to reverse sequences in their minds. For example, they\nhave the ability to predict the original order three balls will re-emerge in a\ntube they have been pushed through but not the ability to predict in which\norder they will appear at its other end: “All children foresee the original\norder. The opposite order, on the other hand, is beyond them till about 4\nor 5 years.”18 By seriation Piaget referred to preschoolers’ difficulties in\n“arranging elements according to increasing or decreasing size.”19 It is\n14 Piaget, Psychology, 141\n15 Jean Piaget, The Language and Thought of the Child, trans. Marjorie and Ruth\nGabain, Routledge Classics (London: Routledge, 2002), 41.\n16 Piaget, Language, 47.\n17 Piaget, Language, 125–26.\n18 Piaget, Language, 149\n19 Jean Piaget and Barbel Inhelder, The Psychology of the Child, trans. Helen\nWeaver (New York: Basis Books, 2000), 101.", "word_count": 500, "start_char": 10999, "end_char": 14211}
{"chunk_id": "DOC0048__00005", "doc_id": "DOC0048", "chunk_index": 5, "text": "arjorie and Ruth\nGabain, Routledge Classics (London: Routledge, 2002), 41.\n16 Piaget, Language, 47.\n17 Piaget, Language, 125–26.\n18 Piaget, Language, 149\n19 Jean Piaget and Barbel Inhelder, The Psychology of the Child, trans.H\n\nelen\nWeaver (New York: Basis Books, 2000), 101.\n\nnot until “the operational level that seriation is achieved straight away, by\nsuch a method as, for example, finding the smallest of all the terms and\nthen the next smallest, etc.”20\nA compromise in preschoolers’ ability to classify things properly\ninto logical groups and to infer deductively is indicative of limitations\nin the depth of knowledge they are capable of attaining. In other words,\nsince concepts are invariably related to the acquisition of knowledge of\npeople, animals, objects, substances and materials, experiences, events,\nactivities, etc.,21 one’s inability to form concepts into proper logical\ngroupings is reflective of gaps in one’s knowledge, resulting in what we\nmight call “surface” knowledge. Consequently a preschooler’s knowledge\nof the world, on account of the four limitations Piaget pointed out, is of\na superficial kind, whereby “the child’s conception of things is at one and\nthe same time what they appear to be (phenomenalism)”22 and not as\nthey really are. This is to say that preschoolers are incapable of grasping\ndeeper knowledge of the world regardless of having the prerequisite forms\nof thinking that can lead to such knowledge. This superficial knowledge\nof preschoolers, Piaget pointed out, is what accounts for their fantastical\ninner world in which there is no separation of, nor telling the difference\nbetween, fact and fiction, reality from the imagined. In his words younger\nchildren “find it far more difficult to distinguish between romancing and a\nfaithful rendering.”23 From the point of view of preschoolers’ limitation to\ntransductive inference, the “child’s incapacity for true causal explanation\nand logical justification”24 or his/her giving “incomplete reason or\ncause”25 for actions and events means that individual fantasy holds sway.\nAs it were, their magical world compensates for their inability to acquire\ndeeper knowledge that would help them to make sense of the world as it\nreally is and therefore have a more accurate picture of reality.\nThis typical inability in preschoolers to separate fact from fiction\nis corroborated in children’s cognitive studies by literature in childhood\ndevelopmental psychology on theory of the mind.26 Theory of the mind\nis “the ability to attribute mental states (beliefs, intentions, and desires)\n20 Piaget, Language, 148.\n21 “The world” from here on.\n22 Piaget, Language, 276.\n23 Piaget, Language, 127.\n24 Piaget, Language, 241\n25 Piaget, Language, 116.\n26 See for example Henry M. Wellman, The Child’s Theory of the Mind (Cambridge,\nMA: Bradford Books, 1990); W. V. Fabricius, T. W. Boyer, A. A. Weimer, and K.\nCarroll, “True or False: Do Five-year-olds Understand Belief?” Developmental\nPsychology 46 (2010): 1402–16; V. Slaughter, “Theory of Mind in Infants and\nYoung Children: A Review,” Australian Psychologist 50 (2015): 169–72.", "word_count": 481, "start_char": 13936, "end_char": 17050}
{"chunk_id": "DOC0048__00006", "doc_id": "DOC0048", "chunk_index": 6, "text": "ellman, The Child’s Theory of the Mind (Cambridge,\nMA: Bradford Books, 1990); W.V\n\n.F\n\nabricius, T.W\n\n.B\n\noyer, A.A\n\n.W\n\neimer, and K.C\n\narroll, “True or False: Do Five-year-olds Understand Belief?” Developmental\nPsychology 46 (2010): 1402–16; V.S\n\nlaughter, “Theory of Mind in Infants and\nYoung Children: A Review,” Australian Psychologist 50 (2015): 169–72.\n\nto oneself and others,”27 which invariably requires one to be conscious\nof beliefs, intentions and desires in oneself and in others. Of critical\nimportance from the perspective of theory of the mind in understanding\nwhy preschoolers blur the distinction between fact and fiction is the\nability to attribute beliefs as a mental state. This is because although\n“beliefs generally coincide with the state of the world,”28 they are\nnonetheless internal and mental states that may, or may not, accord with\nreality. Preschoolers, as seen in myriad “false belief” task experiments,\nfind it difficult to grasp that beliefs (or perceptions) are mental states\nand not reality; thus a person may have false beliefs, i.e., beliefs that do\nnot accord with reality. In one common version of false belief tasks, for\nexample, children are told a story where Maxi places a chocolate in a\nbox x and goes away.29 In his absence his mother removes the chocolate\nfrom box x and puts it in box y. The children are then asked to point\nout the box where Maxi will look for the chocolate when he returns.\nPreschoolers before the age of 5 will typically point to box y because\nthey cannot distinguish Maxi’s false belief (chocolate is in box x) from\ntheir own belief (chocolate is in box y). Moreover, as alluded to above,\nthis inability to point out Maxi’s false belief is an indicator that the\npreschoolers are not conscious of their own or others’ “beliefs.”30 Indeed\nas a recent study has shown, it is not until the age of 70 months that\nchildren consistently demonstrate competence in distinguishing between\nfactive (“know”) and non-factive verbs (“think” and “guess”), heralding\nthe maturation of their mind.31 Difficulty in grasping belief, and belief\nas a mental state, which results in the fusing of belief and reality in their\nexperience is what makes preschoolers blur the distinction between\nreality and perceptions or imaginations. In consequence, what to an older\nperson is fiction, imagination, or apparent (i.e., “belief”) is reality to a\npreschooler, hence their magical world. Thus theory of the mind insights\n27 Anna R. Mcalister and T. Bettina Cornwell, “Preschool Children’s Persuasion\nKnowledge: The Contribution of Theory of the Mind,” Journal of Public Policy\nand Marketing 28.2 (2009): 175–85.\n28 Maria Rosaria Cadinu and Jeff Keisner, “Children’s Development of a Theory\nof the Mind,” European Journal of Psychology of Education 15.2 (2000):\n93– 111 (97).\n29 Heinz Wimmer and Josef Perner, “Beliefs about Beliefs: Representation and\nConstraining Function of Wrong Beliefs in Young Children’s Understanding of\nDeception,” Cognition 13 (1983): 103–28.\n30 Anika Fiebich, “Mindreading with ease? Fluency and Belief Reasoning in 4- to\n5-year-olds,” Synthese 191.5 (2014), 929–44 (929–30).\n31 Susanne Kristen-Antonow, Irina Jarvers, and Beate Sodian, “Preschoolers’\nDeveloping Understanding of Factivity in Mental Verb Comprehension and its\nRelation to First- and Second-order False Belief Understanding: A Longitudinal\nStudy,” Journal of Cognition and Development 20.3 (2019): 354–69.", "word_count": 537, "start_char": 16691, "end_char": 20131}
{"chunk_id": "DOC0048__00007", "doc_id": "DOC0048", "chunk_index": 7, "text": "luency and Belief Reasoning in 4- to\n5-year-olds,” Synthese 191.5 (2014), 929–44 (929–30).\n31 Susanne Kristen-Antonow, Irina Jarvers, and Beate Sodian, “Preschoolers’\nDeveloping Understanding of Factivity in Mental Verb Comprehension and its\nRelation to First- and Second-order False Belief Understanding: A Longitudinal\nStudy,” Journal of Cognition and Development 20.3 (2019): 354–69.\n\nare in harmony with Piaget’s insight on preschoolers’ ego-centric thinking\nand also account for reasons why they struggle to mentally decentre and\ntake another person’s view.\nWhen children get to school age, they transcend the limitations of\nthe four mental operations they had as preschoolers, and consequently\nbecome concrete operational thinkers. The result of this is a marked\nincrease in their concrete thinking capacity. More precisely, they are now\nable to classify people, objects and activities properly, and, thanks to\ntheir development in theory of the mind, they are also able to decentre\nmentally by observing and attributing beliefs, intentions and desires to\nmental states of their own and others. Moreover their inferential ability\nis no longer limited to the transductive kind alluded to above but is now\ntransitive and deductive, bringing about a proper linkage of cause and\neffect. For these reasons they are capable of grasping deeper knowledge\nof the world and can differentiate reality from fiction, thus moving away\nfrom the fantastical world they had as preschoolers to a more accurate\npicture of reality.\nBefore we consider the implications for evangelism that the\nunderstanding of preschoolers’ cognitive status has, we need to consider\ncertain criticisms of Piaget’s studies on children’s cognitive abilities.\nOur concern here is not with criticism of all things Piaget said, but with\ncriticism that is aimed at the stages he identified in children’s cognitive\nabilities and their nature. This is because these are fundamental to\nhis insights and, crucially, what this article draws upon in discussing\npreschoolers’ cognitive abilities. These criticisms of Piaget’s stages of\ncognitive development and their nature are that, first, apart from the\nfirst stage in the first two years of life, they are general, lacking in detail.\nSecondly, there is concern that they do not account for what precipitates\nmovement or transition from one stage to another. Lastly, some argue that\nPiaget’s stages fail to accommodate individual and cultural variations,\ninstead rendering them as uncritically universal and rigid.32 Nevertheless,\nPiaget’s understanding that children’s cognitive abilities undergo definite\ndevelopments has hitherto not been discredited in child psychology\nscholarship, that is to say, they have not been shown to be out of touch\nwith children’s cognitive realities. This is also the case with his insights on,\nin principle, the cognitive characteristics of children in the various stages\nhe identified, i.e., sensori-motor, intuitive and operational. It is for this\n32 I have drawn my summary of these criticism from Peter Sutherland, Cognitive\nDevelopment Today: Piaget and his Critics (London: Chapman, 1992); Lourenco, “,\n“In Defense of Piaget’s Theory: A Reply to 10 Common Criticisms,” Psychological\nReview 103.1 (1996): 143–64; David Henry Feldman, “Piaget’s Stages: The\nUnfinished Symphony of Cognitive Development,” New Ideas in Psychology 22.3\n(2004): 175–231.", "word_count": 506, "start_char": 19745, "end_char": 23140}
{"chunk_id": "DOC0048__00008", "doc_id": "DOC0048", "chunk_index": 8, "text": "reason that they continue to be applied today in discourse on children as\nvaried as children’s map-making,33 children’s development of operational\ntime,34 genetic epistemology,35 use of labels,36 perspectives on children’s\nlearning,37 and models of learning.38 It is for the same reason that I have\nused Piaget to map out preschoolers’ cognitive abilities. With these\nremarks, I am now in a position to offer my proposals on how the church\nand parents can evangelise children in the light of their cognitive status.\n3. Evangelising Preschoolers\nWe have described the cognitive status of preschoolers as one of concrete\nthinking but whose capacities for concrete thinking are limited by their\ninability to perform certain mental operations. We said that this makes\nthem incapable of a deeper knowledge of the world. Therefore, evangelism,\nthat is, gospel proclamation, cannot be a fully blown, and thus integrated,\nexplanation about Jesus. A full-blown gospel proclamation requires\ncommunicating the gospel reasonably, which would invariably entail\nexplaining to preschoolers, for example, the nature of Jesus’ divinity and\nthe goal of Jesus’ coming to the world, the nature of his kingship and its\npurpose, the meaning of his deeds, the reasons for his sacrificial death,\nthe significance of his resurrection, and the ends to be accomplished by\nhis return. Such reasonable explanations of the gospel require making\nconnections between various aspects of the gospel, for example between\nJesus’s coming and humanity’s situation, between his kingship and God’s\neternal home, between his sacrificial death and humanity’s condition,\nbetween his kingship and his deeds, between his kingship and his divine\nsonship, and between his resurrection and his words. These requirements\npresume the cognitive ability for spotting causal linkages in the gospel and\n33 E.g., Eugene Geist, “Let’s Make a Map: The Developmental Stages of Children’s\nMapmaking,” Young Children 71.2 (2016): 50–55.\n34 E.g., Constance K. Kamii and Kelly A. Russell, “The Older of Two Trees:\nYoung Children’s Development of Operational Time,” Journal for Research in\nMathematics Education 41.1 (2010): 6–13.\n35 E.g., D. Abrahamson , S. Shayan, A. Bakker, M. van der Schaaf, “Eye-Tracking\nPiaget: Capturing the Emergence of Attentional Anchors in the Coordination of\nProportional Motor Action,” Human Development 58 (2015): 218–44.\n36 E.g., Stephanie E. Miller, Stuart Marcovitch, and Janet J. Boseovski, “Young\nChildren’s Ability to Use Ordinal Labels in a Spatial Search Task,” Merrill-Palmer\nQuarterly 61.3 (2015): 345–61.\n37 E.g., Kaya Yilmaz, “The Cognitive Perspectives on Learning: Its Theoretical\nUnderpinnings and Implications for Classroom Practices,” Clearing House 84.5\n(2011): 204–12.\n38 E.g., Amy Perfors, “Piaget, Probability, Causality, and Contradiction,” Human\nDevelopment 59 (2016): 26–33.", "word_count": 425, "start_char": 23140, "end_char": 26007}
{"chunk_id": "DOC0048__00009", "doc_id": "DOC0048", "chunk_index": 9, "text": "iller, Stuart Marcovitch, and Janet J.B\n\noseovski, “Young\nChildren’s Ability to Use Ordinal Labels in a Spatial Search Task,” Merrill-Palmer\nQuarterly 61.3 (2015): 345–61.\n37 E.g., Kaya Yilmaz, “The Cognitive Perspectives on Learning: Its Theoretical\nUnderpinnings and Implications for Classroom Practices,” Clearing House 84.5\n(2011): 204–12.\n38 E.g., Amy Perfors, “Piaget, Probability, Causality, and Contradiction,” Human\nDevelopment 59 (2016): 26–33.\n\nintegrating various pieces of information about the gospel, both of which\nare beyond preschoolers’ capacities for concrete thinking.\nI propose then that the evangelism of preschoolers through gospel\nproclamation is limited to proclaiming simple gospel content. By this I\nmean the proclamation of the gospel to preschoolers by way of singular\nconcrete explanations of the gospel to them, with few words, through\npertinent stories, illustrations, and memorable statements or sayings.\nSingular concrete explanations of the gospel entail explaining only one\naspect of the gospel at a time without relating it to other gospel content\n(or even necessarily anticipating explaining at a later date its relationship\nto other gospel content). This singular gospel explanation to preschoolers\nprecludes any integrated understanding of the gospel. It also focuses on\nthe what? or who? or when?, or where? (events, places, descriptions,\nnaming, identifications, etc.), and not how? or why?, of the gospel. This\nmight include a key event in the life of Jesus, where Jesus was born, a\nmiracle he performed, a relationship he had, a concrete identity of his\nsuch as Jesus the king, Jesus the healer, Jesus the miracle worker, etc. We\nwill call this type of evangelism of preschoolers simple explanatory gospel\nproclamation. It has a counterpart in simple non-explanatory gospel\nproclamation (i.e., ways that do not involve simple gospel explanations as\noutlined above) which we consider below.\nEvangelism of preschoolers through simple explanatory gospel\nproclamation enables them to acquire knowledge of the gospel of the\ndeclarative kind. By declarative knowledge I mean “knowledge that can\nbe declared, usually in words, through lectures, books, writing, verbal\nexchange, braille, sign language, mathematical notation, and so on.”39\nCorrespondingly, declarative knowledge40 is explicit, i.e., the knower is\nconscious that s/he has the knowledge and can articulate or communicate\nit. On the other hand, simple non-explanatory gospel proclamation\nenables preschoolers to acquire experiential knowledge of the gospel.\nExperiential knowledge is not taught by any systematic instruction and\nexplanation but, rather, is acquired through exposure. Repeated exposure\nto something engenders knowledge through imitation, internalisation,\nimagination, and affection, and through intuition. For example, a\npreschooler will not know the route to a neighbour’s house by studying a\nmap or taking instructions from parents; s/he will know the route to the\nneighbour’s house through repeated accompanied journeys to the house.\nThis is akin to the ways in which preschoolers know and comprehend a\nlanguage. Therefore, experiential knowledge may not be articulable.\n39 S. Farnham-Diggory, “Paradigms of Knowledge and Instruction,” Review of\nEducational Research 64.3 (1994): 463–77 (468).\n40 Also referred to as “propositional knowledge.”", "word_count": 486, "start_char": 25553, "end_char": 28915}
{"chunk_id": "DOC0048__00010", "doc_id": "DOC0048", "chunk_index": 10, "text": "his is akin to the ways in which preschoolers know and comprehend a\nlanguage.T\n\nherefore, experiential knowledge may not be articulable.\n39 S.F\n\narnham-Diggory, “Paradigms of Knowledge and Instruction,” Review of\nEducational Research 64.3 (1994): 463–77 (468).\n40 Also referred to as “propositional knowledge.”\n\nThe first evangelism of preschoolers through simple non-explanatory\ngospel proclamation I propose, is through repeated exposure to the gospel\nthrough simple gospel stories. Simple gospel stories would have a singular\nfocus with fewer words and characters as has been well done in some\nchildren’s Bibles with usually Bible stories of about 25 words for 3 and\n4 year preschoolers,41 and between 25 and 75 words for 5 and 6 year\npreschoolers.42 We need to note here that although gospel stories should be\ntold intentionally to preschoolers for exposure purposes, preschoolers can\nalso pick up these stories if they capture their attention and are repeatedly\ntold in the context of adult conversation. In this sense, testimonies, or\npersonal stories of faith in Christ, in the context of home conversations\nand in church can be avenues for exposure of preschoolers to gospel\nstories. Since stories are by nature concrete, when simple gospel stories\nare repeatedly heard by, told to, or dramatised for, preschoolers, they feed\ninto their imagination and also become part of its content, enabling them\nto internalise the stories and acquire experiential gospel knowledge.\nThe second simple non-explanatory gospel proclamation in the\nevangelism of preschoolers I wish to propose is through repeated exposure\nto gospel symbols such as the cross, lamb, ship, fish, and Chi-Rho, and\nto gospel rituals, if we may term them so, of Holy Communion, and\nbaptism. Repeated exposure to gospel symbols and rituals means that\nnon-proclamatory evangelism of preschoolers requires the participation of\npreschoolers in Christian worship as a way of evangelism. Such repeated\nexposure feeds into preschoolers’ imagination by which they internalise\nthe symbols and rituals to which they are exposed. Parents, Sunday School\nteachers, and pastors, as noted by James Fowler cannot be in control\nof preschoolers’ imagination and internalisation, but can engage with\nboth.43 Such an engagement is through appropriately answering, guiding,\nor correcting preschoolers in response to the questions they raise and the\nimaginations they express as a result of their internalisation of the gospel.\nGoing back to our analogy of language in understanding experiential\nknowledge, this is the way that parents engage preschoolers when they\nare learning a language.\nWhen preschoolers are exposed to the gospel through simple nonexplanatory means, their subsequent imagination and internalisation of\nthe gospel is most likely to connect with their declarative knowledge of the\ngospel acquired through simple explanatory gospel proclamation leading\n41 E.g., Katin Juhl, The Carry Along Bible, illustrated by Jacob Kramer (Copenhagen:\nCopenhagen Publishing House, 2014).\n42 E.g., Carine Mackenzie, Little Hands Story Bible: Stories from the Old Testament\n(Fearn, Ross-shire: Christian Focus, 2009).\n43 James Fowler, Stages of Faith: The Psychology of Human Development and the\nQuest for Meaning, rev. ed. (New York: Harper Collins, 2004), 132–33.", "word_count": 499, "start_char": 28605, "end_char": 31920}
{"chunk_id": "DOC0048__00011", "doc_id": "DOC0048", "chunk_index": 11, "text": "to a greater knowledge of the gospel. Thus preschoolers’ evangelism has a\ngreater impact when both ways are used.44\nWe conclude our discussion of the evangelism of preschoolers in the\nlight of their cognitive status with a critical point on the outcomes of the\nevangelism of preschoolers from the perspective of worldview. The end\ngoal of the evangelism of preschoolers is not merely belief, or a verbal\nprofession of belief, in the gospel and therefore a conversion from a state\nof “darkness” to a “light”, or from “blindness” to “seeing” or from the\n“old” to the “new’, or from the kingdom of Satan to God’s Kingdom.\nRather, the expected outcome is one of Christian formation, forming the\npreschooler’s worldview into a Christian one by virtue of it being heavily\ninfused by the gospel. This is because a preschoolers’ mental habitat is, as\nalready discussed, fantastical, making no differentiation between the real\nor imagined, and so belief and unbelief are alien to their minds; indeed,\nbelief and unbelief are not a part of their mental posture. A preschooler\nsimply imbibes from, and reflects, the world s/he is exposed to and is\nconsequently formed by it in at least three dimensions: (i) Their world\nperception, i.e., what they perceive of the world, how it is and why, how\nit ought to be, the underlying moral/metaphysical order, etc.; (ii) their\nself-perception and identity; and (iii) their values and attitudes. This is to\nsay that preschoolers’ exposure to the gospel is instrumental in forming\ntheir worldview since these dimensions are basic to a worldview.45 Once\na preschooler’s worldview is formed, it remains an unrivalled force\nthroughout their lives by virtue of both its transformation later into\ntheir root beliefs, and its enduring influence on their identity, attitudes,\nand values.\nWhen preschoolers become school-age children, at about the age of\nseven, their increased thinking capacity, as discussed above, means that\nthey invariably begin to sort out the magical from the real in their inner\n44 This said, we should note that evangelism which is informed by various human\nelements such as cognitive capacities does not solely account for bringing people to\nthe knowledge of, and belief in, God and the Lord Jesus. God works by his Spirit\nthrough evangelism to bring men, women, and children to himself. Evangelism,\ntherefore, should always be carried out with reference to God through obedience,\ntrust, anticipation, etc. When evangelism is viewed this way, then it should be\nprecisely because of reference to God that Christians should strive to evangelise in\nways informed by certain knowledge of human beings, in this case children, since\nit is God who has designed them so according to his plans and purposes divine.\n45 For more on this see Arthur F. Holmes, Contours of a Worldview (Grand Rapids:\nEerdmans, 1983); James H. Olthuis, “On Worldview,” CScR 14.2 (1985), 1–12;\nCharles Taylor, Modern Social Imaginaries (Durham, NC: Duke University Press,\n2004), 23–30; Robert Cummings Neville, “Worldviews,” AJTP 30.3 (2009), 233–\n243; Katherine G. Schultz and James A. Swezey, “A Three-Dimensional Concept of\nWorldview,” JRCE 22 (2013), 227–43.", "word_count": 512, "start_char": 31920, "end_char": 35096}
{"chunk_id": "DOC0048__00012", "doc_id": "DOC0048", "chunk_index": 12, "text": "olmes, Contours of a Worldview (Grand Rapids:\nEerdmans, 1983); James H.O\n\nlthuis, “On Worldview,” CScR 14.2 (1985), 1–12;\nCharles Taylor, Modern Social Imaginaries (Durham, NC: Duke University Press,\n2004), 23–30; Robert Cummings Neville, “Worldviews,” AJTP 30.3 (2009), 233–\n243; Katherine G.S\n\nchultz and James A.S\n\nwezey, “A Three-Dimensional Concept of\nWorldview,” JRCE 22 (2013), 227–43.\n\nworld that hitherto has been undifferentiated. What then was part of their\ninner world that cannot be observed or proven by ordinary human means\nis either rejected as untrue, or embraced by faith as real. This sifting\nthe real from the imagined applies to the gospel as well, which then has\nto be embraced by faith as true or otherwise rejected due to unbelief.\nHowever, school-age children whose worldview was formed by the gospel\nhave, humanly speaking, a better chance to embrace it by faith and not\nreject it in disbelief. This is because their Christian worldview provides a\nhospitable environment for the preschooler to believe in the gospel once\nthey attain the age of discernment. At that age their gospel-informed\nChristian worldview remains with them but is now reconstituted on the\nbasis of faith as a root belief about reality and the world.46\nThis conclusion could explain the convictions articulated by\nBushnell47 over a century ago (that would herald a turn in focus towards\nChristian education as a form of evangelism)48 that if children are from\ninfancy exposed in a sustained way to the gospel, they have an increased\nlikelihood to have a relationship with God than would otherwise be the\ncase, and thereby precluding the need for a radical conversion later in\nlife. Such a conviction is not merely academic but one that some adult\nbelievers, including myself, can identify with. During weekly testimony\nhours at an evangelical theological institution in Africa where I once\ntaught, it was not uncommon to hear testimonies of conversions by some\nstudents that had no point of conversion to mention but rather a journey\nof faith in God and the Lord Jesus that began in childhood. Seen this\nway, apparent conversions in such preschoolers later in their school-age,\nteenage or adult lives need not be viewed as conversions per se but rather\nas spiritual “awakenings” or “renewals” of their faith. What occurs can\nbe described as the “enthusiastic adoption of a belief system that had\nnot been taken seriously previously or that had been abandoned out of\nscepticism, rebellion, or indifference,”49 or, we may add, out of a lack of\n46 Via a different route, for a more varied ecclesial context, and not using the\nlanguage of evangelism and worldview, Yust gives proposals on nurturing children\ninto the faith and their intended outcomes that are very close to mine. See Karen-\nMarie Yust, “Cultivating Christians: North American Family Cultures and\nReligious Identity Formation,” International Journal for Children’s Spirituality\n22.3–4 (2017): 260–73.\n47 Horace Bushnell, Christian Nurture (New Haven: Yale University Press, 1915).\n48 For brief discussion on this, see Sheeder, “Evangelism and Christian Education,”\n349–58; Randolph Crump Miller, “Horace Bushnell: Prophet to America’s\nChildren,” PerkJ 32 (1979): 1–8; and Mark A. Maddix, “Christian Nurture and\nConversion: A Conversation between Horace Bushnell and John Wesley,” CEJ 9.2\n(2012): 309–25.\n49 David A. Snow and Richard Machelek, “The Sociology of Conversion,” Annual\nReview of Sociology 10 (1984): 167–90 (169–70).", "word_count": 550, "start_char": 34704, "end_char": 38191}
{"chunk_id": "DOC0048__00013", "doc_id": "DOC0048", "chunk_index": 13, "text": "addix, “Christian Nurture and\nConversion: A Conversation between Horace Bushnell and John Wesley,” CEJ 9.2\n(2012): 309–25.\n49 David A.S\n\nnow and Richard Machelek, “The Sociology of Conversion,” Annual\nReview of Sociology 10 (1984): 167–90 (169–70).\n\nrelevant teaching or engagement by churches and parents. Others, with\nJohn Barker, prefer to call these awakenings “secondary conversions,”\nwhere those who respond in faith to the proclamation of the gospel\nare not strangers to it but are familiar with it having earlier either been\nshaped by the gospel or accepted it, a situation that both brings about\nand conditions their current awakening.50 Such an understanding also\nmeans that the Christian life of a person evangelised as a preschooler\nin this way is not viewed solely in its current state divorced from his/her\nChristian formation.\n4. Infant Baptism and Preschoolers’ Evangelism in Anglican\nChurches\nEvangelism of preschoolers in Anglican churches is implicit in the liturgy\nfor infant baptism. Indeed, if we understand our liturgies past and present\ncorrectly, an undertaking is made to evangelise the baptised infant\nsubsequent to their baptism. Anglican churches’ prayer book liturgies\nfor infant baptism without exception point in various ways to three\nthings that are symbolised in baptism:51 forgiveness of sins, rebirth, and\nbecoming a member God’s family, the church. The post-baptismal state\nis no less than the onset of Christian pilgrimage, the entry to Christian\nfaith and practice. For the baptised infant, the sequence is that evangelism\nis carried out after his/her baptism in a process across their childhood\nwhich results in their Christian formation rather than conversion.52 This\nis because the infant’s post-baptismal state must be actualised in reality.\nIf there is no actualisation, which would be the case if the baptised infant\nis not evangelised, then we would have a baptised person who does not\nknow God, the Lord Jesus, or God’s forgiveness—a baptised person who\n50 John Barker, “Secondary Conversion and the Anthropology of Christianity in\nMelanesia,” Archives de Sciences Sociales des Religion (2012): 67–87.\n51 See for example The Church of Nigeria (Anglican Communion), The Book\nof Common Prayer, rev. ed. (Dongshang Town: Nanjing Amity Printing, 2007),\n158–67; Anglican Church of Kenya, Our Modern Service (Nairobi: Uzima, 2002),\n34–41; Anglican Church of Southern Africa, An Anglican Prayer Book (London:\nCollins, 1989), 380–87.\n52 Since the liturgies for adult baptism are similar to the ones for infant baptism,\nthe same three things are believed to happen to an adult who is baptised, only that\nunlike the infant an adult begins his/her Christian pilgrimage having believed in the\ngospel. The sequence of events for the baptised adult prior to the onset of Christian\nlife is his/her evangelism, followed by repentance and conversion evidenced in his/\nher profession of faith in God and the Lord Jesus, and lastly his/her baptism.", "word_count": 463, "start_char": 37943, "end_char": 40919}
{"chunk_id": "DOC0048__00014", "doc_id": "DOC0048", "chunk_index": 14, "text": "he sequence of events for the baptised adult prior to the onset of Christian\nlife is his/her evangelism, followed by repentance and conversion evidenced in his/\nher profession of faith in God and the Lord Jesus, and lastly his/her baptism.\n\ndoes not believe in the gospel, and is not a member of the household of\nfaith, the church.53\nAnglican churches presume that the infant’s post-baptismal state\nwill be actualised by means of the infant’s believing parents, godparents/\nsponsors, and the specific community of faith to which the child belongs.\nThis presumption is visible in the role of Christian nurture that parents\nand godparents of the infant bind themselves to according to the liturgies\nfor infant baptism. However Anglican churches’ liturgies do not explicitly\nprovide the content to facilitate this actualisation nor offer guidelines on\nhow to go about it, leaving it incumbent on Anglican churches to work\nthese out. I suggest that the content of actualisation is the gospel. Given\nthat the gospel and belief in the same is integral to the forgiveness of sins,\nto rebirth, and to membership of God’s family, the church, which are the\nvery things believed to happen through infant baptism, actualisation must\nin principle be by way of gospel proclamation, i.e., through evangelism.\nTo put it plainly, baptism cannot be divorced from the gospel and the\npositive outcomes of gospel proclamation. Anglican churches then by\nvirtue of their practice of infant baptism are committed to the evangelism\nof their preschoolers by following-up their infant baptism with a\nministry of evangelism throughout their childhood. In consequence, my\nproposals on how preschoolers’ evangelism in Anglican churches should\nbe conducted based on preschoolers’ cognitive status in relationship to\nworldview formation are highly appropriate for preschoolers’ evangelism\nin Anglican churches by virtue of potentially enabling the ends of their\ninfant baptisms.\nIn the BCP and in the prayer books of some African Anglican churches\nsuch as the Anglican Church of Kenya a link is made between infant\nbaptism and confirmation on the basis of infants coming of age (“age\nof reason”).54 However, the reason for this linkage and the relationship\nbetween childhood and the age of reason to confirmation are not given,\nonce again leaving Anglican churches to work them out. My proposal\nabove for preschoolers’ evangelism in Anglican churches based on Piaget’s\nchildhood cognitive studies helps in making sense of this linkage and\nrelationship. As discussed earlier, these studies show that when children\nget to school-age their cognitive status enters a new phase where, amongst\nother things, reality and fantasy are now distinguished and thus faith and\n53 I suspect that this need for actualisation upon those baptised as infants is the\nreason some in Anglican Churches doubt the efficacy of infant baptism and do\nnot subscribe earnestly to it. When I served as an associate priest in an urban\nAnglican parish there are those who preferred to bring their babies for dedication\nas a substitute for baptism.\n54 See Anglican Church of Kenya, Our Modern Service, 38; Church of the Province\nof Uganda, Come and Worship rev. ed. (Kampala: Centenary, 2009), 32.", "word_count": 516, "start_char": 40680, "end_char": 43912}
{"chunk_id": "DOC0048__00015", "doc_id": "DOC0048", "chunk_index": 15, "text": "hen I served as an associate priest in an urban\nAnglican parish there are those who preferred to bring their babies for dedication\nas a substitute for baptism.\n54 See Anglican Church of Kenya, Our Modern Service, 38; Church of the Province\nof Uganda, Come and Worship rev. ed. (Kampala: Centenary, 2009), 32.\n\nunbelief become part of their mental posture. These children can therefore\nembrace the gospel which has been instrumental in the formation of their\nChristian worldview, but from a position of understanding and belief,\nand thus are able to profess it verbally. In other words, when an infant’s\nChristian formation comes to completion in their school-age years, you\nhave a baptised person who believes in the gospel and is able to profess the\nsame publicly, thereby becoming a candidate for confirmation. This adds\nto the friendliness of my proposals to Anglican practice of infant baptism.\n5. Conclusion\nGoing by my wide experience of east and central African Anglican churches,\nevangelism has been done consciously, consistently, and robustly in African\nAnglican churches. Unfortunately, the same cannot be said of evangelism\nof preschoolers. Indeed there are those who wait for preschoolers to be of\nage before they evangelise them. Saying “then they will have to decide for\nthemselves whether to accept Jesus or not” is a common sentiment. The\nliturgy for infant baptism which, as we pointed out, presumes subsequent\nevangelism of those baptised is virtually ignored. Any inquiry of African\nAnglican churches’ clergy and lay people reveals that their understanding\nof infant baptism as laid down in the liturgy is de facto replaced by\nunderstandings of infant baptism as a child naming ceremony, or a form\nof child dedication, or even the blessing and protection of a child. In\nsome cases, some clergy and lay people have no understanding of what\ninfant baptism means and simply justify the practice as a required church\ntradition. It is no wonder that it is not uncommon to hear the very priests\nwho baptise infants in African Anglican churches disparaging baptism\nby telling their hearers that it is inconsequential in matters of salvation.\nAfrican Anglican churches are therefore under-prepared to carry out the\npreschoolers’ evangelism proposed above. If they are to evangelise the\nmyriad preschoolers in their churches as I have proposed, and thereby\nbe in harmony with their liturgies of infant baptism, they must prioritise\nand invest financial resources in theological childhood studies for training\ntheir clergy and children’s ministers (Sunday School teachers).\nPrioritising theological childhood education of clergy and children’s\nministers is a prerequisite for the kind of evangelism I propose because\nclergy and those who minister to children must be knowledgeable,\nfrom a theological perspective, on childhood matters, to appreciate\nthe appropriateness of such evangelism and support it. Such critical\nknowledge is acquired via theological childhood studies. Childhood\nstudies concern themselves with manifold subjects on children which\nrange from their nature, development, spirituality, world and contexts, to\ntheir rights, education, health, needs and wants, concerns, and questions.\nAccordingly, theological childhood studies are theological studies focused", "word_count": 505, "start_char": 43604, "end_char": 46892}
{"chunk_id": "DOC0048__00016", "doc_id": "DOC0048", "chunk_index": 16, "text": "uch critical\nknowledge is acquired via theological childhood studies.C\n\nhildhood\nstudies concern themselves with manifold subjects on children which\nrange from their nature, development, spirituality, world and contexts, to\ntheir rights, education, health, needs and wants, concerns, and questions.A\n\nccordingly, theological childhood studies are theological studies focused\n\non children that draw critically from childhood studies for theological\nreflection and discourse on children. Some theological studies focused on\nchildren more directly address areas of children’s ministry by drawing\non childhood studies, and from the Bible and theology. Starting from\nthe 1990s literature on theological childhood studies has been on the\nincrease55 with two journals exclusively devoted to the subject.56 There\nis currently a considerable amount of material to support the theological\neducation of clergy and children’s ministers in Anglican churches in Africa.\nThe Anglican Church of Uganda has taken a step in the right direction by\nhaving theological childhood studies in Bishop Tucker School of Divinity\nand Theology of Uganda Christian University’s Child Development and\nChildren’s Ministry programme at both Bachelor’s and Master’s level.\nChurch Army’s Africa theological college, Carlile College, based in\nNairobi which trains evangelists for the Anglican churches of east and\ncentral Africa has also done the same in offering a diploma course in\nChildren and Family Ministries.\nThe other reason why theological childhood studies for clergy and\nchildren’s ministers in African Anglican churches is a prerequisite for\nthe proposed evangelism of preschoolers has to do with its delivery. For\nthe proposed methods for the evangelism of preschoolers to be carried\nout, Anglican churches need personnel who are not only skilled in child\npedagogy but who can also craft curricula and carefully choose the\nmost appropriate literature for such evangelism. With the objectives\nof evangelising preschoolers through simple concrete explanations of\nthe gospel as well as simple non-explanatory gospel proclamations in\nmind, I have to point out here that the content of such curricula would\nin principle be based mostly on simple gospel stories offered repeatedly\nto preschoolers over the course of their preschool. I venture here to\nsuggest, for a concrete example, that a curriculum could be drawn up\nrevolving around six groups of Jesus stories, namely, divinity, miracle\n55 See Marcia J. Bunge, “The Child, Religion, and the Academy: Developing\nRobust Theological and Religious Understandings of Children and Childhood,”\nJR 84.4 (2006): 549–79; Adrian Thatcher, “Theology and Children: Towards a\nTheology of Childhood,” Transformation 23.4 (2006): 194–99; Diana Wood, ed.,\nThe Church and Childhood, Studies in Church History 31 (Oxford: Blackwell,\n1994); Pamela D. Couture, Seeing Children, Seeing God: A Practical Theology of\nChildren and Poverty (Nashville: Abingdon, 2000); Bonnie J. Miller-McLemore.\nLet the Children Come: Reimagining Childhood from a Christian Perspective\n(San Francisco: Jossey-Bass, 2003); Kristine Henriksen Garroway, “Gendered or\nUngendered? The Perception of Children in Ancient Israel,” JNES 71.1 (2012):\n95–114; Naomi Steinberg, The World of the Child in the Hebrew Bible (Sheffield:\nSheffield Phoenix, 2013).\n56 Namely the International Journal of Children’s Spirituality and the Journal of\nChildhood and Religion.", "word_count": 497, "start_char": 46518, "end_char": 49954}
{"chunk_id": "DOC0048__00017", "doc_id": "DOC0048", "chunk_index": 17, "text": "he Perception of Children in Ancient Israel,” JNES 71.1 (2012):\n95–114; Naomi Steinberg, The World of the Child in the Hebrew Bible (Sheffield:\nSheffield Phoenix, 2013).\n56 Namely the International Journal of Children’s Spirituality and the Journal of\nChildhood and Religion.\n\nstories, passion, resurrection, ascension, and second coming stories. All\nthese groups of stories could be packaged in orderly sequence and offered\nto preschoolers as a complete unit for three months (12 Sundays), four\ntimes through the year. The curriculum would be offered to preschoolers\nwhen they are 3 year olds and re-run yearly in their 4th up to their 7th\nyear but graded, i.e., adjusted per year to match the preschoolers’ agedependant memories, concentration spans, and life experiences. Such\nadjustments would be in the number of words per story, as well as in the\nvarious questions, puzzles, and songs. The adjustments would also be in\nthe audio, dramatical, visual, and musical choices as well as in the verbal\nand kinaesthetic activities chosen to accompany the stories. Simple gospel\nexplanations that are limited to matters that deal with the who? what?\nwhere? when? would accompany these stories and be graded as well.\nI would like to give more concrete details on the kind of curriculum\nthat would be useful for preschoolers’ evangelism that I have proposed,\nfor example, on how the curriculum can be designed to also be useful to\nparents and godparents at home, on how the curriculum can be linked to\nthe church’s major feasts, etc. However I have not designed my paper to\narticulate a curriculum that could serve the evangelism of preschoolers in\nAfrican Anglican churches but to propose how such an evangelism can be\ndone in an initial step towards writing curricula. I have argued here that\nAfrican Anglican churches must invest in theological childhood studies to\ndevelop such competencies amongst their clergy and children’s ministers.\nPETER NYENDE is Associate Professor of New Testament and Head\nof Biblical Studies at Bishop Tucker School of Divinity and Theology,\nUganda Christian University.", "word_count": 335, "start_char": 49679, "end_char": 51776}
