{"chunk_id": "DOC0151__00000", "doc_id": "DOC0151", "chunk_index": 0, "text": "Product Planning and Development on the output of Small scale\nand Medium Enterprises in Uganda case study Northern Division\nKabale municipality\nAlex Akankwasa, Teddy Akakikunda, Ivan Habaasa Akatwijuka, Caroline Matsiko Murezi, John Steve Mugisha\nCorrespondence\nAlex Akankwasa Lecturer Bishop Barham University College/ PhD Student Kabale University\nTeddy Akakikunda PhD Student Kampala International University\nIvan Habaasa Akatwijuka Bishop Barham University College/ PhD Student Kabale University\nCaroline Matsiko Murezi Assistant Lecturer/ PhD Student Kabale University\nJohn Steve Mugisha Lecturer Bishop Barham University College/ PhD Student Kabale University.\nAbstract: The purpose of study was to establish Product Planning and Development on the output of small scale and medium\nenterprises in Northern division Kabale Municipality. The research study was guided by the following research objectives which; to\nidentify the problems experienced by the small and medium enterprises in planning and development of new products in a competitive\nand depressed economy like ours, to establish the possible solutions for effective planning and development of new products in a\ncompetitive environment and to examine the relationship between product planning and development and output of Small scale\nEnterprise. The study deployed both qualitative and quantitative designs. The methods used in the collection of data included\nQuestionnaires, focused group discussions and interviews. The findings revealed that there is a high level of relationship between\nproduct planning and development and the output levels of Small and Medium enterprises in Northern Division Kabale Municipality.\nProduct planning and development are very important for the increase in the level of output since it helps in enhancing increased\nsales volume and thereby leading to more revenue. Therefore all the owners and operators of small and medium scale enterprises\nshould conduct research and innovation so as to be able to come up with new products that are in line with the needs of their\nconsumers so as to be able to retain and maintain them. This can be realized by conducting marketing research and intelligence by\nmoving in the field to establish the needs and the changes in the preferences of the consumers.\nKeywords: Product Planning, Product Development, Output, and Small scale and Medium Enterprises\n1.0 Background to the Study\nAccording Lawal (2000), expresses that failure to plan is planning to fail. There is nothing on earth that does not need appropriate\nplanning. If such thing determined goal must be achieved, appropriate planning is one of the most important aspects of a product life\ncycle. As it is important for somebody who intends to build a house, to draw a plan of the house it is also very important to conduct\nplanning in order for any organization to achieve its goals and objectives and to also remain sustainable in the market. It is quite\nvery important for an organization intending to develop a product to make a necessary and adequate planning for such product so as\nto be able to compete favorably in the market.\nBayati & Taghavi, (2007), mentioned that a strong Small and Medium Enterprises (SMEs) sector contributes highly to the country’s\neconomy, contributing to the Gross Domestic Product (GDP) by reducing the level of Unemployment, reduction in poverty levels\nand promotion of entrepreneurship activity. The role of Small and Medium Enterprises in the development of the country is\nsignificant Small and Medium Enterprises in Uganda and across the globe still encounter many challenges, despite their importance\nand significance of Small and Medium Enterprises and their contribution to economic growth which hinder business growth. It is\nobvious that hurdles in the business success are far more than it was previously. The environments, as well as some factors, are very\ncomplex and dynamic. Small and Medium Enterprises have the ability to make a meaningful reduction in the high level of\nunemployment and contribute to the Gross Domestic Product of the local economy in Uganda.\nThe research study considered the two variables such as product planning and development and output of small and medium scale\nenterprises in Northern Division Kabale Municipality.\nNorthern Division is found in Kabale Municipality Kabale District. It has four wards including Upper Bugongi, Lower Bugongi,\nKijuguta and Rutoma Wards. From the observations conducted it is noted that all small and medium scale enterprises should conduct\nproduct planning and development with the aim of increasing output and overall performance of organizations. Inadequate planning\nand development hinder the levels of out of organizations which limit their overall development.\n2.0 LITERATURE REVIEW\n2.1 Need for New Product planning and development.\nEvery organization whether profit oriented or not exist for the society in which it operates. Garba (2000) asserts that the purpose of\nan organization is to provide benefit and or value to the society. In essence, the continued relevance of any organization lies in its", "word_count": 782, "start_char": 0, "end_char": 5112}
{"chunk_id": "DOC0151__00001", "doc_id": "DOC0151", "chunk_index": 1, "text": "very organization whether profit oriented or not exist for the society in which it operates.G\n\narba (2000) asserts that the purpose of\nan organization is to provide benefit and or value to the society.I\n\nn essence, the continued relevance of any organization lies in its\n\nability to develop in line with the needs and changes of the society. This is in agreement with the view of Drucker (1975) that product\npolicy is the core of a company’s approach to the market place and a determining factor in its overall business strategy while Levitt\n(1975) opines that since the market place determines whether companies live or die all corporate decisions must be based upon the\nneeds in the market. Therefore, the ever changing consumer needs and the quest by organizations to accommodate and satisfy these\nneeds, demands for development of new product.\n\nStorely (1997), emphasizes that in response to these environmental changes organizations must initiate changes, innovations and\nrenewed emphasis in customer orientation to improve their viability. Reaffirming similar view\nLear (1963), says that any organization lacking in product planning and development as still operating on the basis of product\norientation which he described as a hangover from an. earlier economy, and as being a “management by convenience” that ignore\nthe fundamental principle that Businesses exist to serve customers efficiently with maximum accommodation. Also, it could be\ndeduced that companies not involved in product planning and development still depend on Chance occurrence to succeed, which\nunfortunately no longer holds in today’s business environment. Hence, Akadiri, (1999) advised that as long as you live you keep\nlearning how to live.", "word_count": 268, "start_char": 4842, "end_char": 6564}
{"chunk_id": "DOC0151__00002", "doc_id": "DOC0151", "chunk_index": 2, "text": "lso, it could be\ndeduced that companies not involved in product planning and development still depend on Chance occurrence to succeed, which\nunfortunately no longer holds in today’s business environment.H\n\nence, Akadiri, (1999) advised that as long as you live you keep\nlearning how to live.\n\nDrucker (1979), in his own contribution said that if the business entrepreneur succeeds it is not by chance it is because the business\ngrew from not only meeting the needs of the future but shaped the future as well. In addition, Levitt (1975) submits that to continue\ngrowing companies must ascertain and act on their customers’ needs and desires not banking in the prescriptive longevity of their\nproducts.\nInternational labor organization (1984) in Nigeria oil and gas directory 1992 first edition suggest that a new type of material may\nlead to new product ideas. For example, the properties of synthetic fibers such as nylon, made it technically possible to produce dripdry shirts, seamless stockings and a variety of other product s which did not exist thirty years ago.\nGrazia (1975), commented on how this has led manufacturers to seek constantly to be innovators and to introduce new products\nwhile Ogiluy offered what he called a practical advice which is “Always try to inject news into your headline, because the consumer\nis always on the lookout for new products or new ways to use and not old product”.\n2.2 Strategies that can be applied in new Product development.\nApplication Engineering;\nGaba (2000) says that basing on product modification there is need to produce goods that fit the needs of particular consumers in a\nmature market. This strategy implies; Substantial product design and engineering resources but no research and little real\ndevelopment, Ready access to product users within customer companies, Technically perceptive salesmen and sales engineers who\nlink closely with product designer, Good product line control to prevent costly proliferation, Considerable cost consciousness in\ndeciding what application to develop, An Efficient oriented manufacturing organization, A flair for minimizing development and\nmanufacturing cost by using the same parts or elements in many different applications. This strategy avoids innovative efforts in the\ninterest of economy, planning is precise, assignments are clear and new technology is introduced cautiously well behind the economy\nof state of the art and management is product oriented.", "word_count": 383, "start_char": 6273, "end_char": 8730}
{"chunk_id": "DOC0151__00003", "doc_id": "DOC0151", "chunk_index": 3, "text": "his strategy avoids innovative efforts in the\ninterest of economy, planning is precise, assignments are clear and new technology is introduced cautiously well behind the economy\nof state of the art and management is product oriented.\n\nDiversification; This strategy requires diversifying into new markets and needs consideration of four important factors which Corey\nstated in question form for managers to ask. Does the market have high growth potential?, Is the market currently dominated by\nlarge and powerful competitors or is it still possible to claim a large market share so as to enjoy large return on investment than\ncompetitors with low market share. In the words of Corey, having large market share enable a company enjoy low unit cost position,\nsupport large Research and development effort and exercise some price leadership, Is the market easy or difficult for competitors to\nenter?, How high is the value added by manufacturers and vice-versa. According to him, low value low value added tends to make\nthe product market opportunity less attractive and vice versa.\nProduct Line Proliferation; This strategy he says may be in response to any of the following. An extension of a product line to\nprovide a range of sizes; models or specification each designed for some particular market segments and use as a competitive weapon\nto fight for market share, Growth in product line, in larger and large unit, as technology permits and market needs of growth. This is\noften used to achieve overall market leadership, preserving a dominant market share and increased profits, defense of market position\nagainst competitors as a result may suffer a sharp drop in market share or add products to match competitive offerings and suffer a\nlost in Profits.\nInnovation Strategy.\nIn the words of Levitt, (1975) this strategy occurs only when something is entirely new, having never been done before. It is research\nand development undertaken to create what might be referred to as breakthrough newness.\nInnovative Imitation: This strategy occurs when other competitors in the same industry subsequently copy the innovator even though\nit is something new for them. According to Levitt, (1975) this strategy is nothing more than simple design and development. This", "word_count": 361, "start_char": 8497, "end_char": 10758}
{"chunk_id": "DOC0151__00004", "doc_id": "DOC0151", "chunk_index": 4, "text": "t is research\nand development undertaken to create what might be referred to as breakthrough newness.I\n\nnnovative Imitation: This strategy occurs when other competitors in the same industry subsequently copy the innovator even though\nit is something new for them.A\n\nccording to Levitt, (1975) this strategy is nothing more than simple design and development.T\n\nhis\n\nstrategy is adopted by companies where they are self-consciously aware, that the possibilities of innovation within their companies\nare in some important ways limited.\nLevitt (1975) has variously termed this strategy “The watchful waiting business strategy” and “The used apple policy” .According\nto him, a company consciously and carefully adopts this practice of never pioneering a new product. It says in effect, you don’t have\nto get the first bite on the apple to make out. The second or third juicy bite is good enough. Just be careful not to get the tenth skimpy\nbite. That is, if the innovators product is rotten apple, the imitator lost nothing, if it is healthy, he is prepared to move quickly and\nget an early and profitable price of it.\n2.3 Relationship between product planning development and output of Small Scale Enterprises\nWheelwright et al (1992) argues that product planning helps to create competitive advantage in several ways. Some of them include\nthe following;\nThey hold the views that an entrepreneur needs to plan effectively its product policies so as to be able to offer the best services to its\nclients and at the same time add value to the product being offered for sale. That the worth of a company depends largely on the kind\nof services it gives out to its customers and as such proper planning and implementation of product going out to the company enhance\nself-services to customers.\n\nThere is the need or desire to gain consumer’s affluences. A consumer expresses their loyalty by purchasing product of a particular\ncompany. This type of affluence being demonstrated by consumers is an example of market acceptability of a product which can\nonly be achieved through improved planning and development. Good product planning and development policy enhances the\ncompany image in today competitive and dynamic market place. For an organization to gain wider acceptance in the market and for\nit’s products to get the largest market share, the producer need to plan and implement an effective product planning strategies aimed\nat positioning the companies developmental programs toward a successful market acceptance.", "word_count": 404, "start_char": 10394, "end_char": 12908}
{"chunk_id": "DOC0151__00005", "doc_id": "DOC0151", "chunk_index": 5, "text": "or an organization to gain wider acceptance in the market and for\nit’s products to get the largest market share, the producer need to plan and implement an effective product planning strategies aimed\nat positioning the companies developmental programs toward a successful market acceptance.\n\nProduct planning and development enhance addition to a company’s product line.\nFurthermore, product planning and development are two essential tools with which organization empowers itself to get the largest\nshare in a particular market The producer with the largest share makes the largest sales and ultimately gets the biggest profit in\nreturn.\n\nYoram (1982) also point out the need to venture into a new area of business interest coupled with the need to engage in other line of\nproduction as an alternative way to show the financial responsibility of a producer. He said that this could be attained through product\nplanning and subsequently developing a new product. The present economic situation of the market requires a diversionary approach\nto marketing as a result of this dynamism. Procedures are expected to regularly diversify production in order to be able to keep up\nto the challenges.\n\n3.0 RESEARCH METHODOLOGY\n3.1 Research Design\nThe research Study used a descriptive research design which specified the methods and procedures for acquiring the required and\nneeded data.\n3.2 Location of study\nThis study was carried out Kabale Municipality Northern division.\n3.3 Population of the study\nThe population of the study was 80 respondents from Northern Division Kabale Municipality involved in Small and Medium Scale\nenterprises.\n3.4. Sample Size\nCategory\nPopulation\nSample\nSampling Technique\nOwners of SMES\nSimple random Sampling\nEmployees of SMES\nSimple Random Sampling\nCustomers\nSimple Random Sampling\nTotal\n\nSource; Field (2022)\n\n3.5 Method of Data Collection\nData was collected using observation and questionnaires methods.\n3.6 Data Processing and Analysis\nData obtained was analyzed by simple categorization such as frequency distribution table and simple percentage. The data was\nsorted, edited and coded and presented in written form and also analyzed using SPSS V 17.0.\n4.0 Presentation, Analysis and Interpretation of findings\n\n4.1 Age of the respondents\n\nTable 4.1 Showing age of respondents\n\nValid\n14-23\n8.5\n\n24-33\n17.4\n\n34-43\n56.2\n\n44-53\n14.4\n\nAbove 53\n3.5\n\nTotal\n100.0\nSource: Primary data, (2022)\nFrom the table above it is noted that majority of the respondents were in the age bracket of 34 – 43 as shown by 56.2%, 14 – 23\nrepresented by 8.5%, 24 – 33 stipulated by 17.4%, 44 – 53 asserted by 14.4% and 53 years and above as expressed by 3.5%\n4.2 Sex of the respondents\nTable 4.2 Sex of the respondent\nPercent\n\nMale\n54.2\n\nFemale\n45.8", "word_count": 437, "start_char": 12618, "end_char": 15371}
{"chunk_id": "DOC0151__00006", "doc_id": "DOC0151", "chunk_index": 6, "text": "Total\n100.0\nAs stipulated above, it is observed that 54.2% of the respondents were Males and Females were 45.8%.\n4.3 Marital status of the respondents\nTable 4.3 Marital status of the respondents\nValid\nSingle\n34.8\n\nMarried\n60.2\n\nOthers\n5.0\n\nTotal\n100.0\nFrom the illustration above it is noted that 60.2 % of the respondents were married, 34.8% were single and 5.0 % were among the\nothers.\n4.4 Education level of the respondents\nTable 4.4 Education level of the respondents\n\nNon-formal\n11.4\n\nPrimary\n22.4\n\nSecondary\n23.9\n\nDiploma\n13.9\n\nDegree\n26.9\n\nOthers\n1.5\n\nTotal\n100.0\nSource: Primary Data, 202\nAs seen above it is noted that 11.4% of the respondents had no formal education, 22.4% were primary holders, 23.9% were\nsecondary level leavers, 13.9% were Diploma holders, 26.9% were Degree holders and 1.5% were in the others category.\n4.5 Occupation of the respondents\nTable 4.5 Occupation of the respondents Table showing occupation of respondents\n\nTransport\n11.9\n\nHair dressing (Saloon)\n6.0\n\nWelding, metal work and fabrication\n10.4\n\nMechanic and wood work\n3.5\n\nBusiness (Shops, selling in markets)\n64.7\n\nGrain milling and bakery\n3.5\nTotal\n100.0\nSource: Primary Data, 2020\nAs observed above, it is seen that 11.9% of the respondents were engaged in transport, 6.0% were involved in Hair Dressing, 10.4%\nwere in welding, metal work and fabrication, 64.7% participated in Business (Shops, and selling in the markets) and 3.5% were\ninvolved in Grain milling and bakery.\n4.6 Need for product planning and development\nTable 4.6 The need for product planning and development\nNeed\nProfit Maximization\nEnvironmental change management\nMeeting the needs of the consumers\nAssists in product orientation\nEncourage innovation\nTotal\nFrom the table above it is noted that 23% of the respondents exemplified that product planning and development helps in profit\nmaximization, 27% asserted that it assists in environmental change management, 17% came up with helps in meeting the needs of\nthe consumers, 16% noted that it aids product orientation and 17% stated that it helps in encourage innovation.\n4.7 Strategies used product planning and development\n4.7 Table showing the strategies used in product planning and development", "word_count": 346, "start_char": 15371, "end_char": 17582}
{"chunk_id": "DOC0151__00007", "doc_id": "DOC0151", "chunk_index": 7, "text": "Strategy\nApplication engineering\nDiversification\nProduct line proliferation\nInnovation strategy\nTotal\nThe table shows that a number of strategies may be used in product planning and development. It is noted that 20% of the\nrespondents stipulated that application engineering may be used, 27% expressed that Diversification strategy can also be\nadopted,22% put forward that Product line proliferation is very core in as far as promoting product planning and development is\nconcerned and 30% stated that the innovation strategy can also be incorporated in enhancing the exercise of product planning and\ndevelopment.\n4.8 The relationship between product planning and development and output of SMEs\nTable 4.8 shows the relationship between product planning and development and output of SMEs\nPercent\nNew product is produced and sold in the market\nProduct that has been developed for one geographical\nmarket\nEmployment excluding rural small agriculture and\npastoralists activities\nPackaging enhances production of new products\nTotal\n100.0", "word_count": 151, "start_char": 17582, "end_char": 18615}
{"chunk_id": "DOC0151__00008", "doc_id": "DOC0151", "chunk_index": 8, "text": "As stated above, it is seen that Product Planning and development is core in as far as the level of output is concerned. This is\nbecause it helps in coming up with new product as shown by 24% of the respondents, 24% came up with product development for\none geographical area, 25% stated that it helps in creation of employment opportunities and 27% stipulated that it helps in\npromoting packaging which leads to production of new products.\n5.0 Conclusion & Recommendations\n5.1 Conclusion\nThere is a significant and big relationship between product planning and development and the levels of output of small and\nmedium scale enterprises in Northern Division Kabale Municipality. Product planning and development is very necessary for the\nlevels of output of Small and Medium Scale enterprises as it helps in addressing issues concerning with quality and quantity levels\nof production in many businesses.\nThe owners of small and medium scale enterprises have problems relating to planning and development of their products which\nhas greatly affected the levels of output and also their growth. Therefore Small and medium scale enterprises are advised to make\nsure that they conduct research and innovation strategies in order to be able to produce products and render services that are\ndemand driven. This will help in increasing Sales volume, customer satisfaction and retention and also achieve high levels of\nprofitability. This is because product planning and development is very important in as far as profit maximization is concerned due\nto an increase in the levels of sales volume and high levels of output.\n5.2 Recommendations\nThe research study recommended that: there is need to widen market to reduce competition, reduce or control interest rate,\nencourage and promote saving culture among the people with the aim of starting up income generating activities, put in place\nfavorable policies and regulations to promote the private sector.", "word_count": 310, "start_char": 18615, "end_char": 20562}
