{"chunk_id": "DOC0031__00000", "doc_id": "DOC0031", "chunk_index": 0, "text": "EXAMINING GENDER INEQUALITY IN UGANDAN NEWSROOMS: A CASE OF\nPOWER FM\nRACHEAL ATUHAIRE\nS21BO4/080\nA DISSERTATION SUBMITTED TO THE SCHOOL OF JOURNALISM, MEDIA AND\nCOMMUNICATION IN PARTIAL FULFILLMENT OF THE REQUIREMENTS FOR THE\nAWARD OF A DEGREE OF BACHELOR OF ARTS IN JOURNALISM AND COMMUNICATION\nOF UGANDA CHRISTIAN UNIVERSITY\nSeptember, 2024\n\ni\n\nii\nAPPROVAL\n\niii\n\nDEDICATION\n\nI dedicate this research to my parents Mr. Kankya Clovice and Mrs. Resty Tugumisirize,\nwho advised, sponsored and mentored me throughout my studies to university level.\nAnd most of all I want to thank the Almighty father for his guidance towards the\ncompletion of my dissertation\n\niv\n\nACKNOWLEDGEMENT\n\nI sincerely give thanks to Miss Prever Mukasa, my supervisor for his effective supervision,\ndedication, availability and professional advice.\nI also thank my dear parents Mr. Kankya Clovice and Mrs. Resty Tugumisirize, for the\nbeing with me at every step.\nTo my employees at Power FM Uganda, thank you for providing relevant information,\nwhich helped in a proper and successful completion of the study.\nI am grateful to the Almighty God, through Jesus Christ, for the good health and\nstrength bestowed upon me to be able to carry out the research successfully from the\nbeginning right to the end.\n\nv\n\nTABLE OF CONTENTS\nDECLARATION ........................................................................................................................................ i\nAPPROVAL .............................................................................................................................................. ii\nDEDICATION ......................................................................................................................................... iii\nACKNOWLEDGEMENT ......................................................................................................................... iv\nABSTRACT ........................................................................................................................................... vii\nCHAPTER ONE....................................................................................................................................... 1\n1.0 Introduction............................................................................................................................... 1\n1.2 Background ................................................................................................................................ 1\n1.3 Problem statement................................................................................................................... 3\n1.4 General purpose ....................................................................................................................... 4\n1.5 Research objectives ................................................................................................................. 4\n1.6 Research questions .................................................................................................................. 4\n1.7 Scope of the study.................................................................................................................... 4\nCHAPTER TWO ...................................................................................................................................... 6\nLITERATURE REVIEW........................................................................................................................ 6\n2.0 Introduction............................................................................................................................... 6\n2.1 Literature Review Summary ................................................................................................. 10\nTHEORETICAL AND CONCEPTUAL FREAME WORK. ................................................................... 10\n2.2 Introduction............................................................................................................................. 10\n2.3 Conceptual framework .......................................................................................................... 11\nCHAPTER THREE ................................................................................................................................ 13\nMETHODOLOGY .............................................................................................................................. 13\n3.0 Introduction............................................................................................................................. 13\n3.1 Research design ...................................................................................................................... 13\n3.2 Study population .................................................................................................................... 13\n3.3 Data collection methods and tools ...................................................................................... 14\nCHAPTER FOUR .................................................................................................................................. 18\nPRESENTATION AND ANALYSIS OF RESULTS ............................................................................... 18\n4.0 Introduction............................................................................................................................. 18\nTable of findings ................................................................................................................................ 18\n4.1 Key findings ............................................................................................................................. 19\nCHAPTER FIVE .................................................................................................................................... 26\n\nvi\n\nSUMMARY OF FINDINGS, CONCLUSION AND RECOMMENDATION. ............................................ 26\n5.0 Introduction............................................................................................................................. 26\n5.1 Summary of findings .............................................................................................................. 26\n5.2 Conclusion ............................................................................................................................... 27\n5.3 Recommendations. ................................................................................................................. 28\n5.4 Areas for further research. .................................................................................................. 29\nReferences.......................................................................................................................................... 29\nAPPENDICES ........................................................................................................................................ 31\n\nvii\n\nABSTRACT", "word_count": 384, "start_char": 0, "end_char": 6975}
{"chunk_id": "DOC0031__00001", "doc_id": "DOC0031", "chunk_index": 1, "text": "Gender inequality is a prevalent issue in Ugandan newsrooms, with men being\ndominant, women less represented and at a high chance of facing harassments in the\nwork environment. This research focuses on gender dynamics in Uganda’s newsrooms\nwith special attention to Power FM. From feminist theory perspective, this topic\ninvestigates the issue of women representation in leadership positions, gender bias in\nnews content as well as experiences that female journalists undergo.\nThe outcomes indicate a wide gap between men and women journalists perpetuating\nstereotypes about gender and limiting opportunities for females. The study therefore\ncalls for policies and practices that are sensitive to gender dimensions so as to redress\nsystemic gender inequality within Uganda’s media industry. It contributes to the\nongoing dialogue on media and gender by emphasizing how inclusive newsrooms\npromote diversity of views while ensuring equal representation.\nThe suggestions given by this study might benefit individuals working towards achieving\nfairer media systems both inside Uganda and at international levels like researchers,\npractitioners and policy makers. Particularly, some strategies would be suggested based\non findings from this research for consideration. I.e. increasing women’s representation\nin leadership positions, addressing gender bias in news coverage, and creating a more\nsupportive work environment for female workers.\nThis study has reviewed gender inequalities that exist within Ugandan newsrooms using\na specific case of Power FM. Using representation, opportunity, and treatment of\nwomen working at the place as measures, the research found vast differences that exist\nin this company owing to a lack of diversity and perpetuation of stereotypes and biases\nbased on gender. The data are showing underrepresentation in leadership positions,\ndiscrimination on gender grounds, stereotypical reporting of women.\n\nviii\n\nRecommendations:\n\nTherefore, this study prescribes that Power FM must commit to changing its system\nthrough periodic training on diversity and inclusion; updating policies and practices to\nscan and mitigate systemic barriers to gender equality; and ensuring staff have equal\nunderstanding and equal responsibility in these development merits. The study\nrecommends specifically:\nMandatory training for the entire staff from entry-level workers to other leadership\npositions\nIt should review hiring, promotion guidelines, and editorial processes against fair\npromotions to ensure they do not have a bias; secondly, it should develop a Diversity\nand Inclusion strategy that will realize gender equality and an inclusive culture at the\nworkplace.\nImplementation of these recommendations may be how Power FM increases gender\nequality, diversity, and inclusion, and thus impacts the reputation of the company while\nfurthering the cause of a more equitable media landscape in Uganda.\n\nCHAPTER ONE", "word_count": 419, "start_char": 6975, "end_char": 9902}
{"chunk_id": "DOC0031__00002", "doc_id": "DOC0031", "chunk_index": 2, "text": "mplementation of these recommendations may be how Power FM increases gender\nequality, diversity, and inclusion, and thus impacts the reputation of the company while\nfurthering the cause of a more equitable media landscape in Uganda.C\n\nHAPTER ONE\n\n1.0 Introduction\nThe inequality is still business as usual in most media houses, especially in Uganda,\nwhere cultural and institutional barriers still limit women's participation in journalism.\nThis chapter reviews how far or near to equality the Ugandan newsrooms are, with a\nspecific focus on Power FM.\n1.2 Background\nGender inequality is a world-wide problem, but it is pronounced in Uganda. Uganda is\nranked 78th out of 146 countries in terms of gender equality according to the world\neconomic forum’s global gender gap report 2023(WEF_GGGR_2023, n.d.) Gender\ninequality Is due to several factors, including stereotypes and biases, pay gap, lack of\npresentation, work life balance, harassment and discrimination.\nOn the global scale, inequality between women and men is still part of a major\nchallenge. According to the United Nations, women hold only 24% of all parliamentary\nseats worldwide(2020-Women in Parliament_EN-LR_0, n.d.). Women are underrepresented\nin leading positions in the most various spheres. Women lack equal rights in education\nlevels and job offers; the female labor force participation rate amounts to 64% globally,\nwhile the male rate is 76%(The Gender Gap in Employment: What’s Holding Women Back? -\nInfoStories, n.d.).\nGender equality is fast becoming a reality in the African region. The African\nDevelopment Bank, however, reports that women remain a meager 24 percent of\nAfrica's parliamentary seats and hold disproportionately few leadership positions in\nmost spheres of life(Gender, 2020). Women in Africa also experience high rates of\ngender-based violence, with 45 percent having reported being victims of sexual or\nphysical violence(Devastatingly Pervasive: 1 in 3 Women Globally Experience Violence, n.d.).", "word_count": 297, "start_char": 9657, "end_char": 11647}
{"chunk_id": "DOC0031__00003", "doc_id": "DOC0031", "chunk_index": 3, "text": "he African\nDevelopment Bank, however, reports that women remain a meager 24 percent of\nAfrica's parliamentary seats and hold disproportionately few leadership positions in\nmost spheres of life(Gender, 2020).W\n\nomen in Africa also experience high rates of\ngender-based violence, with 45 percent having reported being victims of sexual or\nphysical violence(Devastatingly Pervasive: 1 in 3 Women Globally Experience Violence, n.d.).\n\nThe causes of gender inequality in Africa are complex, multi-dimensional, and\nmultifaceted, also encompassing cultural and societal norms that cause discrimination\nagainst women, limited economic opportunities, and poor legal systems that protect\nwomen's rights(ACCELERATE GENDER EQUALITY FOR A SUSTAINABLE, RESILIENT, AND INCLUSIVE\nFUTURE, n.d.).\nThe news media industry in Uganda is no exception to this issue. According to global\nmedia monitoring project (GMMP) findings 2022(Global Media Monitoring Project, n.d.),\nstories by female reporters had a 36% representation and 64% representation for the\nmales. In the 2022 report by the international women’s media foundation, women only\nmade up 28% of journalists and media workers in Uganda(Byerly, 2011)\nThis study assesses gender equality in Ugandan newsrooms, in particular, at Power FM,\nto identify barriers to, and inform strategies on how women can be assisted to improve\ntheir participation in journalism. surveys and interviews coupled with thematic analysis\nwill be used to source the data from selected industry players.\nThese are some of the factors that have contributed to gender inequality in Ugandan\nnewsrooms and these include historical biases, work-life balance, stereotypes, lack of\nrepresentation and harassment.\nImpacts of gender inequality in newsrooms.\nLow representation of women in news coverage perpetuates a narrow range of\nperspectives and is usually reported with respect to traditional themes such as\nreproductive rights, gender-based violence, and health inequities. Much of this limited\ncoverage frames the female experience from the point of view of men and perpetuates\nstereotypes that place women in only a caregiver or victim role, rather than as leaders\nand change agents(The Missing Perspectives of Women in News, n.d.).\nIt not only furthers these stereotypes but also undermines the credibility of news\norganizations when women are underrepresented in editorial positions. This can create\nan impression in audiences that lack of gender diversity shows bias, thus leading to\ndiminished trust and lower engagement. Moreover, gender-biased media confirms or", "word_count": 372, "start_char": 11218, "end_char": 13793}
{"chunk_id": "DOC0031__00004", "doc_id": "DOC0031", "chunk_index": 4, "text": "t not only furthers these stereotypes but also undermines the credibility of news\norganizations when women are underrepresented in editorial positions.T\n\nhis can create\nan impression in audiences that lack of gender diversity shows bias, thus leading to\ndiminished trust and lower engagement.M\n\noreover, gender-biased media confirms or\n\nreinstates societal norms that facilitate discrimination against women, thus impeding\nsocial advancement(Advisory Committee on Equal Opportunities for Women and Men Opinion\non NEW CHALLENGES FOR GENDER EQUALITY IN THE CHANGING WORLD OF WORK, n.d.).\nThus, a toxic workplace culture can be one major reason for attrition and low morale\nin the case of female journalists, and it normally finds its roots in gender inequality. In\naddition, the lack of mentorship and professional development opportunities further\naggravates feelings of isolation and frustration at stake for women's professional\ngrowth(Byerly, 2011).\nIf media operations do not reflect their various audiences, it leaves large portions of\ntheir populations disaffiliated most particularly women and other underrepresented\ngroups. It may result in a decrease in audience engagement and lost opportunities to\nportray how women contribute much to society.\nThis need to correct gender inequity in newsrooms is not only a concern for the media\nindustry but also for a better, more balanced, and enlightened society. It will correct\nthe imbalances and lead to the enrichment of the general discourse and social equity\nby giving a greater representation to voices and viewpoints from across a wide\nspectrum(Advisory Committee on Equal Opportunities for Women and Men Opinion on NEW\nCHALLENGES FOR GENDER EQUALITY IN THE CHANGING WORLD OF WORK, n.d.).\n1.3 Problem statement\nDespite the promotion of gender equality, women remain underrepresented in\nmanagement and other leadership levels at Power FM and in most newsrooms in Uganda.\nThis perpetuates stereotypes and consequently gives little varied perspectives in the\nnews. According to research got from International Women’s Media Foundation,2021,\nonly 27% of the top management positions in media are held by women. They also often\nface these inequalities in opportunities, salaries and presentations. Female journalists\nare also seen to be harassed sexually in order to attain these positions in the media\nhouses, lack of approval of women’s suggestions by men because they are seen as\ndominant, sexists, threats as well as lack of justice in advertising. This hinders female\ngrowth as well as diverse and balanced news reporting(Robertson et al., 2021).", "word_count": 390, "start_char": 13458, "end_char": 16060}
{"chunk_id": "DOC0031__00005", "doc_id": "DOC0031", "chunk_index": 5, "text": "emale journalists\nare also seen to be harassed sexually in order to attain these positions in the media\nhouses, lack of approval of women’s suggestions by men because they are seen as\ndominant, sexists, threats as well as lack of justice in advertising.T\n\nhis hinders female\ngrowth as well as diverse and balanced news reporting(Robertson et al., 2021).\n\n1.4 General purpose\nThis topic general purpose is to:\nExamine Gender Inequality in Ugandan Newsrooms: A Case of Power Fm.\n1.5 Research objectives\n Identify the challenges female journalists encounter in the newsrooms\n Investigate the degree to which gender inequality extends to career growth and\nprofessional development for female journalists.\n To identify ways of advancing gender equality and countering harmful gender\nstereotypes in the media industry.\n1.6 Research questions\n What challenges do female journalists encounter in the newsrooms.\n What is the degree to which gender inequality extends to career growth\nand professional development for female journalists?\n In what ways of can gender equality be advanced and how can harmful\ngender stereotypes in the media industry be countered?\n1.7 Scope of the study\nGeographical Scope\nThis research was conducted at Power FM located in mukono District. The researcher\nset out to assess its impact in the context of the Ugandan media landscape.\nContent Scope\nThe study’s content will include content on (here specify what you will be studying,\nwhat areas? For example, women’s stereotyping or gender inequality). The content\nscope only includes the areas of study you intend to include in your study.\nTime Scope\nThis study covered trends in the last ten years, this was very instrumental in creating\nan enabling media environment. Strategic planning, long term impacts on the company,\nmeasurable progress, industry trends, and proof that organizational change is", "word_count": 294, "start_char": 15707, "end_char": 17583}
{"chunk_id": "DOC0031__00006", "doc_id": "DOC0031", "chunk_index": 6, "text": "he content\nscope only includes the areas of study you intend to include in your study.T\n\nime Scope\nThis study covered trends in the last ten years, this was very instrumental in creating\nan enabling media environment.S\n\ntrategic planning, long term impacts on the company,\nmeasurable progress, industry trends, and proof that organizational change is\n\nnecessary. These five aspects helped Power FM go out of its way in achieving gender\nequality and hence not only improve the status of its female journalists but also of the\nmedia fraternity at large\nJustification for the Study\nGender inequality is one big issue that cannot be sidestepped if there is to be any\nimprovement in media representation and societal impact. It is hoped that this study\nwill add to the present discourse regarding gender equality in journalism.\nSignificance\nThe significance of this study will provide a thorough understanding of the extent and\nnature of gender inequality in the newsrooms in Uganda. This will help promote\neffective policies and programs in addressing gender inequality in the news media\nindustry.\nMoreso it will identify the factors that lead to gender inequality in Ugandan newsrooms.\nThis will help develop a set targeted intervention to address the factors\nIn addition, it will identify the measures implemented to reduce or stop gender\ninequality in the Ugandan newsrooms. This will raise awareness of the issue and\nadvocate of change", "word_count": 230, "start_char": 17233, "end_char": 18668}
{"chunk_id": "DOC0031__00007", "doc_id": "DOC0031", "chunk_index": 7, "text": "oreso it will identify the factors that lead to gender inequality in Ugandan newsrooms.T\n\nhis will help develop a set targeted intervention to address the factors\nIn addition, it will identify the measures implemented to reduce or stop gender\ninequality in the Ugandan newsrooms.T\n\nhis will raise awareness of the issue and\nadvocate of change\n\nCHAPTER TWO\nLITERATURE REVIEW\n2.0 Introduction\nThis chapter reviews the literature available on the subject of gender inequality in the\nmedia, along with some findings and gaps from the research.\nThe Ugandan news media has a platform of sending out information, influencing and\nshaping public opinions in different ways, however gender inequality continues to thrive\nin newsrooms. As we get into the literature review, we commence on a journey to the\nexisting body of research and expose the unfair representation and treatment of the\nfemale journalists In the Ugandan newsrooms with our most concern on Power FM.\nBarbara Kaija 2013 ‘Uganda; women near parity but still leaving newsrooms. is an\nexploration of a wider implication for journalistic integrity, diversity and raise of the\nfemale journalists to the top of the board. This aims to uncover the gaps, patterns and\nhighlights that bring out the issue gender inequality in Ugandan newsrooms(Kaija,\n2013).\nCauses of gender inequality in newsrooms.\nAn underrepresentation of women in leadership positions: Studies have shown that\nwomen are highly underrepresented in Ugandan newsrooms, particularly in influential\ndecision-making positions. As Rosemary Amutuhaire, rightfully said, \"Women occupy\nvery few top management positions in media organizations.\" As can be seen, it is linked\nto societal attitudes that favor traditional male/female roles and place family\nresponsibilities ahead of career aspirations for women. This therefore, puts them in a\nvicious cycle where their prospects for advancement are nonexistent, thus perpetuating\ngender inequality in the news media (Icaza & Schiphorst, 2018).\nGender-Based Discrimination and Hostile Work Environment\nAlong with underrepresentation, female journalists in Ugandan newsrooms often face\ngender-based discrimination and harassment, hostile work environment. As Nalwanga\nelaborates, such discrimination manifests in aspects such as unequal pay, no promotion,", "word_count": 339, "start_char": 18326, "end_char": 20636}
{"chunk_id": "DOC0031__00008", "doc_id": "DOC0031", "chunk_index": 8, "text": "ender-Based Discrimination and Hostile Work Environment\nAlong with underrepresentation, female journalists in Ugandan newsrooms often face\ngender-based discrimination and harassment, hostile work environment.A\n\ns Nalwanga\nelaborates, such discrimination manifests in aspects such as unequal pay, no promotion,\n\nand stereotyping. Mujjawa, 2013 opines that such toxic workplace culture does not only\naffect the morale of the women but also inhibits their professional growth and\ndevelopment. This fact is further compounded by the prevalence of sexual harassment\nin such media organizations, which makes it hard for women to prosper in their careers.\nMedia Representation and Stereotyping\nAnother important issue is the portrayal of women in Ugandan media. Studies have\nshown that Ugandan media all too often perpetuates gender stereotypes, thus fostering\ndestructive attitudes toward women(Kasoma, 1997). The foundation of African ethics\nand professional practice of journalism. A case for society-centred media morality\nWomen are usually portrayed in traditional roles, like caregivers and home keepers,\nrather than leaders or experts in their fields. With such framing of women, this tends\nto make public perceptions both narrow in scope concerning women's capacities and\ncontributions, hence worse regarding entrenching sex biases within society.\nThe 2023 Gender Media Monitoring Report(Project Title: Media for Gender Equality and Social\nJustice: Leaving No One Behind GENDER MEDIA MONITORING FINDINGS, 2020), compiled by\nthe Uganda Media Women's Association, for example, shows that women constitute only\na paltry 25% of news sources quoted across different media spectrums, marked by\ninequalities in gender representations. This inequality is even more pronounced in radio\nand television, where the visibility of women is even lower. The report calls for media\nhouses to adopt gender-sensitive reporting as one sure way of ensuring that the voice\nof women is well represented in news coverage.\nDealing with Gender Inequality\nDespite the challenges, however, attempts to make newsrooms in Uganda more gendersensitive have been made. These are, among others, training and the formulation of\ngender-sensitive policies that place a focus on the increased representation and\nparticipation of women in the media, as seen by WAN-IFRA (2018). Unfortunately, these\nhave not quite resolved the systemic obstacles in the path of women toward this\nprofession. For instance, UMWA has pointed out the importance of increased budgetary", "word_count": 365, "start_char": 20327, "end_char": 22852}
{"chunk_id": "DOC0031__00009", "doc_id": "DOC0031", "chunk_index": 9, "text": "hese are, among others, training and the formulation of\ngender-sensitive policies that place a focus on the increased representation and\nparticipation of women in the media, as seen by WAN-IFRA (2018).U\n\nnfortunately, these\nhave not quite resolved the systemic obstacles in the path of women toward this\nprofession.F\n\nor instance, UMWA has pointed out the importance of increased budgetary\n\nallocations to gender-responsive media training and policies that enable fair newsroom\nrepresentation.\nmore so, the Constitution of Uganda guarantees equal opportunities between women\nand men in all sectors, providing for affirmative action to increase women's\nparticipation in development. However, these policies are inconsistently put into\npractice, and much more should be done to ensure it creates some change in the media\nlandscape.\nGender inequality is still a major problem in Ugandan newsrooms; women are\nunderrepresented, discriminated against, and stereotyped. These are some of the\nchallenges that need to be addressed if there is going to be any meaningful\ndevelopment toward gender equality and better female representation in the media.\nSince the media plays a major role in shaping the imagery of society, all stakeholders\nin cooperation must strive to create an enabling environment that empowers women\nand enables their voices to be heard.\nFor example, a study by Amutuhaire Rosemary (2018) exploring gendered experiences\nof women working in the media industry in Uganda; a case of Uganda Broadcasting\nCorporation, notes that the media work place is gendered and prioritizes men and\nmasculinity at the expense of femininity and women. And women face discrimination,\nsexual harassment and stereotypes which have been normalized.\nA study by the African Center for Media Excellence (Study Uncovers Pervasive Online\nViolence against Women Journalists in Uganda – African Centre for Media Excellence, n.d.) the\ngendered politics of journalism in Uganda found that women journalists in Uganda face\na number of challenges, including sexism, harassment, and discrimination. The study\nalso found that women journalists are often stereotyped and marginalized in the media.\nThe findings of these studies suggest that gender inequality is a common issue in\nUgandan newsrooms. This has a number of negative consequences for women\njournalists, including lower pay, fewer opportunities for advancement, discrimination\nand a hostile work environment. this also has negative effects for the news media", "word_count": 372, "start_char": 22463, "end_char": 24956}
{"chunk_id": "DOC0031__00010", "doc_id": "DOC0031", "chunk_index": 10, "text": "he findings of these studies suggest that gender inequality is a common issue in\nUgandan newsrooms.T\n\nhis has a number of negative consequences for women\njournalists, including lower pay, fewer opportunities for advancement, discrimination\nand a hostile work environment. this also has negative effects for the news media\n\nindustry as a whole, as it limits the diversity of voices and perspectives represented in\nthe news.\nMedia as an Agent of Change\nThe media can contribute to challenging stereotypes and increasing awareness of\ngender equality by providing access to a pluralistic range of opinions and portrayals.\nHowever, the description of women is now being stereotypical, which emphasizes\ntraditional female roles (Free Press Unlimited, 2020). According to the UNESCO report\nof 2018, many studies have pointed out that the media can actually shape conventional\nattitudes and beliefs; therefore, it is a first-rate tool in promoting gender equality. To\nthis end, since the media must reflect the diversity of female voices and experiences,\nit could have an important role in breaking the stereotypes and promoting inclusive\nrepresentation.\nCase Studies on Gender Inequality in Ugandan Media\nPrevious studies on the experiences of women in Ugandan media have highlighted key\nsystemic issues, such as discrimination and harassment. An annual report on violence\nand abusive treatment against journalists by the African Centre for Media Excellence in\n2019 found that challenges to career development in both electronic and print media\nfaced by women in the media in Uganda include gender bias, poor working conditions,\nand lack of mentorship opportunities.\nRole of 2.4 Power FM in Representation of Gender\nInterviews with the female journalists at power FM provided insights to their experience\nat the station. This qualitative approach helped highlight the practical implications of\nthe station on issues of gender inclusiveness, among others, the station's hiring policies,\nthe nature of the editorial policies, and any training programs that might be offered,\nall with a view of establishing whether they are supportive or totally against this\ninitiative. Further, interviews with female journalists of Power FM will help give insights\ninto the challenges they meet and experiences within the organization.", "word_count": 350, "start_char": 24635, "end_char": 26947}
{"chunk_id": "DOC0031__00011", "doc_id": "DOC0031", "chunk_index": 11, "text": "urther, interviews with female journalists of Power FM will help give insights\ninto the challenges they meet and experiences within the organization.\n\n2.1 Literature Review Summary\nThe key findings of this research point to the continued existence of a gender leadership\ngap; this gap requires comprehensive strategies to support the quest for gender equality\nin media. Research has shown that media can influence the attitudes that shape society\nconsiderably by promoting inclusive representations. In that respect, systemic\nchallenges still persist: discrimination, harassment, and little or no career-advancing\nopportunities. It is in this spirit that the present study makes a contribution to existing\nscholarship by engaging with the context of Power FM and potential solutions in moving\nfurther toward gender equality in Ugandan media.\n\nTHEORETICAL AND CONCEPTUAL FREAME WORK.\n2.2 Introduction\nThis chapter explains the relevant theory related to gender studies and representation\nFeminist Theory\nThis is a theory that analyzes gender inequality and advocates for women’s rights and\nempowerment. It started in the 19th century with the first wave feminism from 1848-\n1920 focusing on women voting, women’s suffrage and property rights, the second wave\nfrom 1960’s -1980’s expanding issues like reproductive rights, workplace equality and\ndomestic violence and finally the third wave from 1990’s -present emphasizing\nintersectionality, diversity and individual experience. Sarah Pruitt march2, 2022 what\nare the four waves of feminism?(What Are the Four Waves of Feminism? | HISTORY, n.d.)\nFeminist theory is a vast and diverse area of study, which looks into social, political and\neconomic structures that contribute to gender imbalances. Its central focus involves\nunderstanding the effects of gender on our experiences, opportunities and results.\nNewsrooms can be understood in terms of the perpetuation and maintenance of gender\ninequality using feminist theory. Sarah Pruitt march2, 2022 what are the four waves of\nfeminism?", "word_count": 298, "start_char": 26798, "end_char": 28832}
{"chunk_id": "DOC0031__00012", "doc_id": "DOC0031", "chunk_index": 12, "text": "ts central focus involves\nunderstanding the effects of gender on our experiences, opportunities and results.N\n\newsrooms can be understood in terms of the perpetuation and maintenance of gender\ninequality using feminist theory.S\n\narah Pruitt march2, 2022 what are the four waves of\nfeminism?\n\nLiberal feminism may question why few women end up in newsroom leadership positions\nand demand for equal access to opportunities and resources.\nRadically feminist theories might explain how newsroom culture and structures\nentrench gender biases while advocating for fundamental changes in news production\nor consumption.\nIntersectional feminist theories would consider how gender intertwines with other\nforms of discrimination including race as well as class that result to distinct forms\ndiscrimination or marginalization within newsrooms.\nIn addition, feminist theory helps us grasp wider social and political implications about\ngender inequities in journalism. E.g., Feminist theory may argue that media should\nincrease women’s voices by avoiding femininity\nFeminist theory can also help us understand the broader social and political implications\nof gender inequality in newsrooms. For example, the underrepresentation of women's\nvoices and perspectives may be considered by feminist theory to further perpetuate\ngender stereotypes and limit our understanding of the world.\nIt can be further used to analyze how newsroom dynamics and structures perpetuate\ngender-based violence and harassment and thus argue for policies and practices that\nsecure safety and respect.\n2.3 Conceptual framework\nThe frame work will be based on different variables and these include\nIndependent Variables:\n Gender Stereotypes and Biases\n Power Dynamics and Leadership\n Social and Cultural Norms\nDependent Variables:\n Representation of Women in Newsrooms\n Gender Diversity in Leadership Positions\n\n Gender Equality in Editorial Decision-Making\n Inclusive and Diverse News Coverage\n Mental and Physical Well-being of Women in Newsrooms\nIntervening Variables:\n Education and Training\n Mentorship and Support\n Policy and Legislative Frameworks\n Industry Initiatives and Programs\n Technological Advancements and Social Media\nModerating Variables:\n Intersectionality and Multiple Identities\n Global and Local Contexts\n Cultural and Linguistic Diversity\n Socioeconomic Status and Class\n Age and Generational Differences\nOutcome Variables:\n More Gender-Equal Newsrooms\n Increased Diversity and Inclusion in News Stories\n Improved Mental and Physical Health for Women in Newsrooms\n Better Descriptive Representation of Women in Leadership\n More Representative and Equitable Media Industry\nThe conceptual framework is an attempt to provide a comprehensive description of how\nthe mentioned variables interrelate with and contribute to the gender inequality that\nmanifests in newsrooms. The research study will, therefore, try and come up with\napproaches, solutions, and strategies for making the media fraternity more equal and\ninclusive.", "word_count": 432, "start_char": 28542, "end_char": 31567}
{"chunk_id": "DOC0031__00013", "doc_id": "DOC0031", "chunk_index": 13, "text": "he research study will, therefore, try and come up with\napproaches, solutions, and strategies for making the media fraternity more equal and\ninclusive.\n\nCHAPTER THREE\nMETHODOLOGY\n3.0 Introduction\nThis section shows the strategy that was used to conduct the study in order to address\nthe objectives. This breaks down all the sections i.e., research design, study\npopulation, sampling, data collection, to mention but a few.\nThis study used qualitative research approach and will briefly explain why it is more\nsuitable compared to quantitative research method. It also shows how qualitative\nresearch delves deeper into lived experiences and uncovers underlying social dynamics\nrelated to gender inequality.\n3.1 Research design\nThis study used qualitative data collection. This allowed the researchers to collect more\ndata and get a clear understanding of gender inequality in Power FM.\nAny understanding of gender inequalities within newsrooms must be sophisticated and\ngo beyond mere numbers. Quantitative research, very useful to establish the scope of\na phenomenon, often loses the richness of lived experience. This study followed a\nqualitative research design and hence provides more of lived experiences and\njournalistic, editing, and media executive perspectives. As Gillham (2000) case study\nresearch methods explains, the approach went beyond these surface statistics and help\nexpose deep-seated social dynamics leading to the entrenchment of gender bias in news\noutfits. The methodology for the data collection will be based on a multi-pronged\nstrategy and will gather information from these different sources to arrive at an indepth understanding. This multifaceted approach strengthens the credibility of the\nfindings and gives a full-color portrait of realities existing in the newsrooms today for\nthose working there.\n3.2 Study population\nThis study’s target population involves journalists, editors and media house executors\nwho work in the newsroom. This includes among others, women and people from", "word_count": 297, "start_char": 31416, "end_char": 33430}
{"chunk_id": "DOC0031__00014", "doc_id": "DOC0031", "chunk_index": 14, "text": "his multifaceted approach strengthens the credibility of the\nfindings and gives a full-color portrait of realities existing in the newsrooms today for\nthose working there.\n3.2 Study population\nThis study’s target population involves journalists, editors and media house executors\nwho work in the newsroom.T\n\nhis includes among others, women and people from\n\nmarginalized groups who have either been victims of or witnessed gender inequality\nwithin Power FM.\nSample, size and sampling strategy\nOur sample size was 20 people\nPurposive sampling was conducted to ensure that the participants selected for the\nresearch are experienced and knowledgeable about the media industry and bring out\ndiverse perspectives.\nAdditionally, chain sampling, where participants help recruit others, such as asking\ncolleagues and peers who may be interested in participating in the study, was\nconsidered.\nA sample will be got from some of the journalists working in Power FM. This will be\naccording to the, district, job position and years of experience\nThe sample will include\n 2-3 in-depth interview participants\n 1 case study newsroom which is Power FM.\n 4-6 observation participants (newsroom staff)\n 15-20 research participants\nPoint to note is that feasibility and accessibility of participants may result in sample\nsize being adjusted and also change the sampling strategy.\n3.3 Data collection methods and tools\nRich and detailed data through the use of in-depth interviews and questionnaire type\nof setting were used for the study. The sample size for this research project was 20\nparticipants; employees and management of Power FM.\nQuestionnaire.\nA survey will be conducted physically to journalists at Power FM. The survey will take\nup to 5 minutes to complete and will ask about the demographic information. age,", "word_count": 279, "start_char": 33074, "end_char": 34880}
{"chunk_id": "DOC0031__00015", "doc_id": "DOC0031", "chunk_index": 15, "text": "he sample size for this research project was 20\nparticipants; employees and management of Power FM.Q\n\nuestionnaire.A\n\nsurvey will be conducted physically to journalists at Power FM.T\n\nhe survey will take\nup to 5 minutes to complete and will ask about the demographic information. age,\n\neducation level, job title and years of experience, rates of gender inequality in the\nnewsrooms in Uganda, impact of gender inequality in Ugandan newsrooms experiences\nof sexual harassment and challenges faced by female journalists as they balance both\nfamily and work.\nInterviews\nStructed interviews will be conducted with a subset that went through the survey\nsample. The interviews lasted for about an hour and tackled the factors that have led\nto gender inequality, examples of gender inequality in the Ugandan newsrooms, effects\nof gender inequality on female journalists and the media house, and identified\nrecommendations on addressing gender inequality in newsrooms.\nData collection instruments\nInterview Guide was used with open-ended questions that probed and guided the flow\nof discourse during in-depth interviews.\nObservation Protocol, Structured guideline for observing and recording behaviors,\ninteractions, and setting.\nQuestionnaire: A series of questions were filled by the respondents, which obtained\nself-reported data from participants. However, it is more appropriate for quantitative\nresearch.\nCase Study Protocol, it is a very detailed guide for studying in-depth analysis of a single\ncase or very few cases.\nDocuments-existing texts, like reports, policies, or memos, can contextualize\ninformation.\nQuality control\n\nAll the methods used were standardized and pretested to ensure no mistakes and double\nattempt of the questions. This helped us to get clear and accurate information from\nthose that participated. One will be taught how to answer the guide and it will close\nafter correct attempt.", "word_count": 283, "start_char": 34596, "end_char": 36501}
{"chunk_id": "DOC0031__00016", "doc_id": "DOC0031", "chunk_index": 16, "text": "ocuments-existing texts, like reports, policies, or memos, can contextualize\ninformation.Q\n\nuality control\n\nAll the methods used were standardized and pretested to ensure no mistakes and double\nattempt of the questions.T\n\nhis helped us to get clear and accurate information from\nthose that participated.O\n\nne will be taught how to answer the guide and it will close\nafter correct attempt.\n\nResearch procedure\nThis was cleared by the school of journalism, media and communication [Uganda\nChristian University].\nPermission was sought from the management of Power FM, dated, before conducting\nthis research.\nThrough recommendation from other people on initial contact within Power FM,\nparticipants have been identified and recruited.\nIn-depth interviews with male and female journalists, editors, and managers at Power\nFM.\nThe news articles were analyzed to study gender representation and stereotyping.\nEnsured anonymity and confidentiality of participants and data.\nPotential biases and assumptions were identified and responded to throughout the\nresearch process.\nData management\nData was stored and the information was confidential to anyone. This information was\nstored on a computer with a secured password.\nMore so, data was organized in a logical and consistent manner, using clear file names\nand titles for easy identification\nData was backed up regularly to prevent loss or corruption.\nUse of data visualization techniques were used to communicate findings.\nA plan was developed to archive data and preservation for a long period of time.\nData analysis\nThe approach taken in analyzing data from semi-structured interviews, observations,\nand document analysis would be qualitative method. Accordingly, the thematic analysis\nwill involve transcription and coding of interview data with NVivo software in", "word_count": 264, "start_char": 36113, "end_char": 37921}
{"chunk_id": "DOC0031__00017", "doc_id": "DOC0031", "chunk_index": 17, "text": "se of data visualization techniques were used to communicate findings.A\n\nplan was developed to archive data and preservation for a long period of time.D\n\nata analysis\nThe approach taken in analyzing data from semi-structured interviews, observations,\nand document analysis would be qualitative method.A\n\nccordingly, the thematic analysis\nwill involve transcription and coding of interview data with NVivo software in\n\nidentifying themes regarding gender inequality, power dynamics, and representation\nfor qualitative analysis, while content analysis uses a coding scheme in analyzing news\narticles for gender representation and stereotypes. The data analysis for qualitative\ndata will be done in NVivo, while cleaning, organizing, and visualizing of data will be\ndone using Microsoft Excel. The sequence of data analysis would involve checking for\nmissing data and inconsistencies through cleaning and organization of data, content\nanalysis of news articles, and the application of Excel in terms of data visualization\nthrough charts and graphs to show the results effectively.\nStudy limitations\nThere were a few problems raised during the data collection\nLow survey turn ups as the females were scared to lose their jobs if the survey licked\nto their managers\nLimited access to the necessary resources such as, findings, personnel or equipment.\nResults that contradict expectations or pose unexpected ethical or practical concerns.\nSome of the interview questions were not answered fully thus leaving most of the\nanswers in doubt\nChallenges in transportation from one place to another trying to address the issue\nEthical considerations\nAll information was kept confidential and no one had access to it except the authorities.\nThis was to cut down the risks of licking information.\nAll participants were required to sign an informed consent letter. This letter had the\npurpose of the study, risks and benefits of the participation\nParticipants were given an option to answer the survey unknown\nData was stored and transmitted securely.\nDifferent cultures and backgrounds were be respected", "word_count": 313, "start_char": 37505, "end_char": 39593}
{"chunk_id": "DOC0031__00018", "doc_id": "DOC0031", "chunk_index": 18, "text": "his was to cut down the risks of licking information.A\n\nll participants were required to sign an informed consent letter.T\n\nhis letter had the\npurpose of the study, risks and benefits of the participation\nParticipants were given an option to answer the survey unknown\nData was stored and transmitted securely.D\n\nifferent cultures and backgrounds were be respected\n\nCHAPTER FOUR\nPRESENTATION AND ANALYSIS OF RESULTS\n4.0 Introduction\nThis chapter deals with the findings from the data collection exercise, drawing from\nexperiences and views about the current status of female journalists at Power FM. This\noverview demographically describes characteristics of the respondents, explains the\nrole of media in promoting gender equality, challenges women in journalism face, and\nsolutions for the problems at hand.\nTable of findings\nCategory\nFindings\nGender-based\nDiscrimination\n80% of female journalists at Power FM face gender\ndiscrimination, including unequal pay and limited\nopportunities compared to male counterparts.\nLack of Mentorship\n70% of female journalists report a lack of mentorship and\nprofessional support for career growth.\nPatriarchal Workplace\nCulture\n60% of respondents describe the workplace culture as\npatriarchal, unfriendly, and unwelcoming to women.\nStereotypes and Sexist\nAttitudes\n83-100% of female journalists experience gender inequity\nfrom colleagues and management, including harmful\nstereotypes and biases.\nLeadership Representation\nWomen hold only 5-7% of leadership positions, despite\nmaking up 43% of the workforce.\nWork-Family Balance\nFemale journalists struggle with balancing work and family\ncommitments due to gendered expectations and lack of\ninstitutional support.\nMedia Underrepresentation\nBroader underrepresentation of women in media, with\nwomen being news subjects 28% of the time and authors of\nnews stories only 19% of the time.\nChallenges in Media\nReporting\nMedia perpetuates gender inequality by portraying women\nin traditional roles, objectifying them, and reinforcing\nsexist stereotypes.", "word_count": 286, "start_char": 39230, "end_char": 41262}
{"chunk_id": "DOC0031__00019", "doc_id": "DOC0031", "chunk_index": 19, "text": "edia Underrepresentation\nBroader underrepresentation of women in media, with\nwomen being news subjects 28% of the time and authors of\nnews stories only 19% of the time.C\n\nhallenges in Media\nReporting\nMedia perpetuates gender inequality by portraying women\nin traditional roles, objectifying them, and reinforcing\nsexist stereotypes.\n\nWork-Family Balance\nFemale journalists face challenges balancing work and\nfamily due to gendered expectations and a lack of\ninstitutional support.\nDemographics\nThe newsroom has 42 employees, with males constituting\n52% and females 43% of the workforce. Leadership is maledominated.\nBroader Media Trends\nThe findings at Power FM reflect a broader trend of\nunderrepresentation of women in the Ugandan media\nlandscape.\nRecommendations for\nImprovement\nSystemic changes suggested include regular diversity and\ninclusion training, increasing female representation in\nleadership, mentorship programs, and pay equity audits.\nTable 1: Summary of key findings\n4.1 Key findings\nAfter collecting my research, I found that Power FM, exposed the seriousness of these\nissues as seen that 80% of the female participants in the research complained of genderbased discrimination including unequal pay and limited opportunities relative to their\nmale counterparts.\nLack of mentorship and professional support in relation to career growth is another\nsignificant type of barrier: 70% of female journalists say they lack guidance and\nopportunities for self-improvement with One anonymous respondent saying “she rarely\ngoes to the field and she is just told to read the news collected from outside”. A kind\nof compelling reason for a lack of support is a patriarchal workplace culture that 60%\nof respondents decry as unfriendly and unwelcoming. condemning the gender\nimbalance in the newsrooms.\nThe other female journalists reported that in Power FM, they experienced various\ngender inequity from colleagues and the management in the form of harmful\nstereotypes, biases, and sexist attitudes, at 83-100%. One of the respondents says most\nof the times the males make the decision even when a female suggests an opinion its\nnever carried up by the colleagues. The testimony of their problems is further well\npresented in the fact that females constitute only 5-7% at the leadership level in\ncontrast to constituting 43% of the workers.", "word_count": 351, "start_char": 40930, "end_char": 43275}
{"chunk_id": "DOC0031__00020", "doc_id": "DOC0031", "chunk_index": 20, "text": "ne of the respondents says most\nof the times the males make the decision even when a female suggests an opinion its\nnever carried up by the colleagues.T\n\nhe testimony of their problems is further well\npresented in the fact that females constitute only 5-7% at the leadership level in\ncontrast to constituting 43% of the workers.\n\nFor female journalists, the work-family balance is a major problem because they\nnegotiate gendered expectations and a lack of institutional support. Fear of retaliation\nalso exists should male respondents speak up about discrimination and harassment, with\n60-100% of them having observed or been subjected to gender inequity.\nDemographics and Gender Inequity Estimates\nPower FM has a newsroom of 42 employees, with the majority being males at 52%.\nFemales represent 43% of the workforce with 18-20 employees.\nIn terms of leadership positions, males retain a strong majority with 10-12 employees\nat 24-29% against 2-3 female employees at 5-7%.\nJunior positions are slightly dominated by females, with 14-16 employees (33-38%)\ncompared to 12-14 male employees (29-33%). For female respondents, it ranged from\n83-100% who said that they witnessed or personally experienced gender inequity, while\nfor male respondents, the range was 60-100%. It thus becomes very clear that gender\ndiscrimination is such a fact of life in the newsroom, be it directed at female journalists\nor by its very nature spreading across all other work cultures.\nBroader perspective\nThe findings at Power FM reflect a wider trend within media in Uganda, the general\ntrend being underrepresentation and consignment of women to traditional roles in news\ncoverage. The media is a mirror of society; therefore, stereotypical and gender-biased\nreporting is sustained by deep-seated imbalances within newsrooms.\nSuch challenges can only be overcome through systemic changes. Among other things,\nthe media houses should ensure a gender-sensitive approach, with regard to policies,\nmentorship programs, and training initiatives that create an enabling environment. By\nputting emphasis on gender equality and tackling patriarchy at its roots, it opens a level\nplaying field that empowers female journalists to take their rightful role in improving\nnews coverage.\nThe role of media in promoting gender inequality at Power FM.", "word_count": 355, "start_char": 42947, "end_char": 45262}
{"chunk_id": "DOC0031__00021", "doc_id": "DOC0031", "chunk_index": 21, "text": "y\nputting emphasis on gender equality and tackling patriarchy at its roots, it opens a level\nplaying field that empowers female journalists to take their rightful role in improving\nnews coverage.T\n\nhe role of media in promoting gender inequality at Power FM.\n\nThe media, in general, perpetuate the issues of inequities in gender primarily through\nsome of the ways it chooses to pursue its objectives at Power FM. One of the most\ndisturbing ways is by reinforcing stereotypical ideas and biases in their reporting and\nprogramming, not to mention advertising. The Power FM further aids in perpetuating\nthis culture by portraying women performing roles that are traditional and turning a\nblind eye when stereotypical representations of females come to the fore, hence\nlimiting opportunities for women.\nAnother huge issue is that only 43% of employees within the media workforce are\nwomen. The result of this non-diversity in the newsroom is that stories get slanted and\nvoices get amplified. Media is supposed to represent society both accurately and fairly,\nbut Power FM has failed in its representation.\nAnother serious issue is the objectification and sexualization of women in media\ncontent, which Power FM has to address. The minimization of women to their physical\nattributes and the depiction of them as sex objects promotes a culture laden with\nsexism and misogyny, thus causing harm to women both within the media industry and\nsociety at large.\nAnother critical challenge to achieving gender equality at Power FM is the\nhomogenization of female voices and perspectives in reporting, programming, and\ndecision-making. The media perpetuates this further through non-inclusion of a range\nof women's voices. It works toward consolidating the idea that women's experiences\nand opinions are not as important and valuable as those of men.\nSpecifically, one of the most bothersome issues in the behavior of Power FM is the way\nit builds and shapes patriarchy within its norms and values, which in turn has been\npermitting the perpetuation of gender inequality and potentially limiting social change.\nThe media are strong institutions mandated to challenge systems of oppression and\nadvance justice, and in this regard, Power FM appears to fail.\nThe influence of the media on public opinion and cultural norms is enormous, and with\nPower FM as an institution in entrenching gender inequality, there are far-reaching", "word_count": 382, "start_char": 45004, "end_char": 47416}
{"chunk_id": "DOC0031__00022", "doc_id": "DOC0031", "chunk_index": 22, "text": "he media are strong institutions mandated to challenge systems of oppression and\nadvance justice, and in this regard, Power FM appears to fail.T\n\nhe influence of the media on public opinion and cultural norms is enormous, and with\nPower FM as an institution in entrenching gender inequality, there are far-reaching\n\nimplications. The media can either challenge or reinforce existing power structures in\nthe attitudes and beliefs that people form about women and their roles in society.\nIndeed, Power FM must account for all the different ways in which it entrenches gender\ninequality, from stereotypical imagery to women's underrepresentation in the\nworkforce. Power FM can do a lot towards gender equality and social justice with\ndiverse voices for challenging oppressive structures and amplifying the voices of the\nmarginalized.\nChallenges faced by female journalists at Power FM.\nThe status of gender inequality in the newsroom remains one of the major issues in the\nnewsrooms of Uganda. Huge challenges and barriers have always pulled women\njournalists in Uganda down to success. According to a recent study at one major FM\nradio, Power FM, 80% of the female respondents showed gender discrimination against\nthem in remunerations and opportunities compared to men.\nAnother challenge is the lack of mentorship and support for career growth, with 70% of\nfemale journalists reporting that they do not receive any form of mentorship or\nprofessional development opportunity. Thereafter, the patriarchal workplace culture\nfuels a lack of support, described by 60% as hostile and unwelcoming, entrenching\ngender inequality and sexism.\nFemale journalists at Power FM are equally at the receiving end of injurious\nstereotypes, biases, and sexist attitudes that fellow journalists and management alike\nperpetrate, with the number standing at 83-100% in experiences of one form of gender\ninequity or another. Underrepresentation of women in leadership—where females\noccupy only 5-7% of such positions against their composition of 43% of the workforce—\nfurther underscores the challenges women face.\nFemale journalists in Kenya face a double bind between work and family commitments,\nthat\nis\nconstantly\nchallenged\nby\ngendered\nexpectations\nand\ninstitutional\nunsupportiveness. The need for speaking out against discrimination and harassment\nbrings on the fear of retaliation. In this regard, there is 60-100% testimony by male\nrespondents who witnessed or experienced an act of gender inequity.", "word_count": 374, "start_char": 47102, "end_char": 49586}
{"chunk_id": "DOC0031__00023", "doc_id": "DOC0031", "chunk_index": 23, "text": "emale journalists in Kenya face a double bind between work and family commitments,\nthat\nis\nconstantly\nchallenged\nby\ngendered\nexpectations\nand\ninstitutional\nunsupportiveness.T\n\nhe need for speaking out against discrimination and harassment\nbrings on the fear of retaliation.I\n\nn this regard, there is 60-100% testimony by male\nrespondents who witnessed or experienced an act of gender inequity.\n\nThese findings help underscore broader research on gender imbalances in Ugandan\nmedia, showing that women are news subjects and sources only 28% of the time and\nauthors of news stories just 19%. Deep-seated societal stereotypes and discrimination\nroot the underrepresentation of women within the industry and, when they do appear,\nit is often in traditional roles as opposed to experts or authorities.\nSolutions to address gender inequality.\nSince each media organization operates with its code of ethics and cultures, Power FM\nis just like any other in front of the problems it has to face trying to achieve gender\nequality. Since the persisting issue of gender disparity would relate to workplace\nsettings, there is a great need for multilevel and comprehensive approaches. Therefore,\nthis essay argues that Power FM should commit itself to systemic change through regular\ntrainings on diversity and inclusion, thereby creating a more diverse and inclusive work\nculture with equal understanding and responsibility among all.\nFrom the data analysis, it appeared that Power FM does not represent or create\nopportunities for women, thus sustaining gender-based stereotypes and biases. The\nliterature review also identified regular trainings on diversity and inclusion as a\nnecessary ingredient in realizing systemic change. Putting these two together yields\nthat Power FM would do well to implement a diversity and inclusion initiative to break\ndown gender inequality.\nAnother key area for redressing gender imbalance is increasing the presence of women\nand other underrepresented groups at management and decision-making levels, as well\nas on-air. Power FM should engage itself in active recruitment and promotion of eligible\nunderrepresented\nindividuals,\nidentifying\nclear\ntargets\nand\nobjectives\nfor\nimprovement. This would provide role models to young women who wish to pursue their\ncareer path in journalism and include different perspectives in the internal decisionmaking process and into the products of the organization.\nSuch mentorship programs will also be very instrumental in the career growth and\nprofessional development of women. Matching junior journalists with mentors, Power\nFM can offer mentorship that avails guidance, support systems, and networking", "word_count": 394, "start_char": 49193, "end_char": 51857}
{"chunk_id": "DOC0031__00024", "doc_id": "DOC0031", "chunk_index": 24, "text": "uch mentorship programs will also be very instrumental in the career growth and\nprofessional development of women.M\n\natching junior journalists with mentors, Power\nFM can offer mentorship that avails guidance, support systems, and networking\n\nopportunities—things that many women in the industry lack. The programs must,\ntherefore, be tailor-made to address the specific challenges that female journalists\nface and equip them with what they need to make a difference.\nThis can also be ensured by promoting equality in pay, benefits, and opportunities for\npromotion and training. Power FM should, therefore, undertake regular pay equity\naudits and take proper measures to bridge gaps, if any, on grounds of gender. Further,\nit should also give equal opportunities for training and development to all the\nemployees so that they get adequate opportunity to grow and built up their careers.\nSexism, misogyny, and harassment can only be addressed if there is a safe and inclusive\nculture of workplace. Power FM needs to develop a clear policy and procedure for\nreporting and addressing such issues and, more importantly, making sure that all\nemployees have a voice without the fear of speaking up. There are also other resources\nand support the organization has to make available to employees who have been\nharassed or discriminated against, including counseling and legal assistance if needed.\nFor instance, guidelines on gender-sensitive reporting and the implementation of\ntraining would be important in not continuing stereotypical impressions and biases\nthrough the organization's content. Power FM must therefore organize training for its\njournalists on the sensitive and nuanced reporting of gender-related issues, and it must\nimplement specific directives regarding the characterization of women and other\ngroups in news stories and other content.\nThe commitment to gender equality needs to have clear accountability mechanisms in\nplace. This will establish a system for tracking progress towards the goals set by Power\nFM, holding managers and leaders accountable for their role in promoting diversity and\ninclusiveness. One such way is to relate compensation to the progress made in this line.\nThis would mean that gender equality metrics are measured as achievement during\nperformance reviews.\nThis shall further require regular audits and assessments for progress monitoring and\nareas of improvement. Power FM should, at regular intervals, conduct employee surveys\nabout their perceptions of the culture and climate of the organization and use that data", "word_count": 386, "start_char": 51616, "end_char": 54176}
{"chunk_id": "DOC0031__00025", "doc_id": "DOC0031", "chunk_index": 25, "text": "his would mean that gender equality metrics are measured as achievement during\nperformance reviews.T\n\nhis shall further require regular audits and assessments for progress monitoring and\nareas of improvement.P\n\nower FM should, at regular intervals, conduct employee surveys\nabout their perceptions of the culture and climate of the organization and use that data\n\nto inform its diversity and inclusion efforts. The organization should also, from time to\ntime, look into the content auditing regarding the representation and portrayal of\nwomen and other marginalized groups within their news coverage and other content.\nEmployee resource groups could provide an important platform for women and\nmarginalized groups within Power FM to air their views and concerns. These employee\nresource groups can support employees, advise management on different issues about\ndiversity and inclusion, and help shape the organization's efforts toward diversity and\ninclusion.\nCommitment from the leadership of the organization to bridge the gender gap is very\nimportant to implement change. Hence, the leadership team at Power FM should set\nout clear goals and objectives of improving its diversity and inclusion and communicate\nthem to all employees. Leaders must also model inclusive behaviors and hold\nthemselves accountable for progress.\nIt can also help Power FM engage with the community and further social and cultural\nnorms of change by working with organizations that are promotive of gender equality.\nIt would be possible, at this level, to raise awareness about issues of gender equality\nand to facilitate positive changes in communities through local-level partnerships with\norganizations and local communities, as well as through community events.\nrecommendations on how to deal with the problem of gender inequality at Power FM.", "word_count": 273, "start_char": 53814, "end_char": 55640}
{"chunk_id": "DOC0031__00026", "doc_id": "DOC0031", "chunk_index": 26, "text": "t would be possible, at this level, to raise awareness about issues of gender equality\nand to facilitate positive changes in communities through local-level partnerships with\norganizations and local communities, as well as through community events.\nrecommendations on how to deal with the problem of gender inequality at Power FM.\n\nCHAPTER FIVE\nSUMMARY OF FINDINGS, CONCLUSION AND RECOMMENDATION.\n5.0 Introduction\nThis last chapter summarizes the objectives, methodology, and findings of the study. It\nalso spells out conclusions and recommendations from the research toward systemic\nchange if society is to strive for gender equality within media organizations, with\nspecific reference to Power FM.\n5.1 Summary of findings\nThe findings of this study unveil a very distressing landscape for female journalists at\nPower FM, whereby systemic gender inequality manifests in several ways that greatly\nhamper professional growth and well-being. Based on these challenges, the\nidentification can be categorized into three areas: gender-based discrimination, lack\nof mentorship, and a patriarchal workplace culture.\nGender-Based Discrimination, the responses that showed that 80 percent of the\nrespondents experienced gender-based discrimination within the newsroom were\noverwhelming. The foremost forms of discrimination include equal pay and\nopportunities. Many female journalists reported that they receive lower wages\ncompared to their males holding similar qualifications and years of experience. This\ncompensation disparity puts them not only in a different financial position but also tags\nthem with the notion that their contribution is less worthy. More often than not, they\nalso reported being bypassed for promotion opportunities, training, and key\nassignments, which aggravates further the marginalization of women in the\norganization. These inequities not only result in lowered morale but indeed create a\ngreater climate of disenfranchisement among females in the media.\nIn addition, lack of mentorship, a major barrier to the advancement of female\njournalists at Power FM was the lack of mentorship. About 70% of the respondents\nindicated that they felt their careers were not developing well and pointed to a\nlimitation in the access to mentorship programs, as well as a lack of training and\ndevelopment opportunities. Many female journalists reported that they rarely received", "word_count": 347, "start_char": 55310, "end_char": 57696}
{"chunk_id": "DOC0031__00027", "doc_id": "DOC0031", "chunk_index": 27, "text": "bout 70% of the respondents\nindicated that they felt their careers were not developing well and pointed to a\nlimitation in the access to mentorship programs, as well as a lack of training and\ndevelopment opportunities.M\n\nany female journalists reported that they rarely received\n\nadequate practical guidance with respect to career navigation or guidance in\ndeveloping their skills. This issue is further escalated by the lack of clear pathways for\nprofessional growth, thereby leaving women lost and unguided in their professional\njourneys. In the absence of mentors and training, it's unlikely for female journalists to\nrise into positions of leadership or for their work to be taken seriously, hence\nperpetuating the cycle.\nMore so, patriarchal workplace culture, 60% of the respondents described a patriarchal\nworkplace culture that fosters an environment rife with sexism and misogyny. This\nculture, therefore, not only perpetuates inequality between men and women but also\nmakes for a hostile, unwelcoming atmosphere against female journalists. It was\nreported by many women that they felt uncomfortable or even unsafe in the work\nenvironment, thus paving the way for decreased job satisfaction and an increase in\nturnover rates. Stereotyping and chauvinistic attitude, as projected through various\nbehaviors, truncate opportunities for career growth and professional up-scaling because\nwomen often move through a terrain that is far from being conducive to their success.\nSuch a patriarchal culture undermines the potential for a diverse and inclusive\nnewsroom, which goes a long way in delivering balanced media content that truly\nrepresents the public.\n5.2 Conclusion\nThe findings of this study underline systemic changes that will help to attack huge\nchallenges female journalists at Power FM are currently facing. For a more equal\nworkplace, institute gender-sensitive policies in administration regarding pay and equal\nopportunity for all workers at the company; equip female journalists through strong\nmentorship programs and training initiatives that will help them in career growth.\nUltimately, a more inclusive workplace culture in which sexism is actively challenged\nand gender equality advanced holds the key to long-term success for both female\njournalists and the organization at large.\nIn other words, addressing the issue of gender inequality within Ugandan newsrooms,\nespecially at Power FM, is not only a matter of justice but also improving the quality of\njournalism. A diverse and fair newsroom is better put to reflect the complexity of the", "word_count": 387, "start_char": 57418, "end_char": 59984}
{"chunk_id": "DOC0031__00028", "doc_id": "DOC0031", "chunk_index": 28, "text": "n other words, addressing the issue of gender inequality within Ugandan newsrooms,\nespecially at Power FM, is not only a matter of justice but also improving the quality of\njournalism.A\n\ndiverse and fair newsroom is better put to reflect the complexity of the\n\nsociety and serve its audience fully. It is in this understanding that Power FM must take\na step forward to break down the barriers that exist against women journalists in order\nto create a fair and representative media landscape in Uganda. This essay format\nenables an overview of all findings against the foregrounding of any essential need for\nsystemic change within the context of gender inequality at Power FM.\n5.3 Recommendations.\nThere are number of recommendations that have been made for addressing gender\ninequality at Power FM one of the newsrooms in Uganda.\nDemonstration of leadership commitment to gender equality by setting certain goals\nand objectives, the leadership team should under go training on gender equality and\nunconscious bias. This is to help one oversee implementations of gender equality\ninitiatives.\nRaising awareness about the increased issue, the first step to addressing an issue is to\nraise awareness for thus makes people known to the issue. This can be done through\ntraining programs, public awareness campaigns and so much more.\nMore so, developing policies to promote gender inequalities. This will help provide a\ncomfortable working environment for the female journalists. Issues to be addressed\nshould include low pay, sexual harassment, discrimination and unfavorable conditions.\nFurthermore, supporting female journalists as they raise through providing them with\nraising opportunities, employing more women in the different sectors. This to help\nwiden the female representation on board thus creating less bias. By taking these steps\nthe media news company is ready to equality in the newsrooms.\nMore to that Power FM should conduct regular gender audits to monitor progress in the\nworking environment for example how many women have joined the radio stations and\nhow far have they gone in their career. This also helps one to identify which points need\nimprovement. The findings got should be used to inform gender equality initiatives.\nPower FM should promote inclusivity at the work place through training programs and\ndiversity initiatives, these programs should focus on gender equality, unconscious bias,\n\nand inclusive language. Diversity initiatives should aim at increasing female\nrepresentation in leadership position and giving women a chance to air out their views.", "word_count": 399, "start_char": 59725, "end_char": 62307}
{"chunk_id": "DOC0031__00029", "doc_id": "DOC0031", "chunk_index": 29, "text": "he findings got should be used to inform gender equality initiatives.P\n\nower FM should promote inclusivity at the work place through training programs and\ndiversity initiatives, these programs should focus on gender equality, unconscious bias,\n\nand inclusive language.D\n\niversity initiatives should aim at increasing female\nrepresentation in leadership position and giving women a chance to air out their views.\n\n5.4 Areas for further research.\nThis study aimed at examining gender inequality in Ugandan newsrooms in relation to\nPower FM. Therefore, more research can focus on how traditional masculinity and\ngender roles contribute to gender inequality in the media industry. More so this research\ncan assess the impact of organizational culture and policy on gender inequality in the\nmedia industry, investigate the long-term consequences of gender inequality on\nindividuals, organizations and society as a whole. In additional one could focus on\ncomparing gender inequality in the media industry across different countries and\nregions and the different practices and strategies for promoting gender equality in the\nmedia industry.", "word_count": 166, "start_char": 61896, "end_char": 63029}
