{"chunk_id": "DOC0149__00000", "doc_id": "DOC0149", "chunk_index": 0, "text": "A STUDY ON THE EFFECTS OF THE SCIENTIFIC THEORIES OF CREATION ON THE\nCHRISTIANS OF VICTORIA NYANZA DIOCESE: A CASE STUDY OF MWANZA\nARCHDEACONRY.\nALBINUS ALOYS PETER\nM20B09/064\nA RESEARCH SUBMITTED TO BISHOP TUCKER SCHOOL OF\nDIVINITY AND THEOLOGY IN PARTIAL FULFILMENT FOR THE AWARD\nOF THE BACHELOR DEGREE OF DIVINITY AND THEOLOGY\nUGANDA CHRISTIAN UNIVERSITY\n\nAcknowledgment\nI humbly give my inner thanks to the Almighty God who in His tender and divine mercy\nchose me among many to join Uganda Christian University and also for the good\nhealth and well-being that were necessary to complete this course. Besides, I’m eager\nto thank my sponsors who supported me throught my studies, Bishop Zephaniah Amos\nNtunza through whom God inspired to send me here at Uganda Christian University as\nto expand my knowledge for the purpose of God’s mission.\nI would also like to express my sincere gratitude to my supervisor Rev. Can. Dr Moses\nStephen Isabirye for his patience, motivation and immense knowledge which has\nhelped me accomplish this research project.\nI express my appreciation to Rahel my darling wife, Esther and John my children who\nhave been a blessing to me with all sorts of encouragement that they provided in the\nperiod of this study.\n\nTable of Contents\nDeclaration ......................................................................................... i\nApproval ........................................................................................... ii\nAcknowledgment ................................................................................. iii\nAbstract .......................................................................................... viii\nCHAPTER ONE: ..................................................................................... 1\n1.0\nTHE PROBLEM AND ITS SETTING .......................................................... 1\n1.1\nIntroduction ................................................................................. 1\n1.2\nStatement of the problem ................................................................ 2\n1.3\nPurpose of the study ....................................................................... 2\n1.1. Objectives of the study .................................................................... 3\n1.5\nResearch Questions ........................................................................ 3\n\n1.6\nGeographical Scope of the study ......................................................... 3\n1.7\nTime scope of the study ................................................................... 4\n1.8\nSignificance of the Study .................................................................. 5\n1.9\nLimitations of the Study ................................................................... 5\n1.10\nDefinition of Terms ...................................................................... 5\nCHAPTER TWO: ..................................................................................... 7\n2.0\nLITERATURE REVIEW ....................................................................... 7\n2.1\nIntroduction ................................................................................. 7\n2.2\nScientific theories of creation ............................................................ 7\n2.2.1\nEvolution Theories ....................................................................... 8\n2.3\nEvidences brought forward that support scientific theories of creation. ........ 12\n\n2.4\nEffects of the evolution theories ....................................................... 12\n2.5\nRoles of the church in mitigating effects of the scientific theories of creation 16\n2.6 New knowledge created by the study (Gaps to be Bridged) ........................ 17\nCHAPTER THREE: ................................................................................. 19\n3.0\nRESEARCH METHODOLOGY .............................................................. 19\n3.1\nIntroduction. .............................................................................. 19\n3.2\nResearch plan (research design). ...................................................... 19\n3.3 Population, Sampling methods/techniques and Sample Size ...................... 20\n3.4\nSources of data information (Primary and Secondary) .............................. 20\n3.5\nResearch instruments .................................................................... 21\n3.6\nValidation of the research instruments ............................................... 21", "word_count": 424, "start_char": 0, "end_char": 4465}
{"chunk_id": "DOC0149__00001", "doc_id": "DOC0149", "chunk_index": 1, "text": "3.7\nData collection procedure. ............................................................. 22\n3.8\nData processing and analysis. .......................................................... 22\nCHAPTER FOUR ................................................................................... 23\n4.0\nINTERPRETATION ......................................................................... 23\n4.1\nChapter’s introduction .................................................................. 23\n4.2\nHow scientific theories of creation are understood by both Christians and non-\nChristians in Mwanza archdeaconry. .......................................................... 23\n4.3\nIndividual responses as far as teaching scientific theories of creation in school is\nconcerned. ........................................................................................ 26\n4.4\nEffects of the scientific theories of creation ......................................... 28\n4.5\nThe church’s failures .................................................................... 30\n4.6\nThe church’s roles in mitigating the effects of scientific theories of creation. 32\n4.7\nThe use of social Medias and networks................................................ 36\n\n4.8\nConclusion ................................................................................. 36\nCHAPTER FIVE: ................................................................................... 37\n5.0\nSUMMARY, CONCLUSION AND RECOMMENDATIONS .................................. 37\n5.1\nIntroduction ............................................................................... 37\n5.2\nSummary ................................................................................... 37\n5.3\nConclusion ................................................................................. 38\n5.4 Recommendations ....................................................................... 40\nReferences ........................................................................................ 42\nBOOKS ............................................................................................. 42\nARTICLES .......................................................................................... 45\nWebsites ........................................................................................... 46\n\nAPPENDIX ONE - QUESTIONNAIRES ........................................................... 47\nAPPENDIX TWO – INTERVIEWERS .............................................................. 50\nAPPENDIX THREE – RESEARCH DIAGRAM (fig 1.1) .......................................... 53\nAPPENDIX FOUR – MWANZA ARCHDEACONRY MAP ........................................ 54\n\nAbstract\nDue to the rise of scientific arguments which are spreading rapidly in all corners of\nthe world and Mwanza region which is allocated North West of Tanzania has not been\nleft out by this wind. In Tanzania, studies that put a lot of emphasis on scientific\ntheories of creation have been given priority and it has happened that a big number\nof people in this area have come across and learnt these scientific theories of\ncreation, not only learn but also believe in them. Meanwhile less effort has been\nmade by Christians to refute them and this state has led many people in Victoria\nNyanza Diocese to believe in the scientific theories of creation. This research used\nquestioners, interviews, books, websites and articles in gathering information; and\nfrom these, this study explored and brought into light the effects of scientific theories\nof creation. This paper concluded by designing a strategy for a mission that will\nenable the church tackle the problem.", "word_count": 335, "start_char": 4465, "end_char": 8119}
{"chunk_id": "DOC0149__00002", "doc_id": "DOC0149", "chunk_index": 2, "text": "his research used\nquestioners, interviews, books, websites and articles in gathering information; and\nfrom these, this study explored and brought into light the effects of scientific theories\nof creation.T\n\nhis paper concluded by designing a strategy for a mission that will\nenable the church tackle the problem.\n\nCHAPTER ONE:\n1.0\nTHE PROBLEM AND ITS SETTING\n1.1\nIntroduction\nThroughout much of the 20th century, opponents of evolution theory many of them\ntheologically conservative Christians either have tried to eliminate the scientific\ntheories of creation from Tanzanian public school’s curriculum or urged science\nteachers also to teach a version of the creation story found in the biblical book of\nGenesis because of their negative impacts. Though this seems to be an unsolved\nparable due to the fact that the scientific theories of creation are taught in schools.\nWhen being taught, they are made to believe that evolution is a well-established\nscientific theory that convincingly explains the origins and development of life on\nearth. Moreover, say, a scientific theory is not a hunch but is instead an established\nexplanation for a natural phenomenon, like gravity, that has repeatedly been tested\nthrough observation and experimentation. Not only that but with the material\nevidences found in Old vai gorge, Kondoa Irangi, Mumba cave and Engaruka all these\nallocated within the country, the creation account in Genesis seems to have no place", "word_count": 226, "start_char": 7807, "end_char": 9259}
{"chunk_id": "DOC0149__00003", "doc_id": "DOC0149", "chunk_index": 3, "text": "ot only that but with the material\nevidences found in Old vai gorge, Kondoa Irangi, Mumba cave and Engaruka all these\nallocated within the country, the creation account in Genesis seems to have no place\n\nin the hearts and minds of most people in Tanzania due to the fact that less effort has\nbeen made by Christians to refute these scientific theories of creaton\nThe church in the Diocese of Victoria Nyanza is doing its best making new disciples,\nfulfilling the Great Commission (Mathew 28:19) and indeed it is doing its part in\ncalling people build the kingdom of God. But at the same time the teaching of\nevolution has become a part of the nation’s culture in all schools and has been taken\nup by legislature and boards of education all over the country of Tanzania. This can\nbe referred to the curriculum starting at primary level; Standard 4, 5, 6 and 7,\nSecondary level; Form I, II, III, IV, V, VI; and at university level. The Christians under\nthe Diocese of Victoria Nyanza, have either passed, are passing or will pass through\nthis system of education. So, this study was conducted so as to study on the effects of\nthe scientific theories of creation on the Christians of Victoria Nyanza Diocese.\n1.2\nStatement of the problem\nWhereas studies in Tanzania have put a lot of emphasis on scientific theories of\ncreation, less effort has been made by Christians to refute them. This state has led\nmany people in Victoria Nyanza Diocese to believe in the scientific theories of\ncreation. This study therefore, sought to analyze the effects of these theories on the\nChristians of Mwanza archdeaconry.\n\n1.3\nPurpose of the study\nThe purpose of this study was to study on the effects of the scientific theories of\ncreation on the Christians of Victoria Nyanza Diocese specifically those of Mwanza\nArchdeaconry. Not only that but also to suggest and highlight the roles of the church\nin helping people that have been affected and those that are yet to be affected by\nthe scientific theories of creation.\n1.1.\nObjectives of the study\nThe objectives of this study were to;\nIdentify the scientific theories of creation. Identify the effects of the scientific\ntheories of creation on the Christian life of the Christians.\nExplore the roles of the church in ministering to a person who has been affected and\nhelp him/her grow spiritually in spite of coming into contact with the scientific\ntheories of creation.", "word_count": 413, "start_char": 9057, "end_char": 11461}
{"chunk_id": "DOC0149__00004", "doc_id": "DOC0149", "chunk_index": 4, "text": "dentify the effects of the scientific\ntheories of creation on the Christian life of the Christians.E\n\nxplore the roles of the church in ministering to a person who has been affected and\nhelp him/her grow spiritually in spite of coming into contact with the scientific\ntheories of creation.\n\n1.5\nResearch Questions\nWhat are the scientific theories of creation?\nWhat are the effects of scientific theories of creation in the life of Christians?\nWhat are the roles of the church in mitigating the effects of the scientific theories\nof creation?\n1.6\nGeographical Scope of the study\nThe study was carried out in the Anglican church of Tanzania, Diocese of Victoria\nNyanza Mwanza Archdeaconry. Mwanza Archdeaconry is found in the Diocese of\nVictoria Nyanza (DVN) which was inaugurated on 16th March 1963. The Diocese is\namong 28 Dioceses under the Anglican Church of Tanzania. Furthermore, it was the\nfifth Diocese of formation out of 28 existing Dioceses of the Anglican Church of\nTanzania. With effect from this date the Diocese of Victoria Nyanza was separated\nfrom the Diocese of Central Tanganyika (DCT). Maxwell Wiggins was the first Bishop of\nthe Diocese, and the current Bishop of the Diocese is Bishop Zephaniah Ntuza who is\nthe fifth Bishop.\n\nGeographically the Diocese of Victoria Nyanza is situated on the shores of Lake\nVictoria and lies in Latitude 2° 30′ 59.99′′ S and Longitude 32° 53′ 59.99′′ E. The\nDiocese covers all districts in Mwanza Region, and some of Geita Region which is one\nof the regions around Lake Victoria.\nOn boundaries this Diocese on the east side it is bordered with the district of Bunda,\non the east side of Mara region. On the west it is delimited with Kagera region, on the\nNorthern side it serves to the Island of Ukerewe, whereby from there lays the Lake\nVictoria which is delimited by Uganda. On the southern it is bordered with the region\nof Shinyanga. The physical features of this area are hilly with high mountains and\nlarge stones and swamps. This vicinity receives abundant rainfall through the year,\nwhich allows the settlers of this part to cultivate food and cash crops, and also\nengaging in livestock keeping.\n1.7\nTime scope of the study\nThis study focused on the effects of scientific theories of creation in Mwanza\nArchdeaconry from the year 2010 to year 2023.", "word_count": 391, "start_char": 11172, "end_char": 13481}
{"chunk_id": "DOC0149__00005", "doc_id": "DOC0149", "chunk_index": 5, "text": "his vicinity receives abundant rainfall through the year,\nwhich allows the settlers of this part to cultivate food and cash crops, and also\nengaging in livestock keeping.\n1.7\nTime scope of the study\nThis study focused on the effects of scientific theories of creation in Mwanza\nArchdeaconry from the year 2010 to year 2023.\n\n1.8\nSignificance of the Study\nThe study helped the church in becoming aware of the effects of the scientific\ntheories of creation and how to tackle them.\nHelped the church leaders understand better their role in the academic world as far\nas providing Christian education is concerned.\nThe study guided the church on how to help the people that have been affected or\nare at the verge of losing their faith in God and the church because of the biblical\naccount and scientific theories of creation paradigm.\nThis study aided those that are struggling on what to believe and are in dilemma, by\nproviding a possible way out of the static moment they are passing through.\n1.9\nLimitations of the Study\nThis kind of study appears to be of national and international relevance but it will be\nlimited to Victoria Nyanza Diocese specifically Mwanza Archdeaconry.\n\n1.10 Definition of Terms\nCreation; The word creation has been delivered from old French word creacion which\nmeans “The act or process of creating, sometimes the fact of being created or\nsomething that has been brought into existence or created, especially a product of\nhuman intelligence or imagination the whole universe, including the world and all\nthe things in it”1\nTheory; Is a principle that has been formed as an attempt to explain things that have\nalready been substantiated by data. It is used in the names of a number of principles\naccepted in the scientific community, such as the Big Bang Theory. Because of the\nrigors of experimentation and control, it is understood to be more likely to be true\nthan a hypothesis is. Furthermore, it is a plausible or scientifically acceptable general\nprinciple or body of principles offered to explain phenomena.2\n\n_ Collins William, Collins English Dictionary (Harper Collins Publishers, 2012) pg. 745.\n_ “Merriam Webster Dictionary,” n.d., https://www.merriamwebster.com/dictionary/science.\n\nScientific; Refers to a process conducted in the manner of science or according to\nresults of investigation by science, sometimes practicing or using thorough or\nsystematic methods.3 Borrowed from Medieval Latin scientificus it means \"producing\nknowledge or relating to knowledge.\nEffects; These are changes which is a result or consequence of an action or other\ncause.4 Effects can also be referred to as things that are produced by an agency or\ncause, result or consequence\n\n_ Collins William, Collins English Dictionary.\n_ “Merriam Webster Dictionary.”", "word_count": 445, "start_char": 13158, "end_char": 15933}
{"chunk_id": "DOC0149__00006", "doc_id": "DOC0149", "chunk_index": 6, "text": "ffects; These are changes which is a result or consequence of an action or other\ncause.4 Effects can also be referred to as things that are produced by an agency or\ncause, result or consequence\n\n_ Collins William, Collins English Dictionary.\n_ “Merriam Webster Dictionary.”\n\nCHAPTER TWO:\n2.0\nLITERATURE REVIEW\n2.1\nIntroduction\nIn this chapter the researcher will have much dealing with what other authors and\nresearchers have written, concerning the scientific theories of creation; previewing\nsome of the scientific theories of creation specifically the evolution theories, the\neffects of the scientific theories of creation on the Christian life of the Christians and\nthe roles of the church in ministering to a person who has been affected and how to\nhelp him/her grow spiritually in spite of coming into contact with the scientific\ntheories of creation. Then the researcher will do a Synthesis of the review and lastly\nwill come the new knowledge created by the researcher’s study.\n2.2\nScientific theories of creation\nWhen we are to excavate the scientific theories of creation, it would be a great help\nif we keep in mind that “science is a way to understand nature by developing\nexplanations for the structures, processes and history of nature that can be tested by\n\nobservations in laboratories or in thefield” 5 There isn’t just a single theory of\ncreation raised by the researchers, scientists, archaeologists, philosophers and all\nthose who use reasoning and scientific experimental procedures. Although there are\nmany theories of creation in this research paper the researcher will look at some of\nthem and will be more concerned with the evolution theory as well as taking a glance\nat the other scientific theories of creation.\nThere isn’t just a single theory of creation raised by the researchers, scientists,\narchaeologists, philosophers and all those who use reasoning and scientific\nexperimental procedures. Although there are many theories of creation in this\nresearch paper, we will be more concerned with the evolution theories which are the\ncommon scientific theories of creation that the people of Mwanza are well aware of.\n\n_ Stephen C. Meyer, Signature in the Cell: DNA and the Evidence for Intelligent Design\n(United States: Harper One, 2010) pg. 74.", "word_count": 365, "start_char": 15660, "end_char": 17935}
{"chunk_id": "DOC0149__00007", "doc_id": "DOC0149", "chunk_index": 7, "text": "lthough there are many theories of creation in this\nresearch paper, we will be more concerned with the evolution theories which are the\ncommon scientific theories of creation that the people of Mwanza are well aware of.\n\n_ Stephen C.M\n\neyer, Signature in the Cell: DNA and the Evidence for Intelligent Design\n(United States: Harper One, 2010) pg. 74.\n\n2.2.1 Evolution Theories\nThe theory of evolution is a scientific theory that essentially states that species\nchange over time.6 There are many different ways species change, but most of them\ncan be described by the idea of natural selection. The theory of evolution through\nnatural selection was the first scientific theory that put together evidence of change\nthrough time as well as a mechanism for how it happens.\nDarwin’s Theory of Evolution\nIn 1859 Charles Darwin published a book called On the Origin of Species. This book\nwas based on his studies of creatures he had encountered on his travels to many\noverseas locations, including the Galapagos Islands. He put forward the theory “that\nall living creatures that exist today, including human beings, have evolved from\n\n_ Scoville Heather., “‘What Is Evolution?’ ThoughtCo.,” July 2019,\nhttps://www.thoughtco.com/what-is-evolution-1224603.\n\nprimitive life forms over a period of millions of years”. 7 Here I think that it is\nimportant if I will explain in brief about the natural selection.\nNatural Selection: Due to variation among different individual, they struggle towards\ntheir existence with different potentials. The variation in an individual may allow\nhim to survive and complete its life cycle comfortable. Whereas, if the variations are\nunfavourable, the individual will struggle against every odd and as a result it may\nnot be able to complete the life cycle. In the theory of natural selection, organisms\nproduce more offspring than are able to survive in their environment. Those that are\nbetter physically equipped to survive, grow to maturity, and reproduce. Those that\nare lacking in such fitness, on the other hand, either do not reach an age when they\ncan reproduce or produce fewer offspring than their counterparts. Natural selection\nis sometimes summed up as “survival of the fittest” because the “fittest” organisms,\nthose most suited to their environment—are the ones that reproduce most\nsuccessfully, and are most likely to pass on their traits to the next generation.\n\n_ Charles Darwin, The Origin of Species: 150th Anniversary Edition (West Bengal, India:\nSignet, 2003) pg. 97.", "word_count": 398, "start_char": 17585, "end_char": 20097}
{"chunk_id": "DOC0149__00008", "doc_id": "DOC0149", "chunk_index": 8, "text": "atural selection\nis sometimes summed up as “survival of the fittest” because the “fittest” organisms,\nthose most suited to their environment—are the ones that reproduce most\nsuccessfully, and are most likely to pass on their traits to the next generation.\n\n_ Charles Darwin, The Origin of Species: 150th Anniversary Edition (West Bengal, India:\nSignet, 2003) pg. 97.\n\nThis means that if an environment changes, the traits that enhance survival in that\nenvironment will also gradually change, or evolve. Natural selection was such a\npowerful idea in explaining the evolution of life that it became established as a\nscientific theory. Biologists have since observed numerous examples of natural\nselection influencing evolution. Today, it is known to be just one of several\nmechanisms by which life evolves. For example, a “phenomenon known as genetic\ndrift can also cause species to evolve. In genetic drift, some organisms—purely by\nchance—produce more offspring than would be expected. Those organisms are not\nnecessarily the fittest of their species, but it is their genes that get passed on to the\nnext generation.”8\nChemical Evolution\nThe term evolution refers to change from one form to another. Change in living\norganism with time is known as organic or biological evolution. The process of\nevolution can be understood from the fact that unicellular organism appears first,\nsimple multicellular and later development of complex multicellular organisms such\n\n_ Chevalier de lemarck, Philosophie Zoologique, vol. Volume 2 (United States of America:\nCambridge University press, 2011).\n\nas seed plants and vertebrate animals. The fishes were the initial early vertebrate\nand it gradually changes to form amphibians. These amphibians have produced\nreptiles and that has evolved further to give birds and mammals. “Man is an animal,\nand however greatly his present state differs from that of the rest of the animal\nkingdom, we must accept that he arose from subhuman ancestors by a process of\nevolution” 9 argues Carter. These hierarchical linking of different species is\nconsidered by ladder of chain by Aristotle as given in Figure 1.1 In the same series,\nmammals have evolved to human involving ape-like primates by acquiring changes\nover the course of time\n\nFigure 1.1\n\n_ G. S. Carter, Theory of Evolution and the Evolution of Man (Chicago: University of\nChicago press, 1953) pg. 143.", "word_count": 376, "start_char": 19731, "end_char": 22118}
{"chunk_id": "DOC0149__00009", "doc_id": "DOC0149", "chunk_index": 9, "text": ".C\n\narter, Theory of Evolution and the Evolution of Man (Chicago: University of\nChicago press, 1953) pg. 143.\n\n2.3\nEvidences brought forward that support scientific theories of creation.\nFossil Evidence in Tanzania\nOlduvai Gorge is a site in Tanzania that holds the earliest evidence of the existence\nof human ancestors. Paleoanthropologists have found hundreds of fossilized bones\nand stone tools in the area dating back millions of years, leading them to conclude\nthat humans evolved in Africa. The fossils are the remains or impression of the\nancient organism preserved by natural means in some medium. The mediums found\nwith fossils are sedimentary rocks, amber, asphalt, volcanic ash, ice, peat bogs, sand\nand mud.\nThis discovery work was laid to foundation by Louis and Mary Leakey’s pioneering\nefforts. The pair made several discoveries at Tanzania’s Olduvai Gorge in the 1950s\nand 1960s that inspired other anthropologists to come to East Africa in search of\nhuman ancestors. These include the 1.8-million-year-old skull of a hominid with a\nflat face, gigantic teeth, a large crest on the top of its head and it was named\nZinjanthropus boisei, then the second to be discovered in this area was the Homo\nhabilis (meaning Handy Man). The third fossil discovered was the Homo erectus, and\n\nlastly the Australopithecus afarensis which was discovered later in the 1970s, after\nLouis died.\n2.4\nEffects of the evolution theories\nEvolution theory has led to the confinement of science into the framework of a\nnaturalistic worldview. It has led to a forced alignment of origins research to the\ndogma of evolution. Before evolution theory, science had commonly been considered\nthe study of God’s created universe and the natural laws that he had put in place to\ngovern the workings of it. After Evolution, the belief that the universe can be\nexplained without the existence of God or any other supernatural phenomenon,\nbecame far more prevalent, and even gradually became recognized as the worldview\nthat all science was practically required to be performed within. Furthermore,\nresearch done to disprove and criticize evolution is termed as pseudoscience or fake\nscience. In addition, the science acclaimed by evolutionists as true science is aligned\nto a huge confirmation bias where evidence for evolution is readily believed while\nevidence against it is explained away or dismissed outright and decried as false.\nThe theory of evolution goes against religious teachings that God made earth and\ncreated all living things. It is against Christians who believe that God had created", "word_count": 412, "start_char": 22009, "end_char": 24589}
{"chunk_id": "DOC0149__00010", "doc_id": "DOC0149", "chunk_index": 10, "text": "he theory of evolution goes against religious teachings that God made earth and\ncreated all living things.I\n\nt is against Christians who believe that God had created\n\nhumans in his own image, and that humans are superior to all other creatures and\nhave a soul that is immortal. Moreover, “the theory of evolution challenges the idea\nthat God is the designer of the universe and that the beauty, order and complexity of\nthe universe is not God’s work”.10 These theories oppose the Biblical facts that say\nhumans were created on the sixth day of creation, not over a period of millions of\nyears.\nAccordingly, Christians who embrace theistic evolution, in addition to being at odds\nwith the biblical account of creation, they place themselves outside of the historical\nposition of the church. While believing that God created matter, they fall short of\naffirming that God created not only non-living matter but all visible things (for\nexample, oak trees and horses) and invisible things (for example, the angels). “God’s\ncreation, therefore, was not a creation of generic material but of specific kinds and\nvarieties of creatures”11\n\n_ Casey Luskin William A. Dembski, The Comprehensive Guide to Science and Faith:\nExploring the Ultimate Questions About Life and the Cosmos (United Kingdom: Harvest House\nPub, 2021) pg. 126.\n_ Theistic Evolution: A Scientific, Philosophical, and Theological Critique, ed. by Stephen\nC. Meyer J. P. Moreland (Wheaton, Illinois: Crossway; Illustrated edition, 2017) pg. 440.", "word_count": 240, "start_char": 24424, "end_char": 25927}
{"chunk_id": "DOC0149__00011", "doc_id": "DOC0149", "chunk_index": 11, "text": "embski, The Comprehensive Guide to Science and Faith:\nExploring the Ultimate Questions About Life and the Cosmos (United Kingdom: Harvest House\nPub, 2021) pg. 126.\n_ Theistic Evolution: A Scientific, Philosophical, and Theological Critique, ed. by Stephen\nC.M\n\neyer J.P\n\n.M\n\noreland (Wheaton, Illinois: Crossway; Illustrated edition, 2017) pg. 440.\n\nEvolution theory gives scientific justification to the view that people of African and\nAboriginal descent are inferior, that’s the reason for them to be referred to as less\nevolved and for them to be treated with condescension and dehumanizing hatred. In\nsupport of this Stephen says “Biological arguments for racism may have been common\nbefore 1859, but they increased by orders of magnitude following the acceptance of\nevolutionary theory.”12 This theory has managed to provide justification for the social\nevils of racism, sexism, and genocide. Although some deceive themselves by denying\nevolution’s link to social evils, the facts are clear that acceptance of evolution has\nplayed a part in numerous crimes against humanity. Evolution fuelled racism against\nAfricans. Evolution led museums to display the bodies of Australian aboriginals as\nexamples of missing links between apes and humans. In these ways and more,\nevolution has led to the deaths of millions not only physically but also spiritually.\nThis leads directly the very vital point, the spiritual life. In addition to the scientific\nproblems and social evils caused by the acceptance of evolution, a spiritual danger is\nalso emerging, the rise of atheism. Although some vehemently deny that evolution\nleads to Atheism, no one can argue against the fact that the number of adherents to\n\n_ Stephen Jay Gould, ‘Ontogeny and Phylogeny, Cambridge, Mass’, Harvard University\nPress, 1977 pg. 79.", "word_count": 278, "start_char": 25579, "end_char": 27383}
{"chunk_id": "DOC0149__00012", "doc_id": "DOC0149", "chunk_index": 12, "text": "lthough some vehemently deny that evolution\nleads to Atheism, no one can argue against the fact that the number of adherents to\n\n_ Stephen Jay Gould, ‘Ontogeny and Phylogeny, Cambridge, Mass’, Harvard University\nPress, 1977 pg. 79.\n\nthe atheistic belief system has drastically increased since the 1800's, right along with\nthe increase of the acceptance of evolution. As stated by National Geographic, in the\n105 years between 1900 and 2005, the percentage of the non-religious world\npopulation rose from approximately 2% to around 14%, an enormous increase. It can\nalso be observed that countries with high acceptance rates of evolution are also\nhighly atheistic, for instance France, where 80% of the population confidently accepts\nevolution, is also over 55% atheistic. 13 With evolution concept some people have\nalready dismissed the fact that God exists. An example of this are the words of Josef\nStalin who said “God’s not unjust, he doesn’t actually exist. We’ve been deceived. If\nGod existed, he’d have made the world more just.”14\nEvolution has led to the deification of science in the minds of the people, and\nencourages them to place their trust in this new god. Even as many trumpet the\nsupposed compatibility of Christianity and evolution, they are oblivious to the\nscriptural foundations of Christianity crumbling beneath their feet. As acceptance of\n\n_ “NATIONAL GEOGRAPHICAL MAGAZINE,” accessed April 15, 2023,\nhttps://www.nationalgeographic.com/magazine/.\n_ Montefiore, S., “Young Stalin,” Weidenfeld & Nicolson, 2007, https://www.cedebate.org/the-implications-of-evolution.\n\nevolution has increased, rejection of God has also increased and will continue to do\nso. In spite evolution’s claim to be enlightening knowledge, it has caused many to be\nlost in the darkness of atheism. However, as thousands wander off into this darkness,\nall is not lost, for “there is a light that shines in the darkness, and the darkness has\nnot overcome it.”\n2.5\nRoles of the church in mitigating effects of the scientific theories of\ncreation\nFirst and foremost, the church is supposed to teach, emphasizing on how the creation\naccount of Genesis is quite unique in ancient literature. This great uniqueness has\nbeen commented on by Francis A. Schaeffer who says that it “reflects an advanced\nmonotheistic viewpoint and it provides us with a sequence of phrases which modern\nscience cannot improve upon.” 15 Bringing into light the mentality of the whole\nscripture, which affirms that the creation theory is historical true as the history of\nthe Jews and our own present moment of time. This is due to the fact that “both the\nOld and the New Testaments deliberately root themselves back into the early\n\n_ Francis A. Schaeffer, Genesis in Space and Time (Great Britain: Hodder and Stoughton,\n1973) pg. 567.", "word_count": 443, "start_char": 27152, "end_char": 29955}
{"chunk_id": "DOC0149__00013", "doc_id": "DOC0149", "chunk_index": 13, "text": "his is due to the fact that “both the\nOld and the New Testaments deliberately root themselves back into the early\n\n_ Francis A.S\n\nchaeffer, Genesis in Space and Time (Great Britain: Hodder and Stoughton,\n1973) pg. 567.\n\nchapters of Genesis insisting that they are a record of historical events.”16 Remind\nChristians that we have the Bible, which is the Word of God, the words of the\nCreator who has always been there and has revealed to us the major past events that\nwe need to know. On the basis of these events (creation, the Fall, the Flood, Babel,\netc.), that we have a set of presuppositions to build a way of thinking which enables\nus to interpret the facts of the present.\nSecondly, the church is to refute these theories in all ways possible because failure\nto this is creating a generation that won’t believe the death of Jesus Christ on the\ncross. The church is to point out the fact that, for Jesus to die on the cross there\nmust be a reason and the reason was that man sinned. That one should be aware that\nthe one who sinned was the created one and not the one who evolved from an Apelike man. If the Genesis account of man’s origin and fall is viewed as mythical, then\nmankind obviously cannot be viewed as fallen and in need of salvation. The point of\nview is that Jesus wouldn’t die if Adam wouldn’t have sinned and also Adam\nwouldn’t sin if he wouldn’t have broken the Laws that were set forth by His creator.\n\n_ E. E. Flack W. F, Albright, Old Testament Commentary (Philadelphia: Muhlenberg,\n1948) pg. 138.", "word_count": 280, "start_char": 29737, "end_char": 31261}
{"chunk_id": "DOC0149__00014", "doc_id": "DOC0149", "chunk_index": 14, "text": "he point of\nview is that Jesus wouldn’t die if Adam wouldn’t have sinned and also Adam\nwouldn’t sin if he wouldn’t have broken the Laws that were set forth by His creator.\n\n_ E.E\n\n.F\n\nlack W.F\n\n, Albright, Old Testament Commentary (Philadelphia: Muhlenberg,\n1948) pg. 138.\n\nThirdly, is the church coming out and encouraging all those that are fighting\nevolution, those whose hearts have fainted, those who see that the war against\nevolution is done and evolution has won, that though evolution attempts to set up\nnaturalistic science as the source ultimate truth, Jesus Christ is the Truth. Though\nsocial evils caused by evolution bring death, Jesus Christ is the Lord of Life. Though\nevolution brings spiritual darkness, Jesus Christ is the light of the world, the light that\nno darkness–even the darkness brought about by evolution–can overcome.\n2.6 New knowledge created by the study (Gaps to be Bridged)\nAs discussed, the dark side of Darwinism is far darker than today’s society would\nhave you believe. Scientifically, the theory of evolution is treated more and more\nlike an undeniable fact and factions within the scientific community that reject\nevolutionary dogma are themselves marginalized and rejected. Furthermore, it has\nprovided justification for the social evils of racism, sexism, and genocide.\nOn the other side the church has a vital role in opening up the eyes of the people in\nthe society on the dangers of carrying the scientific theories of creation to be the\ndefinition of their existence. The church also has to be aware on the increase in\nnumber of atheists in the society. There is still room for the church pointing to\n\npeople that the scientific theories are not the ultimate truth as far as explaining\ncreation is concerned.", "word_count": 292, "start_char": 30989, "end_char": 32743}
{"chunk_id": "DOC0149__00015", "doc_id": "DOC0149", "chunk_index": 15, "text": "he church also has to be aware on the increase in\nnumber of atheists in the society.T\n\nhere is still room for the church pointing to\n\npeople that the scientific theories are not the ultimate truth as far as explaining\ncreation is concerned.\n\nCHAPTER THREE:\n3.0\nRESEARCH METHODOLOGY\n3.1\nIntroduction.\nHaving looked at the literature review in Chapter 2, this chapter represents the\nmethodological approaches that were used to collect data to study the research\nproblem. These include the research design, population of the study, sampling\ntechniques, sample size, procedures for data collection, sources of data, research\ninstruments and the validation of the research instruments.\n3.2\nResearch plan (research design).\nResearch design is an arrangement of collecting and analysing data in relevance to\nresearch economy in procedure. With an intention of facilitation, the smooth running\nof research operations and make research effective with required information as a\nsubsided expenditure The researcher used a qualitative and quantitative research\napproach and the deductive research approach. The qualitative strategy of inquiry\nused in this study was in form of interviews and discussions favorably for the\nuneducated persons, and the quantitative strategy used was the kind of questionnaire\ndistributed to some groups of people who were able to read and write among the\n\nchurch leaders. The qualitative approach had great success because it was seen to be\nthe best in discovering why things are the way they are. This was done through\nintensive and extensive interviews and discussions. An extensive collection of data\nwas done appropriately. Deductive approach which enabled the research to move\nfrom general ideas or theories to specific particular and situations.\n3.3 Population, Sampling methods/techniques and Sample Size\nThe research was carried out in the Anglican Church of Tanzania Diocese of Victoria\nNyanza, Mwanza Archdeaconry. The Archdeaconry covers three administrative\ndistricts of Nyamagana, Ilemela, and Ukerewe which also serve as the archdeaconry’s\ndeaneries.\nSamples were selected using the one sampling technique of purposive technique\nwhich reflects a group of sampling techniques that rely on the judgment of the\nresearcher when it comes to selecting the units. So, the researcher approached 1\nBishop, 7 priests, 5 evangelists, 10 Anglican congregants, 1 regional education officer,\n1 district educational officer, 2 Christian education coordinators, 10 students, 2\nprimary school Teachers, 2 secondary school teachers, 2 university lecturers and 3\nVillage leaders, which makes a total of 46 people. After collecting data and\ninformation, everything was filled and kept well in order to come up with a good", "word_count": 413, "start_char": 32503, "end_char": 35237}
{"chunk_id": "DOC0149__00016", "doc_id": "DOC0149", "chunk_index": 16, "text": "fter collecting data and\ninformation, everything was filled and kept well in order to come up with a good\n\nreport after the process of research. On the sample size, since that total number of\npopulations in the area covered by the Archdeaconry of Mwanza is large, then the\nresearcher selected and interviewed 46 people.\n3.4\nSources of data information (Primary and Secondary)\nThe researcher used both primary and secondary information in carrying out the\nstudy. Concerning the primary sources, data was collected through direct contact\nwith the respondents, personal interviews and through questionnaires. The secondary\nsources were obtained through the already available data collected and analysed by\nother researchers. The researcher used published data available in books, journals,\nnewspapers and reports about the topic of the study.\n3.5\nResearch instruments\nThe research employed instruments like interviews, questionnaire, observation,\nchecklist, notebooks, papers and pens. The researcher selected some people and gave\nthem printed questionnaires which were returned after one week. The researcher\nscheduled for specific groups and individual interviews. The researcher used a\nchecklist to make sure that the planned activities were carried out in time and\neffectively. Oral interviews were conducted to respondents especially to those who\n\nfound it difficult to communicate through written words or were unable to write and\nread.\n3.6\nValidation of the research instruments\nThe research techniques were valid to the researcher because they led the researcher\nto obtain credible, correct and relevant information pertaining.\nQualitative approach was valid to the study due to the fact that it played a very good\nrole in obtaining precise information like feelings, opinions, and descriptions on the\neffects of the scientific theories of creation.\nQuantitative approach was helpful in correcting numerical information appropriate to\nthe study because it focuses in analysing figures related to the effects of the\nscientific theories of creation in the society.\nDeductive approach was helpful because it facilitated the research to move from\ngeneral ideas or theories to specific particular and situations which were very crucial\nto the research.", "word_count": 334, "start_char": 35132, "end_char": 37384}
{"chunk_id": "DOC0149__00017", "doc_id": "DOC0149", "chunk_index": 17, "text": "uantitative approach was helpful in correcting numerical information appropriate to\nthe study because it focuses in analysing figures related to the effects of the\nscientific theories of creation in the society.D\n\neductive approach was helpful because it facilitated the research to move from\ngeneral ideas or theories to specific particular and situations which were very crucial\nto the research.\n\n3.7\nData collection procedure.\nThe researcher got permission letters for conducting research from relevant\nauthorities beginning with Uganda Christian University and then from the Diocese of\nVictoria Nyanza (ACT). The letters helped the researcher to carry out his research\nwithout hesitation and was able to make appointments with different offices, schools,\nparishes, congregations and individuals. Not only that but also the researcher\ndeveloped a self-administered questionnaire to help him collect data.\n3.8\nData processing and analysis.\nThe researcher analyzed the data in a statistical technique. The researcher also\nemployed analytical techniques in organizing collected information. The researcher\nkeenly cross checked relevant and appropriate form, data, edited and modified them\ninto relation to the study.\nThe researcher made sure that all information received or given by the respondents\nwas confidential. This means that the information was not given or published thus,\nonly for the purpose of helping the society be aware of the effects of the scientific\ntheories of creation and the stand of the church in playing its role.\n\nCHAPTER FOUR\n4.0\nINTERPRETATION\n4.1\nChapter’s introduction\nIn approach to this chapter that will have more dealing with the scientific theories of\ncreation basically at the archdeaconry level, which is Mwanza archdeaconry.\nPresenting how these theories are understood, the peoples’ take and response on\nthese theories being taught at school, why the government has allowed these theories\nto be included in the academic curriculum of schools in Tanzania, their effects, how\nthe affected should be helped, the church’s failure and roles in overcoming the\nalready uprising problem in the community and lastly will come the conclusion.\n4.2\nHow scientific theories of creation are understood by both Christians and\nnon-Christians in Mwanza archdeaconry.\nSince Christians live in community where there is a wide spread of the scientific\ntheories of creation then in one way or the other, they have their own approach to\nthis, how they understand, interpret and respond to these theories. Here we are not", "word_count": 384, "start_char": 36987, "end_char": 39524}
{"chunk_id": "DOC0149__00018", "doc_id": "DOC0149", "chunk_index": 18, "text": "ince Christians live in community where there is a wide spread of the scientific\ntheories of creation then in one way or the other, they have their own approach to\nthis, how they understand, interpret and respond to these theories.H\n\nere we are not\n\nonly referring to Christians but also to all people found in community including\nMuslims and those who believe in African Tradition Religions (ATR)\nTurning to the genuinity of the scientific theories of creation, it was recorded that\n65% of the people interviewed were totally against the scientific accounts of creation\nsaying that it is totally a heresy. We have a large percentage in this group and this is\nbecause it is in this group where we find Christians who believe in the biblical account\nof creation, while other Religion groups like Muslims believe that Allah (God) created\nthe universe. One of the things that was not expected is finding a large percent of the\nAfrican Tradition Religion believers acknowledging God as the creator. Shilankuta\nMwana Butoli an elder and head of the Butolishengwa clan in Ukerewe said “it’s true\nthat we neither believe in the Christian faith nor the Islamic faith. Our faith agrees\nand acknowledges God as the creator of each and everything we see and he entrusted\nit to our ancestors to control and keep it. I’m wondering if the scientists think that\nGod is not the creator, while at the same time science is just an idea and has no even\na single element of truth in it.”17\n\n_ shilankuta Mwana Butoli. A traditional leader, interviewed on 27/12/2022; Ukerewe\n\nThe study recorded a 25% of people who were neutral and argued that science has\nsome elements of truth and can be believed since it has some evidences. One of these\npeople is Johannes Joktan who said “although I’m a Christian one half of mine\nbelieves science to be stating the truth because of the evidences they have. You know\nwhat; you can’t ignore things like the remains in old-vai saying that it is a lie.”18 It\nwas recorded that a 10% of the people interviewed had a strong belief in science to an\nextent of saying that God does not exist because He can’t be seen and proved by\nscientific procedures\n\n_ Johannes Joktan. A University student at St. Augustine University, interviewed on\n29/12/2022; Mwanza Nyamagana.\n\nOn the people interviewed it was clear that 70% priests are ignorant as far as\nscientific theories of creation are concerned and 30% had an understanding on the\ntheories. Furthermore 45% of the of the parents interviewed had a clue and 55% had\nno clue of what scientific theories are.", "word_count": 443, "start_char": 39276, "end_char": 41839}
{"chunk_id": "DOC0149__00019", "doc_id": "DOC0149", "chunk_index": 19, "text": "ugustine University, interviewed on\n29/12/2022; Mwanza Nyamagana.O\n\nn the people interviewed it was clear that 70% priests are ignorant as far as\nscientific theories of creation are concerned and 30% had an understanding on the\ntheories.F\n\nurthermore 45% of the of the parents interviewed had a clue and 55% had\nno clue of what scientific theories are.\n\n4.3\nIndividual responses as far as teaching scientific theories of creation in\nschool is concerned.\nThe curriculum that is used to teach in schools, colleges and universities have the\nscientific theories of creation in them; some in form of topics and some as sub-topics.\nThese topics are commonly found in history subjects\nMr. John Leonard the region coordinator in responding to why these scientific theories\nof creation are taught in schools he said “It is important that young people learn\nabout the world around them, and are aware of different beliefs”19 To Wilson Fumbi\nan evangelist from St. Peter Nyegezi Parish said “The theory of evolution has nothing\n\n_ John Leonard, Mwanza regional education coordinator, interviewed on 6/12/2022; Mwanza\nregional headquarters Ilemela.\n\nto do with divine revelation but is built on facts. Intelligent design, presented in a\nmore suitable way, seeks to portray its approach as scientific, and therein lies the\ndanger.”20\nRev. Samwel Shiyengo a priest from Nyakato parish said there was “a real risk of a\nserious confusion\" being introduced into children's minds between belief and\nscience.”21 To Rt. Rev Zephania Ntunza the bishop of Victoria Nyanza diocese when\nasked on his point of view as far as teaching Scientific theories of creation in schools\nand universities is concerned he asid “It is not a matter of opposing belief and\nscience, but it is necessary to prevent science from opposing the Christian faith.”22\nAnd so, there was a mixed feeling between the people interviewed some supporting\nthe idea of scientific theories of creation being taught at school while some where\nagainst this idea.\n\n_ Wilson Fumbi. Evangelist at St. John the Baptist, interviewed on 15/11/2022; Nyegezi\nMwanza.\n_ Rev. Samwel Shiyengo. A priest in the Diocese of Victoria Nyanza Nyakato parish, interviewed\non 08/11/2022. Nyakato Mwanza\n_ Rt. Rev. Zephania Ntunza. Bishop of the Diocese of Victoria Nyanza, interviewed 17/10/2022;\nDiocese headquarters Mwanza.\n\nAccording to this survey, 76% of the participants agreed with the sentiment ‘Science\nand religion disagree on so many things that you cannot believe both’; 8% of the\nparticipants agreed that ‘Religious ideas about how the universe began have been\nproved wrong by science’; and 16% of the participants agreed that ‘A good scientist\ncannot believe that life was created by God or a higher being’.", "word_count": 438, "start_char": 41487, "end_char": 44229}
{"chunk_id": "DOC0149__00020", "doc_id": "DOC0149", "chunk_index": 20, "text": "4.4 Effects of the scientific theories of creation\nSuggested by Scholastica Richard one of the students who were interviewed at Ilemela\nprimary school, said, “If you are not spiritually mature then you may end-up falling\n\ndown in faith”23. One of the victims of these teachings is Madam Leah a history\nteacher at Nundu secondary school who graduated at St. Augustine University, she\nsaid “it was in the lesson of Science of religions that the lecturer taught about the\naccounts of creation; it’s here that a large percent of the students in the class were\nconfused. It was only that I grew in a Christian home that’s why I keep my faith in\nJesus, however unfortunately there are some of my colleagues who until they\ngraduated, they insisted that Christianity is a false religion, and what is written in the\nbible is false.”24\nIncrease in number of the atheists, is another rising problem that is currently\nfacing Mwanza, this has been recorded on different social media pages including\nFacebook and twitter.25 The number of people declaring that God does not exist\n\n_ Scholastica Richard. A primary six student at Ilemela Primary school; interviwed on\n10/11/2022 Ilemela Mwanza\n_ Leah Theodole. A secondary school teacher at Nundu Secondary school; interviewed on\n10/11/2022 Ilemela Mwanza\n_ (12) Facebook\n\nis increasing day by day.26 Although this has not been taken seriously, the issue here\nis that most of the people in our societies have un-answered questions and one of this\nis what was the beginning alike, where did God come from, is science stating the\ntruth about the beginning? Considering that in Tanzania there are historic sites that\nshow how man evolved from the ape like creatures then “I am likely to believe that\nthe bible is not stating the truth because the Garden of Eden is nowhere to be found\nthough the remains and evidences of evolution still exist and I have personally visited\nthe Old Vai Gorge and the National museum so they is no way I can be convinced that\nevolution is a lie and the creation account of the bible is true”27 said Mukuta Kaphili\nWhen the interviewed were asked if the spread of scientific theories of creation have\ncontributed to increase in number of the atheists, there was a mixed feeling on the\nresponses; 60 percent of the interviewed said that these theories have contributed\ngreatly to the increase in number of atheists, while 10 percent said no and 30 percent\nsaid that they were not sure.\n\n_ Mungu hayupo? Atheist njooni mthibitishe | Page 4 | JamiiForums\n_ Mukuta Kaphilli. A human resources’ student at St. Augustine University; interviewed on\n06/05/2023 Nyamagana Mwanza.", "word_count": 445, "start_char": 44229, "end_char": 46860}
{"chunk_id": "DOC0149__00021", "doc_id": "DOC0149", "chunk_index": 21, "text": "theist njooni mthibitishe | Page 4 | JamiiForums\n_ Mukuta Kaphilli.A\n\nhuman resources’ student at St.A\n\nugustine University; interviewed on\n06/05/2023 Nyamagana Mwanza.\n\nPositive effects\nThe research conducted in Mwanza Archdeaconry concerning the effects of the\nscientific theories of creation realized that there are some positives that people have\nobserved, seen and experienced from coming into contact with these theories. This is\nbecause through these they understand that God created the universe and everything\nthat is in it. Also, it is through this they have the courage to face their studies no\nmatter what is taught that is against God, they just take scientific studies on creation\nfor granted since they know that the syllabus, they are taught is just the idea of\npeople who sat and wrote it. Rev Shedrack Bitaly said “it is through studying science\nthat people get employed”28 moreover most of the people said that it is through\nstudying science they have been employed, an example of this is Mr. Kasumbi a\nPrimary School teacher at Ibeshi primary school, Mr. Katto a Secondary School teacher\nat Alliance High School and Prof. Frank Chiteji a lecturer at BUHASI university. To\nProf. Frank Chiteji he observes studying science as an advantage saying “when you\nknow science and understand it, then you know its weaknesses and in return this is a\n\n_ Rev. Shedrack Bitaly. A priest in the Diocese of Victoria Nyanza; St. Peter Igogo parish,\ninterviewed on 20/04 2023 Nyamagana Mwanza\n\nweapon. When you have it in class then students who are curious to know what\naccount states the truth will definitely get the right answer”29\n4.5 The church’s failures\nTeaching Christian education in secondary and primary schools; Only 35% of the\nAnglican priests in DVN Mwanza archdeaconry teach or attend schools for Christian\neducation classes. Furthermore, the failure of the Diocese in preparing such programs\nand well-equipped personnel to take part and run the Christian education programs.\nThis must be taken seriously and this is a challenge that DVN is facing due to the fact\nthat things are getting even shoddier as days go on. I’m saying this because of the\nevangelism coordinators’ statement that “neither is Christian education provided in\nschools nor do the pastors take part in religious groups in schools like UKWATA,\nbesides even the bible knowledge exams are not effectively done because of the lack\nwell trained and equipped pastors to teach Christian education”30\n\n_ Prof. Frank Chiteji. A lecturer at Bugando University of Health and allied sciences;\ninterviewed on 09/05/2023 Mwanza\n_ Revd Kashirimu. Diocesan Christian education coordinator; interviewed on 07/05/2023\nMwanza", "word_count": 431, "start_char": 46692, "end_char": 49386}
{"chunk_id": "DOC0149__00022", "doc_id": "DOC0149", "chunk_index": 22, "text": "rank Chiteji.A\n\nlecturer at Bugando University of Health and allied sciences;\ninterviewed on 09/05/2023 Mwanza\n_ Revd Kashirimu.D\n\niocesan Christian education coordinator; interviewed on 07/05/2023\nMwanza\n\nSurprisingly when Rev Joseph tried to teach Christian education unexpectedly, some\npeople sprung and opposed him; he says, “When I started this program the church\nelders and some pastors said that is not my duty but that task belongs to the AIC, and\nthey insisted that if I continue I will be neglected by the church”31.\nThe lack of use of modern communication ways; When talking about the use of\nmeans of communication I deliberately mean the social networks and Medias such as\ntelevision and radio sessions, magazines, newspapers and articles. This research paper\nhas found out that DVN doesn’t use means of communication, “We don’t have such\nsessions running mainly due to the reason that we don’t get enough time to come\ntogether and arrange such programs because of the conflicts taking place in the\nDiocese”32 said Rev Can. Kashimba a Vicar General in DVN.\nOrganizing seminars on such topics like creation; One of the most forgotten topics\nin the church is the creation, and even if taught it’s just partially. Another reason\n\n_ Revd Joseph Kwangu. A priest in the Diocese of Victoria Nyanza; St. John the Baptist Usagara\nparish, interviewed on 12/10/2022 Nyamagana Mwanza\n_ Rev Can. Kashimba. Vicar general of the Diocese of Victoria Nyanza; interviewed on\n27/04/2023 Mwanza", "word_count": 239, "start_char": 49182, "end_char": 50669}
