{"chunk_id": "DOC0103__00000", "doc_id": "DOC0103", "chunk_index": 0, "text": "THE IMPORTENCES OF CHILDREN’S MINISTRY AT ALL SAINTS CHURCH OF UGANDA\nKYOTERA KAKOMA ARCHDEACONRY WEST BUGANDA DIOCESE\n\nJAMES MUBIRU\nM22B09/031\n\nA DISSERTATION SUBMITTED TO BISHOP TUCKER SCHOOL OF DIVINITY AND\nTHEOLOGY, IN PARTIAL FULFILLMENT OF THE REQUIREMENTS FOR THE AWARD OF A\nDEGREE OF BACHELOR OF DIVINITY OF UGANDA CHRISTIAN UNIVERSITY\n\nJuly, 2024\n\ni\n\nDECLARATION\n\nI, Mubiru James hereby declare that this research is my work and that it has not been submitted to\nany institution for the award of a degree in Divinity.\n\nSignature: ______________________\n\nDate: ________________________\nMUBIRU JAMES\n\nii\n\nAPPROVAL\nThis is to certify that this research report entitled “The Importance of Children’s Ministry in All\nSaints Church of Uganda Kyotera has been done under my supervision and guidance and is now\nready for submission for examination to Uganda Christian University with my approval.\n\nSigned: ____________________________\nDate: ___________________\nREV. CANON. PROF. PETER NYENDE.\nSUPERVISOR\n\niii\n\nDEDICATION\nTo my wife Catherine Mubiru, thank you for caring for our children and everything at home in my\nabsence.\nTo my Bishop, the Rt. Rev. Henry Katumba Tamale. Thank you for sending me back to school.\n\niv\n\nACKNOWLEDGEMENT\nI wish to acknowledge all the persons who in one way or the other assisted me in the completion\nof this study. Special appreciation goes to my supervisor Prof. Peter Nyende for his effort to\nspeedily read and comment on my drafts.\nIn the same way, I wish to thank my Bishop and Diocese for the opportunity to further my\ntheological education at Uganda Christian University and for the University sponsorship given to\nme.\n\nv", "word_count": 261, "start_char": 0, "end_char": 1661}
{"chunk_id": "DOC0103__00001", "doc_id": "DOC0103", "chunk_index": 1, "text": "pecial appreciation goes to my supervisor Prof.P\n\neter Nyende for his effort to\nspeedily read and comment on my drafts.I\n\nn the same way, I wish to thank my Bishop and Diocese for the opportunity to further my\ntheological education at Uganda Christian University and for the University sponsorship given to\nme.\n\nv\n\nABSTRACT\nThis study labored to give the importance of Children's ministry in All Saints Church of Uganda\nKyotera and found that; children's ministry helps in the following;\nknowing the truth about God, the continuity of the Church, Church growth, source of Joy and\ndevelop Children among others therefore, pastors should try their best to do this ministry well\nthrough training Children's teachers, building Children's Church, having a curriculum, and having\na budget to facilitate this ministry.\nThe study has established that the number of children at All Saints Kyotera Church of Uganda and\nWest Buganda Diocese at large is growing but the children’s ministry is not given sufficient\nsupport from the clergy because they are attending to the bigger issues of the church. There are\nstill many people in the congregations who treat children as second-class human beings who\nshould not be heard. Children ministries are viewed as welcoming of children, but most\nrespondents understood the significance of children only as recipients of Christian education and\ncare. Clergy cannot provide examples of how their churches are sanctuaries of vulnerable children\nthat need compassion and the majority of the clergy and Christians are unsure of how their church\nis blessing children.\nThe study focuses on revealing the principal aim of the children’s ministries in the Church is to\nteach children about Jesus. However, the children’s ministries also emphasized discipline and\nmorals. All the churches that were the focus of this study had children’s workers who were trained\nand were receiving continuing ministry training. The Church had developed a curriculum for\nchildren’s ministry, capacity building was done for children’s ministry workers, and music was\nincorporated into the children’s ministry curriculum. Media and visual aids were used in teaching\nchildren and bible games were incorporated in the children’s ministry curriculum. However,\nresources for curriculum implementation were inadequate.\n\nvi\n\nTABLE OF CONTENTS\nTable of Contents\nDECLARATION ................................................................................................................................................ i\nAPPROVAL ..................................................................................................................................................... ii\nDEDICATION ................................................................................................................................................. iii\nACKNOWLEDGEMENT .................................................................................................................................. iv\nABSTRACT ...................................................................................................................................................... v\nTABLE OF CONTENTS .................................................................................................................................... vi\nINTRODUCTION ............................................................................................................................................. 1\nChildren’s ministry at All Saints’ Church ................................................................................................... 2\nChallenges with All Saints’ Children’s Ministry ......................................................................................... 4\nTHE IMPORTANCE OF CHILDREN’S MINISTRY ............................................................................................... 5\nTeaching Children ..................................................................................................................................... 5\nBuilding tomorrow’s Church ..................................................................................................................... 6\nFollowing God’s command........................................................................................................................ 7\nDiscipling Children..................................................................................................................................... 9\nDeveloping children’s gifts ...................................................................................................................... 10\nBelonging to the church .......................................................................................................................... 11\nSource of joy ........................................................................................................................................... 12\nConclusion ............................................................................................................................................... 12\nBIBLIOGRAPHY ............................................................................................................................................ 16", "word_count": 448, "start_char": 1348, "end_char": 6603}
{"chunk_id": "DOC0103__00002", "doc_id": "DOC0103", "chunk_index": 2, "text": "INTRODUCTION\nI grew up in a village church where the wardens' work was to chase the children out of the Church\nso that the adults could worship God without disturbances from the children. Children could sit on\nthe verandas of the church without anyone helping them to learn anything about God. As children,\nwhenever we could go for Sunday services with our parents, we could be sent to rest under the\ntrees in the Church compound as the adults could be attending the services. While under the trees,\nno one could care about or minister to us.\nSometimes, during rainy seasons it could rain on us or they could put us in the church vestry which\ncould contain twenty people and put there more than two hundred children. I remember one day\nfour children almost fainted due to overclouding in the church vestry. Such treatment made us hate\nthe churchwardens because they were the ones to chess us from the church and we hated the church\ntoo due to mistreatment.\nOne day when Bishop Keefa Kamya Ssemakula visited our Church for the first time in 2003, he\ntold his wife to meet the children and talk to them and encouraged the church to come out with\nchildren’s ministry. He was not happy with how the children were treated. He asked the children\nthe main role of the churchwardens and the answer from the children together was to chase away\nchildren during worship. To make matters worse, children could come first, very early, and sit\ndown in the churches but the old Christians could come very late and there the chasing away of\nchildren could begin.\nWhen the Bishop requested his wife to attend to the children, she asked whether they could find\nwhere to worship from. She asked any volunteers to help her and I volunteered to do it with her.\nThe children were very happy that day to the extent that they cried when the Bishop was leaving\nbecause they wanted to continue with his wife. They cried calling Maama Bishop, Maama Bishop.\nIt touched my life and since then I could organize the children every Sunday and sing with them\nChristian songs. I had no idea of how to do children’s ministry but I could try to do it like “Maama\nBishop did it.”", "word_count": 386, "start_char": 6603, "end_char": 8745}
{"chunk_id": "DOC0103__00003", "doc_id": "DOC0103", "chunk_index": 3, "text": "hey cried calling Maama Bishop, Maama Bishop.I\n\nt touched my life and since then I could organize the children every Sunday and sing with them\nChristian songs.I\n\nhad no idea of how to do children’s ministry but I could try to do it like “Maama\nBishop did it.”\n\nChildren loved me and spread the information about what happened and in around three months\nchildren were more than two hundred.\nWhen the parish priest realized this, he started giving me skills on how I can do it better and it\nbecame my Sunday routine. This was a pastor’s target to earn something from them and he started\ntelling the adults to give offertories to their children and whenever we could collect the money it\ncould go to the treasurer but helped nothing to the children’s church. According to the pastor I was\nnot supposed to earn anything since I never went for training and according to church hierarchy\n“there is no children’s pastor” said the Parish Priest. Of course, I never started doing that ministry\non grounds of earning anything but I was inspired by the happiness the children got when the\nBishop’s wife attended to them so I continued to enjoy their joy and happiness.\nChildren started calling me Jesus because I could always point them to Jesus and teach them about\nGod’s love for mankind through Jesus Christ since I had memorized John 3:16 which says “For\nGod so loved the world that he sent his only begotten son that whoever believes in him shall not\nperish but have eternal life.” This was repeated every Sunday.\nThe more the children loved me the more their parents loved me and came closer to me; they\nstarted supporting my ministry and me as a person. They helped me to study up to secondary level\nfour and pledged to pay for me for a lay reader course but the Bishop gave me a bursary to study\nS.6 after hearing about what I was doing in children’s ministry.\nI continued with my education and I gave the glory back to God for he saw my faithful work\nrendered to children and work rendered to children and the Lord educated me through the Bishop.\nI felt good and I asked God if he wanted me to serve in his vineyard till 2014 when I had the call\nand joined the ordination course at Uganda Martyrs Seminary Namugongo.\nChildren’s ministry at All Saints’ Church\nI learned a lesson from my personal experience and when I became a parish priest I tried my best\nto organize my children’s ministry at my parish.\nWe organized age groups\n3-6 years with two teachers", "word_count": 445, "start_char": 8486, "end_char": 10940}
{"chunk_id": "DOC0103__00004", "doc_id": "DOC0103", "chunk_index": 4, "text": "hildren’s ministry at All Saints’ Church\nI learned a lesson from my personal experience and when I became a parish priest I tried my best\nto organize my children’s ministry at my parish.W\n\ne organized age groups\n3-6 years with two teachers\n\n7-9 years with two teachers\n10-12 years with one teacher\nWe have five trained Sunday school teachers and five helpers so each age group has a warden who\nhelps them when they want to go and ease themselves.\nThe teens also have their programs and the youth but my focus is on children’s church.\nThe age group of 3-6 is around five hundred when the schools are going on since we have many\nschools.\nThe age group 10-12 is around four hundred children during school time.\nDuring the holiday the number is low but during school time we are more than one thousand two\nhundred.\nWe do not have a well-organized Children’s church but we use the Kyotera Township Primary\nSchool ground and classrooms which is the Church school at the Parish under my supervision.\nThe number of children’s church teachers is very low compared to the number of children but we\nare trying to have more helpers since we cannot afford to pay more than five teachers and when\nthey are not paid something we cannot utilize their talents well for we do not own them for they\njust help us but when paid, we can give them instructions.\nWe are using the church of Uganda provincial curriculum and since I am the children’s Champion\nin my Diocese I always get materials from the provincial youth and children’s department which\nwe use.\nI also get time to select memory verses that the teachers can use to teach the children.\nI choose my wife to be part of the children’s church but for her, she is not paid but willing to serve\nwith me in that department.\nMy parish has a uniform for children’s ministry and always represents the Diocese at Namugongo\nMartyrs Children’s Day. Am very proud of it and it has helped me so much during Bishop’s visit\nfor we do not lack comfirmates.", "word_count": 358, "start_char": 10701, "end_char": 12679}
{"chunk_id": "DOC0103__00005", "doc_id": "DOC0103", "chunk_index": 5, "text": "y parish has a uniform for children’s ministry and always represents the Diocese at Namugongo\nMartyrs Children’s Day.A\n\nm very proud of it and it has helped me so much during Bishop’s visit\nfor we do not lack comfirmates.\n\nChallenges with All Saints’ Children’s Ministry\nThe children enjoy their services when they are worshipping together with their fellow children\nrather than being mixed without separating them according to their age group.\nThe children’s teachers enjoy their work though the allowances given to them are very little. There\nis a need for increments if we get resources and next year we are planning to have supporters at\nleast each Sunday we shall have Christians to be Sunday quests to children’s ministry to support\nit.\nWe lack a church where to worship for the classrooms seem to be schools not churches to the\nchildren so there is a need to have Sunday school organized places of worship at All Saints Church\nof Uganda Kyotera.\nThe instruction materials are very important since most of the children learn through listening,\nobserving/seeing, and touching now they learn very well. Some weeks we lack instruction\nmaterials but it seems to be born when the instruction materials are there, the children enjoy them\nso much, therefore, we try to buy them but we lack funds sometimes.\nEven parents take it seriously and very important to see their children enjoying and learning God’s\nword and nurturing spiritually in the Lord. It is a joy to them so they try to support this ministry.\nThe only need is to empire this ministry from the top church leaders to the bottom ones. That is\nthe Archbishop, House of Bishops, House of Clergy, Lay readers, and the Laity.\nAmidst all the challenges children’s ministry at All Saints Church of Uganda faces, the work is\nwonderful, children enjoy it, parents love it and its impact on the church is seen and will be seen\nin fifteen years to come in abundance.\nPurpose of the study\nThis research aims at creating awareness about the importance of Children’s ministry among\nchurch leaders and those involved with children’s ministry in the church.", "word_count": 357, "start_char": 12458, "end_char": 14562}
{"chunk_id": "DOC0103__00006", "doc_id": "DOC0103", "chunk_index": 6, "text": "urpose of the study\nThis research aims at creating awareness about the importance of Children’s ministry among\nchurch leaders and those involved with children’s ministry in the church.\n\nTHE IMPORTANCE OF CHILDREN’S MINISTRY\nChildren’s ministry is a term that refers to the various ways that churches seek to teach, nurture,\nand serve children in the name of Jesus Christ. Children’s ministry can include activities such as\nSunday school, Bible study, children’s conferences, and school chaplaincies. It is one of the\nministries that has been neglected in the Anglican Church of Uganda hence leading to the exodus\nof children to the Pentecostal churches that have a well-established Children’s ministry. Below is\nthe importance of Children's ministry in our church if it is effectively conducted well.1\nTeaching Children\nThe central point of children’s ministry is to make sure that children learn about God in an orderly\nway according to their age groups. It is key to understand that children learn very well when they\nare fed according to their age. The writer of the book of Hebrews encourages those preaching the\ngospel to feed milk to those who deserve milk and when they grow, they can now feed them adult\nfood. In that case, children deserve milk food (gospel) if they are to understand or learn well about\nGod (Hebrews 15:13-14).2\nChildren are slow to understand their listening time is low thus making it meaningless and injustice\nto combine them in the adult church thinking that they will understand what they are teaching in\nthe adult church.\nChildren’s ministry, therefore, if organized well enables children to understand what they are\ntaught about God since they are fed according to their age groups.\nChildren’s ministry is done by well-trained teachers (Sunday school teachers as they are called),\nchildren can learn about God truly because the teachers know what to teach, how to teach, and\nhow to handle the children according to their age group.\n\n1Chukwudum B. Okolo. (1991). The liberating Role of the church in Africa today. Eldoret. P17-38\nAmecea Gaba Publications\n2Chukwudum B. Okolo. (1991). The liberating Role of the church in Africa today. Eldoret.\nAmecea Gaba Publications p49-76", "word_count": 357, "start_char": 14378, "end_char": 16586}
{"chunk_id": "DOC0103__00007", "doc_id": "DOC0103", "chunk_index": 7, "text": "kolo. (1991).T\n\nhe liberating Role of the church in Africa today.E\n\nldoret.P\n\n17-38\nAmecea Gaba Publications\n2Chukwudum B.O\n\nkolo. (1991).T\n\nhe liberating Role of the church in Africa today.E\n\nldoret.A\n\nmecea Gaba Publications p49-76\n\nIn the children’s ministry, there is a following of the curriculum. If the curriculum is followed, it\nbegins by introducing children to a particular topic, the definitions of key terms, the explanation\nof difficult words, and relevant examples. According to the culture of the community and age\ngroups relevant illustrations are done for example, the story of Goliath and David's child may act\nas David and another one Goliath. When Goliath is defeated by a younger boy due to the hand of\nhelp from God, children can learn that God is powerful and he can win for us all the big battles we\nfear if we trust Him. In the adult church, there is no curriculum in most of the churches so children\ncannot understand well.\nIn conclusion, therefore, Hebrews 5:13-4 “Anyone who lives on milk being still an infant, is not\nacquainted with the teaching about righteousness. But solid food is for the mature who by constant\nuse have trained themselves to distinguish good from evil.” Children are still infants and young to\nknow good and evil so through feeding them milk, they go on growing from milk to adult food\nafter knowing what is good and evil. Learning is a process in which one must follow process by\nprocess and stage by stage. Therefore, children’s ministry helps children learn about God process\nby process and stage by stage the result is to know God truly thus children’s ministry provides an\nopportunity for children to learn about God truly.3\nBuilding tomorrow’s Church\nThe continuation of the universal church is dependent on the ability of children ministry to reach\nout to them” (Felton 96). Family including children is considered to be a small church (outler 309).\nThe early church also has an impact on whether parents bring their children to church. For children\nwho were churched as children, most of them take their children to church those who did not go\nto church during their childhood will not take their children to church.\nIt is very important to know that people who get opportunities to go to children’s ministry during\ntheir childhood at least 60% of them attend church during their adulthood but only 75% who do\nnot attend church during their adulthood do not go to church even when they grow old. This implies\n\n3Dan Brewster. (2005).A child, church and mission. Compassion international: Makati\nPhilippines p99-107", "word_count": 431, "start_char": 16353, "end_char": 18926}
{"chunk_id": "DOC0103__00008", "doc_id": "DOC0103", "chunk_index": 8, "text": "his implies\n\n3Dan Brewster. (2005).A child, church and mission.C\n\nompassion international: Makati\nPhilippines p99-107\n\nthat the future church will only get 25% of the people born in Christian families who do not attend\nchildren’s ministry during childhood and thus the church has no future.\nAccording to Chris Howles, the Church of England is facing the challenge of the depopulation of\nthe church because they neglected children’s ministry some time back. Now some of the churches\nare turned into cinema halls and places of sexual immorality.\nThe church today must secure the future of the church through empowering children’s ministry for\nonce neglected the future of the church is in Vail.\nOne of the solutions to have a secure, strong, and well-organized church is through strengthening\nchildren’s ministry because;\n1. Children’s ministry encourages children to be rooted in Christ and serve him.\n2. Children’s ministry develops children’s minds to love God as the source of all blessings,\nprotection, and comfort.\nThese factors make children dependent on God so coming to God is a sign of their dependency on\nGod even during their adulthood.\nIn conclusion therefore children’s ministry secures the growth of the future church because\nchildren grow up rooted in faith and therefore even when they are adults they still love to come to\nchurch because they grow that they grow up knowing that they are not independent but dependents\non God.\nFollowing God’s command\n“From the beginning, God commanded the people to reach out to children and children teach them\nGod’s commandments so that they may also teach their children and children teach them to their\nchildren...”Pass them on as a command to your children so they will obey every word of these\ninstructions.” Thus God commanded people to raise a godly generation.4\n\n4Felton, G. Carlton. (1997).John Wesley and the Teaching Ministry. Religious Education. Winter p 24", "word_count": 308, "start_char": 18809, "end_char": 20730}
{"chunk_id": "DOC0103__00009", "doc_id": "DOC0103", "chunk_index": 9, "text": "arlton. (1997).John Wesley and the Teaching Ministry.R\n\neligious Education.W\n\ninter p 24\n\nJesus commanded his disciples to preach the gospel to all nations. All nations include the children,\nMatthew 28:16 “God and make disciples of all nations... teaching them to obey all that I\ncommanded you.”\nChildren’s ministry therefore is a sign of the church’s obedience to God and our Lord and Savior\nJesus Christ.\nThe importance of children’s ministry is to teach the children to obey God’s command and also to\ntell their children in the future to tell their children to the goodness of the Lord, the word of God,\nand the commandments of God.\nAny church that does not empower and facilitate or even without children’s ministry disobeys the\nLord God because it is a command to teach God’s word to our children. In the same way, any\nparent who denies his/her children access to children’s ministry is disobeying God.5\nGod’s intention in teaching his word to our children is to raise a generation that knows him and\nfears and loves him. Churches therefore should make sure that they obey God and build strong\nchildren ministries and teach them the word of God.\nThe challenge we have is that most children’s ministries focus on installing only discipline to their\nchildren, only focusing on teaching them dos and don’ts neglecting God’s word.\nChildren’s ministry must be Christ-centered and focus on the word of God, not our own words,\nsecular music among others.\nIn conclusion therefore a well-organized children’s ministry that teaches the truth; that is Christ\ncentered word of God in the church is a sign that the church obeys God and his commands.\n\n5Felton, G. Carlton. (1997).John Wesley and the Teaching Ministry. Religious Education. Winter p 69", "word_count": 290, "start_char": 20642, "end_char": 22384}
{"chunk_id": "DOC0103__00010", "doc_id": "DOC0103", "chunk_index": 10, "text": "n conclusion therefore a well-organized children’s ministry that teaches the truth; that is Christ\ncentered word of God in the church is a sign that the church obeys God and his commands.\n\n5Felton, G.C\n\narlton. (1997).John Wesley and the Teaching Ministry.R\n\neligious Education.W\n\ninter p 69\n\nDiscipling Children\nChildren can be means of gospel transmission for example they can hear the word of God at\nchurch/in Sunday school and go back home and share that message with their parents and their\nfellow children thus contributing to the mission of the church (Mathew 28:17-20.\nIn Genesis 22:1ff, Isaac pre-figured Jesus’ sacrifice. Though he was young the act of his father to\nGod and offers him as a sacrifice prefigured Jesus Christ. John 3:16 “For God so loved the world\nthat he sent his only begotten son that whoever believes in him shall not perish but have eternal\nlife.” The super mission was done by God’s son who was pre-figured by Isaac the son of Abraham\nthe ground father of the faithful.\nJesus grew up as a child and began his ministry when he was a child his parents left him in\nJerusalem where he read the scrolls that were in Isaiah 9:1ff of which he was the fulfiller of that\nscroll.\nJoseph was a young man sold by his brothers but became a missionary in Egypt and later saved\nhis family (Genesis 57:1ff). There is no doubt that when a child grows up in godliness he/she can\nbe a missioner and carry on his godliness to others.\nShadrack, Mesearch, and Abadnego in the book of Daniel 1, 2,3:1ff they refused to defile\nthemselves and became missionaries in another land. King Nebuchadnezzar recognized their God\nand ordered everybody in his kingdom to worship the God of Shadrack, Mesearch, and Abednego.\nWhen children are rooted in faith during their attendance in children’s ministry, they can carry/pass\non that faith to other generations and they can be a change and bring a change to others.\nIn conclusion after looking at children who carried on godliness to other nations and Jesus Christ\nhimself who was born as a child but incarnate and brought salvation to mankind, children today\ncan pass that message of salvation to others, and through them, people may come to Christ thus\nreceiving salvation. Therefore children’s ministry can train children who can extend the gospel to\nothers through evangelizing them what they have learned from children’s ministry thus children’s\nministry helps the children understand their role in the church especially the role in mission helping\nthe church to grow through missions and evangelism.", "word_count": 431, "start_char": 22093, "end_char": 24645}
{"chunk_id": "DOC0103__00011", "doc_id": "DOC0103", "chunk_index": 11, "text": "herefore children’s ministry can train children who can extend the gospel to\nothers through evangelizing them what they have learned from children’s ministry thus children’s\nministry helps the children understand their role in the church especially the role in mission helping\nthe church to grow through missions and evangelism.\n\nOther children in the Bible who did great in godliness include Samuel (1 Sam 3), and David (1\nSam 17) the younger servant girl who did a mission to Nadman (2 Kings 5) among others.\nDeveloping children’s gifts\nThrough knowing and sharing our gifts, we provide an example to the children of how God created\nus each to fit into the body of Christ.\nThrough singing in the ministry, the Sunday school teachers can observe those who are gifted in\nsinging and they can begin to encourage and support them to develop that gift.\nIn children’s ministry, children are given a chance to participate in readings, and playing in all\nthese, the teachers can observe their children’s talents and spiritual gifts and help them to develop\nthese spiritual gifts.\nIn summary, children’s ministry provides a nurturing environment that creates a warm, welcoming,\nand safe space where children feel comfortable expressing themselves and exploring their spiritual\ngifts. Encourage open communication and respect for each child’s unique talents and abilities.6\nIn children’s ministry, teachers celebrate and recognize the children’s accomplishments and\nmilestones as they grow in their spiritual gifts. Acknowledge their efforts and progress which can\nboost their confidence and motivating to continue developing their talents.\nChildren’s ministry also encourages children to engage in prayer and reflection to discern and\ncultivate their spiritual gifts, provide guidance on how to listen to God’s voice and seek\ndiscernment on how best to use their gifts for the greater good.\n\nIn conclusion by implementing all the above strategies and creating a supportive and enriching\nenvironment, a children’s ministry can effectively nurture and grow the spiritual gifts of children\nto pray and reflect on their spiritual gifts depending on God, celebrating and appreciating\n\n6Marcia J Bunge and William B. (2001).The child in Christian thought. Michigan. Eerdmans\nPublishing Company p117", "word_count": 352, "start_char": 24317, "end_char": 26602}
{"chunk_id": "DOC0103__00012", "doc_id": "DOC0103", "chunk_index": 12, "text": "n conclusion by implementing all the above strategies and creating a supportive and enriching\nenvironment, a children’s ministry can effectively nurture and grow the spiritual gifts of children\nto pray and reflect on their spiritual gifts depending on God, celebrating and appreciating\n\n6Marcia J Bunge and William B. (2001).The child in Christian thought.M\n\nichigan.E\n\nerdmans\nPublishing Company p117\n\nchildren’s achievements, fostering educational opportunities and providing a nurturing\nenvironment. All of these can help children to develop their spiritual gifts during their time in\nchildren’s ministry.\nBelonging to the church\nChildren’s ministry foster relationships. Children’s ministry prioritizes building relationships\namong children providing opportunities for them to connect and develop friendships. This is\nmainly achieved through small group activities, team-building exercises, and collaboration\nsessions.\nThrough collaborations and teamwork, children’s ministry helps children learn to value and\nsupport one another. Activities such as group games, projects, and mission activities can encourage\nthem to work together towards a common goal.\nIt creates an inclusive and welcoming environment where every child feels accepted and valued.\nThis means embracing diversity, appreciating different backgrounds, cultures, and abilities, and\nensuring that no child is left out or marginalized.\nCelebrate multigenerational connections. Children’s ministry facilitates interactions between\nchildren and adults in the church fostering meaningful relationships and mentorship opportunities.\nThis is done through intergenerational events, mentorship programs, or encouraging children to\nparticipate in worship services alongside their families once in a while.7\nProvide service opportunities. Children’s ministry provides opportunities for children to actively\nserve and give back to their church community involving them in age-appropriate service projects,\noutreach, and missions can help them understand the importance of being part of a bigger\ncongregation and making a positive impact on them.\n\n7Glenn Miles. (2003). Celebrating children. Carlisle: Paternoster Press p2", "word_count": 290, "start_char": 26201, "end_char": 28379}
{"chunk_id": "DOC0103__00013", "doc_id": "DOC0103", "chunk_index": 13, "text": "hildren’s ministry provides opportunities for children to actively\nserve and give back to their church community involving them in age-appropriate service projects,\noutreach, and missions can help them understand the importance of being part of a bigger\ncongregation and making a positive impact on them.\n\n7Glenn Miles. (2003).C\n\nelebrating children.C\n\narlisle: Paternoster Press p2\n\nChildren’s ministry encourages children to take ownership of their involvement in the church by\nempowering them to contribute their talents and skills to the community through leading worship\n(praise and worship), participating in skits, and reading lessons among others.\nIn conclusion, most of the time, the church organizes regular social events like on 28th December\nevery year while remembering the children below three years who were killed on the orders of\nKing Herod when searching to kill Jesus Christ. Children from different communities or churches\nmay come to the parish headquarters with their parents and gather together to celebrate their day\ngather together to celebrate their day hence creating opportunities for building relationships,\nstrengthening bonds, and fostering a sense of belonging within the church.\nSource of joy\nThrough interactive and engaging activities, children’s ministry can incorporate fun and interactive\nactivities like games, crafts, skits, and songs that are age-appropriate and capture children’s\ninterest. These activities create an atmosphere of joy and excitement.\nThrough a positive and welcoming environment where children feel loved, accepted, and valued,\nchildren and parents enjoy that joy.\nMeaningful Bible lessons that are full of biblical truth in a way that is relatable to children\nincorporating stories, objects, lessons, and group work or discussions help children understand and\nconnect with the teachings leading to a sense of joy and growth in faith.\nChildren’s ministry helps the church raise great skilled church leaders who can defend the faith.\nConclusion\nIn conclusion, Jesus said; “Let the little children come to me, and do not hinder them, for the\nkingdom of heaven belongs to such as these” Matthew 19:14. We need to teach children what we\nlearn so that they can spread the love of Jesus Christ when we are no longer around in serving\nJesus Christ. The church leader must show children the way and help guide them into adults who\nare devoted to the ministry in the church. In return, they will devote time to helping the church,\nand teach others the importance of ministering the church which will help the church to grow and\nspread the word of the Lord.", "word_count": 407, "start_char": 27997, "end_char": 30604}
{"chunk_id": "DOC0103__00014", "doc_id": "DOC0103", "chunk_index": 14, "text": "he church leader must show children the way and help guide them into adults who\nare devoted to the ministry in the church.I\n\nn return, they will devote time to helping the church,\nand teach others the importance of ministering the church which will help the church to grow and\nspread the word of the Lord.\n\nThe starting point is that all humanity is loved and valued by God. The creator of the entire earth\nand all humanity looked at the world and declared ‘it is good’ and ‘God was very pleased’ (Genesis\n1: 31). It seems that at All Saints Church Kyotera, this has not always been the case. We are still a\nlong way from the ideal of valuing all people. However, the belief is that every person is created\nin God’s image\nThe Old Testament depicts children as fully human and made in the image of God, that they are\ngifts from God and sources of joy (Gen. 1:27; 21:6–7; 30:11; 30:20; 30:22; 1 Sam 1:11, 19).8\nTherefore, parents and other caregivers are to respect them, enjoy them, and be grateful for them.\nWe are therefore to recognize that children are distinct from adults in their maturity and ability\nand depend on adults for their nurture and protection. As a church, we must recognize our special\nresponsibility for the care of children. Many passages in the Bible speak of children as blessings\nand gifts from God (Ps 127:3). The bible consistently refers to children as a blessing and a gift\nfrom God. “When we (in the church) regard children as vulnerable and worthy of care, we\ndemonstrate our understanding that they are gifts to be protected and blessings to be welcomed\nand cared for.”\nThe New Testament depicts children as models of faith for adults. Therefore, adults are to listen\nto children and learn from them. Many Gospel passages turn upside down the myth, that children\nare to be seen but not heard. The primary role of children is to learn from and obey adults. In\ncontrast, the New Testament depicts children in striking and even radical ways as moral witnesses,\nmodels of faith for adults, sources or vehicles of revelation, and even examples for entering the\nreign of God.9\n\n8Dan Brewster. (2005). A child, church and mission. Compassion international: Makati\nPhilippines p 33\n9Publishing Company Marcia J Bunge and William B. (2001).The child in Christian thought. Michigan.\nEerdmans p 109", "word_count": 404, "start_char": 30299, "end_char": 32617}
{"chunk_id": "DOC0103__00015", "doc_id": "DOC0103", "chunk_index": 15, "text": "child, church and mission.C\n\nompassion international: Makati\nPhilippines p 33\n9Publishing Company Marcia J Bunge and William B. (2001).The child in Christian thought.M\n\nichigan.E\n\nerdmans p 109\n\nAll children are God’s children. In Mark 9:33–37, Jesus states that to welcome Him, one must\nwelcome God’s children. Then He took a little child and put it among them, and taking it in His\narms, He said to them, ‘Whoever welcomes one of these little children in my name welcomes me,\nand whoever welcomes me does not welcome me but the one who sent me.’ This suggests that\ncaring for children is a privilege that God entrusted to all adults, not just parents.\nJesus’ teaching about the kingdom of God is surprising. He puts it clearly that greatness in his\nkingdom has nothing to do with societal attitudes and assumptions. One has to become like a little\nchild if he is to enter the Kingdom of Heaven. Welcoming the little ones means welcoming the\nLord (Matthew 18:1-6).\nJesus taught against the exclusion of Children (Luke 18.15-17; Matt. 19.13-15; Mk. 10.13-16).\nStudies of children in antiquity clearly show that children were not in any way, close to adults, a\nconcern nor a priority to society. For this reason, they were a marginalized lot. Such a nature was\ninformed, as many are, by views of children which focus on their incapacities to the extent that\ntheir humanness is not reckoned with. This disposition of society towards children is seen with the\ndisciples in the Gospels when they stop those bringing children to Jesus from doing so. As far as\nthey were concerned children were to be excluded from the ministry of Jesus.10\nA children’s ministry helps the church to spread the word of the Lord. It teaches kids about their\nLord and Savior which help them to feel included and loved. Children are going to be vulnerable\nto a lot of situations in their lives that will challenge their faith. With the ministry, they can be\ntaught to have faith and follow Christ’s teachings regardless of the number of hardships they will\nencounter in their life. It will lead to them returning to church during difficult times and encourage\nthem to keep listening to church sermons.\n\n10 Through the Eyes of a Child, pg. 171", "word_count": 381, "start_char": 32424, "end_char": 34639}
{"chunk_id": "DOC0103__00016", "doc_id": "DOC0103", "chunk_index": 16, "text": "ith the ministry, they can be\ntaught to have faith and follow Christ’s teachings regardless of the number of hardships they will\nencounter in their life.I\n\nt will lead to them returning to church during difficult times and encourage\nthem to keep listening to church sermons.\n\n10 Through the Eyes of a Child, pg. 171\n\nAngela Shier-Jones says, “Communities fail where they do not respond graciously to the needs of\nchildren placed in their care. One of the things which we do not often think about is that a failure\nto provide grace as well as sustenance can cause serious harm to a child.” Jesus teaching in\nMatthew 18 is as challenging for us today as it was for the first disciples. Not only are we to look\nto children to see what is required to enter the Kingdom, but we must also consider that we will be\njudged on the way we welcome the child in our midst. Therefore, the nurture and welcome of\nchildren is a calling not just for parents or junior church leaders but for all those who would be\nDisciples of Christ.", "word_count": 187, "start_char": 34324, "end_char": 35342}
