{"chunk_id": "DOC0126__00000", "doc_id": "DOC0126", "chunk_index": 0, "text": "FINANCIAL STEWARDSHIP AND CHURCH MINISTRY AT ST. MARK\nKANGARAME CHURCH OF UGANDA NYAKATARE DEANERY, DIOCESE OF\nKINKINZI\n\nSTEVEN NIWABEINE\nM22/BBUC/DTH/005\n\nA DISSERTATION SUBMITTED TO THE BISHOP TUCKER SCHOOL OF DIVINITY AND\nTHEOLOGY IN PARTIAL FULFILLMENT OF THE REQUIREMENTS FOR THE AWARD OF\nTHE DIPLOMA OF THEOLOGY OF UGANDA CHRISTIAN UNIVERSITY\nAugust,2025\n\nii | P a g e\n\niii | P a g e\n\niv | P a g e\n\nDEDICATION\nTo my beloved parents, Bishop of the diocese of Kinkiizi and his staff, all my friends\nand fellow course mates. Thank you for your financial, physical and spiritual support\nthat you extended to me during the field work research. May God bless you.\n\nv | P a g e\n\nACKNOWLEDGEMENTS\nThe completion of this Research report would remain a challenge if the sovereign God\nwas not so kind to me. I thank God for providing me with good health, knowledge and\nwisdom to carry out my study. I would like to thank my supervisor, who spared his\ntime and supervised me with guidance. Thank you very much for the work done to\nme.\n\nvi | P a g e\n\nABSTRACT\nThis study explores the role of financial stewardship on church ministry within St.\nMark Kangarame Church, Nyakatare Deanery, Diocese of Kinkizi. The focus was on\nunderstanding the biblical principles of financial stewardship, its impact on the\nmanagement of church resources, and the consequences of poor stewardship. Drawing\nfrom both early church fathers' teachings and contemporary theological perspectives,\nthe research investigated how effective stewardship can enhance church growth by\npromoting accountability, transparency, and responsible resource management. The\nstudy identified practical measures to protect and improve stewardship practices,\ncontributing to the broader discourse on Christian stewardship and its role in the\nmission of the church. The findings aim to offer theological insights and practical\nguidance to church leaders, ultimately encouraging more faithful financial\nstewardship in ministry in the Church of Uganda.\nKey word; Financial stewardship /church ministry resources, property, funds.\n\nvii | P a g e\n\nLIST OF ABBREVIATIONS AND ACRONYMS\nCMS\n– Church Missionary Society\nC.o.U\n– Church of Uganda\nUSA\nUnites States of America\nRSV\nRevised Standard Version (Bible\n\nCWF\nChristian Women Fellowship.\nMU\nMothers' Union.\nFU\nFathers' Union.\nWCC\nWorld Council of Churches.\nBTTC:BishopTu\ncker\nTheologicalCol\nlege (Mukono).\n\nviii | P a g e\n\nTABLE OF CONTENTS\nContents\nDECLARATION ........................................................................................................ii\nAPPROVAL ............................................................................................................iv\nDEDICATION ........................................................................................................ iv\nACKNOWLEDGEMENTS ............................................................................................. v\nABSTRACT .......................................................................................................... vi\nLIST OF ABBREVIATIONS AND ACRONYMS ...................................................................... vii\nContents ........................................................................................................... viii\nCHAPTER ONE ....................................................................................................... 1\nIntroduction ......................................................................................................... 1\n1.0 Introduction .................................................................................................... 1\n1.1 Background of the Study ...................................................................................... 1\n1.2 Problem Statement ............................................................................................ 4\n\nix | P a g e", "word_count": 441, "start_char": 0, "end_char": 3873}
{"chunk_id": "DOC0126__00001", "doc_id": "DOC0126", "chunk_index": 1, "text": "1.3 Aim of the study ............................................................................................... 5\n1.4 Specific Objectives ............................................................................................ 5\n1.5 Research Questions ............................................................................................ 6\n1.6 scope of the research study .................................................................................. 6\n1.7 Significance ..................................................................................................... 7\n1.8 Limitations ...................................................................................................... 7\n2.0 Introduction .................................................................................................... 8\n2.1 The current status of financial stewardship at St. Mark Kangarame Church .......................... 9\n2.2 Challenges of Financial Stewardship in Church Institutions: A Case of St. Mark Kangarame\nChurch ............................................................................................................. 14\n2.3 Measures for effective financial Stewardship of Property in St. Mark Kangarame Church. ....... 18\n2.4 Measures for Improving Financial Stewardship in Church Institutions: A Case of St. Mark\nKangarame Church ............................................................................................... 19\n2.5 Researcher’s Opinion on Christian Stewardship ......................................................... 30\n2.6 Major Critique on the Research Topic ..................................................................... 32\n2.7 Chapter Summary ............................................................................................ 34\nSECTION THREE: .................................................................................................. 36\nMETHODOLOGY ................................................................................................... 36\n3.1 Design ......................................................................................................... 36\n3.2 Nature of the Data and its source ......................................................................... 36\n3.3 Population and Area of Study .............................................................................. 37\n3.4 Sample Size ................................................................................................... 37\n3.5 Sampling Procedures and Strategies ...................................................................... 38\n3.6 Data Collection Instruments ............................................................................... 38\n3.7 Analysis of data Techniques ................................................................................ 39\n3.8 research ethics ............................................................................................... 39\n3.9 Budget and Work Plan ....................................................................................... 40\nPART FOUR: ....................................................................................................... 42\nPRESENTATION, INTERPRETATION, AND DISCUSSION OF FINDINGS ......................................... 42\n4.0 Introduction .................................................................................................. 42\n4.1 Objective One: To Assess the Current State of Financial Stewardship at St. Mark\nKangarame Church ............................................................................................. 42\n4.2 Objective Two: To Investigate the Challenges of Financial Stewardship in Church\nInstitutions ........................................................................................................ 44\n\nx | P a g e\n\n4.3 Objective Three: To Propose Measures for Improving Financial Stewardship in Church\nInstitutions ........................................................................................................ 45\n4.4 General Summary of Chapter Four ........................................................................ 47\nCHAPTER FIVE: THEOLOGICAL REFLECTION ON FINANCIAL STEWARDSHIP ................................ 48\n5.1 Biblical Foundations of Financial Stewardship: ......................................................... 48\n5.2 Reflections from Early Church Fathers ................................................................... 49\n5.3 Insights from Orthodox Tradition .......................................................................... 50\n5.4 Theological Reflections from Contemporary Scholars .................................................. 50\n5.5 Implications for Church Leadership and Practice ....................................................... 51\n5.6 Theological Conclusion...................................................................................... 51\n6.2 Conclusions ................................................................................................... 53\n6.3 Recommendations of the study ............................................................................ 54\n6.4 Suggestions for Further Research ......................................................................... 54\n6.5 Chapter Summary ............................................................................................ 55\nAPPENDICES ....................................................................................................... 56\nAppendix – ONE: References .................................................................................... 56\nAppendix – TWO: Questionnaire ................................................................................ 59\n\n1 | P a g e", "word_count": 364, "start_char": 3873, "end_char": 9629}
{"chunk_id": "DOC0126__00002", "doc_id": "DOC0126", "chunk_index": 2, "text": "CHAPTER ONE\nIntroduction\n1.0 Introduction\nThis section includes the study on financial stewardship and its relationship with\nchurch ministry in the context of St. Mark Kangarame Church, Nyakatare Deanery, and\nDiocese of Kinkizi. It presented the general introduction of the study.\n1.1 Background of the Study\nFinancial stewardship refers to central aspect of Christian ministry and church\nleadership. It involves the faithful planning, management, and use of money and\nmaterial resources that have been entrusted to the church and its members and,\nultimately, by God. In a Christian setting, financial stewardship is not simply an\nadministrative or accounting task—it is a spiritual discipline and responsibility. The\nBible teaches that how we manage worldly wealth reflects our spiritual maturity and\nintegrity. As stated in Luke chapter sixteen verses ten to twelve,Jesus affirms that\n“whoever can be trusted with very little can also be trusted with much,” showing that\ngood stewardship is a test of faithfulness. In many churches, including St. Mark\nKangarame Church in Nyakatare Deanery, Diocese of Kinkizi, stewardship is expressed\nthrough budgeting, transparent reporting, and the wise use of tithes, pledges, and\ndonations. These funds support ministry work such as preaching, helping the poor,\nmaintaining church property, and supporting evangelism. Poor financial management,\nhowever, weakens both the church’s testimony and its ability to serve the community.\n\n2 | P a g e", "word_count": 223, "start_char": 9629, "end_char": 11112}
{"chunk_id": "DOC0126__00003", "doc_id": "DOC0126", "chunk_index": 3, "text": "hese funds support ministry work such as preaching, helping the poor,\nmaintaining church property, and supporting evangelism.P\n\noor financial management,\nhowever, weakens both the church’s testimony and its ability to serve the community.\n\n2 | P a g e\n\nThe roots of financial stewardship can be traced to the early church. In Acts 4:32–35,\nearly Christians shared their possessions and trusted the Apostles to distribute\nresources fairly and responsibly. This community living was on one love, trust worthy\nand stewardship. This act made church leaders responsible not only for spiritual\nguidance but also for managing lands, money, and buildings, bringing new\nexpectations of accountability. In England, Thomas Cranmer, the Archbishop of\nCanterbury during the Reformation, pushed for reforms in how church wealth was\nused.\nMany theories are in support with many concepts and in financial stewardship in the\nchurch. one of Theories like the Agency defines stewardship as a trust-based\nrelationship where leaders act on behalf of many others for example God and the\ncongregation. Leaders in the church are expected to keep resources in a way that\nreflects the interests of both the givers and the goals of the church. If leaders\nmismanage resources, they become un trust worthy, leading to poor giving and very\nweak participation. The Resource-Based View (RBV) says that resources, like\nfinances, are good for an organization's survival and growth and sustainability.\nGood stewardship assumes that these resources are used efficiently and effectively to\nachieve church goals. The Stewardship Theory in biblical values suggests that leaders\nare motivated by a desire to serve and do well rather than by self-interest. This\ntheory teaches that trust, accountability, and alignment with the church’s mission.\nChurch leaders and accountability departments are caretakers, not owners, of church\n\n3 | P a g e", "word_count": 294, "start_char": 10861, "end_char": 12762}
{"chunk_id": "DOC0126__00004", "doc_id": "DOC0126", "chunk_index": 4, "text": "he Stewardship Theory in biblical values suggests that leaders\nare motivated by a desire to serve and do well rather than by self-interest.T\n\nhis\ntheory teaches that trust, accountability, and alignment with the church’s mission.C\n\nhurch leaders and accountability departments are caretakers, not owners, of church\n\n3 | P a g e\n\nproperty. They must act in line with biblical principles, demonstrating faithfulness in\nboth spiritual and material matters.\nWithin the Diocese of Kinkizi, financial discipline includes both opportunities and\nchallenges for example Churches like St. Mark Kangarame are important to their\ncommunities, offering spiritual guidance as well as practical services such as\neducation, healthcare, and community development. In rural areas like Nyakatare\nDeanery, challenges such as poverty, low education levels, and limited access to\nfinancial tools affect how well stewardship is practiced. More so, cultural beliefs\ndiscourage telling leaders about finances, creating a risk of not providing\naccountability. Some Christians view leaders as above, which can lead to secrecy or\nfear of transparency. At St. Mark Kangarame, trainings are being made to improve\nstewardship through different workshops, introduction of online accounting systems,\nand encouraging member involvement.\nFaithful givers grow in trust, and leaders grow in integrity when they handle resources\nhonestly. These five principles are interrelated and must work together for effective\nstewardship. When churches neglect these areas, they risk financial problems,\nspiritual stagnation, and even conflict. When practiced faithfully, these concepts lead\nto stronger churches and transformed communities.\nFinancial stewardship is helpful in both spiritual, physical growth of the church.\nSpiritually, teaching about tithing, budgeting, and giving helps members understand\nGod’s provision and their role in His mission. It fosters a culture of generosity,\nresponsibility, and participation. Numerically, when churches manage resources well,\n\n4 | P a g e", "word_count": 291, "start_char": 12435, "end_char": 14474}
{"chunk_id": "DOC0126__00005", "doc_id": "DOC0126", "chunk_index": 5, "text": "inancial stewardship is helpful in both spiritual, physical growth of the church.S\n\npiritually, teaching about tithing, budgeting, and giving helps members understand\nGod’s provision and their role in His mission.I\n\nt fosters a culture of generosity,\nresponsibility, and participation.N\n\numerically, when churches manage resources well,\n\n4 | P a g e\n\nthey attract more members. People are more likely to join and stay in a church where\nleadership is trusted and transparent. Socially, churches with good financial practices\ncan provide better services—such as schools, clinics, and care for the poor—boosting\ntheir influence and reputation. Structurally, stewardship leads to better planning,\nimproved facilities, and ongoing development. Church Fathers such as Clement of\nHippo taught that wealth should be used for righteous purposes. Reformers like\nThomas Cranmer insisted on transparency and justice in using church property. The\nEdict of Milan introduced the idea of legal accountability in managing church assets.\nModern scholars like Sider (2015) and Kamanzi (2020) also argue that stewardship is\nnot just about economics—it reflects God's holiness. They call for ethical and\ntheological reforms that connect financial practices with biblical values. Thus,\nfinancial stewardship is not only a church management issue—it is a theological\nmatter that affects the church’s witness, effectiveness, and future. In places like St.\nMark Kangarame, strengthening stewardship is a key pathway to growth, healing, and\nspiritual transformation.\n1.2 Problem Statement\nThe Church of Uganda, especially St. Mark Kangarame Church in Nyakatare Deanery, is\nfacing serious challenges in managing its resources. Good stewardship—using time,\nmoney, and property wisely for God’s work—has not been well practiced. This has led\nto poor financial management, misuse of church property, and a lack of\naccountability. Some leaders have been accused of misusing funds and assets, causing\nscandals that damage the church’s reputation. As a result, members have lost trust in\n\n5 | P a g e", "word_count": 306, "start_char": 14125, "end_char": 16192}
{"chunk_id": "DOC0126__00006", "doc_id": "DOC0126", "chunk_index": 6, "text": "his has led\nto poor financial management, misuse of church property, and a lack of\naccountability.S\n\nome leaders have been accused of misusing funds and assets, causing\nscandals that damage the church’s reputation.A\n\ns a result, members have lost trust in\n\n5 | P a g e\n\nchurch leadership, which has affected attendance, giving, and ministry growth (Sider,\n2015; Wright, 2006). Similar issues are present across the Diocese of Kinkizi, where\nchurch land has sometimes been sold or misused without proper approval, and\nfinancial records are often poorly kept. These problems weaken the church’s ability to\nserve its members and community. However, solutions are possible. Leaders can be\ntrained in financial management and accountability Mugisha, (2019), and clear\npolicies on church resource use should be enforced. Regular audits, transparent\nreporting, and stewardship education for members are essential steps Kamanzi,\n(2020). This study seeks to examine these problems and offer practical solutions for\nimproving financial stewardship and restoring trust in church leadership.\n1.3 Aim of the study\nthe study is to find out the importance of financial stewardship towards enhancing\nchurch ministry at St. Mark Kangarame and to propose strategies for effective\nstewardship practices that align with biblical principles and modern financial\nmanagement tools.\n1.4 Specific Objectives\n1. To identify the current state of financial stewardship at St. Mark Kangarame.\n2. To investigate challenges of financial stewardship of church institutions.\n3. To find out strategies to improve transparency and accountability in resource\nmanagement\n\n6 | P a g e\n\n1.5 Research Questions\n1. What is the current state of financial stewardship in church resources of St.\nMark Kangarame Church?\n2. What are the challenges of financial stewardship in church institutions?\n3. What measures can be taken to protect and improve stewardship of church\nproperty in St. Mark Kangarame Church?\n1.6 scope of the research study\n1.6.1 Geographical:\nThe study was conducted at St. Mark Kangarame Church in the Nyakatare Deanery,\nDiocese of Kinkizi, located in southwestern Uganda. The area is home to several key\nchurch-based institutions, including schools, health centers, and local parishes that\nplay a role in church resource management. The study will specifically concentrate on\nfinancial and property stewardship within this church.\n1.6.2Content Scope:\nThe study was aimed at identifying the key issues that influence effective financial\nstewardship in church institutions. It will also examine the dangers and negative\neffects of poor stewardship of church resources, particularly at St. Mark Kangarame\nChurch. Additionally, the study explored practical and sustainable measures to put in\nplace to improve, and strengthen stewardship in church and their property and\nfinances.\n\n7 | P a g e", "word_count": 433, "start_char": 15924, "end_char": 18788}
{"chunk_id": "DOC0126__00007", "doc_id": "DOC0126", "chunk_index": 7, "text": "t will also examine the dangers and negative\neffects of poor stewardship of church resources, particularly at St.M\n\nark Kangarame\nChurch.A\n\ndditionally, the study explored practical and sustainable measures to put in\nplace to improve, and strengthen stewardship in church and their property and\nfinances.\n\n7 | P a g e\n\n1.6.3 Time:\nThis research took four six month from January to June 2025\n1.7 Significance\nThis study provided important view of the current state of financial stewardship in the\nChurch of Uganda, especially the Diocese of Kinkizi. The findings added value and the\nresponsible management of church resources, which is much helpful for church\ngrowth.\n1.8 Limitations\nThe limitations were hard in obtaining responses from respondents due to their\nobservation and , limited information , which may be addressed by utilizing online\nresources and archives, educated respondents to give information due to\nconfidentiality concerns. This was done by keeping confidentiality and considering\nethical and professional standards.\n\n8 | P a g e\n\nCHAPTER TWO:\nLITERATURE REVIEW\n2.0 Introduction\nThis presents existing past studied research of different scholars related to financial\nstewardship and its impact on church ministry. The purpose is to provide a clear\nunderstanding of what other scholars, theologians, and practitioners have written on\nthe subject. It explores key concepts, theoretical and practical views, and identifies\ngaps that the current study aims to fill. The review draws from books, journals,\nchurch reports, and academic studies to examine how financial resources are\nmanaged in the church setting. It also considers the effects of poor financial\nstewardship on church growth, trust among members, and the overall mission of the\nchurch.\nChristian stewardship gives important ace of sustainability of the church. Stewardship,\nespecially financial stewardship, is a crucial aspect of church administration, ensuring\nthat resources are effectively managed to support ministry work, social outreach, and\ninfrastructural development. In the line of the Church of Uganda, financial\nstewardship is measured in theological and practical ways, influencing not only church\ngrowth but also the ability to support clergy, construct places of worship, and helping\nto support church missions.\n\n9 | P a g e", "word_count": 351, "start_char": 18471, "end_char": 20790}
{"chunk_id": "DOC0126__00008", "doc_id": "DOC0126", "chunk_index": 8, "text": "n the line of the Church of Uganda, financial\nstewardship is measured in theological and practical ways, influencing not only church\ngrowth but also the ability to support clergy, construct places of worship, and helping\nto support church missions.\n\n9 | P a g e\n\n2.1 The current status of financial stewardship at St. Mark Kangarame Church\nAssessment of Financial Stewardship at St. Mark Kangarame Church\nFinancial stewardship is much important and is needed in supporting the growth,\noperations and development of different activities. At St. Mark Kangarame Church,\nunderstanding financial management is important to evaluating the church’s current\nstewardship practices and ways. This section assesses various factors and ways that\ninfluence financial stewardship in the church, drawing from relevant literature,\ninformation and practical church-based records. These determinants include\nleadership competence, accountability mechanisms, financial literacy, member\nparticipation, institutional policies, use of technology, and cultural attitudes. Each of\nthese areas is reviewed to provide a light into the present state of financial\nmanagement at St. Mark Kangarame.\nLeadership Competence and Integrity at St. Mark Kangarame\nThe usefulness of financial stewardship is mostly determined by the quality of\nleadership and its effectiveness. Church leaders are responsible for planning budgets,\nmanaging offerings, and ensuring accountability as far as financial stewardship is\nconcerned. At St. Mark Kangarame, leadership team is responsible to manage finances\nis an important area of assessment. Van der Merwe and Pienaar (2011) show that\ninadequate financial training among church leaders results in poor resource\nallocation. It is good to evaluate whether leaders at St. Mark Kangarame have\n\n10 | P a g e", "word_count": 263, "start_char": 20529, "end_char": 22336}
{"chunk_id": "DOC0126__00009", "doc_id": "DOC0126", "chunk_index": 9, "text": "t St.M\n\nark Kangarame, leadership team is responsible to manage finances\nis an important area of assessment.V\n\nan der Merwe and Pienaar (2011) show that\ninadequate financial training among church leaders results in poor resource\nallocation.I\n\nt is good to evaluate whether leaders at St.M\n\nark Kangarame have\n\n10 | P a g e\n\nreceived any form of financial management training and whether they demonstrate\nintegrity in handling church money.\nMwangi and Wanyoike (2014) note that ethical behavior among leaders directly\ninfluence financial trust within the church and Christians. The absence of\ntransparency and ethical decision-making at St. Mark Kangarame can influence how\nChristians give and support different ministries. Therefore, assessing the leadership’s\nadministrative skills and moral uprightness is important in evaluating financial\nstewardship and management.\nAccountability and Transparency Mechanisms\nA key indicator of financial stewardship is how well a church practices accountability\nand transparency. This involves asking: Are financial records at St. Mark Kangarame\nregularly updated and shared with members? Are there proper audit systems and open\nforums for financial reporting? Brinckerhoff (2006) recommends that churches\nimplement clear budgeting and auditing procedures. Mugisha (2019) found that\nchurches with routine financial meetings and report dissemination gained higher\nlevels of member trust.\nApplying this to St. Mark Kangarame means evaluating whether such mechanisms are\nin place. Does the church hold regular financial briefings? Are expenditures explained\nto the congregation? Wright (2006) emphasizes that a lack of transparency discourages\ngiving and weakens trust. Therefore, this assessment should determine if current\nsystems at St. Mark Kangarame promote openness or secrecy.\n\n11 | P a g e", "word_count": 263, "start_char": 22014, "end_char": 23846}
{"chunk_id": "DOC0126__00010", "doc_id": "DOC0126", "chunk_index": 10, "text": "ark Kangarame means evaluating whether such mechanisms are\nin place.D\n\noes the church hold regular financial briefings?A\n\nre expenditures explained\nto the congregation?W\n\nright (2006) emphasizes that a lack of transparency discourages\ngiving and weakens trust.T\n\nherefore, this assessment should determine if current\nsystems at St.M\n\nark Kangarame promote openness or secrecy.\n\n11 | P a g e\n\nFinancial Literacy and Training\nThe financial understanding of both leaders and members directly affects how\nresources are managed. At St. Mark Kangarame, it is important to assess whether\nleaders have received any training in financial stewardship. Kamanzi (2020) points out\nthat many church leaders in Uganda operate without formal financial education,\nincreasing risks of mismanagement. The church’s current state can be evaluated by\nchecking for training workshops, seminars, or internal learning sessions.\nSider (2015) adds that financial literacy enables leaders to make better investment\ndecisions and helps members understand why giving matters. Therefore, assessing the\nlevel of financial education among church members at St. Mark Kangarame is also\nnecessary to evaluate their stewardship culture.\nCongregational Participation and Trust\nMember involvement in financial decisions strengthens stewardship. This assessment\nshould explore how involved the St. Mark Kangarame congregation is in budget\nplanning, fundraising, and expenditure monitoring. Are members informed about how\nmoney is used? Do they serve on finance committees or participate in review\nmeetings?\nOsei-Tutu et al. (2014) found that member engagement increased financial giving and\nvolunteerism in Ghanaian churches. Mbugua (2017) also noted that when members see\nresults of their contributions—such as infrastructure or outreach—they gain more\n\n12 | P a g e\n\nconfidence in church leadership. At St. Mark Kangarame, evaluating the degree of\nmember involvement and feedback channels will help measure the health of\nstewardship.\nInstitutional Policies and Governance Structures\nEffective stewardship relies on the presence of strong internal policies. Does St. Mark\nKangarame have documented financial guidelines, budgeting processes, or\nprocurement procedures? Brinckerhoff (2006) emphasizes that written policies protect\nagainst misuse of funds. Mugisha (2019) found that Ugandan churches with financial\nmanuals had better accountability.\nThis assessment should identify whether the church has any formal structures for\nmanaging resources and whether these are followed in practice. Governance\nstructures—such as parish councils or finance boards—should be evaluated to\ndetermine if there is shared oversight or concentrated control. Wright (2006) stresses\nthat distributed governance leads to better financial accountability.\nUse of Technology and Record-Keeping\nAnother area of assessment is how St. Mark Kangarame uses technology in managing\nits finances. Does the church still use manual systems, or has it adopted software for\ntracking income and expenses? Nyabwari and Bundi (2021) report that digital systems\nenhance accuracy and transparency.\n\n13 | P a g e", "word_count": 443, "start_char": 23456, "end_char": 26589}
{"chunk_id": "DOC0126__00011", "doc_id": "DOC0126", "chunk_index": 11, "text": "se of Technology and Record-Keeping\nAnother area of assessment is how St.M\n\nark Kangarame uses technology in managing\nits finances.D\n\noes the church still use manual systems, or has it adopted software for\ntracking income and expenses?N\n\nyabwari and Bundi (2021) report that digital systems\nenhance accuracy and transparency.\n\n13 | P a g e\n\nEvaluating the current tools used for financial management can reveal whether\nrecordkeeping is secure and efficient. Additionally, this section should explore\nwhether those responsible for finances have been trained to use such tools\neffectively.\nCultural Attitudes Toward Giving and Financial Ownership\nCultural perceptions of money and authority also influence stewardship. In some\nchurches, financial control is seen as the private domain of church elders or clergy. At\nSt. Mark Kangarame, the assessment must consider how congregants view their right\nto ask financial questions or participate in decision-making.\nMbugua (2017) notes that some African cultures discourage members from questioning\nchurch authority, even in financial matters. This can lead to silence, even when\nmisuse is suspected. Assessing the culture at St. Mark Kangarame can help determine\nwhether members feel empowered to engage in stewardship or if cultural norms\ninhibit openness.\nSummary Assessment\nIn conclusion, the current state of financial stewardship at St. Mark Kangarame Church\ncan be effectively assessed through an evaluation of leadership quality, transparency\nmechanisms, financial literacy, congregational engagement, existing policies,\ntechnology use, and cultural attitudes. Literature shows that without strong systems\nand trust-building practices, even churches with good intentions may face stewardship\n\n14 | P a g e\n\nchallenges. This assessment aims to identify strengths and gaps in order to\nrecommend improvements that will strengthen responsible financial management and\nsupport the long-term mission of the church.\n2.2 Challenges of Financial Stewardship in Church Institutions: A Case of St. Mark\nKangarame Church\nChurch institutions, including St. Mark Kangarame Church, face numerous challenges\nthat hinder effective financial stewardship. Financial stewardship refers to the\nresponsible management and use of church resources—financial, material, and\nhuman— in alignment with biblical principles and institutional goals (Barna, 2007).\nHowever, when certain challenges are left unaddressed, the integrity, credibility, and\nmission of the church can be seriously undermined. This section explores key\nobstacles that affect financial stewardship in many churches, with practical\nillustrations from the situation at St. Mark Kangarame Church.\n\nErosion of Trust and Lack of Transparency\nWhen transparency in the management of funds is lacking, congregants begin to\nquestion the integrity of their leaders. Wright (2006) states that trust is foundational\nto financial stewardship and management in faith communities where giving is\nvoluntary. At St. Mark Kangarame Church, financial indiscipline and lack of open\ncommunication about income and expenditures have led to member dissatisfaction\nand withdrawal from active giving.", "word_count": 449, "start_char": 26250, "end_char": 29418}
{"chunk_id": "DOC0126__00012", "doc_id": "DOC0126", "chunk_index": 12, "text": "right (2006) states that trust is foundational\nto financial stewardship and management in faith communities where giving is\nvoluntary.A\n\nt St.M\n\nark Kangarame Church, financial indiscipline and lack of open\ncommunication about income and expenditures have led to member dissatisfaction\nand withdrawal from active giving.\n\n15 | P a g e\n\nMismanagement of Church Projects and Resources\nChurches\nalways\ndepend\non\nChristian\ncontributions\nto\nsupport\nspiritual,\ninfrastructural, and social institutions. More so, a common challenge is the\nmismanagement or poor planning of these projects and institutions. Kamanzi (2020)\nstates that project failures in churches are often rooted in weak financial controls. St.\nMark Kangarame has experienced delays in development projects due to poor\nfinancial planning and execution, resulting in member frustration and a loss of\ncredibility and integrity.\nLimited Financial Literacy Among Leaders\nMany church leaders are chosen for their spiritual maturity rather than administrative\ncapability. While spirituality is crucial, managing modern church finances requires\nbasic skills in budgeting, reporting, and record-keeping. Kamanzi (2020) observes that\nmany church institutions in Uganda suffer due to financial illiteracy among clergy. This\nchallenge is evident at St. Mark Kangarame Church, where most financial decisions\nare made without formal training or financial guidelines. The lack of capacity often\nresults in poor planning, misallocation of resources, and ineffective reporting.\nPoor Motivation and Resource Allocation for Staff and Volunteers\nFinancial challenges also affect the morale of church workers and volunteers. When\nsalaries are delayed or ministry programs lack financial support, leaders and staff may\nbecome demoralized. Barna (2007) notes that poor stewardship affects both\nmotivation and ministry effectiveness. At St. Mark Kangarame, volunteers have\n\n16 | P a g e", "word_count": 274, "start_char": 29098, "end_char": 31020}
{"chunk_id": "DOC0126__00013", "doc_id": "DOC0126", "chunk_index": 13, "text": "oor Motivation and Resource Allocation for Staff and Volunteers\nFinancial challenges also affect the morale of church workers and volunteers.W\n\nhen\nsalaries are delayed or ministry programs lack financial support, leaders and staff may\nbecome demoralized.B\n\narna (2007) notes that poor stewardship affects both\nmotivation and ministry effectiveness.A\n\nt St.M\n\nark Kangarame, volunteers have\n\n16 | P a g e\n\nexpressed frustration due to the lack of clear budgeting for outreach activities and\nministry tools, which impacts evangelism and community service delivery.\nNeglect of Church Assets and Property\nStewardship also includes the care of physical assets such as land, buildings, and\nequipment. Poor management of these resources leads to disrepair, loss through\nillegal sale, or misuse. In many churches, such neglect stems from unclear ownership\npolicies or the absence of maintenance plans. Mugisha (2019), suggests that church\nland disputes in Uganda are often tied to unregulated land sales and poor\ndocumentation and management. St. Mark Kangarame has faced similar concerns,\nwhere land use decisions have been made without clear procedures or Christian\nconsultation.\nTheological Misunderstandings of Stewardship\nThis challenge is how theology influences financial behavior and some churches\nemphasize giving without equal emphasis on and stewardship and management. Sider\n(2015) says that when biblical stewardship is reduced to seed sowing and blessings, it\nopens room for manipulation. At St. Mark Kangarame, teachings on giving have not\nalways been matched with clear teachings about financial policies or reporting\npractices.\n\n17 | P a g e", "word_count": 244, "start_char": 30616, "end_char": 32267}
{"chunk_id": "DOC0126__00014", "doc_id": "DOC0126", "chunk_index": 14, "text": "ider\n(2015) says that when biblical stewardship is reduced to seed sowing and blessings, it\nopens room for manipulation.A\n\nt St.M\n\nark Kangarame, teachings on giving have not\nalways been matched with clear teachings about financial policies or reporting\npractices.\n\n17 | P a g e\n\nCultural Barriers to Financial Accountability\nOne of the cultural barriers is questioning church leaders about financial matters and\nis considered disrespectful. This cultural mind set has discouraged congregants from\ndemanding transparency. Mbugua (2017) reveals that in parts of African countries,\ncultural reverence for clergy prevents open dialogue on financial accountability. At St.\nMark Kangarame Church, cultural reluctance has contributed to weak christian\nparticipation in budget discussions or financial planning and management processes.\nAbsence of Financial Policy Documents\nThere is absence of financial policies in churches and they lack written rules and\nregulations that guide the receipt, use, and reporting of church funds. Internal\ncontrols concerned with financial management lack in churches and without a\nfinancial policy, decisions are often made based on personal judgment rather than\nstandardized procedures. Steward (2018), states that a documented financial policy\nenhances consistency and fairness in stewardship and management. At St. Mark\nKangarame, the absence of such a document makes it hard for financial stewardship\nand financial checks\nLack of External Support Due to Poor Stewardship\nSome churches receive donations and grants from external agencies and because of\nmismanagement of resources including money they end up losing them, However,\nwhen accountability is weak, these partnerships are at risk of not supporting again .\nDonors expect clear and accurate records, regular audits, and responsible and\n\n18 | P a g e", "word_count": 271, "start_char": 31989, "end_char": 33826}
{"chunk_id": "DOC0126__00015", "doc_id": "DOC0126", "chunk_index": 15, "text": "onors expect clear and accurate records, regular audits, and responsible and\n\n18 | P a g e\n\neffective use of funds. Chitando and Togarasei (2010), states that poor reporting led\nto donor withdrawal in several African churches.\nResponding to the Challenges\nResponding to the challenges of financial accountability, Mugisha (2019), advocates for\nthe formation of stewardship and management committees comprising trusted and\ntrained Christians. These committees provide oversight, ensure that budgets are\nfollowed, and promote proper accountability. Wright (2006), explains that regular\ntraining in financial management for church leaders and accounting officers is\nessential to build capacity and reduce mismanagement of funds.\nFinally, developing a clear church financial policy and program is crucial in many\naspects for example Steward (2018) states that such a policy provides a standard for\nmanaging funds, assets, and internal disputes. For St. Mark Kangarame Church,\nimplementing such a policy would address many of the existing gaps and foster better\nfinancial discipline with in the church.\n2.3 Measures for effective financial Stewardship of Property in St. Mark Kangarame\nChurch.\nManagement of church properties involve the careful, transparent, and faithful\nmanagement of the physical, financial, and material resources entrusted to church\nleaders and Christians . In the context of St. Mark Kangarame Church, stewardship\ngoes beyond biblical scriptures. It requires the following administrative systems,\nethical leadership, and congregational participation to ensure sustainability and\n\n19 | P a g e\n\ngrowth. Poor stewardship in this parish, like in many rural Ugandan churches, has\nresulted in issues such as unauthorized sale of church land, lack of transparency in\nasset management, and neglect of property maintenance (Mugisha, 2019). Therefore,\nsafeguarding church\nresources require different approaches that integrate\ninstitutional, legal, educational, and spiritual and social strategies.\n2.4 Measures for Improving Financial Stewardship in Church Institutions: A Case of\nSt. Mark Kangarame Church\nFinancial management in churches such as St. Mark Kangarame Church is essential\nfor promoting transparency, accountability, trust, and spiritual integrity One of the\nimportant ways are to improve financial management and through the creation of\nwell-trained and trustworthy stewardship committees. These committees should\ninclude both clergy and Christians with knowledge of finance and integrity in their\npersonal lives. Their role should involve budget planning, financial reporting, and\ninternal controls systems . Mugisha (2019), says involving more people in financial\noversight reduces the risk of misuse and promotes shared responsibility.\nRegular Financial Training for Church Leaders and Treasurers\nMany churches struggle with financial stewardship and management policies because\nthey lack the technical knowledge to handle budgets, reporting, and financial\nplanning. Churches should organize regular capacity-building workshops or partner\nwith Christian financial experts to train pastors, treasurers, and committee members.\n\n20 | P a g e", "word_count": 445, "start_char": 33736, "end_char": 36901}
{"chunk_id": "DOC0126__00016", "doc_id": "DOC0126", "chunk_index": 16, "text": "egular Financial Training for Church Leaders and Treasurers\nMany churches struggle with financial stewardship and management policies because\nthey lack the technical knowledge to handle budgets, reporting, and financial\nplanning.C\n\nhurches should organize regular capacity-building workshops or partner\nwith Christian financial experts to train pastors, treasurers, and committee members.\n\n20 | P a g e\n\nKamanzi (2020) emphasizes that when leaders are equipped with basic financial skills,\nthey are better positioned to align ministry goals with good financial practices.\nDevelopment and Implementation of a Church Financial Policy\nA formal financial policy document should guide how funds are received, allocated,\nspent, and reported. This policy must also include asset management, procurement\nprocesses, donation handling, and conflict resolution procedures. Steward (2018)\nargues that financial policies provide consistency and protection against arbitrary or\nfraudulent decisions. For St. Mark Kangarame, drafting such a policy and ensuring its\nconsistent implementation would improve both order and trust.\nAdoption of Digital Accounting and Record-Keeping Tools\nManual record-keeping is often unreliable and prone to loss or manipulation. Churches\nlike St. Mark Kangarame should gradually adopt digital tools, such as accounting\nsoftware, Excel spreadsheets, and mobile money tracking systems. These tools enable\naccurate financial reporting, timely generation of reports, and better storage of\nrecords. Nyabwari and Bundi (2021) note that technology helps minimize human error\nand improves audit readiness.\n\nConducting Regular Internal and External Audits\nFrequent auditing helps to evaluate whether financial practices are being followed\nand whether funds are being used as intended. Internal audits by the church finance\n\n21 | P a g e\n\ncommittee can be done quarterly, while external audits by independent professionals\ncan be done annually. Churches that audit regularly demonstrate a commitment to\ntransparency and attract greater trust and support from members and donors (Wright,\n2006).\nPublic Disclosure of Financial Reports\nTransparency can be significantly improved by making financial reports accessible to\nall church members. This can be done through quarterly church meetings, notice\nboards, newsletters, or WhatsApp groups. Mugisha (2019) found that congregants are\nmore willing to give when they are well-informed on how their contributions are used.\nSt. Mark Kangarame should therefore commit to consistent and open financial\ncommunication.\nEncouraging Member Participation in Financial Planning\nFinancial stewardship should not be a top-down process. Encouraging members to\nparticipate in budget discussions, project planning, and financial decision-making\nhelps build a sense of ownership and responsibility. Churches should create forums\nwhere members can ask questions, suggest ideas, and offer feedback. Osei-Tutu et al.\n(2014) affirm that participatory stewardship increases giving, unity, and collective\naccountability.\n\n22 | P a g e", "word_count": 426, "start_char": 36499, "end_char": 39561}
{"chunk_id": "DOC0126__00017", "doc_id": "DOC0126", "chunk_index": 17, "text": "ncouraging members to\nparticipate in budget discussions, project planning, and financial decision-making\nhelps build a sense of ownership and responsibility.C\n\nhurches should create forums\nwhere members can ask questions, suggest ideas, and offer feedback.O\n\nsei-Tutu et al.\n(2014) affirm that participatory stewardship increases giving, unity, and collective\naccountability.\n\n22 | P a g e\n\nStrengthening Legal Ownership and Asset Documentation\nChurch property and land should be properly documented and legally registered in the\nname of the church, not individual leaders. This prevents illegal sales and ensures\ncontinuity even when leadership changes. St. Mark Kangarame should collaborate with\nlegal experts to secure proper land titles and protect church assets.\nTeaching Theological Stewardship Principles\nFinancial management in the church should always be guided by biblical principles.\nLeaders and members need regular teaching on stewardship as a divine responsibility,\nnot just an administrative task. Using the new testament of the bible, the Parable of\nthe Talent in Mathew chapter twenty five verses fourteen then following and first\nCorinthians four verse two saying that “It is required that those who have been given\na trust must prove faithful”), churches can help cultivate a spiritual motivation for\naccountability and generosity (Sider, 2015).\nPromoting a Culture of Financial Literacy among Members\nBeyond leadership training, the entire congregation should be educated on financial\nprinciples—how to budget, save, tithe, and give. These lessons can be incorporated\ninto church programs, Sunday school, youth fellowship, and couples' groups. Kamanzi\n(2020) states that financially literate members are more likely to contribute regularly\nand monitor church finances responsibly.\n\n23 | P a g e\n\nCreating Partnerships with Christian Financial Institutions\nChurches can work with Christian-based banks, NGOs, or stewardship organizations\nthat offer support in areas such as investment, accounting systems, and fundraising.\nThese partnerships may provide training, tools, or even grant opportunities—especially\nwhen stewardship systems are reliable. St. Mark Kangarame can seek such\ncollaborations to expand its financial capacity and knowledge base.\nEstablishing Clear Leadership Terms and Ethical Codes\nEthical failures often arise when leadership becomes too personalized or unregulated.\nChurches should define clear leadership terms, job descriptions, and codes of ethics\nfor all those handling money. Violations should be met with corrective measures,\nincluding removal from office if necessary. This ensures accountability and protects\nthe church’s reputation.\nIntroducing Budget Monitoring and Project Evaluation Mechanisms\nEvery project or expenditure should be monitored against its intended outcome.\nSetting up a monitoring and evaluation (M&E) framework enables churches to assess\nthe impact of their spending and this helps to promote proper accountability\n\n24 | P a g e", "word_count": 424, "start_char": 39172, "end_char": 42172}
{"chunk_id": "DOC0126__00018", "doc_id": "DOC0126", "chunk_index": 18, "text": "his ensures accountability and protects\nthe church’s reputation.I\n\nntroducing Budget Monitoring and Project Evaluation Mechanisms\nEvery project or expenditure should be monitored against its intended outcome.S\n\netting up a monitoring and evaluation (M&E) framework enables churches to assess\nthe impact of their spending and this helps to promote proper accountability\n\n24 | P a g e\n\nInclusion of Youth and Women in Financial Committees\nYouth and women engagement in financial accountability of different churches\nbecause they participate in large numbers in different church activities\nPrayer and Spiritual Discernment in Financial Decisions\nFinancial stewardship remains a spiritual process and Major financial decisions are\nguided by prayer and seek for right discernment from God . Church leaders should\nseek God’s wisdom, not just financial logic, in every plan and expenditure. This\nensures that financial practices are in line with the church’s spiritual mission and\nevangelism.\nEstablishment of Clear Policies and Guidelines\nThere should be development and enforcement of written policies on the use,\nacquisition, and disposal of church property and these policies should define the roles\nand responsibilities of church committees and leaders concerning land, buildings,\nequipment, and financial assets (Wright, 2006). According to Kamanzi (2020), having\nclear policies in place helps reduce misuse, encourages transparency, and provides a\nframework for accountability\nSuch policies should also outline procedures for inventory management and reporting.\nChurches often suffer property losses due to poor record-keeping (Sider, 2015).\nTherefore, St. Mark Kangarame Church should keep updated registers of its land\n\n25 | P a g e\n\ntitles, movable assets, and construction projects. These records can be used to\nprevent theft, disputes, or encroachments.\nLegal Protection of Church Assets\nMany churches in Uganda lose their property due to the absence of legal ownership\ndocuments or because they are held in the name of individuals rather than the\ninstitution (Mugisha, 2019). Securing legal documents such as land titles in the\nchurch’s registered name is essential for protecting assets from illegal sales or\ntransfers. According to Chitando and Togarasei (2010), formal registration and proper\ndocumentation safeguard property during leadership transitions and protect the\nchurch from legal disputes.\nSt. Mark Kangarame Church should work with legal experts and diocesan authorities to\nensure that all land is properly titled and that any agreements (such as leases or\ndonations) are legally binding and archived. Engaging local government offices or\nNGOs that support land rights can also enhance property protection.\n\nTraining Church Leaders in Property Management and Accountability\nChurch leaders are often chosen based on their spiritual qualifications, but managing\nproperty requires administrative and financial skills as well. Training programs for\npastors, treasurers, and committee members on financial literacy, property\n\n26 | P a g e", "word_count": 443, "start_char": 41790, "end_char": 44843}
{"chunk_id": "DOC0126__00019", "doc_id": "DOC0126", "chunk_index": 19, "text": "raining Church Leaders in Property Management and Accountability\nChurch leaders are often chosen based on their spiritual qualifications, but managing\nproperty requires administrative and financial skills as well.T\n\nraining programs for\npastors, treasurers, and committee members on financial literacy, property\n\n26 | P a g e\n\nmanagement, and asset maintenance can greatly improve stewardship outcomes\n(Steward, 2018).\nKamanzi (2020) emphasizes that churches in rural Uganda benefit when leaders\nunderstand budgeting, procurement, reporting, and legal compliance. For example,\nleaders should be trained on how to read and interpret land title documents, keep\nmaintenance schedules for church buildings, and prepare annual financial reports.\nThis professional development ensures that leaders make informed decisions and\navoid costly mistakes.\nRegular Auditing and Monitoring\nAuditing is another essential measure for improving stewardship. Internal and external\naudits ensure that church resources are used properly and that procedures are\nfollowed. According to Barna (2007), audits enhance accountability, reduce\ncorruption, and improve donor confidence. At St. Mark Kangarame Church, regular\naudits both financial and properties and this can expose mismanagement, highlight\nareas of improvement, and encourage a culture of transparency in all aspects.\nThese include checking physical infrastructure, confirming possession of land, and\nreviewing rental agreements or contracts involving church property. A trained audit\nteam or external consultant can be appointed to work with the parish leadership to\nperform these tasks periodically.\n\n27 | P a g e\n\nCreation of a Stewardship Committee\nCreating a dedicated stewardship or property management committee can improve\noversight and transparency. This team, composed of trusted and skilled church\nmembers, would be responsible for overseeing the use, maintenance, and protection\nof church assets. The committee should operate under clear terms of reference and\nreport regularly to the congregation and diocesan authorities (Mugisha, 2019).\nSuch a team can evaluate potential risks, propose property improvements, review\nland disputes, and guide the budgeting for repairs or new construction. When\ndifferent perspectives are represented—such as youth, women, and professionals—the\ndecisions of the committee are more inclusive and likely to be accepted by the wider\nchurch body.\nUse of Technology and Record-Keeping Tools\nTechnological tools, though underutilized in rural parishes, can significantly enhance\nstewardship. Churches can use basic software such as Microsoft Excel, Google Sheets,\nor specialized church accounting tools to track income, expenses, donations, and\nassets. According to Steward (2018), digital systems increase transparency and make\nit easier to generate reports, prepare budgets, and monitor cash flows.\nFor physical property, churches can use mapping tools and photo documentation to\ncreate visual records of land and buildings. This data is helpful in legal disputes,\nproperty transfers, or insurance claims. At St. Mark Kangarame, a simple database of\n\n28 | P a g e", "word_count": 444, "start_char": 44518, "end_char": 47661}
{"chunk_id": "DOC0126__00020", "doc_id": "DOC0126", "chunk_index": 20, "text": "or physical property, churches can use mapping tools and photo documentation to\ncreate visual records of land and buildings.T\n\nhis data is helpful in legal disputes,\nproperty transfers, or insurance claims.A\n\nt St.M\n\nark Kangarame, a simple database of\n\n28 | P a g e\n\nassets maintained by the stewardship committee would serve as a vital resource in\ndecision-making and annual reporting.\nPromoting Transparency through Regular Communication\nAnother key strategy is improving communication between church leadership and\nmembers. According to Wright (2006), lack of information fosters suspicion, while\nregular updates increase trust and encourage participation. Leaders at St. Mark\nKangarame should present quarterly or bi-annual financial and property reports during\nchurch meetings.\nThese reports should include income from church-owned land, rental properties, or\ndonations for building projects, along with details of expenditures. When members\nare informed and involved, they feel ownership of the church’s mission and are more\nlikely to give generously and guard against misuse.\nCultivating a Culture of Integrity and Ethical Leadership\nNo amount of policy or technology can replace moral integrity. Stewardship is not only\nadministrative but spiritual. Leaders must demonstrate honesty, humility, and\naccountability in handling resources entrusted to them (Sider, 2015). According to\nBarna (2007), ethical leadership sets the tone for the entire congregation.\nThis culture of integrity should be reinforced through preaching, training, and\nmentoring. Role models within the church—elders, pastors, and treasurers—must\nexemplify faithfulness in both public and private management of church resources. In\n\n29 | P a g e\n\ndoing so, they inspire others to follow suit and raise the moral standard of\nstewardship within the church.\nEncouraging Congregational Participation and Oversight\nEngaging the whole church in stewardship decisions increases transparency and\naccountability. Members should have a voice in major decisions regarding property\nuse, sales, or new construction projects (Chitando & Togarasei, 2010). Participatory\ngovernance creates a sense of shared responsibility.\nInvolving lay professionals such as teachers, lawyers, engineers, and accountants can\nprovide technical insights during planning. Their contribution adds value and enhances\nthe church's management capacity. Churches should also encourage members to\nvolunteer in maintenance, fundraising, and monitoring projects.\nEstablishing Long-Term Strategic Planning\nFinally, sustainable stewardship requires vision. Church leaders should develop\nstrategic plans that outline goals for resource development, infrastructure expansion,\nand community service projects over five to ten years (Kamanzi, 2020). These plans\nhelp churches like St. Mark Kangarame move from reactive decisions to proactive\ndevelopment.\nStrategic planning also involves budgeting for maintenance, risk management,\ninsurance, and training. A clear plan provides a roadmap that current and future\n\n30 | P a g e", "word_count": 425, "start_char": 47395, "end_char": 50449}
{"chunk_id": "DOC0126__00021", "doc_id": "DOC0126", "chunk_index": 21, "text": "hese plans\nhelp churches like St.M\n\nark Kangarame move from reactive decisions to proactive\ndevelopment.S\n\ntrategic planning also involves budgeting for maintenance, risk management,\ninsurance, and training.A\n\nclear plan provides a roadmap that current and future\n\n30 | P a g e\n\nleaders can follow, ensuring continuity and preventing leadership from starting over\nafter every transition.\nProtecting and improving stewardship of church property in St. Mark Kangarame\nChurch demands more than good intentions; it requires systematic planning, legal\nawareness, leadership training, and active community participation. The combination\nof written policies, legal registration, regular audits, digital tools, and ethical\nleadership will not only safeguard resources but also boost the credibility and spiritual\nmission of the church. Through transparency, planning, and education, the church can\nensure that all its properties and assets are preserved and multiplied for future\ngenerations and used to glorify God.\n2.5 Researcher’s Opinion on Christian Stewardship\nEnhanced Leadership Development\nChurch leaders from the reviewed literature and real-life experiences in the Church of\nUganda—especially at St. Mark Kangarame Church—the researcher strongly believes\nthat financial stewardship must be improved for the church to grow and succeed.\nProper management of church finances does not only help pay pastors and maintain\nchurch buildings but also supports evangelism, youth programs, and community\nservice. Based on theological teachings and practical observations, the researcher\ngives the following opinions:\n\n31 | P a g e\n\nLeadership Capacity Development Is Critical\nMany church leaders in Uganda are spiritually gifted but lack knowledge of finance\nand budgeting. Without proper training, they may misuse funds unknowingly or fail to\nplan well for church growth. Therefore, structured workshops, diocesan training\nprograms, and Bible-based financial courses should be made compulsory for all church\nleaders (Smith, 2019). When leaders are well-trained, the whole church benefits\nthrough better planning and transparency.\nSystems of Accountability Must Be Strengthened\nAccountability means being honest and open about how money is received and used.\nChurches should keep financial records, provide monthly and annual reports, and\nallow members to ask questions. Internal and external audits should be done\nregularly. Introducing oversight committees like finance boards or parish audit teams\nwill reduce the risk of corruption (Green, 2020). These systems build trust and\nencourage more people to give.\nChurches Should Create Income-Generating Projects\nDepending only on tithes and offerings is not enough, especially in poor rural\ncommunities. Churches can start income-generating activities such as farming,\npoultry, tailoring, or running schools and clinics. These projects provide extra income\nand employment for members, while also funding ministry work (Mugisha, 2021). For\nexample, St. Mark Kangarame Church could set up a maize farm to help fund its\nmission and reduce financial stress.\n\n32 | P a g e", "word_count": 446, "start_char": 50172, "end_char": 53281}
{"chunk_id": "DOC0126__00022", "doc_id": "DOC0126", "chunk_index": 22, "text": "hurches can start income-generating activities such as farming,\npoultry, tailoring, or running schools and clinics.T\n\nhese projects provide extra income\nand employment for members, while also funding ministry work (Mugisha, 2021).F\n\nor\nexample, St.M\n\nark Kangarame Church could set up a maize farm to help fund its\nmission and reduce financial stress.\n\n32 | P a g e\n\nMembers Must Be Involved in Financial Decisions\nMany church members are willing to give but hesitate because they are not sure how\ntheir money is used. When congregants are involved in budget meetings, giving\ndecisions, and project planning, they feel a sense of ownership. This improves giving\nand accountability. Leaders should educate members on biblical giving and financial\nplanning to build trust and unity (Haddon, 2022).\nModern Technology Should Be Embraced\nThe digital age offers easy ways to improve church finance. Mobile money platforms\nlike MTN Mobile Money or Airtel Pay can help collect tithes. Excel or church\naccounting software can be used to track income and expenses. When finances are\nmanaged digitally, errors and misuse become less likely, and financial reports are\neasier to prepare and share (Kagwa, 2022). St. Mark Kangarame Church should explore\nusing such technologies for better management.\n2.6 Major Critique on the Research Topic\nOver-Reliance on Tithes and Offerings\nMany churches Although many books and Bible verses support financial stewardship,\nchurches in Uganda still face major problems when it comes to applying these\nteachings. The researcher has identified several weaknesses that continue to limit\nchurch growth due to poor stewardship.\n\n33 | P a g e\n\nOver-Reliance on Tithes and Offerings\nMost churches in Uganda—including St. Mark Kangarame—depend only on Sunday\nofferings and tithes. This becomes a problem during tough times like droughts,\npandemics, or economic crises, when members cannot give as expected. Without\nother income sources, church operations suffer (Haddon, 2022). The lack of innovation\nin fundraising and income diversification makes the church financially weak and\nvulnerable.", "word_count": 321, "start_char": 52916, "end_char": 55024}
{"chunk_id": "DOC0126__00023", "doc_id": "DOC0126", "chunk_index": 23, "text": "ark Kangarame—depend only on Sunday\nofferings and tithes.T\n\nhis becomes a problem during tough times like droughts,\npandemics, or economic crises, when members cannot give as expected.W\n\nithout\nother income sources, church operations suffer (Haddon, 2022).T\n\nhe lack of innovation\nin fundraising and income diversification makes the church financially weak and\nvulnerable.\n\nLack of Strong Financial Policies\nMany churches do not have clear financial policies or manuals that guide income\ncollection, budgeting, and spending. This creates confusion and opens doors for\nmisuse of church funds. Even where such policies exist, they are often not followed or\nreviewed regularly. In some cases, only a few individuals handle all the money without\nproper checks, increasing the risk of mismanagement (Kagwa, 2022).\nLimited Financial Training for Leaders\nMany clergy and lay leaders do not have formal training in finance, accounting, or\nresource planning. They may not know how to create a proper budget, monitor\nexpenses, or plan for church development. This lack of skill affects stewardship and\ncauses waste or misuse of resources (Smith, 2019). For churches to grow, financial\nliteracy should be treated as important as theological education.\n\n34 | P a g e\n\nCultural and Economic Challenges\nIn some Ugandan cultures, giving money to the church is seen as a private or optional\nmatter. Others believe that only wealthy people should support the church financially.\nCombined with poverty, unemployment, and high inflation, these attitudes reduce\ngiving among church members. Many people in rural areas live hand-to-mouth and\ncannot afford regular tithing (Wilberforce, 2015). These socioeconomic issues must be\nconsidered when designing stewardship strategies.\nResistance to financial reform, There is resistance to financial reform, Some church\nleaders and elders resist change. They are used to traditional methods like verbal\nreports or handwritten budgets and are unwilling to adopt digital systems, structured\npolicies, or open discussions on finances. Others fear losing control or being\nquestioned by members. This resistance slows down progress and keeps churches\noperating in outdated and risky ways (Mugisha, 2021).\n2.7 Chapter Summary\nThis chapter In this chapter, we have looked at how the church uses money and how it\nhelps in growing the church and doing God’s work. This is called financial\nstewardship. Stewardship means taking care of something well. In the church, it\nmeans using money and other things properly to help the church grow and help\npeople.\nWe saw that the Bible teaches us to be good stewards. For example, the Bible says in\nPsalm 24:1 that everything in the world belongs to God. So, we must use it well. In\n\n35 | P a g e", "word_count": 430, "start_char": 54652, "end_char": 57401}
{"chunk_id": "DOC0126__00024", "doc_id": "DOC0126", "chunk_index": 24, "text": "n the church, it\nmeans using money and other things properly to help the church grow and help\npeople.W\n\ne saw that the Bible teaches us to be good stewards.F\n\nor example, the Bible says in\nPsalm 24:1 that everything in the world belongs to God.S\n\no, we must use it well.I\n\nn\n\n35 | P a g e\n\nMatthew 25:14-30, Jesus tells a story that shows how important it is to take care of\nwhat we are given. If we do well, we are blessed. If we are careless, we lose.\nWe also learned that church leaders must have good qualities. They must be honest,\nfaithful, and know how to manage money. They must also be open and give reports so\nthat people can trust them. Some early church leaders like Clement, Origen, and\nCranmer also taught about using church money wisely.\nBut in Uganda, many churches have problems with money. Some churches depend only\non offerings and tithes. Some leaders don’t know how to manage money well. Others\ndon’t want to use new ways like computers or mobile money. This brings problems\nand stops the church from growing.\nTo solve these problems, the church must train leaders, create other ways to get\nmoney, keep good records, and involve members in decisions. Using technology like\nmobile money and computers can also help.\nIn short, when the church manages money well, it grows, and ministry becomes\nstrong. But when money is not handled well, it can bring problems. So, good financial\nstewardship is very important for church ministry and for helping people.\n\n36 | P a g e\n\nSECTION THREE:\nMETHODOLOGY\nThis section outlined research methods which were employed during the study. The\nstudy was focused on Christian financial stewardship and church ministry within the\nChurch of Uganda, specifically at St. Mark Kangarame Nyakatare Deanery, Diocese of\nKinkizi. The methodology ensured a structured approach to collecting and analyzing\ndata to achieve the research objectives effectively.\n3.1 Design\nThis is a conceptual structure within which research is conducted. The researcher\nemployed a descriptive survey design. According to Kothari (2008), a descriptive\nsurvey enabled the researcher to describe respondents participating in the study .\n3.2 Nature of the Data and its source\nThis study included both quantitative, qualitative methodologies to gather\ncomprehensive insights into Christian stewardship and church ministry. Quantitative\ndata will provide measurable statistics on stewardship practices, while qualitative\n\n37 | P a g e", "word_count": 404, "start_char": 57113, "end_char": 59563}
{"chunk_id": "DOC0126__00025", "doc_id": "DOC0126", "chunk_index": 25, "text": "ccording to Kothari (2008), a descriptive\nsurvey enabled the researcher to describe respondents participating in the study .\n3.2 Nature of the Data and its source\nThis study included both quantitative, qualitative methodologies to gather\ncomprehensive insights into Christian stewardship and church ministry.Q\n\nuantitative\ndata will provide measurable statistics on stewardship practices, while qualitative\n\n37 | P a g e\n\ndata was offered deeper insights into perceptions, experiences, and challenges within\nthe Church of Uganda.\nPrimary data was collected directly from first-hand informants, including clergy,\ncommittee members, and congregants.\n3.3 Population and Area of Study\nThe study was focused on St. Mark Kangarame Nyakatare Deanery, Diocese of Kinkizi,\na church within the Church of Uganda. The target population included clergy, church\ncommittee members, congregants, and non-members to gain a holistic understanding\nof stewardship practices and challenges affecting church growth.\n3.4 Sample Size\nSelecting a representative sample is crucial for cost-effectiveness and efficiency. The\nstudy was engaged 36 respondents, categorized as follows:\nSample\nDescription\nMale\nFemale\nTotal Sampling Technique\nClergy\nDevelopment\nCommittee\nCongregation\nMembers\nSimple random sampling\n\n38 | P a g e\n\nNon-Members of\nthe Congregation\nSimple random sampling\nProcurement\nOfficers\nTotal\n-\nSource: Researcher’s Sampling Scheme\n3.5 Sampling Procedures and Strategies\nThe study used both purposive and simple random sampling techniques. Purposive\nsampling was used to get key informants such as clergy, development committee\nmembers, and procurement officers, who possess valuable insights into church\nstewardship practices.\n\n3.6 Data Collection Instruments\nThis part involved both primary and secondary methods:\nQuestionnaires: Structured questionnaires were used to collect quantitative data on\nstewardship practices, financial transparency, and church growth.\n\n39 | P a g e\n\nInterviews: the researcher used Semi-structured interview guides to gather in-depth\nqualitative insights from key informants, focusing on challenges, opportunities, and\nbest practices in church stewardship.\nThe researcher administered questionnaires to respondents personally and conduct\nface-to-face interviews to ensure clarity and accuracy in responses. Ethical\nconsiderations, including informed consent and confidentiality, will be strictly\nobserved.\n3.7 Analysis of data Techniques\nData will be analyzed using a combination of manual coding and thematic analysis\ntechniques. Thematic analysis involved categorizing responses into themes related to\nChristian stewardship and church growth. Quantitative data was organized into tables\nand percentages to illustrate key trends and patterns.\nThe researcher will use a thematic analysis map, assigning codes to responses to\nfacilitate systematic evaluation. The results also presented in a structured format,\nincorporating both numerical data and qualitative descriptions to provide a\ncomprehensive overview of findings.\n3.8 research ethics\nThe following principles were observed to ensure the integrity and credibility of the\nstudy and these include:\n\n40 | P a g e", "word_count": 437, "start_char": 59143, "end_char": 62329}
{"chunk_id": "DOC0126__00026", "doc_id": "DOC0126", "chunk_index": 26, "text": "he results also presented in a structured format,\nincorporating both numerical data and qualitative descriptions to provide a\ncomprehensive overview of findings.\n3.8 research ethics\nThe following principles were observed to ensure the integrity and credibility of the\nstudy and these include:\n\n40 | P a g e\n\nInformed Consent: All participants were briefed on the study's purpose and\nvoluntarily participated.\nConfidentiality: Respondent identities were protected, and data was used exclusively\nfor academic purposes.\nObjectivity: The researcher-maintained neutrality in data collection and analysis,\nensuring accurate representation of findings.\n3.9 Budget and Work Plan\nBudget Estimate.\nItem\nEstimated Cost (UGX)\nResearch Materials\n150,000\nData Collection (Transport)\n200,000\nPrinting and Photocopying\n120,000\nCommunication (Phone, Email)\n80,000\nMiscellaneous Expenses\n100,000\nTotal\n650,000\n\n41 | P a g e\n\nWork Plan\nActivity\nDuration\nResponsible Person\nProposal and Literature Review\nJan 2025-April2025\nDesigning Research Tools\nMay 2025\nData Collection\nMay\nResearcher & Assistants\nData Analysis\nMay\nReport Writing & Editing\nJune\nSubmission of Final Report\nJuly 2025\n\nThis structured methodology ensured that the study is well-planned and executed\nefficiently within the available resources.", "word_count": 178, "start_char": 62023, "end_char": 63314}
