{"chunk_id": "DOC0162__00000", "doc_id": "DOC0162", "chunk_index": 0, "text": "The Elements of Style\n\nWilliam Strunk, Jr.\n\nNewly Revised and Edited by Chris Hong\n\nFormer Editor, Harvard University\n\n© 2011\n\nThe Elements of Style Press\n\nTABLE OF CONTENTS\n\nI. INTRODUCTORY\n\nII. ELEMENTARY RULES OF USAGE\n1. Form the possessive singular of nouns with 's.\n2. In a series of three or more terms with a single\nconjunction, use a comma after each term except the last.\n3. Enclose parenthetic expressions between commas.\n4. Place a comma before and or but introducing an\nindependent clause.\n5. Do not join independent clauses by a comma.\n6. Do not break sentences in two.\n7. A participial phrase at the beginning of a sentence must\nrefer to the grammatical subject.\n8. Divide words at line-ends, in accordance with their\nformation and pronunciation.\n\nIII. ELEMENTARY PRINCIPLES OF COMPOSITION\n9. Make the paragraph the unit of composition: one\nparagraph to each topic.\n10. As a rule, begin each paragraph with a topic sentence;\nend it in conformity with the beginning.\n11. Use the active voice.\n12. Put statements in positive form.\n13. Omit needless words.\n14. Avoid a succession of loose sentences.\n15. Express co-ordinate ideas in similar form.\n16. Keep related words together.\n\n17. In summaries, keep to one tense.\n18. Place the emphatic words of a sentence at the end.\n\nIV. A FEW MATTERS OF FORM\n\nV. WORDS AND EXPRESSIONS COMMONLY\nMISUSED\n\nVI. WORDS OFTEN MISSPELLED\n\nI. INTRODUCTORY\n\nThis book is intended for use in English courses in which\nthe practice of composition is combined with the study of\nliterature. It aims to give in brief space the principal\nrequirements of plain English style. It aims to lighten the task of\ninstructor and student by concentrating attention (in Chapters II\nand III) on a few essentials, the rules of usage and principles of\ncomposition most commonly violated. The numbers of the\nsections may be used as references in correcting manuscript.\n\nThe book covers only a small portion of the field of English\nstyle, but the experience of its writer has been that once past the\nessentials, students profit most by individual instruction based\non the problems of their own work, and that each instructor has\nhis own body of theory, which he prefers to that offered by any\ntextbook.", "word_count": 375, "start_char": 0, "end_char": 2223}
{"chunk_id": "DOC0162__00001", "doc_id": "DOC0162", "chunk_index": 1, "text": "he book covers only a small portion of the field of English\nstyle, but the experience of its writer has been that once past the\nessentials, students profit most by individual instruction based\non the problems of their own work, and that each instructor has\nhis own body of theory, which he prefers to that offered by any\ntextbook.\n\nIt is an old observation that the best writers sometimes\ndisregard the rules of rhetoric. When they do so, however, the\nreader will usually find in the sentence some compensating\nmerit, attained at the cost of the violation. Unless he is certain\nof doing as well, he will probably do best to follow the rules.\nAfter he has learned, by their guidance, to write plain English\nadequate for everyday uses, let him look, for the secrets of\nstyle, to the study of the masters of literature.\n\nII. ELEMENTARY RULES OF USAGE\n\n1. Form the possessive singular of nouns with 's.\n\nFollow this rule whatever the final consonant. Thus write,\n\nCharles's friend, Burns's poems, the witch's malice, the\nBeatles’s concert tour\n\nThis is the usage of the United States Government Printing\nOffice and of the Oxford University Press.\n\nExceptions are the possessives of ancient proper names in -\nes and -is, the possessive Jesus', and such forms as for\nconscience' sake, for righteousness' sake. But such forms as\nAchilles' heel, Moses' laws, Isis' temple are commonly\nreplaced by\n\nthe heel of Achilles the laws of Moses, the temple of Isis\n\nThe pronominal possessives hers, its, theirs, yours, and\noneself have no apostrophe.\n\n2. In a series of three or more terms with a single\nconjunction, use a comma after each term except the last.\n\nThus write,\n\nred, white, and blue\n\nhonest, energetic, but headstrong\n\nHe opened the letter, read it, and made a note of its\ncontents.\n\nThis is also the usage of the Government Printing Office and\nof the Oxford University Press.\n\nIn the names of business firms the last comma is omitted, as\n\nBrown, Shipley and Company\n\nThe abbreviation etc., even if only a single term comes\nbefore it, is always preceded by a comma.\n\n3. Enclose parenthetic expressions between commas.\n\nThe best way to see a country, unless you are pressed for\ntime, is to travel on foot.\n\nThis rule is difficult to apply; it is frequently hard to decide\nwhether a single word, such as however, or a brief phrase, is or\nis not parenthetic. If the interruption to the flow of the sentence\nis but slight, the writer may safely omit the commas. But\nwhether the interruption be slight or considerable, he must\nnever omit one comma and leave the other. Such punctuation as", "word_count": 447, "start_char": 1893, "end_char": 4474}
{"chunk_id": "DOC0162__00002", "doc_id": "DOC0162", "chunk_index": 2, "text": "f the interruption to the flow of the sentence\nis but slight, the writer may safely omit the commas.B\n\nut\nwhether the interruption be slight or considerable, he must\nnever omit one comma and leave the other.S\n\nuch punctuation as\n\nMarjorie's husband, Colonel Nelson paid us a visit\nyesterday,\n\nor\n\nMy brother you will be pleased to hear, is now in perfect\nhealth,\n\nis indefensible.\n\nNon-restrictive relative clauses are, in accordance with this\nrule, set off by commas.\n\nThe audience, which had at first been indifferent, became\nmore and more interested.\n\nSimilar clauses introduced by where and when are similarly\npunctuated.\n\nIn 1769, when Napoleon was born, Corsica had but\nrecently been acquired by France.\n\nNether Stowey, where Coleridge wrote The Rime of the\nAncient Mariner, is a few miles from Bridgewater.\n\nIn these sentences the clauses introduced by which, when,\nand where are non-restrictive; they do not limit the application\nof the words on which they depend, but add, parenthetically,\nstatements supplementing those in the principal clauses. Each\nsentence is a combination of two statements which might have\nbeen made independently.\n\nThe audience was at first indifferent. Later it became\nmore and more interested.\n\nNapoleon was born in 1769. At that time Corsica had but\nrecently been acquired by France.\n\nColeridge wrote The Rime of the Ancient Mariner at\nNether Stowey. Nether Stowey is only a few miles from\nBridgewater.\n\nRestrictive relative clauses are not set off by commas.\n\nThe candidate who best meets these requirements will\nobtain the place.\n\nIn this sentence the relative clause restricts the application\nof the word candidate to a single person. Unlike those above,\nthe sentence cannot be split into two independent statements.\n\nThe abbreviations etc. and jr. are always preceded by a\n\ncomma, and except at the end of a sentence, followed by one.\n\nSimilar in principle to the enclosing of parenthetic\nexpressions between commas is the setting off by commas of\nphrases or dependent clauses preceding or following the main\nclause of a sentence. The sentences quoted in this section and\nunder Rules 4, 5, 6, 7, 16, and 18 should afford sufficient\nguidance.\n\nIf a parenthetic expression is preceded by a conjunction,\nplace the first comma before the conjunction, not after it.\n\nHe saw us coming, and unaware that we had learned of\nhis treachery, greeted us with a smile.\n\n4. Place a comma before and or but introducing an\nindependent clause.\n\nThe early records of the city have disappeared, and the\nstory of its first years can no longer be reconstructed.\n\nThe situation is perilous, but there is still one chance of\nescape.", "word_count": 434, "start_char": 4246, "end_char": 6894}
{"chunk_id": "DOC0162__00003", "doc_id": "DOC0162", "chunk_index": 3, "text": "lace a comma before and or but introducing an\nindependent clause.T\n\nhe early records of the city have disappeared, and the\nstory of its first years can no longer be reconstructed.T\n\nhe situation is perilous, but there is still one chance of\nescape.\n\nSentences of this type, isolated from their context, may seem\nto be in need of rewriting. As they make complete sense when\nthe comma is reached, the second clause has the appearance of\nan after-thought. Further, and, is the least specific of\nconnectives. Used between independent clauses, it indicates\nonly that a relation exists between them without defining that\nrelation. In the example above, the relation is that of cause and\nresult. The two sentences might be rewritten:\n\nAs the early records of the city have disappeared, the\nstory of its first years can no longer be reconstructed.\n\nAlthough the situation is perilous, there is still one chance\nof escape.\n\nOr the subordinate clauses might be replaced by phrases:\n\nOwing to the disappearance of the early records of the\ncity, the story of its first years can no longer be\nreconstructed.\n\nIn this perilous situation, there is still one chance of\nescape.\n\nBut a writer may err by making his sentences too uniformly\ncompact and periodic, and an occasional loose sentence\nprevents the style from becoming too formal and gives the\nreader a certain relief. Consequently, loose sentences of the\ntype first quoted are common in easy, unstudied writing. But a\nwriter should be careful not to construct too many of his\nsentences after this pattern (see Rule 14).\n\nTwo-part sentences of which the second member is\nintroduced by as (in the sense of because), for, or, nor, and\nwhile (in the sense of and at the same time) likewise require a\ncomma before the conjunction.\n\nIf a dependent clause, or an introductory phrase requiring to\nbe set off by a comma, precedes the second independent clause,\nno comma is needed after the conjunction.\n\nThe situation is perilous, but if we are prepared to act\npromptly, there is still one chance of escape.\n\nFor two-part sentences connected by an adverb, see the next\nsection.\n\n5. Do not join independent clauses by a comma.\n\nIf two or more clauses, grammatically complete and not\njoined by a conjunction, are to form a single compound\nsentence, the proper mark of punctuation is a semicolon.\n\nStevenson's romances are entertaining; they are full of\n\nIt is nearly half past five; we cannot reach town before\ndark.\n\nIt is of course equally correct to write the above as two\nsentences each, replacing the semicolons by periods.\n\nStevenson's romances are entertaining. They are full of", "word_count": 441, "start_char": 6646, "end_char": 9261}
{"chunk_id": "DOC0162__00004", "doc_id": "DOC0162", "chunk_index": 4, "text": "tevenson's romances are entertaining; they are full of\n\nIt is nearly half past five; we cannot reach town before\ndark.I\n\nt is of course equally correct to write the above as two\nsentences each, replacing the semicolons by periods.S\n\ntevenson's romances are entertaining.T\n\nhey are full of\n\nIt is nearly half past five. We cannot reach town before\ndark.\n\nIf a conjunction is inserted, the proper mark is a comma\n(Rule 4).\n\nStevenson's romances are entertaining, for they are full of\n\nIt is nearly half past five, and we cannot reach town\nbefore dark.\n\nNote that if the second clause is preceded by an adverb,\nsuch as accordingly, besides, so, then, therefore, or thus, and\nnot by a conjunction, the semicolon is still required.\n\nI had never been in the place before; so I had difficulty in\nfinding my way about.\n\nIn general, however, it is best, in writing, to avoid using so\nin this manner; there is danger that the writer who uses it at all\nmay use it too often. A simple correction, usually serviceable,\nis to omit the word so, and begin the first clause with as:\n\nAs I had never been in the place before, I had difficulty in\nfinding my way about.,\n\nIf the clauses are very short, and are alike in form, a comma\nis usually permissible:\n\nMan proposes, God disposes.\n\nThe gate swung apart, the bridge fell, the portcullis was\ndrawn up.\n\n6. Do not break sentences in two.\n\nIn other words, do not use periods for commas.\n\nI met them on a cruise several years ago. Coming home\nfrom Liverpool to New York.\n\nHe was an interesting talker. A man who had traveled all\nover the world, and lived in half a dozen countries.\n\nIn both these examples, the first period should be replaced\nby a comma, and the following word begun with a small letter.\n\nIt is permissible to make an emphatic word or expression\nserve the purpose of a sentence and to punctuate it accordingly:\n\nAgain and again he called out. No reply.\n\nThe writer must, however, be certain that the emphasis is\nwarranted, and that he will not be suspected of a mere blunder\nin punctuation.\n\nRules 3, 4, 5, and 6 cover the most important principles in\nthe punctuation of ordinary sentences; they should be so\nthoroughly mastered that their application becomes second\nnature.\n\n7. A participial phrase at the beginning of a sentence must\nrefer to the grammatical subject.\n\nWalking slowly down the road, he saw a woman\naccompanied by two children.", "word_count": 425, "start_char": 8973, "end_char": 11365}
{"chunk_id": "DOC0162__00005", "doc_id": "DOC0162", "chunk_index": 5, "text": "ules 3, 4, 5, and 6 cover the most important principles in\nthe punctuation of ordinary sentences; they should be so\nthoroughly mastered that their application becomes second\nnature.\n\n7.A\n\nparticipial phrase at the beginning of a sentence must\nrefer to the grammatical subject.W\n\nalking slowly down the road, he saw a woman\naccompanied by two children.\n\nThe word walking refers to the subject of the sentence, not\nto the woman. If the writer wishes to make it refer to the\nwoman, he must recast the sentence:\n\nHe saw a woman, accompanied by two children, walking\nslowly down the road.\n\nParticipial phrases preceded by a conjunction or by a\npreposition, adjectives, and adjective phrases come under the\nsame rule if they begin the sentence.\n\nOn arriving in Chicago, his friends met him at the station.\n> When he arrived (or, On his arrival) in Chicago, his\nfriends met him at the station.\n\nA soldier of proved valor, they entrusted him with the\ndefence of the city. > A soldier of proved valor, he was\nentrusted with the defence of the city.\n\nYoung and inexperienced, the task seemed easy to me. >\nYoung and inexperienced, I thought the task easy.\n\nWithout a friend to counsel him, the temptation proved\nirresistible. > Without a friend to counsel him, he found the\n\ntemptation irresistible.\n\nSentences violating this rule are often ludicrous.\n\nBeing in a dilapidated condition, I was able to buy the\nhouse very cheap.\n\n8. Divide words at line-ends, in accordance with their\nformation and pronunciation.\n\nIf there is room at the end of a line for one or more\nsyllables of a word, but not for the whole word, divide the\nword, unless this involves cutting off only a single letter, or\ncutting off only two letters of a long word. No hard and fast rule\nfor all words can be laid down. The principles most frequently\napplicable are:\nA. Divide the word according to its formation:\n\nknow-ledge (not knowl-edge);\n\nShake-speare (not Shakes-peare);\n\nde-scribe (not des-cribe);\n\natmo-sphere (not atmos-phere);\n\nB. Divide \"on the vowel:\"\n\nedi-ble (not ed-ible);\n\npropo-sition;\n\nordi-nary;\n\nespe-cial;\n\nreli-gious;\n\noppo-nents;\n\nregu-lar;\n\nclassi-fi-ca-tion (three divisions possible);\n\ndeco-rative;\n\npresi-dent;\n\nC. Divide between double letters, unless they come at\nthe end of the simple form of the word:\n\nApen-nines;\n\nCincin-nati;\n\nrefer-ring;\n\nbut tell-ing.\n\nThe treatment of consonants in combination is best shown\nfrom examples:\n\nfor-tune;\n\npic-ture;\n\npresump-tuous;\n\nillus-tration;\n\nsub-stan-tial (either division);\n\nindus-try;\n\ninstruc-tion;\n\nsug-ges-tion;\n\nincen-diary.\n\nThe student will do well to examine the syllable-division in\na number of pages of any carefully printed book.\n\nIII. ELEMENTARY PRINCIPLES OF\nCOMPOSITION\n\n9. Make the paragraph the unit of composition: one\nparagraph to each topic.", "word_count": 440, "start_char": 11014, "end_char": 13810}
{"chunk_id": "DOC0162__00006", "doc_id": "DOC0162", "chunk_index": 6, "text": "he treatment of consonants in combination is best shown\nfrom examples:\n\nfor-tune;\n\npic-ture;\n\npresump-tuous;\n\nillus-tration;\n\nsub-stan-tial (either division);\n\nindus-try;\n\ninstruc-tion;\n\nsug-ges-tion;\n\nincen-diary.T\n\nhe student will do well to examine the syllable-division in\na number of pages of any carefully printed book.I\n\nII.E\n\nLEMENTARY PRINCIPLES OF\nCOMPOSITION\n\n9.M\n\nake the paragraph the unit of composition: one\nparagraph to each topic.\n\nIf the subject on which you are writing is of slight extent, or\nif you intend to treat it very briefly, there may be no need of\nsubdividing it into topics. Thus a brief description, a brief\nsummary of a literary work, a brief account of a single incident,\na narrative merely outlining an action, the setting forth of a\nsingle idea, any one of these is best written in a single\nparagraph. After the paragraph has been written, it should be\nexamined to see whether subdivision will not improve it.\n\nOrdinarily, however, a subject requires subdivision into\ntopics, each of which should be made the subject of a\nparagraph. The object of treating each topic in a paragraph by\nitself is, of course, to aid the reader. The beginning of each\nparagraph is a signal to him that a new step in the development\nof the subject has been reached.\n\nThe extent of subdivision will vary with the length of the\ncomposition. For example, a short notice of a book or poem\nmight consist of a single paragraph. One slightly longer might\nconsist of two paragraphs:\n\nA. Account of the work.\nB. Critical discussion.\n\nA report on a poem, written for a class in literature, might\nconsist of seven paragraphs:\nC. Facts of composition and publication.\nD. Kind of poem; metrical form.\nE. Subject.\nF. Treatment of subject.\nG. For what chiefly remarkable.\nH. Wherein characteristic of the writer.\nI. Relationship to other works.\n\nThe contents of paragraphs C and D would vary with the\npoem. Usually, paragraph C would indicate the actual or\nimagined circumstances of the poem (the situation), if these call\nfor explanation, and would then state the subject and outline its\ndevelopment. If the poem is a narrative in the third person\nthroughout, paragraph C need contain no more than a concise\nsummary of the action. Paragraph D would indicate the leading\nideas and show how they are made prominent, or would\nindicate what points in the narrative are chiefly emphasized.\n\nA novel might be discussed under the heads:\nJ. Setting.\nK. Plot.\n\nL. Characters.\nM. Purpose.\n\nA historical event might be discussed under the heads:\nN. What led up to the event.\nO. Account of the event.\nP. What the event led up to.", "word_count": 439, "start_char": 13363, "end_char": 15980}
{"chunk_id": "DOC0162__00007", "doc_id": "DOC0162", "chunk_index": 7, "text": "novel might be discussed under the heads:\nJ.S\n\netting.K\n\n.P\n\nlot.L\n\n.C\n\nharacters.M\n\n.P\n\nurpose.A\n\nhistorical event might be discussed under the heads:\nN.W\n\nhat led up to the event.O\n\n.A\n\nccount of the event.P\n\n.W\n\nhat the event led up to.\n\nIn treating either of these last two subjects, the writer would\nprobably find it necessary to subdivide one or more of the\ntopics here given.\n\nAs a rule, single sentences should not be written or printed\nas paragraphs. An exception may be made of sentences of\ntransition, indicating the relation between the parts of an\nexposition or argument.\n\nIn dialogue, each speech, even if only a single word, is a\nparagraph by itself; that is, a new paragraph begins with each\nchange of speaker. The application of this rule, when dialogue\nand narrative are combined, is best learned from examples in\nwell-printed works of fiction.\n\n10. As a rule, begin each paragraph with a topic sentence;\nend it in conformity with the beginning.\n\nAgain, the object is to aid the reader. The practice here\nrecommended enables him to discover the purpose of each\nparagraph as he begins to read it, and to retain the purpose in\nmind as he ends it. For this reason, the most generally useful\nkind of paragraph, particularly in exposition and argument, is\nthat in which\nA. the topic sentence comes at or near the beginning;\nB. the succeeding sentences explain or establish or\ndevelop the statement made in the topic sentence; and\nC. the final sentence either emphasizes the thought of the\ntopic sentence or states some important consequence.\n\nEnding with a digression, or with an unimportant detail, is\nparticularly to be avoided.\n\nIf the paragraph forms part of a larger composition, its\nrelation to what precedes, or its function as a part of the whole,\nmay need to be expressed. This can sometimes be done by a\nmere word or phrase (again; therefore; for the same reason)\nin the topic sentence. Sometimes, however, it is expedient to\nprecede the topic sentence by one or more sentences of\nintroduction or transition. If more than one such sentence is\nrequired, it is generally better to set apart the transitional\n\nsentences as a separate paragraph.", "word_count": 370, "start_char": 15741, "end_char": 17905}
{"chunk_id": "DOC0162__00008", "doc_id": "DOC0162", "chunk_index": 8, "text": "ometimes, however, it is expedient to\nprecede the topic sentence by one or more sentences of\nintroduction or transition.I\n\nf more than one such sentence is\nrequired, it is generally better to set apart the transitional\n\nsentences as a separate paragraph.\n\nAccording to the writer's purpose, he may, as indicated\nabove, relate the body of the paragraph to the topic sentence in\none or more of several different ways. He may make the\nmeaning of the topic sentence clearer by restating it in other\nforms, by defining its terms, by denying the converse, by giving\nillustrations or specific instances; he may establish it by proofs;\nor he may develop it by showing its implications and\nconsequences. In a long paragraph, he may carry out several of\nthese processes.\n\n1 Now, to be properly enjoyed, a walking tour should be\ngone upon alone. (Topic sentence.)\n\n2 If you go in a company, or even in pairs, it is no longer a\nwalking tour in anything but name; it is something else and\nmore in the nature of a picnic. (The meaning made clearer by\ndenial of the contrary.)\n\n3 A walking tour should be gone upon alone, because\nfreedom is of the essence; because you should be able to stop\nand go on, and follow this way or that, as the freak takes you;\nand because you must have your own pace, and neither trot\nalongside a champion walker, nor mince in time with a girl.\n(The topic sentence repeated, in abridged form, and supported\nby three reasons; the meaning of the third (\"you must have your\nown pace\") made clearer by denying the converse.)\n\n4 And you must be open to all impressions and let your\nthoughts take colour from what you see. (A fourth reason,\nstated in two forms.)\n\n5 You should be as a pipe for any wind to play upon. (The\nsame reason, stated in still another form.)\n\n6 \"I cannot see the wit,\" says Hazlitt, \"of walking and\ntalking at the same time. (The same reason as stated by\nHazlitt.)\n\n7 When I am in the country, I wish to vegetate like the\ncountry,\" which is the gist of all that can be said upon the\nmatter. (The same reason as stated by Hazlitt.)\n\n8 There should be no cackle of voices at your elbow, to jar\non the meditative silence of the morning. (Repetition, in\nparaphrase, of the quotation from Hazlitt.)", "word_count": 406, "start_char": 17651, "end_char": 19876}
{"chunk_id": "DOC0162__00009", "doc_id": "DOC0162", "chunk_index": 9, "text": "9 And so long as a man is reasoning he cannot surrender\nhimself to that fine intoxication that comes of much motion in\nthe open air, that begins in a sort of dazzle and sluggishness\nof the brain, and ends in a peace that passes comprehension.\n—Stevenson, Walking Tours. (Final statement of the fourth\nreason, in language amplified and heightened to form a strong\nconclusion.)\n\n1 It was chiefly in the eighteenth century that a very\ndifferent conception of history grew up. (Topic sentence.)\n\n2 Historians then came to believe that their task was not\nso much to paint a picture as to solve a problem; to explain or\nillustrate the successive phases of national growth,\nprosperity, and adversity. (The meaning of the topic sentence\n\nmade clearer; the new conception of history defined.)\n\n3 The history of morals, of industry, of intellect, and of\nart; the changes that take place in manners or beliefs; the\ndominant ideas that prevailed in successive periods; the rise,\nfall, and modification of political constitutions; in a word, all\nthe conditions of national well-being became the subjects of\ntheir works. (The definition expanded.)\n\n4 They sought rather to write a history of peoples than a\nhistory of kings. (The definition explained by contrast.)\n\n5 They looked especially in history for the chain of causes\nand effects. (The definition supplemented: another element in\nthe new conception of history.)\n\n6 They undertook to study in the past the physiology of\nnations, and hoped by applying the experimental method on a\nlarge scale to deduce some lessons of real value about the\nconditions on which the welfare of society mainly depend.—\nLecky, The Political Value of History. (Conclusion: an\nimportant consequence of the new conception of history.)\n\nIn narration and description the paragraph sometimes begins\nwith a concise, comprehensive statement serving to hold\ntogether the details that follow.\n\nThe breeze served us admirably.\n\nThe campaign opened with a series of reverses.\n\nThe next ten or twelve pages were filled with a curious set\nof entries.\n\nBut this device, if too often used, would become a\nmannerism. More commonly the opening sentence simply\nindicates by its subject with what the paragraph is to be\nprincipally concerned.\n\nAt length I thought I might return towards the stockade.\n\nHe picked up the heavy lamp from the table and began to\nexplore.\n\nAnother flight of steps, and they emerged on the roof.\n\nThe brief paragraphs of animated narrative, however, are\noften without even this semblance of a topic sentence. The\nbreak between them serves the purpose of a rhetorical pause,\nthrowing into prominence some detail of the action.\n\n11. Use the active voice.", "word_count": 441, "start_char": 19876, "end_char": 22556}
{"chunk_id": "DOC0162__00010", "doc_id": "DOC0162", "chunk_index": 10, "text": "nother flight of steps, and they emerged on the roof.T\n\nhe brief paragraphs of animated narrative, however, are\noften without even this semblance of a topic sentence.T\n\nhe\nbreak between them serves the purpose of a rhetorical pause,\nthrowing into prominence some detail of the action.\n\n11.U\n\nse the active voice.\n\nThe active voice is usually more direct and vigorous than\nthe passive:\n\nI shall always remember my first visit to Boston.\n\nThis is much better than\n\nMy first visit to Boston will always be remembered by me.\n\nThe latter sentence is less direct, less bold, and less\nconcise. If the writer tries to make it more concise by omitting\n\"by me,\"\n\nMy first visit to Boston will always be remembered,\n\nit becomes indefinite: is it the writer, or some person\nundisclosed, or the world at large, that will always remember\nthis visit?\n\nThis rule does not, of course, mean that the writer should\nentirely discard the passive voice, which is frequently\nconvenient and sometimes necessary.\n\nThe dramatists of the Restoration are little esteemed today.\n\nModern readers have little esteem for the dramatists of\n\nthe Restoration.\n\nThe first would be the right form in a paragraph on the\ndramatists of the Restoration; the second, in a paragraph on the\ntastes of modern readers. The need of making a particular word\nthe subject of the sentence will often, as in these examples,\ndetermine which voice is to be used.\n\nThe habitual use of the active voice, however, makes for\nforcible writing. This is true not only in narrative principally\nconcerned with action, but in writing of any kind. Many a tame\nsentence of description or exposition can be made lively and\nemphatic by substituting a transitive in the active voice for\nsome such perfunctory expression as there is, or could be\nheard.\n\nThere were a great number of dead leaves lying on the\nground.\n\nDead leaves covered the ground.\n\nThe sound of the falls could still be heard.\n\nThe sound of the falls still reached our ears.\n\nThe reason that he left college was that his health became\nimpaired.\n\nFailing health compelled him to leave college.\n\nIt was not long before he was very sorry that he had said\nwhat he had.\n\nHe soon repented his words.\n\nAs a rule, avoid making one passive depend directly upon\nanother.\n\nGold was not allowed to be exported.\n\nIt was forbidden to export gold (The export of gold was\nprohibited).\n\nHe has been proved to have been seen entering the\nbuilding.\n\nIt has been proved that he was seen to enter the building.", "word_count": 429, "start_char": 22244, "end_char": 24731}
{"chunk_id": "DOC0162__00011", "doc_id": "DOC0162", "chunk_index": 11, "text": "e soon repented his words.A\n\ns a rule, avoid making one passive depend directly upon\nanother.G\n\nold was not allowed to be exported.I\n\nt was forbidden to export gold (The export of gold was\nprohibited).H\n\ne has been proved to have been seen entering the\nbuilding.I\n\nt has been proved that he was seen to enter the building.\n\nIn both the examples above, before correction, the word\nproperly related to the second passive is made the subject of\nthe first.\n\nA common fault is to use as the subject of a passive\nconstruction a noun which expresses the entire action, leaving\nto the verb no function beyond that of completing the sentence.\n\nA survey of this region was made in 1900. > This region\nwas surveyed in 1900.\n\nMobilization of the army was rapidly carried out. > The\narmy was rapidly mobilized.\n\nConfirmation of these reports cannot be obtained. >\nThese reports cannot be confirmed.\n\nCompare the sentence, \"The export of gold was prohibited,\"\n\nin which the predicate \"was prohibited\" expresses something\nnot implied in \"export.\"\n\n12. Put statements in positive form.\n\nMake definite assertions. Avoid tame, colorless, hesitating,\nnon-committal language. Use the word not as a means of denial\nor in antithesis, never as a means of evasion.\n\nHe was not very often on time. > He usually came late.\n\nHe did not think that studying Latin was much use. > He\nthought the study of Latin useless.\n\nThe Taming of the Shrew is rather weak in spots.\nShakespeare does not portray Katharine as a very admirable\ncharacter, nor does Bianca remain long in memory as an\nimportant character in Shakespeare's works. > The women in\nThe Taming of the Shrew are unattractive. Katharine is\ndisagreeable, Bianca insignificant.\n\nThe last example, before correction, is indefinite as well as\nnegative. The corrected version, consequently, is simply a\nguess at the writer's intention.\n\nAll three examples show the weakness inherent in the word\nnot. Consciously or unconsciously, the reader is dissatisfied\nwith being told only what is not; he wishes to be told what is.\nHence, as a rule, it is better to express a negative in positive\nform.\n\nnot hones > dishonest\n\nnot important > trifling\n\ndid not remember > forgot\n\ndid not pay any attention to > ignored\n\ndid not have much confidence in > distrusted\n\nThe antithesis of negative and positive is strong:\n\nNot charity, but simple justice.\n\nNot that I loved Caesar less, but Rome the more.\n\nNegative words other than not are usually strong:\n\nThe sun never sets upon the British flag.\n\n13. Omit needless words.", "word_count": 430, "start_char": 24409, "end_char": 26941}
{"chunk_id": "DOC0162__00012", "doc_id": "DOC0162", "chunk_index": 12, "text": "ot that I loved Caesar less, but Rome the more.N\n\negative words other than not are usually strong:\n\nThe sun never sets upon the British flag.\n\n13.O\n\nmit needless words.\n\nVigorous writing is concise. A sentence should contain no\nunnecessary words, a paragraph no unnecessary sentences, for\nthe same reason that a drawing should have no unnecessary\nlines and a machine no unnecessary parts. This requires not that\nthe writer make all his sentences short, or that he avoid all\ndetail and treat his subjects only in outline, but that every word\ntell.\n\nMany expressions in common use violate this principle:\n\nthe question as to whether > whether (the question\nwhether)\n\nthere is no doubt but that > no doubt (doubtless)\n\nused for fuel purposes > used for fuel\n\nhe is a man who > he\n\nin a hasty manner > hastily\n\nthis is a subject which > this subject\n\nHis story is a strange one. > His story is strange.\n\nIn especial the expression the fact that should be revised\nout of every sentence in which it occurs.\n\nowing to the fact that > since (because)\n\nin spite of the fact that > though (although)\n\ncall your attention to the fact that > remind you (notify\nyou)\n\nI was unaware of the fact that > I was unaware that (did\nnot know)\n\nthe fact that he had not succeeded > his failure\n\nthe fact that I had arrived > my arrival\n\nSee also under case, character, nature, system in Chapter\nV.\n\nWho is, which was, and the like are often superfluous.\n\nHis brother, who is a member of the same firm > His\nbrother, a member of the same firm\n\nTrafalgar, which was Nelson's last battle > Trafalgar,\nNelson's last battle\n\nAs positive statement is more concise than negative, and the\nactive voice more concise than the passive, many of the\nexamples given under Rules 11 and 12 illustrate this rule as\nwell.\n\nA common violation of conciseness is the presentation of a\nsingle complex idea, step by step, in a series of sentences\nwhich might to advantage be combined into one.\n\nMacbeth was very ambitious. This led him to wish to\n\nbecome king of Scotland. The witches told him that this wish\nof his would come true. The king of Scotland at this time was\nDuncan. Encouraged by his wife, Macbeth murdered Duncan.\nHe was thus enabled to succeed Duncan as king. (55 words.)\n> Encouraged by his wife, Macbeth achieved his ambition\nand realized the prediction of the witches by murdering\nDuncan and becoming king of Scotland in his place. (26\nwords.)\n\n14. Avoid a succession of loose sentences.", "word_count": 442, "start_char": 26773, "end_char": 29233}
{"chunk_id": "DOC0162__00013", "doc_id": "DOC0162", "chunk_index": 13, "text": "ncouraged by his wife, Macbeth murdered Duncan.H\n\ne was thus enabled to succeed Duncan as king. (55 words.)\n> Encouraged by his wife, Macbeth achieved his ambition\nand realized the prediction of the witches by murdering\nDuncan and becoming king of Scotland in his place. (26\nwords.)\n\n14.A\n\nvoid a succession of loose sentences.\n\nThis rule refers especially to loose sentences of a particular\ntype, those consisting of two co-ordinate clauses, the second\nintroduced by a conjunction or relative. Although single\nsentences of this type may be unexceptionable (see under Rule\n4), a series soon becomes monotonous and tedious.\n\nAn unskilled writer will sometimes construct a whole\nparagraph of sentences of this kind, using as connectives and,\nbut, and less frequently, who, which, when, where, and while,\nthese last in non-restrictive senses (see under Rule 3).\n\nThe third concert of the subscription series was given last\nevening, and a large audience was in attendance. Mr. Edward\nAppleton was the soloist, and the Boston Symphony Orchestra\nfurnished the instrumental music. The former showed himself\nto be an artist of the first rank, while the latter proved itself\nfully deserving of its high reputation. The interest aroused by\nthe series has been very gratifying to the Committee, and it is\nplanned to give a similar series annually hereafter. The fourth\nconcert will be given on Tuesday, May 10, when an equally\nattractive program will be presented.\n\nApart from its triteness and emptiness, the paragraph above\nis bad because of the structure of its sentences, with their\nmechanical symmetry and sing-song. Contrast with them the\nsentences in the paragraphs quoted under Rule 10, or in any\n\npiece of good English prose, as the preface (Before the Curtain)\nto Vanity Fair.\n\nIf the writer finds that he has written a series of sentences of\nthe type described, he should recast enough of them to remove\nthe monotony, replacing them by simple sentences, by sentences\nof two clauses joined by a semicolon, by periodic sentences of\ntwo clauses, by sentences, loose or periodic, of three clauses—\nwhichever best represent the real relations of the thought.\n\n15. Express co-ordinate ideas in similar form.\n\nThis principle, that of parallel construction, requires that\nexpressions of similar content and function should be outwardly\nsimilar. The likeness of form enables the reader to recognize\nmore readily the likeness of content and function. Familiar\ninstances from the Bible are the Ten Commandments, the\nBeatitudes, and the petitions of the Lord's Prayer.", "word_count": 410, "start_char": 28906, "end_char": 31462}
{"chunk_id": "DOC0162__00014", "doc_id": "DOC0162", "chunk_index": 14, "text": "xpress co-ordinate ideas in similar form.T\n\nhis principle, that of parallel construction, requires that\nexpressions of similar content and function should be outwardly\nsimilar.T\n\nhe likeness of form enables the reader to recognize\nmore readily the likeness of content and function.F\n\namiliar\ninstances from the Bible are the Ten Commandments, the\nBeatitudes, and the petitions of the Lord's Prayer.\n\nThe unskilled writer often violates this principle, from a\nmistaken belief that he should constantly vary the form of his\nexpressions. It is true that in repeating a statement in order to\nemphasize it he may have need to vary its form. For illustration,\nsee the paragraph from Stevenson quoted under Rule 10. But\napart from this, he should follow the principle of parallel\nconstruction.\n\nFormerly, science was taught by the textbook method,\nwhile now the laboratory method is employed. > Formerly,\nscience was taught by the textbook method; now it is taught\nby the laboratory method.\n\nThe left-hand version gives the impression that the writer is\nundecided or timid; he seems unable or afraid to choose one\nform of expression and hold to it. The right-hand version shows\nthat the writer has at least made his choice and abided by it.\n\nBy this principle, an article or a preposition applying to all\nthe members of a series must either be used only before the first\n\nterm or else be repeated before each term.\n\nThe French, the Italians, Spanish, and Portuguese > The\nFrench, the Italians, the Spanish, and the Portuguese\n\nIn spring, summer, or in winter > In spring, summer, or\nwinter (In spring, in summer, or in winter)\n\nCorrelative expressions (both, and; not, but; not only, but\nalso; either, or; first, second, third; and the like) should be\nfollowed by the same grammatical construction. Many\nviolations of this rule can be corrected by rearranging the\nsentence.\n\nIt was both a long ceremony and very tedious. > The\nceremony was both long and tedious.\n\nA time not for words, but action > A time not for words,\nbut for action\n\nEither you must grant his request or incur his ill will. >\nYou must either grant his request or incur his ill will.\n\nMy objections are, first, the injustice of the measure;\nsecond, that it is unconstitutional. > My objections are, first,\nthat\nthe\nmeasure\nis\nunjust;\nsecond,\nthat\nit\nis\nunconstitutional.\n\nSee also the third example under Rule 12 and the last under\nRule 13.\n\nIt may be asked, what if a writer needs to express a very\nlarge number of similar ideas, say twenty? Must he write\ntwenty consecutive sentences of the same pattern? On closer", "word_count": 438, "start_char": 31064, "end_char": 33642}
{"chunk_id": "DOC0162__00015", "doc_id": "DOC0162", "chunk_index": 15, "text": "ee also the third example under Rule 12 and the last under\nRule 13.I\n\nt may be asked, what if a writer needs to express a very\nlarge number of similar ideas, say twenty?M\n\nust he write\ntwenty consecutive sentences of the same pattern?O\n\nn closer\n\nexamination he will probably find that the difficulty is\nimaginary, that his twenty ideas can be classified in groups, and\nthat he need apply the principle only within each group.\nOtherwise he had best avoid the difficulty by putting his\nstatements in the form of a table.\n\n16. Keep related words together.\n\nThe position of the words in a sentence is the principal\nmeans of showing their relationship. The writer must therefore,\nso far as possible, bring together the words, and groups of\nwords, that are related in thought, and keep apart those which\nare not so related.\n\nThe subject of a sentence and the principal verb should not,\nas a rule, be separated by a phrase or clause that can be\ntransferred to the beginning.\n\nWordsworth, in the fifth book of The Excursion, gives a\nminute description of this church. > In the fifth book of The\nExcursion, Wordsworth gives a minute description of this\nchurch.\n\nCast iron, when treated in a Bessemer converter, is\nchanged into steel. > By treatment in a Bessemer converter,\ncast iron is changed into steel.\n\nThe objection is that the interposed phrase or clause\nneedlessly interrupts the natural order of the main clause. This\nobjection, however, does not usually hold when the order is\ninterrupted only by a relative clause or by an expression in\napposition. Nor does it hold in periodic sentences in which the\ninterruption is a deliberately used means of creating suspense\n(see examples under Rule 18).\n\nThe relative pronoun should come, as a rule, immediately\nafter its antecedent.\n\nThere was a look in his eye that boded mischief. > In his\neye was a look that boded mischief.\n\nHe wrote three articles about his adventures in Spain,\nwhich were published in Harper's Magazine. > He published\nin Harper's Magazine three articles about his adventures in\nSpain.\n\nThis is a portrait of Benjamin Harrison, grandson of\nWilliam Henry Harrison, who became President in 1889. >\nThis is a portrait of Benjamin Harrison, grandson of\nWilliam Henry Harrison. He became President in 1889.\n\nIf the antecedent consists of a group of words, the relative\ncomes at the end of the group, unless this would cause\nambiguity.\n\nA proposal to amend the Sherman Act, which has been\nvariously judged > A proposal, which has been variously\njudged, to amend the Sherman Act\n\nOr\n\n> A proposal to amend the much-debated Sherman Act", "word_count": 446, "start_char": 33397, "end_char": 35991}
{"chunk_id": "DOC0162__00016", "doc_id": "DOC0162", "chunk_index": 16, "text": "f the antecedent consists of a group of words, the relative\ncomes at the end of the group, unless this would cause\nambiguity.A\n\nproposal to amend the Sherman Act, which has been\nvariously judged > A proposal, which has been variously\njudged, to amend the Sherman Act\n\nOr\n\n> A proposal to amend the much-debated Sherman Act\n\nThe grandson of William Henry Harrison, who > William\nHenry Harrison's grandson, Benjamin Harrison, who\n\nA noun in apposition may come between antecedent and\nrelative, because in such a combination no real ambiguity can\narise.\n\nThe Duke of York, his brother, who was regarded with\nhostility by the Whigs\n\nModifiers should come, if possible next to the word they\nmodify. If several expressions modify the same word, they\nshould be so arranged that no wrong relation is suggested.\n\nAll the members were not present. > Not all the members\nwere present.\n\nHe only found two mistakes. > He found only two\nmistakes.\n\nMajor R. E. Joyce will give a lecture on Tuesday evening\nin Bailey Hall, to which the public is invited, on \"My\nExperiences in Mesopotamia\" at eight P. M. > On Tuesday\nevening at eight P. M., Major R. E. Joyce will give in Bailey\nHall a lecture on \"My Experiences in Mesopotamia.\" The\npublic is invited.\n\n17. In summaries, keep to one tense.\n\nIn summarizing the action of a drama, the writer should\nalways use the present tense. In summarizing a poem, story, or\nnovel, he should preferably use the present, though he may use\nthe past if he prefers. If the summary is in the present tense,\nantecedent action should be expressed by the perfect; if in the\npast, by the past perfect.\n\nAn unforeseen chance prevents Friar John from\ndelivering Friar Lawrence's letter to Romeo. Juliet,\nmeanwhile, owing to her father's arbitrary change of the\nday set for her wedding, has been compelled to drink the\npotion on Tuesday night, with the result that Balthasar\ninforms Romeo of her supposed death before Friar\nLawrence learns of the nondelivery of the letter.\n\nBut whichever tense be used in the summary, a past tense in\nindirect discourse or in indirect question remains unchanged.\n\nThe Legate inquires who struck the blow.\n\nApart from the exceptions noted, whichever tense the writer\nchooses, he should use throughout. Shifting from one tense to\nthe other gives the appearance of uncertainty and irresolution\n(compare Rule 15).\n\nIn presenting the statements or the thought of some one else,\nas in summarizing an essay or reporting a speech, the writer", "word_count": 423, "start_char": 35669, "end_char": 38145}
