{"chunk_id": "DOC0024__00000", "doc_id": "DOC0024", "chunk_index": 0, "text": "Open Journal of Social Sciences, 2024, 12, 101-126\nhttps://www.scirp.org/journal/jss\nISSN Online: 2327-5960\nISSN Print: 2327-5952\n\nDOI: 10.4236/jss.2024.121008 Jan. 19, 2024\n\nService Quality, Customer Loyalty and\nCustomer Retention among Private Health Care\nServices in Mbarara City\nNayiga Harriet1, Nuwagaba Arthur2, Mabel Birungi Komunda3, Tom Mugizi3\n1Department of Business, Kabale University, Kabale, Uganda\n2School of Business, Uganda Christian University, Mukono, Uganda\n3Department of Marketing and Media Studies, Business School, Makerere University, Kampala, Uganda\n\nAbstract\nThis study aimed to investigate the relationships between service quality,\ncustomer loyalty, and customer retention within private healthcare facilities\nin Mbarara City. It specifically focused on how service quality affects customer retention and loyalty, and how loyalty in turn influences retention. A\ncross-sectional design was used, with data collection and analysis conducted\nquantitatively. The study encompassed 36 operational private healthcare\ncentres, with their customers serving as the subjects of the investigation.\nThe study distributed self-administered closed-ended questionnaires to the\nparticipants, and the data collected was later processed and analysed using\nStatistical Package for Social Scientists (SPSS), version 21. To address the\nresearch objectives, Pearson correlation was utilized to examine the relationships between the variables under investigation, while Ordinary Least\nSquare regression was employed to assess the model’s predictive capability.\nThe study revealed a noteworthy positive relationship between service quality and customer loyalty, as well as a significant positive correlation between customer loyalty and customer retention. However, it was determined that the link between service quality and customer retention was not\nstatistically significant. Therefore, there is a need for private healthcare\nmanagement to focus on service quality to improve customer loyalty. This\nmeans that activities related to the reliability of the health staff, positive responsiveness of the doctors and other employees in the health centres, ensuring that the patients are assured of quality service and equipping the\nhealth facility with the right machines that can test and treat diseases, this\nwill help in improving customer loyalty hence customer retention among\nprivate health care services in Mbarara City.\nHow to cite this paper: Harriet, N., Arthur, N., Komunda, M. B., & Mugizi, T.\n(2024). Service Quality, Customer Loyalty\nand Customer Retention among Private\nHealth Care Services in Mbarara City. Open\nJournal of Social Sciences, 12, 101-126.\nhttps://doi.org/10.4236/jss.2024.121008\nReceived: November 22, 2023\nAccepted: January 16, 2024\nPublished: January 19, 2024\nCopyright © 2024 by author(s) and\nScientific Research Publishing Inc.\nThis work is licensed under the Creative\nCommons Attribution International\nLicense (CC BY 4.0).\nhttp://creativecommons.org/licenses/by/4.0/\n\nOpen Access\n\nKeywords\nService Quality, Customer Loyalty, Customer Retention, Private Health Care\nServices", "word_count": 417, "start_char": 0, "end_char": 3112}
{"chunk_id": "DOC0024__00001", "doc_id": "DOC0024", "chunk_index": 1, "text": "pen\nJournal of Social Sciences, 12, 101-126.\nhttps://doi.org/10.4236/jss.2024.121008\nReceived: November 22, 2023\nAccepted: January 16, 2024\nPublished: January 19, 2024\nCopyright © 2024 by author(s) and\nScientific Research Publishing Inc.T\n\nhis work is licensed under the Creative\nCommons Attribution International\nLicense (CC BY 4.0).\nhttp://creativecommons.org/licenses/by/4.0/\n\nOpen Access\n\nKeywords\nService Quality, Customer Loyalty, Customer Retention, Private Health Care\nServices\n\n1. Introduction\nCompanies boost their profits through various means, including acquiring new\ncustomers, increasing the volume of one-time purchases from existing customers, and prolonging customer retention (Ali et al., 2010). In an intensely competitive business landscape, customer retention is vital to a company’s continued\nexistence. This is because the loss of a customer equates to relinquishing the potential future revenue generated by the customer’s lifelong purchases. Furthermore, customer retention brings several advantages, including enhanced employee retention, higher job satisfaction, improved service quality, reduced costs,\ndecreased price sensitivity, and increased productivity, among other benefits\n(Aydin & Özer, 2006). It is important to highlight that acquiring new customers comes with considerably higher costs than retaining existing customers\n(Osarenkhoe et al., 2017). The more extended a customer maintains their relationship with a company, the greater the company’s advantages (Shashikala &\nAshwini, 2015). This result is shaped by various factors and aligns with the idea\nthat the expenses associated with acquiring and enticing new customers are substantial. The expense associated with attracting new customers is five times\nhigher than that of retaining existing ones (Rust & Zahorik, 1993). In agreement,\nTao (2014) asserted that attracting and retaining profitable customers is important in businesses today.\nGlobally, many firms face challenges in retaining their customer base. For\nexample, in the mobile phone industry, customer attrition rates frequently surpass 30% despite the implementation of various strategies aimed at retaining\ncustomers. Well-known UK mobile network providers Orange, T-Mobile, O2,\nand Vodafone have lost more than one-third of their younger customers to rival\ncompanies (Andic, 2006). This scenario is not unlike the situation in the Ugandan telecom sector, where, as reported in the Business Market International Report (2017), MTN Uganda maintains a customer base of 11.2 million subscribers, representing 55 per cent of its market share. Nevertheless, there has been a\nnoticeable increase in the number of inactive prepaid users, with mobile customers periodically opting to abandon some of their SIM cards.\nService companies place a significant emphasis on service quality as a critical\ntool for customer retention. In the financial services sector such as banks, competition varies in the market using differentiated products. These services are\nregarded as competitive tool (Nsiah & Mensah, 2014). In other words, the banking sector attracts customers by offering high-quality services. Similarly, within\nthe healthcare sector, service quality encompasses the provision of what patients", "word_count": 449, "start_char": 2627, "end_char": 5876}
{"chunk_id": "DOC0024__00002", "doc_id": "DOC0024", "chunk_index": 2, "text": "n the financial services sector such as banks, competition varies in the market using differentiated products.T\n\nhese services are\nregarded as competitive tool (Nsiah & Mensah, 2014).I\n\nn other words, the banking sector attracts customers by offering high-quality services.S\n\nimilarly, within\nthe healthcare sector, service quality encompasses the provision of what patients\n\ndesire (patient quality) and what they require (professional quality) while optimizing resource utilization and minimizing errors to ensure their ongoing patronage (Mosadeghrad, 2014). Previous studies have confirmed the connection\nbetween service quality and customer retention (Althonayan et al., 2015; Nsiah\n& Mensah, 2014; Saeed et al., 2005; Uslu & Eren, 2020).\nFurthermore, a great deal of research has examined the connection between\nclient retention and loyalty (Oliver, 1999). When faced with situational influences and marketing campaigns that may tempt one to switch, customers who\nexhibit loyalty will repeatedly purchase the same brand or product within the\nsame category. This deep commitment to repurchasing a preferred product or\nservice in the future is what defines customer loyalty. Thomas and Tobe (2012)\nadvocate that “loyalty is more profitable,” since it is significantly more expensive\nto acquire new customers than it is to keep existing ones. In addition to sticking\nwith a company, devoted consumers act as brand ambassadors, encouraging\nothers to buy from it and make thoughtful choices before looking at other options. Customer loyalty can be cultivated over time through multiple transactions (Khadka & Maharjan, 2017).\nPrivate healthcare providers are viewed as more competitive than public\nhealthcare providers because they have qualified and competent healthcare providers. Being the closest to community members, they are the main source of\nhealth care, thus extending health care services including required medicines\ncloser to Ugandans (Martini et al., 2007), and filling gaps where little or no public health care is available. Nevertheless, these private healthcare providers have\nstruggled to maintain their customer base, as customers appear to be transitioning from one healthcare facility to another in search of improved services.\nCustomer retention is crucial for businesses, including private healthcare providers in Mbarara City, where most customers are new and repeat (Ali et al.,\n2010). This trend, evidenced by the closure and relocation of health centres such\nas the Rwebikona Clinic and Rubindi Pharmacy in 2020, could lead to more\nclosures if not addressed (Ali et al., 2010; Shashikala & Ashwini, 2015). Previous\nstudies on customer retention have focused on different sectors and developed\ncountries, leaving a knowledge gap in developing countries, such as Uganda.\nThis study aims to fill this gap by exploring the relationship between service\nquality, customer loyalty, and customer retention in Mbarara’s private health\ncare sector.\n2. Literature Review\n2.1. Customer Retention\nAccording to Hume et al. (2007), customer retention is characterized by customers’ willingness to partake in future interactions with a service provider, encompassing the particular nature of these forthcoming interactions. Hume et al.\n(2007) also posit that customer retention is a direct result of consumer attitudes\nand behaviors in response to the services they receive. Essentially, it can be con-", "word_count": 502, "start_char": 5502, "end_char": 8916}
{"chunk_id": "DOC0024__00003", "doc_id": "DOC0024", "chunk_index": 3, "text": "ume et al.\n(2007) also posit that customer retention is a direct result of consumer attitudes\nand behaviors in response to the services they receive.E\n\nssentially, it can be con-\n\ncluded that the desire to repurchase is rooted in consumers’ willingness to make\nrepeat purchases or return to the same organization.\nA company’s customer retention rate is determined by dividing the total\nnumber of active customers by the proportion of the remaining customers at the\nstart of the fiscal year (Ali et al., 2010). Oliver (2014) characterizes customer retention as a robust and long-lasting pledge to regularly repurchase a favoured\ngood or service in the future. It encompasses actions taken by a selling organization to mitigate customer defects. Successful customer retention efforts commence from the initial interaction a company has with a customer and persist\nthroughout the entire duration of the customer relationship. Essentially, customer retention focuses on maintaining a business relationship between a supplier and a customer (Duffy, 2003).\nMoreover, the customer retention rate is defined by Buchanan and Gillies\n(1990) as the percentage of consumers who were part of the customer base at the\nbeginning of a specific term, such as a year, and who continue to be customers\nafter that same period. This metric offers a quantitative measure of a business’s\nability to retain customers over a specific timeframe. This definition aligns with\nMotiwala (2005), which emphasizes that customer retention entails maintaining\nthe current customer base by cultivating positive relationships with individuals\nwho purchase a small business’s products or services. The primary goal of customer retention is to minimize the loss of profitable customers, aiming for zero\ndefects, as outlined by Richards (1996). This signifies sustained commitment\nfrom both the customer and firm to preserve the relationship. Customer retention focuses on recurring patronage, which is closely associated with repeat\npurchasing behaviour and brand loyalty (Osarenkhoe et al., 2017). Komunda et\nal. (2015) assert that retained customers are individuals who persistently remain\nloyal to the company. Customer retention dimensions include repeated purchases and referrals to other buyers, where repeated purchases are the continuous purchase of a product or service from the same seller. Referral to other buyers is the act of the existing customer to encourage others to buy from where\nthey buy.\n2.2. Service Quality\nService quality, as defined by Bitner (2018), represents a consumer’s holistic\njudgment of the relative excellence or inferiority of an organization and its services. Service quality, as well as quality in a broader sense, is defined as the value\nof a service from the customer’s perspective. The shared elements of service\nquality—reliability, responsiveness, empathy, personalization, competence, diligence, consistency, safety, security, environmental variables, and user interfaces—are in line with this viewpoint (Ali, 2021; Ali & Anwar, 2021; Faraj et al.,\n2021).\nRecognizing the imperative of achieving customer satisfaction and loyalty\nthrough the delivery of higher-quality services, Ali et al. (2021), Rajeswari et al.\n(2017), and Shava (2021) emphasize the continuous efforts of service providers.", "word_count": 491, "start_char": 8738, "end_char": 12039}
{"chunk_id": "DOC0024__00004", "doc_id": "DOC0024", "chunk_index": 4, "text": "ecognizing the imperative of achieving customer satisfaction and loyalty\nthrough the delivery of higher-quality services, Ali et al. (2021), Rajeswari et al.\n(2017), and Shava (2021) emphasize the continuous efforts of service providers.\n\nHighlighting the significance of addressing individual customer needs to enhance satisfaction, Bolton and Drew (1991) stress the importance of customized\nservices. In various service industries such as telecommunications, the focus is\nincreasingly on providing exceptional customer service to maximize satisfaction,\nas noted by Sharma and Jhamb (2017).\nWithin the domain of customer service quality, Karatepe (2011) utilized a\nmodified SERVQUAL framework and identified network efficiency as the most\ninfluential factor, whereas staff responsiveness had room for enhancement because it had the least impact. Al-Aali et al. (2011) added network quality and\ncompetitive advantage to the SERVQUAL framework, extending it. However,\nKadasah (2016) evaluated the service quality of several telecom companies using\nSERVQUAL and found that Mobily was the best in all areas of service provision.\nWhen Bora et al. (2015) included network quality in SERVQUAL in an Indian\nsetting, they found a significant and positive correlation between all aspects and\ncustomer satisfaction. Furthermore, gender differences were observed in the\nevaluation of empathy, responsiveness, and dependability among Indian telecom\nservice users. Similarly, SERVQUAL was used by Suguanthi and Shanthi (2017)\nand Sharma and Jhamb (2017) to examine the relationship between customer\nhappiness and service quality in India.\nSimilarly, Ali et al. (2021) emphasized that concerning service quality, five\ncritical dimensions profoundly influence customer satisfaction. Tangibility is\nsignificant among these dimensions. This is because there exists a connection\nbetween customers and tangibility, where the tangible aspects of a service draw\ncustomers’ attention to service quality by aligning the tangible elements associated with the service provided. Tangibility involves physical presence, hardware,\nstaff, and communication materials, all of which contribute to perceptions of\nservice quality.\nReliability involves the consistent and accurate delivery of promised services.\nCustomers prefer to interact with businesses or companies that are dependable\nand true of their commitments, particularly concerning service guarantees and\nessential support elements. Customers value and prioritize reliability in any\nbusiness environment (Ali et al., 2021). Responsiveness is another crucial aspect\nthat directly impacts customer experience. This dimension relates to the willingness to promptly assist and provide customers with fast service (Ali et al.,\n2021). Assurance pertains to confidence and trust in customers. This implies\nthat any business or market entity must possess the necessary capabilities to inspire customers with a strong sense of confidence and trust (Suguanthi & Shanthi, 2017).\nEmpathy represents another dimension characterized by two vital components: trust and attentive care. Empathy is closely tied to customer attention and\nserves to reassure customers that a particular market or business entity is best\nsuited to satisfy their needs and foster strong customer loyalty through trust (Ali\net al., 2021). Essentially, it reflects the customer’s desire for quality products and\nservices and underscores the responsibility of businesses to cultivate a sense of", "word_count": 488, "start_char": 11802, "end_char": 15284}
{"chunk_id": "DOC0024__00005", "doc_id": "DOC0024", "chunk_index": 5, "text": "mpathy is closely tied to customer attention and\nserves to reassure customers that a particular market or business entity is best\nsuited to satisfy their needs and foster strong customer loyalty through trust (Ali\net al., 2021).E\n\nssentially, it reflects the customer’s desire for quality products and\nservices and underscores the responsibility of businesses to cultivate a sense of\n\ncomfort, trust, and loyalty.\nIn the context of healthcare, service quality is a broad term that includes all\nthe characteristics and elements of a good or service that affect its ability to meet\nexplicit or implicit demands. The quality of health care services encompasses\nmeeting the needs of both patients and professionals (professional quality); optimizing resource utilization; minimizing errors, delays, and inefficiencies; and\ncomplying with overarching regulations (management quality) (Korwar, 1997;\nSuguanthi & Shanthi, 2017).\n2.3. Customer Loyalty\nPearson (1996) defined customer loyalty as the mindset of customers who hold\nfavourable attitudes towards a company, commit to repurchasing the company’s\nproducts or services, and recommend them to others. Similarly, Oliver (1999)\ndefines loyalty as “a deeply held commitment to consistently repurchase a preferred product or service in the future, even in the face of situational influences\nand marketing efforts that may encourage switching behaviours.” Customer\nloyalty is recognized as a long-term asset and a crucial business outcome\n(Abu-Alhaija et al., 2018). Many companies consider having loyal customers as\nan essential strategy, given its significant role in establishing sustainable competitive advantages. Achieving customer loyalty involves identifying, managing,\nand meeting customer needs (Komunda et al., 2015). Companies can cultivate\nloyalty among their customers by providing superior value, exceptional services,\nand high-quality products (Rahman et al., 2012; Uslu & Eren, 2020). Remarkably, achieving customer loyalty in business organizations is heavily influenced by\nservice quality and customer satisfaction (Ehigie, 2006).\nIn the contemporary rapidly evolving market, the task of establishing and\nsustaining customer loyalty has grown more complex, largely owing to technological progress and the prevalent use of the Internet. To foster loyalty, businesses must place strong emphasis on the value of their products and services,\nshowing a sincere commitment to fulfilling customer needs and cultivating robust customer relationships (Uslu & Eren, 2020). Building a strong relationship\nwith customers is a critical element in fostering customer loyalty, which often\nrequires companies to function within a broader framework that goes beyond\ntheir primary expertise because no single company can excel in every facet\n(McDonald & Keen, 2000).\n2.4. Service Quality and Customer Loyalty.\nRajeswari et al. (2017) illustrate that when service providers enhance the quality\nof their services, customer loyalty tends to increase. Similarly, in a study conducted by Boohene and Agyapong (2011), which investigated the determinants\nof customer loyalty in Ghana, the importance of prioritizing service quality\nwithin telecommunication management was highlighted. They emphasized that\ngiven the intangible nature of services, service quality is commonly evaluated", "word_count": 471, "start_char": 14901, "end_char": 18223}
{"chunk_id": "DOC0024__00006", "doc_id": "DOC0024", "chunk_index": 6, "text": "imilarly, in a study conducted by Boohene and Agyapong (2011), which investigated the determinants\nof customer loyalty in Ghana, the importance of prioritizing service quality\nwithin telecommunication management was highlighted.T\n\nhey emphasized that\ngiven the intangible nature of services, service quality is commonly evaluated\n\nthrough the relationships between service providers and customers.\nThe study conducted by Parasuraman et al. (1988) underscores the positive\nand significant relationship between service quality and customer loyalty. It is\nimportant to note that service quality, with factors such as cost, assurance, responsiveness, and reliability following in that order, plays a central role in this\ncontext, which aligns with the findings of Parasuraman et al. (1994). Additionally, Nsiah and Mensah (2014) observed that satisfaction with product offerings\n(quality) is a primary driver of overall customer loyalty. In summary, a positive\nassociation exists between service quality and customer loyalty, and consistent\nresearch findings demonstrate the substantial impact of service quality on organizational outcomes, particularly fostering customer loyalty (Ehigie, 2006).\nMoreover, service quality influences customer loyalty through repurchase intentions (Levesque & McDougall, 1996). The success of a service provider is closely\ntied to the quality of the customer relationship, which in turn affects customer\nloyalty (Komunda et al., 2015). It is widely acknowledged that high service quality significantly leads to customer satisfaction and, consequently, customer loyalty (Duffy, 2003; Osarenkhoe et al., 2017).\nResearch conducted by Uslu and Eren (2020) establishes a positive relationship between customer loyalty and customer satisfaction. When customers perceive that their overall experience, encompassing service quality, ambience, and\nvalue for money, exceeds their expectations, they experience satisfaction, which\nin turn fosters customer loyalty and intentions to revisit. Factors contributing to\ncustomer loyalty include the quality of food, interpersonal relationships, social\nbonds, a pleasing environment, variety-seeking, dining experience, perceived\nvalue, switching costs, and price-value ratios. Similarly, Zhong and Moon (2020)\nillustrated that having dependable and trustworthy service personnel can create\na welcoming and pleasurable dining environment, which, in turn, encourages\npatron loyalty in quick-service restaurants. Providing services on time, being\ndependable, accurately charging customers, and other aspects all help foster a\nloyal customer base. Oliver (1980) highlights that each service interaction presents an opportunity to deliver exceptional service quality and sets the company\napart from its competitors in the quest for customer loyalty. The product, its attributes, performance, reliability, sales processes, and customer support all represent the vital components necessary to meet or surpass customer satisfaction.\nSatisfied customers typically return for repeat businesses and serve as advocates\nby sharing their positive experiences with potential customers (Komunda et al.,\n2015).\nCustomers frequently look for value in the entirety of the service, necessitating\ninternal cooperation among various departments responsible for different facets\nof the offering, which may include the core product (goods or services), product\ndelivery, product documentation, etc. Therefore, companies must strive to gain a\ndeeper understanding of their customers than they typically do. Building trust\nwith customers is essential for facilitating feedback collection from customers\n(Parasuraman et al., 1994). Several key factors come into play in customer loy-", "word_count": 502, "start_char": 17894, "end_char": 21613}
{"chunk_id": "DOC0024__00007", "doc_id": "DOC0024", "chunk_index": 7, "text": "herefore, companies must strive to gain a\ndeeper understanding of their customers than they typically do.B\n\nuilding trust\nwith customers is essential for facilitating feedback collection from customers\n(Parasuraman et al., 1994).S\n\neveral key factors come into play in customer loy-\n\nalty, with quality, reliability, empathy, responsiveness, and assurance being the\nprimary influencers. To foster customer loyalty, both Oliver (2014) and Osarenkhoe et al. (2017) emphasize that every service encounter presents a chance to deliver exceptional service quality, setting the company apart from its competitors.\nThe relationship between service quality and customer loyalty has not been\ncarefully studied or solidly proven, even though customer loyalty is crucial to a\nbusiness’s ability to survive (Ramzi & Mohamed, 2010).\n2.5. Service Quality and Customer Retention\nNumerous scholars (Ennew & Binks, 2005; Oliver, 1999; Ranaweera & Prabhu,\n2003; Venetis & Ghauri, 2004) have investigated the relationship between service\nquality and client retention. The results of their investigations regularly showed\na direct correlation between client retention and service excellence. In particular,\ntheir results emphasize that reliability, responsiveness, empathy, and security\nsignificantly impact customer retention (Murugiah & Akgam, 2015). Furthermore, these studies reveal that empathy is particularly significant in customer\nretention, as customers tend to gravitate towards private healthcare services that\ngenuinely prioritize their best interests. Customer retention is influenced by\nvarious factors, with service quality being the key driver in the purchase process.\nThis process is expected to yield customer satisfaction and commitment, leading\nto repeat purchases (Sari et al., 2018). Similarly, in multiple studies (Ranaweera\n& Prabhu, 2003; Saeed et al., 2005), service quality consistently emerged as a\npivotal factor in retaining customers. These results indicate that service quality\nhas a positive and significant relationship with customer retention.\nReichheld and Kenny (1990) were among the first to draw attention to the\nobservable advantages of a business’s dedication to keeping consumers, asserting\nthat a higher retention rate translates into a higher net present value for customers. Within the service marketing domain, retaining customers is considered a\nway to improve the calibration of customer care. In today’s competitive market,\nlong-term survival depends on maintaining profitable long-term client relationships and consistently providing quality customer services. According to Wilson\n(1995), customer retention refers to a consistent effort on the client side and the\nbusiness to maintain the relationship. Better service quality encourages good\nbehavioural intentions, which in turn helps customer retention (Nsiah & Mensah, 2014).\nEvidently, the effectiveness of customer service levels enhances customer retention, reduces customer switching between service providers, and provides a\ncompetitive advantage over other competitors. In the past, customer retention\nstrategies were often overshadowed by the primary focus on attracting new customers, with marketing professionals downplaying their significance. However,\ncompanies that continually acquire new customers without retaining them are\nunlikely to achieve positive outcomes, emphasizing the vital role of customer retention in the current business landscape. The relationship between customers\nand banks appears to be influenced by two distinct factors: social bonds, repre-", "word_count": 490, "start_char": 21331, "end_char": 24893}
{"chunk_id": "DOC0024__00008", "doc_id": "DOC0024", "chunk_index": 8, "text": "owever,\ncompanies that continually acquire new customers without retaining them are\nunlikely to achieve positive outcomes, emphasizing the vital role of customer retention in the current business landscape.T\n\nhe relationship between customers\nand banks appears to be influenced by two distinct factors: social bonds, repre-\n\nsenting relational components that foster direct relationships, and structural\nbonds, which provide insights into the structural components of the parties involved. As noted by Patterson et al. (1997), the service market is becoming progressively competitive, characterized by heightened price competition and the\nreadiness of customers to change their loyalties.\nService quality is linked to customer loyalty through repurchase intentions\n(Levesque & McDougall, 1996; Parasuraman et al., 1988). Enhancing customer\nretention not only benefits the retention of existing customers but also aids in\nacquiring new ones. Loyal customers are more likely to engage in word-ofmouth advertising because of their positive attitude towards their current provider. Reichheld and Kenny (1990) discovered that between 20% and 40% of\nnew customers select a bank based on the referrals. van Riel et al. (2001) categorized services into five distinct elements: user interface, auxiliary services, supporting services, core services, and complementary services. This finding highlights the fact that service quality is mostly determined by perceptions. This underscores the need for businesses to proactively assess how they deliver highquality services that not only fulfil but also surpass customer expectations\nthrough direct input. The dominant view in the field of service quality suggests a\npositive relationship between customer loyalty and repeat purchases (Storbacka\net al., 1994). Furthermore, research by Gounaris (2005) showed a strong correlation between customer trust and service quality in terms of attracting and retaining new customers. Additionally, because clients know that they can rely on\na reputable company, trust reduces uncertainty in a situation where they feel\nexposed (Aydin & Özer, 2006). Under the influence of trust, one is willing to\nrepurchase from a company (Jarvenpaa et al., 2000).\n2.6. Customer Loyalty and Customer Retention\nSeth et al. (2005) highlighted the interchangeable use of the terms “customer\nloyalty” and “customer retention,” while (Gerpott et al., 2001) argued that these\nconcepts are distinct. In today’s service business landscape, success hinges on\nretention and long-term focus on existing customers, particularly since a select\nfew brands manage to cultivate loyalty at high levels (Jarvis & Goodman, 2005).\nUlaga and Eggert (2006) propose that loyalty is contingent upon certain incentives offered by companies to their customers. Consequently, extensive research has explored the impact of customer loyalty on firms, given its positive\ninfluence on repeat purchases (Oliver, 1999; Ulaga & Eggert, 2006). Loyalty can\nmanifest through behavioural patterns, such as frequent purchases of specific\nproducts or brands, as well as attitudinal aspects, including emerging consumer\nattitudes and preferences. Hence, loyalty programs have been thoroughly examined by both researchers and industry professionals because of their potential to\ngenerate positive impacts on repeat purchases from the same service provider\n(Craft, 2007). These loyalty programs empower firms to enhance customer retention and encourage customer recommendations (Ha, 2007).", "word_count": 499, "start_char": 24570, "end_char": 28078}
{"chunk_id": "DOC0024__00009", "doc_id": "DOC0024", "chunk_index": 9, "text": "ence, loyalty programs have been thoroughly examined by both researchers and industry professionals because of their potential to\ngenerate positive impacts on repeat purchases from the same service provider\n(Craft, 2007).T\n\nhese loyalty programs empower firms to enhance customer retention and encourage customer recommendations (Ha, 2007).\n\nDick and Basu (1994) research revealed that highly loyal customers tend to\nreduce their motivation to seek new brands, leading to a diminished inclination\nto choose other brands and reduced effort in the decision-making process. Research has consistently shown that positive consumption experiences and accumulation of trust strongly influence repeat purchase intentions among loyal\ncustomers. Additionally, the diffusion of trust in specific firms tends to reduce\nperceived risk when purchasing other services from the same company, thus increasing repeat purchases of the same brand.\nAnother crucial aspect of loyal customers is their consistent and frequent\npurchase of preferred services or products. Thomas and Tobe (2012) highlighted\nthe notion that “loyalty is more profitable.” Gaining a new customer is significantly more expensive than maintaining an existing customer. Loyal consumers\nnot only persuade others to buy from you but also carefully analyze their options\nbefore thinking about switching to other businesses. Customer loyalty is developed through thoughtful sourcing and design choices, not through happenstance. Adopting customer-centric strategies that consider the requirements and\npreferences of the service recipient is necessary for cultivating client loyalty.\nCustomer loyalty develops over time in multiple transactions. Osarenkhoe et al.\n(2017) highlighted that serving a loyal customer costs five to six times less than\nacquiring a new customer, highlighting the importance of customer loyalty.\nWalsh et al. (2012) emphasize the prudence of prioritizing existing customers\nbefore pursuing new ones. Furthermore, customer retention represents the future inclination of customers to remain faithful and loyal to the use of goods or\nservices (Ranaweera & Prabhu, 2003).\nAccording to Agyei and Kilika (2013) and Komunda et al. (2015), loyal customers exhibit greater tolerance for negative customer experiences and greater\nwillingness to purchase other products. Customer retention is a strategy used to\ntransform customer behaviour, shifting it from defection to loyalty or fostering a\nstrong, long-term relationship with the company (Hasan et al., 2013). This\ntransformation is often based on trust built in the products and services offered\nby a particular organization. However, Aspinall et al. (2001) argue that customer\nacquisition is not as crucial as client retention. The study conducted by Payne\nand Frow (2018) revealed that in UK enterprises, client retention accounts for\nonly 23% of the marketing budget. To have a competitive edge in the market—a\ncrucial component of any business’s survival—many companies have also implemented client retention tactics (Komunda et al., 2015). Hanks (2007) also\npointed out that a 5% improvement in client retention might provide a massive\n75% boost in profitability. However, not all businesses place the same emphasis\non establishing and sustaining strong relationships with every client because not\nall relationships and customers are profitable or consistent (Chen & Popovich,\n2003). Reichheld and Kenny (1990) have also observed that many firms concentrate on current-period revenues and costs, often overlooking the potential cash\nflows generated over their customers’ lifetimes.", "word_count": 518, "start_char": 27738, "end_char": 31342}
{"chunk_id": "DOC0024__00010", "doc_id": "DOC0024", "chunk_index": 10, "text": "owever, not all businesses place the same emphasis\non establishing and sustaining strong relationships with every client because not\nall relationships and customers are profitable or consistent (Chen & Popovich,\n2003).R\n\neichheld and Kenny (1990) have also observed that many firms concentrate on current-period revenues and costs, often overlooking the potential cash\nflows generated over their customers’ lifetimes.\n\n2.7. Conceptual Framework\nThe conceptual model that guided this study was largely influenced by the studies of Parasuraman et al. (1988) and Ranaweera and Prabhu (2003). This study\nfocuses on the potential of service quality and customer loyalty as predictors of\ncustomer retention among healthcare providers in Mbarara City, as shown in\nFigure 1.\nWhen private healthcare providers implement strategies that ensure quality\nservices, such as tangibles, responsiveness, empathy, and assurance, customers’\nbehaviour, emotions, and love for the business change and grow, allowing them\nto make repeat purchases and recommend the business to others. Additionally,\nimproved service quality through tangibles, reliability, and assurance also improves the effectiveness and positive attitudes towards the company’s products\nand services. Furthermore, customers are more likely to make repeat purchases\nand recommend the business’s services and goods to others when they grow to\nhave a favourable attitude and enthusiasm for what the company has to offer.\nFinally, improved service quality and customer loyalty lead to repeated purchases and referrals of other customers to the company’s services and products.\nIt can be realized from the above extant literature that service quality, customer loyalty and customer retention are correlated. The literature on service\nquality identifies traits such as tangibles, empathy, responsiveness, assurance,\nand reliability as the major factors that influence customer retention because\nthey enable customers to hang on to the organization. The literature on customer loyalty identifies honesty, trust, and integrity as the determinants of customer retention. Customer retention can be enhanced by optimizing these indicators. Nevertheless, uncertainty remains regarding the specific variables that\ncan act as proxies for customer retention. Therefore, this study is necessary to\nbridge this gap in the literature. Moreover, prior research has primarily examined the independent and dependent variables separately, whereas there is a lack\nof literature on all three variables combined. This study aims to rectify this gap\n\nSource: (Parasuraman et al., 1988) and (Ranaweera & Prabhu, 2003).\nFigure 1. Conceputal framework developed from the review of the literature.", "word_count": 387, "start_char": 30925, "end_char": 33639}
{"chunk_id": "DOC0024__00011", "doc_id": "DOC0024", "chunk_index": 11, "text": "oreover, prior research has primarily examined the independent and dependent variables separately, whereas there is a lack\nof literature on all three variables combined.T\n\nhis study aims to rectify this gap\n\nSource: (Parasuraman et al., 1988) and (Ranaweera & Prabhu, 2003).F\n\nigure 1.C\n\nonceputal framework developed from the review of the literature.\n\nby exploring the relationship between service quality, customer loyalty, and customer retention among private healthcare providers in Mbarara City.\n3. Methods\n3.1. Research Design\nAccording to Amin (2005), a research design is an all-inclusive plan or approach\nused to conduct research. This study used a cross-sectional design, which involved gathering data at a particular moment in time. This design was mostly\nselected using a questionnaire survey because it is economical, efficient, and\nsimple to apply. The cross-sectional design makes it possible to gather important\ndata in a comparatively short amount of time (Sedgwick, 2014).\n3.2. The Study Population\nThe study population for this research study included the thirty-eight (38) active\nprivate healthcare providers in Mbarara City (Ministry of Health, 2018). Private\nhealthcare centres were selected because they are accessed by all people, but\nmany have failed to retain customers. The unit of analysis was the private health\ncentres in Mbarara and patients over the years as a unit of inquiry since they are\nadults and have good reasons for visiting a particular health centre.\n3.3. Sample Size and Selection Procedure\nThe sample size for this study, which included 36 private health centres, was determined using the Krejcie and Morgan (1970) table for sample size determination. The sample was selected using simple random sampling. Specifically, a lottery method was employed whereby a list of health centres was first obtained,\nfollowed by the allocation of a unique number to each health centre, writing the\nnumbers and names on individual pieces of paper, and placing them in a box.\nThe pieces of paper were then picked without replacement until a total of 36\nhealth centres were established. As health centres are the unit of analysis, they\ncannot answer questionnaires by themselves. Four (4) patients from each of the\n36 health centres were requested to complete the questionnaires.\n3.4. Source of Data and Data Collection Instrument\nThe main source of data was primary data collected through self-administered\nquestionnaires distributed to the patients. These questionnaires encompassed\nvarious aspects, including information related to respondents’ demographics\nand the specific characteristics of the healthcare centres. The questionnaire also\nincluded questions on customer loyalty, customer retention, and service quality.\nResponses to continuous variables were recorded on a 5-point Likert scale. The\nquestionnaire design was aligned with the guidelines provided by scholars, such\nas Sekaran and Bougie (2016). To ensure the tool’s reliability and validity, a preliminary version was pretested before the final survey was conducted. The\nitems used to measure the study variables were adapted from previous schol-", "word_count": 471, "start_char": 33287, "end_char": 36431}
{"chunk_id": "DOC0024__00012", "doc_id": "DOC0024", "chunk_index": 12, "text": "esponses to continuous variables were recorded on a 5-point Likert scale.T\n\nhe\nquestionnaire design was aligned with the guidelines provided by scholars, such\nas Sekaran and Bougie (2016).T\n\no ensure the tool’s reliability and validity, a preliminary version was pretested before the final survey was conducted.T\n\nhe\nitems used to measure the study variables were adapted from previous schol-\n\narly work.\n3.5. Validity Tests\nValidity refers to whether an instrument measures what it was designed to\nmeasure, and is one way of trying to ensure that the measurement error is kept\nto a minimum (Field, 2013). A content validity test was used in this study to assess the degree to which individual items in the questionnaire represented the\nconstructs being measured (Field, 2013). Experts, experienced researchers, and\nacademics were asked to rate the relevance of the items in the instrument. The\ncontent validity index (CVI) for each variable 0.7 is the recommended cut-off\npoint (Field, 2013).\n3.6. Reliability Tests\nAccording to Field (2013), a measure’s reliability is its capacity to yield consistent outcomes when applied to the same circumstances. In this study, the internal consistency of the scales was assessed using Cronbach’s alpha (α), a widely\nused and trustworthy reliability metric. According to the criteria established by\nNunnally (1978) and De Vellis (2003), an alpha coefficient cutoff point of 0.7\nprovides adequate evidence that the item scales are both consistent and reliable,\nthus allowing us to infer that the instrument demonstrated reliability. The instrument was pilot tested among health centres in Kabale Municipality, and the\nreliability results are shown in Table 1.\n3.7. Data Processing and Analysis\nData from the field were cleaned to ensure completeness. This is followed by\ntesting the regression assumptions. Next, the relationships between variables\nwere tested using correlation and regression analyses. This is detailed as follows:\n3.7.1. Data Cleaning\nThe collected data were edited first to identify and eliminate errors, the information was categorized according to its different nature and then well coded, and\nresponses were entered into the Statistical Package for Social Scientists (SPSS)\nVersion 21. An outlier check was conducted using minimum and maximum\nfrequency counts, means, and scatter plots. Outliers are values outside the range\nof the measurement scale (Field, 2013). Based on this analysis, a few identified\noutliers were due to data entry errors and were deleted. Parametric assumption\n\nTable 1. Validity and reliability results.\nVariable\nCronbach Alpha\nCoefficient (α)\nContent Validity\nIndex\nNumber\nof Items\nService Quality\n.751\n.886\nCustomer Loyalty\n.702\n.853\nCustomer Retention\n.774\n.898", "word_count": 417, "start_char": 36039, "end_char": 38790}
{"chunk_id": "DOC0024__00013", "doc_id": "DOC0024", "chunk_index": 13, "text": "utliers are values outside the range\nof the measurement scale (Field, 2013).B\n\nased on this analysis, a few identified\noutliers were due to data entry errors and were deleted.P\n\narametric assumption\n\nTable 1.V\n\nalidity and reliability results.V\n\nariable\nCronbach Alpha\nCoefficient (α)\nContent Validity\nIndex\nNumber\nof Items\nService Quality\n.751\n.886\nCustomer Loyalty\n.702\n.853\nCustomer Retention\n.774\n.898\n\ntests were also performed. This was necessary, given the conceptualization of the\nstudy. Conceptualization required the use of parametric analyses, such as correlation and regression. However, these analyses depend on parametric assumptions. The researcher tested for normal data distribution, variance homogeneity,\ndata linearity, and the absence of multicollinearity, which are critical for further\nstatistical analyses. These tests were conducted according to the recommendations of Hair et al. (1987). Evaluation of these assumptions is essential because\nthe validity of the findings drawn from statistical analyses relies on the soundness of these assumptions. Parametric tests were performed to confirm that the\nsample met the criteria for the parametric data. Subsequently, correlation and\nregression analyses were conducted to explore the relationships among the study\nvariables.\n3.7.2. Data Analysis\nData analysis involved descriptive statistics, correlations, and regressions. Pearson’s correlation coefficient was used to evaluate the association between the\nstudy variables. Ordinary least squares regression was used to assess the predictive power of the conceptualized model. The results are then presented in the\nfollowing section.\n3.8. Ethical Considerations\nThe participants were made aware, to protect their privacy, that the study did\nnot require their names (Mugenda & Mugenda, 2003a, 2003b). The respondents\nwere also informed that any information they submitted would only be used for\nacademic purposes, and that any information about personal matters would be\nhandled with the highest discretion to ensure anonymity (Amin, 2005). Before\nconducting the study, the researcher made all efforts to obtain approval from the\nMbarara City Health Office (CHO) and health care providers. The researcher\nacknowledges and credits the work of other researchers.\n4. Results\n4.1. Demographic Characteristics of the Respondents\nThe following details about the respondents’ demographic profiles were requested: sex, age range, educational attainment, and marital status.\nThe results in Table 2 indicate that most of the respondents were female\n(68.1%) and the males were 31.9%. This implies that women tend to visit health\ncentres more often than men. In addition, women tended to take children to\nprivate health care services compared to men, which h is why they were more in\nthe study.\nThe results in Table 2 indicate that most of the respondents were between 31 -\n40 years (43.5%), followed by those between 21 - 30 years (23.9%). These findings imply that most of the individuals who go for healthcare services are mature\nand responsible parents who are normally above 25 years of age, and these provided true information about the study variables.", "word_count": 469, "start_char": 38385, "end_char": 41551}
{"chunk_id": "DOC0024__00014", "doc_id": "DOC0024", "chunk_index": 14, "text": "hese findings imply that most of the individuals who go for healthcare services are mature\nand responsible parents who are normally above 25 years of age, and these provided true information about the study variables.\n\nTable 2. Gender of the respondents.\nVariable\nItem\nFrequency\nPercent\nGender\nMale\n31.9\nFemale\n68.1\nAge group\n10 - 20\n5.1\n21 - 30\n23.9\n31 - 40\n43.5\n41 - 50\n11.6\nAbove 50\n15.9\nLevel of Education\nPrimary certificate\n5.1\nSecondary certificate\n10.1\nCollege certificate\n12.3\nDiploma\n28.3\nBachelors and above\n44.2\nMarital status\nMarried\n63.0\nSingle\n31.9\nDivorced\n5.1\nTime spent as a\ncustomer\nLess than 1 year\n33.3\n2 - 5 years\n35.5\n6 - 10 years\n24.6\nMore than 10 years\n6.5\nSource: Primary data.\n\nThe results in Table 2 indicate that most of the respondents were degree\nholders and above (44.2%), followed by diploma holders (28.3%), and the least\ngroup had primary-level certificates (5.1%). These findings imply that most of\nthe individuals who access private health care are the elite class who do not want\nto waste a lot of time waiting for government services, and these gave a clear\npicture of the status of private health centres.\nThe results in Table 2 indicate that most of the respondents were married\n(63.0%), followed by singles (31.9%), and the least divorced (5.1%). These results\nimply that most married people have health-related problems because they typically have young children who are prone to diseases.\nThe results in Table 2 indicate that customers had spent 2-5 years (35.5%),\nfollowed by those who had spent less than 1 year (33.3%), and the least group\nhad spent more than 10 years (6.5%). These findings imply that most of the customers provided information that was relevant to the study subject since they\nhad spent more than two years providing health care services in private health\ncentres. Those customers who had spent one year also had information about", "word_count": 322, "start_char": 41334, "end_char": 43230}
{"chunk_id": "DOC0024__00015", "doc_id": "DOC0024", "chunk_index": 15, "text": "hese findings imply that most of the customers provided information that was relevant to the study subject since they\nhad spent more than two years providing health care services in private health\ncentres.T\n\nhose customers who had spent one year also had information about\n\nwhere they had left where they were getting their services before, and this provided valid information to make a recommendable conclusion about customer\nretention.\n4.2. Correlation Analysis\nA zero-order correlation analysis was conducted to establish the association between the independent variables (service quality and customer loyalty) and dependent variable (customer retention). The results are presented in Table 3.\nThe results in Table 3 show a significant positive relationship between service\nquality and customer retention among private healthcare providers in Mbarara\nCity (r = .557**, p < .01). This means that any positive change in service quality\nresults in a positive change in customer retention. Additionally, the results further imply that any improvement in tangibility, reliability, responsiveness, assurance, and empathy would result in a positive change in customer retention\nThe results in Table 3 show that there is a significant positive relationship\nbetween service quality and customer loyalty among private healthcare providers\nin Mbarara City (r = .660**, p < .01). This means that any positive change in service quality results in a positive change in customer loyalty. In addition, the results imply that any improvement in tangibility, reliability, responsiveness, assurance, and empathy would result in a positive change in customer loyalty\nThe results in Table 3 show a significant positive relationship between customer loyalty and customer retention among private healthcare providers in\n\nTable 3. Zero-order correlation results.\nVariables\nTangibility (1)\n\nReliability (2)\n.007\n\nResponsiveness (3)\n.186*\n.757**\n\nAssurance (4)\n.213*\n.614** .754**\n\nEmpathy (5)\n.150\n.720** .752** .720**\n\nService Quality (6)\n.266** .748** .741** .646** .677**\n\nBehaviour (7)\n.182*\n.762** .607** .750** .771** .659**\n\nAffective (8)\n.363** .290** .358** .425** .380** .408** .440**\n\nCognitive (9)\n.295**\n.176*\n.286** .297** .259** .295** .289** .472**\n\nCustomer Loyalty (10)\n.367** .520** .608** .628** .600** .660** .734** .798** .658**\n\nRepeated purchase (11) .466** .307** .556** .603** .400** .531** .558** .679** .488** .755**\n\nReferral (12)\n.467** .288** .496** .436** .545** .515** .430** .636** .466** .673** .761**\n\nCustomer Retention (13) .497** .316** .560** .552** .505** .557** .525** .700** .508** .760** .736** .741**\nSource: Primary data.", "word_count": 383, "start_char": 42958, "end_char": 45603}
{"chunk_id": "DOC0024__00016", "doc_id": "DOC0024", "chunk_index": 16, "text": "Mbarara City (r = .760**, p < .01). This means that any positive change in customer loyalty results in a positive change in customer retention. In addition, the\nresults further imply that any improvement in behaviour, affective, and cognitive\namong customers would result in a positive change in customer retention\n4.3. Ordinary Least Square Regression\nRegression analysis was used to confirm the relationship between service quality,\ncustomer loyalty, and customer retention, as they are three variables. The results\nare presented in Table 4.\nThe results in Table 4 indicate that service quality was found to be an insignificant predictor of customer retention among private health centres in\nMbarara City, as indicated by a probability value below the 95% level of confidence (Beta = .098, p < .05). This implies that a positive change in service quality\nmay not necessarily improve customer retention. The results further indicated\nthat customer loyalty was a significant predictor of customer retention, as indicated by a significance level of above 95% level of confidence (Beta = .695, p\n< .01). This implies that a unit increase in customer loyalty results in a .695 unit\nincrease in customer retention.\nFinally, the results indicate that 57.7% (Adjusted R Square = .557) of the\nvariations in customer retention were a result of changes in service quality and\ncustomer loyalty. This also implies that 44.3% of the changes in customer retention were due to other factors not considered in this study, such as customers’\nlevel of income and customer awareness of private services in Mbarara city.\n5. Discussion\nThe correlation findings indicated a significant relationship between service\nquality and customer retention; however, the regression results demonstrated\nthat service quality does not serve as a significant predictor of customer retention\namong private healthcare providers. The findings indicate that improvements in\n\nTable 4. Ordinary least square regression.\nModel\n\nUnstandardized\nCoefficients\nStandardized\nCoefficients\nBeta\nT\nSig.\nB\nStd. Error\n(Constant)\n−.611\n.305\n\n−2.004\n.047\n\nService Quality\n.149\n.112\n.098\n1.332\n.185\n\nCustomer\nLoyalty\n.986\n.105\n.695\n9.406\n.000\nModel summary: R = 0.764. R Square = 0.584, Adjusted R Square = 0.577, F-Sat =\n94.580, Sig = 0.000\naDependent Variable: Customer Retention.", "word_count": 359, "start_char": 45603, "end_char": 47929}
{"chunk_id": "DOC0024__00017", "doc_id": "DOC0024", "chunk_index": 17, "text": "rdinary least square regression.M\n\nodel\n\nUnstandardized\nCoefficients\nStandardized\nCoefficients\nBeta\nT\nSig.B\n\nStd.E\n\nrror\n(Constant)\n−.611\n.305\n\n−2.004\n.047\n\nService Quality\n.149\n.112\n.098\n1.332\n.185\n\nCustomer\nLoyalty\n.986\n.105\n.695\n9.406\n.000\nModel summary: R = 0.764.R\n\nSquare = 0.584, Adjusted R Square = 0.577, F-Sat =\n94.580, Sig = 0.000\naDependent Variable: Customer Retention.\n\nservice quality in terms of tangibility, reliability, responsiveness, assurance, and\nempathy may not necessarily improve customer retention among private\nhealthcare providers in Mbarara City.\nThis can be attributed to the nature and conduct of the people in the western\nregion of Uganda. Anecdotal evidence shows that most Westerners are arrogant,\nnot empathetic, have the “I don’t care” attitude, and customer care is next to\nimpossible. As such, there is evidence that most health centres lack food for their\npatients; if it is there, it is of poor quality; there is the issue of opening late, staff\nnot minding the emergencies, staff taking their time, the places are not that tidy,\nit is rare for patients to get apologies for the inconveniences caused, etc. In short,\npatients rarely obtain the value of the money they expect.\nThese results contrast with the findings of Oliver (1999) and Ranaweera and\nPrabhu (2003) which indicated a direct relationship between service quality and\ncustomer retention. Their studies demonstrated that attributes such as reliability, responsiveness, empathy, and security have a substantial impact on customer\nretention (Komunda et al., 2015). Furthermore, their findings point to a significant connection between empathy and customer retention, suggesting that individuals Favor private healthcare services that genuinely prioritize their wellbeing. Customer retention appears to be influenced by multiple factors, with\nservice quality being a crucial element shaping the dynamics of a purchase\ntransaction.\nCorrelation analysis revealed a strong relationship between customer loyalty\nand service excellence. Nonetheless, the findings of the regression analysis indicated that, among private healthcare providers, client loyalty may not be significantly predicted by service quality. These results suggest that improving client\nloyalty within the private healthcare sector in Mbarara City may not always follow improving components of service quality, such as tangibility, reliability, responsiveness, assurance, and empathy.\nThis implies that the improvement of tangible equipment in terms of having\nupdated machines, a clean environment of the health facility, having enough\nrooms in the health centre, and having properly qualified nurses will result in an\nimprovement in customer loyalty. In addition, when the services of the health\nfacility are reliable in terms of staff doing the right thing at the right time, the\nhealth centre is well located in the most accessible place and keeps the patients’\nrecords properly for easy accessibility, which will result in an improvement in\ncustomer loyalty.\nFurthermore, when activities related to responsiveness to the client’s needs are\nfocused on, in terms of patients receiving prompt services from the health centre, staff giving clear explanations to the customers and employees at the health\ncentre being able to help every patient, this will lead to improved customer loyalty. Finally, when activities related to assurance and empathy for customers are\nimproved, customer loyalty will improve.\nThese results are consistent with those of the study conducted by Suguanthi", "word_count": 525, "start_char": 47547, "end_char": 51093}
{"chunk_id": "DOC0024__00018", "doc_id": "DOC0024", "chunk_index": 18, "text": "inally, when activities related to assurance and empathy for customers are\nimproved, customer loyalty will improve.T\n\nhese results are consistent with those of the study conducted by Suguanthi\n\nand Shanthi (2017), which similarly highlighted the positive correlation between\nservice quality and customer loyalty. Similarly, in an analysis by Boohene and\nAgyapong (2011) regarding customer loyalty in the context of telecommunication management in Ghana, they emphasized the significance of quality. They\nhighlighted that service firms that often lack tangible products are typically\nevaluated based on interactions between the service provider and customers.\nThis study found a strong positive correlation between service quality and\ncustomer loyalty. However, service quality is not a significant predictor of customer loyalty among private healthcare providers because service quality dimensions such as tangibles, which include healthcare infrastructure and reliability\nlike location, do not change the patient’s perception and feeling about the health\ncentre services since they are mostly convinced when they heal other than where\nthey are treated.\nThe correlation and regression findings confirm that customer loyalty has a\npositive and significant relationship with customer loyalty and customer retention. This implies that any improvement in activities related to the behaviour of\nhealth workers is improved in terms of decreasing the charges of health care,\nimproving the services at the health unit, and ensuring that the services offered\nare the best choice will result in customer retention. In addition, improvement\nin activities related to affect in terms of clients having a positive emotional relation to the health centre they have chosen, and customers considering themselves as loyal patrons of the health centre will result in improvement in customer retention. Finally, when customers are cognitive in terms of looking at the\nhealth centre as being different from others, saying positive things about the\nhealth centre, and being committed to the health centre, this will result in improvement in customer retention among private health care providers.\nThese results are in line with Seth et al. (2005), who pointed out that historically, the terms customer loyalty and customer retention have often been used\ninterchangeably, although Gerpott et al. (2001) argued that they represent distinct concepts. According to Jarvis and Goodman (2005), a small number of\nbrands can foster high levels of client loyalty; therefore, the secret to success in\nthe current environment of service organizations is to focus on long-term customer retention. Diller (2000) posited that loyalty may be contingent on the incentives provided by companies to their customers. Consequently, substantial\nresearch has explored the impact of customer loyalty on firms, given its positive\ninfluence on repeat purchases (Oliver, 1999).\n5.1. Conclusion\nIt can be concluded that service quality, measured in terms of tangibility, reliability, responsiveness, assurance, and empathy, may not necessarily improve\ncustomer retention among private healthcare providers in Mbarara City. Therefore, activities related to service quality may work in other cities that aim to improve customer retention, but not Mbarara, implying that emphasis may be", "word_count": 486, "start_char": 50901, "end_char": 54235}
{"chunk_id": "DOC0024__00019", "doc_id": "DOC0024", "chunk_index": 19, "text": "onclusion\nIt can be concluded that service quality, measured in terms of tangibility, reliability, responsiveness, assurance, and empathy, may not necessarily improve\ncustomer retention among private healthcare providers in Mbarara City.T\n\nherefore, activities related to service quality may work in other cities that aim to improve customer retention, but not Mbarara, implying that emphasis may be\n\nplaced on managerial issues of activities related to customer satisfaction to improve customer retention among the private health centres in Mbarara City.\nService quality is very important in improving customer loyalty, and according to the results, there is a confirmed positive significant relationship between\nthe two variables, which means that when one variable improves, the other also\nimproves. In addition, customer loyalty can be improved by increasing the\nequipment, reliability of the staff, and all the services needed and responsiveness\nof health workers.\nCustomer loyalty was also found to have a significant positive relationship\nwith customer retention among private healthcare centres in Mbarara City. This\nalso suggests that when customers exhibit positive behaviors towards services,\neffectiveness, and cognitive thinking, it will lead to an enhancement in customer\nretention among private health centres.\nGiven these results, private health centres should consider all variables as dependable indicators of customer retention. The outcomes of the regression\nmodel demonstrated the statistical significance of the overall model. Nevertheless, it is crucial to emphasize that a stronger emphasis should be placed on customer loyalty, as it explains a larger proportion of the variation in customer retention than in service quality.\n5.2. Recommendations\nThere is a need for private healthcare centre management to focus on service\nquality as it will improve customer loyalty. This means that activities related to\nthe reliability of the health staff, positive responsiveness of the doctors and other\nemployees in the health centres, ensuring that the patients are assured of quality\nservice, and equipping the health facility with the right machines that can test\nand treat any form of the disease will help improve customer loyalty.\nThere is also a need to increase customer loyalty in terms of making customers feel as if there is no other better place where they can obtain better services,\nensuring that customers can inform other clients about the services provided by\nthe same health facility, which will result in improvement in customer retention\namong private health centres.\nFinally, the predictor variables in this study accounted for 57.7% of the customer retention. This covers both predictor variables of the study. However, the\nremaining percentage may be attributed to factors other than those in this study.\nThis is because customer retention is affected by factors that differ from one\nprivate healthcare provider to another. Thus, it is important to consider a variety\nof factors rather than focusing only on the predictor variables in this study.\n5.3. Limitations and Areas of Further Research\nThis study employed a cross-sectional research design and collected data from a\nsingle point in time. As cross-sectional studies provide insights limited to the\ncurrent period, future research endeavours could contribute to the field’s", "word_count": 503, "start_char": 53836, "end_char": 57204}
{"chunk_id": "DOC0024__00020", "doc_id": "DOC0024", "chunk_index": 20, "text": "imitations and Areas of Further Research\nThis study employed a cross-sectional research design and collected data from a\nsingle point in time.A\n\ns cross-sectional studies provide insights limited to the\ncurrent period, future research endeavours could contribute to the field’s\n\nknowledge by employing a longitudinal research design. This would allow for an\nexamination of changes and developments over an extended period.\nThis study used a predominantly quantitative approach. Incorporating qualitative elements into this research would enrich the study by providing a deeper\nunderstanding of the subject matter.\nConflicts of Interest\nThe authors declare no conflicts of interest regarding the publication of this paper.", "word_count": 103, "start_char": 56927, "end_char": 57648}
