{"chunk_id": "DOC0167__00000", "doc_id": "DOC0167", "chunk_index": 0, "text": "Full Terms & Conditions of access and use can be found at\nhttps://www.tandfonline.com/action/journalInformation?journalCode=rajs20\nAfrican Journal of Science, Technology, Innovation and\nDevelopment\nISSN: (Print) (Online) Journal homepage: https://www.tandfonline.com/loi/rajs20\nUnderstanding ICT adoption amongst SMEs in\nUganda: Towards a participatory design model to\nenhance technology diffusion\nStephen Kyakulumbye & Shaun Pather\nTo cite this article: Stephen Kyakulumbye & Shaun Pather (2021): Understanding ICT\nadoption amongst SMEs in Uganda: Towards a participatory design model to enhance\ntechnology diffusion, African Journal of Science, Technology, Innovation and Development, DOI:\n10.1080/20421338.2020.1802843\nTo link to this article: https://doi.org/10.1080/20421338.2020.1802843\nPublished online: 19 Jan 2021.\nSubmit your article to this journal\nView related articles\nView Crossmark data", "word_count": 107, "start_char": 0, "end_char": 901}
{"chunk_id": "DOC0167__00001", "doc_id": "DOC0167", "chunk_index": 1, "text": "ubmit your article to this journal\nView related articles\nView Crossmark data\n\nUnderstanding ICT adoption amongst SMEs in Uganda: Towards a participatory design model\nto enhance technology diffusion\nStephen Kyakulumbye\nand Shaun Pather\n*\nDepartment of Information Systems, University of the Western Cape, South Africa\n*Corresponding author. Email: spather@uwc.ac.za\nPolicy statements by the United Nations, the African Union and most African countries boldly pronounce on the anticipated\nbenefits of the internetworked world and associated ICT to society in general and to the world of business specifically. In\nterms of the latter, Small and Medium Enterprises (SMEs) are recognized as being critical to the growth of developing\neconomies. There is consensus that this sector has considerable potential for improved business outcomes through the\nharnessing of Information and Communication Technologies (ICTs). However, a problem of low adoption of ICT in this\nsector still prevails in Africa and there is a gap in our understanding of the reasons for this. In light of this problem, this\npaper reports on a survey of Ugandan SME owners in which their ICT pre-usage beliefs and attitudes are explored. The\nstudy identified four pre-use factors that are correlated with ICT use. The pre-usage beliefs which significantly influence\ndecisions to adopt and use ICT include Benefit expectation, ICT learnability, User-confidence, and User-friendliness.\nThese are found to be key determinants of ICT adoption. ICT support and ease-of-use on the other hand were factors\nthat did not correlate with decisions to use ICT. However, it is found that there is a low predictive capability (17.7%) of\npre-usage beliefs and attitudes in respect of prior use or non-use of ICT among SMEs. As such, this study found that\nother contextual factors constitute a greater (82.3%) predictive percentage. In light of this, the paper concludes by\nrecommending an ICT participatory design process to mitigate ICT pre-use scepticism among SMEs owners.\nKey words: ICT adoption, antecedents, scepticism, technophobia, ICT pre-usage beliefs and attitudes\nIntroduction\nThe role of Small and Medium Enterprises (SMEs) in\nshaping the World’s economy is very fundamental and\nwell documented (Ndiaye et al. 2018). For instance,\namongst OECD countries, SMEs are the predominant\nform of enterprise, accounting for approximately 99% of\nall firms (ILO 2012; OECD 2017). They provide the\nmain source of employment, accounting for about 70%\nof jobs on average, are major contributors to value creation, generating between 50% and 60% of value added\non average, and comprise 45% of total employment and\n33% of GDP (IFC 2010; Perkins 2019). Micro-enterprises\nalone are reported to employ an estimated 80% of the\nworking population of Sub-Saharan Africa (Biekpe\n2004; Stein, Ardic, and Hommes 2013; Abisuga-Oyekunle, Patra, and Muchie 2020).\nThe increasing penetration of the internet and associated ICTs in Africa has led several commentators to\nargue\nthat\nthese\ntechnologies\nare\ncreating\na\nnew\neconomy –an information economy –in which information\nis the critical resource and basis for competition in all\nsectors including SMEs (Pather and Abiodun 2017).\nHowever, it has been observed that users in the SME\nsector have perceived the adoption of ICT with ‘scepticism,’ with some scholars ascribing the phenomena to\n‘technophobia’ (Gilbert, Lee-Kelley, and Barton 2003;\nGray 2006; Ion and Andreea 2008; Labrianidis 2017;\nRahman et al. 2017; Lew et al. 2019; Panas, Vasiliadou,\nand Halkiopoulos 2020). This is especially true amongst\nthe smallest category of SME business, commonly\nknown\nas\nmicro-enterprises\n(Cataldo,\nPino,\nand\nMcQueen 2020). It has further been observed that such\ntechnophobia in relation to ICT use is influenced by\nusers’ pre-usage beliefs and attitudes (Chakraborty and\nAl Rashdi 2018).\nIn light of the prevailing technophobia, this paper\nexamines the underlying beliefs and attitudes among\nSMEs owners in Uganda, which to date comprise low\nadopters. The underlying objective of the paper is firstly\nto deepen our understanding of the root causes of ‘scepticism’ of ICTs amongst SME owners in a typical developing country context. Secondly, the paper assesses the\ninfluence of SME owners’ demographic variables on\nSME owners’ perceptions of ICT and examines how the\ndemographic variables and perceptions influence use or\nnon-use of ICTs. Finally, the findings are used as a basis\nto recommend a participatory design approach as a\nmeans of mitigating technophobia that prevails amongst\nSME owners.\nLiterature review\nLevel of ICT adoption among SMEs\nIn this study, the term ICTs refers to the use of internet\nenabled applications via desktop or mobile computing\ndevices to boost business performance (Francis and\nWillard 2016). Information and communication technologies (ICTs), particularly the use of internet to conduct\nonline business, have been changing the conventional\nway of doing business among brick and mortar companies\n(Beynon-Davies 2018). In the SME sector several proponents suggest there is need for early adoption if business\nsustainability is to be achieved (Beynon-Davies 2018).\nThe problem of low adoption of ICT amongst this\nsector is well documented in the literature (e.g. Nguyen\n2009; Mramba et al. 2016; Pather and Abiodun 2017).\nThis problem is further compounded in practice wherein\nSMEs fail to make the connection between ICT adoption\nand their profit-motive on the one hand and their personal\nmotive gain expectations on the other. However, there is a\nwidely accepted consensus that if SMEs harness ICTs, it is\nAfrican Journal of Science, Technology, Innovation and Development is co-published by NISC Pty (Ltd) and Informa Limited (trading as Taylor & Francis Group)\nAfrican Journal of Science, Technology, Innovation and Development, 2021\nhttps://doi.org/10.1080/20421338.2020.1802843\n© 2021 African Journal of Science, Technology, Innovation and Development", "word_count": 902, "start_char": 825, "end_char": 6791}
{"chunk_id": "DOC0167__00002", "doc_id": "DOC0167", "chunk_index": 2, "text": "owever, there is a\nwidely accepted consensus that if SMEs harness ICTs, it is\nAfrican Journal of Science, Technology, Innovation and Development is co-published by NISC Pty (Ltd) and Informa Limited (trading as Taylor & Francis Group)\nAfrican Journal of Science, Technology, Innovation and Development, 2021\nhttps://doi.org/10.1080/20421338.2020.1802843\n© 2021 African Journal of Science, Technology, Innovation and Development\n\nlikely to improve performance, growth and sustainability\nfor more inclusive employment, increased mobility,\nability to organize customer information and improved\ninter-connectedness to other microenterprises (Francis\nand Willard 2016). It is further observed that the low adoption and use of ICTs among SMEs in developing contexts\nis due to demographic antecedents and beliefs and attitudes of users in the sector (Pustovrh et al. 2017).\nTechnology acceptance model (TAM)\nOver several years various models and theorizes have been\ndeveloped to explain the vexing problem of ICT adoption.\nIn this section we briefly assess one of the seminal adoption theories with a view to examine the usage and nonusage contexts of ICT among SMEs in a developing\ncountry context.\nFrom an adoption perspective, a widely used theory is\nthe Technology Acceptance Model (Davis 1985, 1993). In\nthe original model Davis (1985), posits that a potential\nuser’s overall attitude towards using a given system is\nassumed to be a major determinant of whether one will\nor will not use it. Attitude towards use is a cognitive\nissue for which Davis (ibid.) highlights two dimensions,\nviz., perceived usefulness and perceived ease-of-use.\nMoreover, a cognitive response results into affective\nresponse (attitude towards using) which later predicts\nactual use (Davis 1985, 1993). However, inherent in\nease-of-use and usefulness is the concept of perception\nwhich is behavioural and attitudinal in nature (Kyakulumbye, Muhenda, and Anaclet 2012; Verma and Sinha 2018;\nScherer, Siddiq, and Tondeur 2019). Over the years there\nhave been several studies that render the original TAM\nvariables insignificant. For instance, Sin Tan et al.\n(2009) found that relative advantage, compatibility, complexity, observability, and security are significant factors\ninfluencing internet-based ICT adoption. Other studies\nhave correlated adoption and diffusion challenges among\nSMEs to ICT design issues (Aleke, Ojiako, and Wainwright 2011). Namankani (2019) has argued that to\nensure successful diffusion of innovation, a balance\nmust be maintained between the amount of effort\nexpended in the design of ICT and social factors such as\nlanguage and traditional life.\nGiven the foregoing, and taking into account the low\nexplanatory prediction by the originator of TAM that\n‘Only 36% of variance in the adoption of ICTs is explained\nby TAM constructs, implying that 64% comprises other\ncognitive and contextual issues,’ (Davis 1993, 475),\nfurther extensions have been made to the model. One\nsuch extension of TAM, which serves to understand preusage issues, is the two-stage information systems continuance model (Venkatesh et al. 2011) and Unified\nTheory\nof\nUse\nand\nAcceptance\nof\nTechnology\n(UTUAT); (Chakraborty and Al Rashdi 2018). The following section deals with one of the pertinent extensions\nof pre-usage beliefs and pre-usage attitudes.\nPre-usage beliefs and pre-usage attitudes\nVenkatesh et al. (2011), build upon TAM and UTUAT to\ntake into account the contextual nature of ICT use and\nuser expectations. They advance two other pre-usage\nconstructs, viz., pre-usage beliefs and pre-usage attitudes\n(Yasmin and Grundmann 2019).\nSuch extensions to the TAM have improved the explanatory power of ICT diffusion in developing contexts\n(Chakraborty and Al Rashdi 2018). For example, there\nare several versions of the frequently cited unified theory\nof acceptance and use of technology (UTAUT) (Venkatesh, Thong, and Xu 2012) among others used in different\ncontexts. A literature review of 174 articles based on\nUTAUT has revealed, from the weight analysis of independent variables that variables such as performance\nexpectancy and behavioural intention qualified as the\nbest predictor category (Williams, Rana, and Dwivedi\n2015; Chakraborty and Al Rashdi 2018). This supports\nour argument in this paper, that pre-usage attitudes, preusage beliefs and performance related expectations are\nimportant\nelements\nin\nunderstanding\nICT adoption\namongst SMEs. Such expectations can be in form of tangible or intangible elements (Gomez and Pather 2012;\nJawed and Siddiqui 2019).\nTangible and intangible perceived impacts of ICTs\nPre-usage beliefs and attitudes are comprised of both tangible and intangible elements. Effective ICT diffusion\namong SMEs should result in impacts that transcend tangible benefits and impacts (Consoli 2012; Jawed and Siddiqui 2019). Various studies which reveal the low levels of\nadoption among the SME sector, have endeavoured to\nmake recommendations in respect of tangible components\nof ICT adoption. For instance, Arendt (2008) reveals that\nin Malaysia, despite efforts to improve technology\naccumulation through education and skills development,\nSMEs remain on the wrong side of the digital divide.\nOthers have argued that further research is necessary in\norder to develop a real understanding of the ICT adoption\nprocesses in small firms (Martin and Matlay 2001;\nHartono and Herman 2019).\nOther studies have advocated for increasing awareness\namong SMEs on the benefits of ICT adoption. For\nexample, Almazroa and Gulliver (2018) argue the need\nfor more ICT training facilities for SMEs, measures to\nprovide ICT products and services at an affordable cost,\nand free professional advice and consulting. Some critiques\nhave\nreferred\nto\nsuch\nrecommendations\nas\n‘Blanket’\napproaches\nto\npromoting\nICT\nadoption\namongst SMEs which regretfully have not made significant differences to the sector (Eze et al. 2019; Cataldo,\nPino, and McQueen 2020). Others such as Gomez and\nPather (2012) recommend a fundamental paradigm shift\nin understanding how ICT might have development\nimpacts, by focusing on intangible aspects in relation to\nusage outcomes, instead of only tangible ones.\nSeveral scholars conceptualize tangible impacts in a\nmanner whereby they are viewed as quantifiable returns\nto the implementation of ICTs in organizations and\namong individuals (Jawed and Siddiqui 2019). Other\nstudies have perceived tangibility and intangibility in\nterms of delivering direct and indirect benefits respectively\n(Jones 2008; Jawed and Siddiqui 2019).\nThis study postulates that it is crucial to assess the\nanticipated tangible and intangible benefits and impacts", "word_count": 984, "start_char": 6364, "end_char": 13019}
{"chunk_id": "DOC0167__00003", "doc_id": "DOC0167", "chunk_index": 3, "text": "ther\nstudies have perceived tangibility and intangibility in\nterms of delivering direct and indirect benefits respectively\n(Jones 2008; Jawed and Siddiqui 2019).T\n\nhis study postulates that it is crucial to assess the\nanticipated tangible and intangible benefits and impacts\n\nof ICTs to the SMEs sector prior to design and deployment\nof technology. Prior to any intervention to address low ICT\nadoption, there is a need to understand the underlying perceptual beliefs, attitudes and expectations about ICTs\namongst SME owners. This forms the underlying focus\nof this paper.\nModel construction\nFrom TAM, UTAUT, and an extension of TAM which\nhighlights pre-usage beliefs and pre-usage attitudes\nwhich can be predominantly be both tangible and intangible elements, the following model is developed:\nThe model posits that demographic characteristics like\nage, education level, gender can influence actual ICT use\namong SMEs. Beliefs and attitudes can be either positive\nor negative. Furthermore, pre-usage beliefs and attitudes\nof ICT could influence and determine use of ICTs\n(Ceresia and Mendola 2019). For instance, when assessing\nusage of mobile based payments, Almazroa and Gulliver\n(2018) reveal that personal characteristics have a positive\ninfluence on actual ICT use. Similarly, Alruwaie, El-Haddadeh, and Weerakkody (2020) also found that demographic characteristics are crucial in influencing citizens’\ncontinuous use of e-government services. Moreover,\nsuch expectation beliefs and attitudes may be likened to\ntangible and intangible elements from technology-based\ninnovations (Jawed and Siddiqui 2019). In terms of negative and positive beliefs influencing ICT usage, Gholami\net al. (2013) found a significant positive effect. On the\nother hand, Verma and Sinha (2018) did not find a significant influence of ICT pre-usage attitudes and beliefs on\nperceived wellbeing.\nSuch contradictions in the extant literature were\nexplored in the research that is reported in this paper. In\nparticular we explored why in some studies, the influence\nis strongly significant while in others, it is not. Consequently, the following objectives formed the focus of the\npaper:\n(a) To identify the underlying factors that determine the\nnegative and positive beliefs among SMEs which in\nturn influence ICT use.\n(b) To establish the relationship between the identified\nfactors and ICT use among SMEs in Uganda.\n(c) To assess whether there are any significant differences\nin ICT use among SMEs in Uganda as influenced by\nthe underlying factors.\nMethods\nThe primary aim of the paper was to ascertain the antecedents and determinants of ICT usage amongst owners of\nUgandan Small and Medium Enterprises (SMEs). The\nobjective was to understand the latter so as to inform\nfuture interventions that may improve adoption levels\namongst SMEs in a resource constrained environment.\nThe study utilized a quantitative cross section survey to\ntest the research hypotheses derived from literature and\nICT adoption theoretical underpinnings.\nPopulation and sample size selection\nThe study sampled SMEs from Mukono Municipality,\nUganda. SMEs in this municipality have characteristics\nof both urbanity and rural. A sample target of 385 respondents was set, based on sampling norms of (Krejcie and\nMorgan 1970).\nMukono Municipality Register has approximately\n20,000 SMEs when stratified according to type of business\n(National Population and Housing Census 2014). To cater\nfor non-response, we enhanced the sample size by 10%\nand a total of 425 participants were considered. The unit\nof analysis was SMEs owners (managers) while the type\nof business was used for respondent stratification. Stratified convenience sampling (Neneh and Van Zyl 2012)\nwas used to collect the data. Twenty-five research assistants traversed the Municipal zones to collect the data.\nThe businesses which were targeted have diverse operations due to the zones where they belong. Thus, stratifying and zoning them enabled business representation\nbased on location and nature of business.\nSurvey method\nThe survey approach utilized a structured questionnaire\nfor collecting perception quantitative (negative and positive pre-usage beliefs and attitudes) data, demographics\ndata and prior use of ICT based on a dichotomous scale\nof YES/NO. The objective of the survey approach was\nto obtain a ‘snap-shot’ of the situation amongst SMEs\nwhich in turn would provide a basis for quantification of\nICT pre-usage beliefs and attitudes.\nInstrument development and analysis processes\nThe development of the survey tool was informed by the\nmodel (Figure 1). The instrument comprised a section to\ncollect demographic data, followed by a section which\nascertained use experience, and finally the core of the\ninstrument comprised statements regarding pre-usage attitudes as guided by the literature and the model. The constructs in the tool comprised cognitive response items.\nTherefore, questions in relation to pre-usage beliefs and\npre-usage attitudes provided for an understanding of the\ncontext of ICT use which follows on Venkatesh et al.\n(2011). The instrument further provided for an assessment\nof such beliefs and attitudes in terms of both tangible and\nintangible perceptions of ICT benefits could have influenced prior use or non-use of ICTs.\nThe items in the instrument included a measure of\nnegative and positive ICT pre-usage beliefs and attitudes\nwith a total of 14 items (7 negative and 7 positive preusage expectations). For all constructs, the authors asked\nrespondents to rate their ICT usage attitudes and beliefs,\nusing a Likert scale of 1–5 (1=strongly disagree and\n5=strongly agree).\nResults and discussions\nThis section reports the demographic antecedents of the\nSME owners as they were deemed to be critical for\nusage attitudes and beliefs. A total of 425 usable responses\nwere received. This implies that study had an acceptable\nresponse given that it was over the recommended statistical threshold of 377 for a population of ≥20,000 (Krejcie\nand Morgan 1970, 608) and 392 (Israel 1992) for the same\npopulation at a 5% level of precision.", "word_count": 924, "start_char": 12745, "end_char": 18840}
{"chunk_id": "DOC0167__00004", "doc_id": "DOC0167", "chunk_index": 4, "text": "total of 425 usable responses\nwere received.T\n\nhis implies that study had an acceptable\nresponse given that it was over the recommended statistical threshold of 377 for a population of ≥20,000 (Krejcie\nand Morgan 1970, 608) and 392 (Israel 1992) for the same\npopulation at a 5% level of precision.\n\nSME category and demographics of respondents\nThe Table 2 reveals the SME business type and demographic data. This provides the basis to examine variations\nin beliefs and attitudes among the different SME business\nsector types (Table 1).\nThe results reveal that SMEs in Mukono Municipality\ncomprise small businesses ranging from those that deal\nwith health-related products and services, pre-schools, to\nartisanal type businesses such as welding. The next table\npresents the demographics of the SMEs participants that\nresponded to the survey in Table 2.\nAfter accounting for missing data, it was excluded from\nthe analysis. Female respondents represented 43.5%, while\nmale respondents accounted for 56.5%. This suggests male\nFigure 1: ICT pre-usage beliefs and attitudes and Actual Use of ICTs.\nTable 1: SME category.\nSME category\nCarpentry\n7.1\nMedical Centre\n16.5\nDrug shop\n3.5\nPharmacy\n15.3\nRestaurant\n11.8\nRetail shop\n11.8\nSchool\n14.1\nVeterinary shop\n4.7\nWelding\n15.3\nTotal\n100.0\nTable 2: Demographics of respondents.\nGender\nFemale\n43.5\nMale\n56.5\nTotal\n100.0\nMarital status\nSingle\n30.6\nMarried\n62.4\nDivorced\n4.7\nWidowed\n1.2\nTotal\n98.8\nSystem\n1.2\nTotal\n100.0\nAge category\nAge <35 years\n56.4\n>35\n43.6\nTotal\n100.0\nEducation level\nless than primary\n2.4\nCompleted O-level\n7.1\nCompleted A-level\n9.4\nCompleted tertiary education certificate\n12.9\nOrdinary diploma\n12.9\nAdvanced diploma\n12.9\nBachelor’s degree\n28.2\nPostgraduate diploma\n4.7\nMaster’s degree\n8.2\nTotal\n98.8\nNon-response (dropped)\n1.2\nTotal", "word_count": 276, "start_char": 18543, "end_char": 20338}
{"chunk_id": "DOC0167__00005", "doc_id": "DOC0167", "chunk_index": 5, "text": "dominance in SMEs, and this may hold true since, culturally in Central Uganda, men are regarded as the breadwinners and must find alternative means of survival in the\nabsence of formal employment (Svensson and Wamala\nLarsson 2016). Based on the model guiding the study, the\nstudy hypothesizes that demographics are linked to use or\nnon-use of ICTs among SME sector owners.\nUse of ICTs among SMEs\nWe assessed the extent of use of ICT by SME owners in\nthe business itself or for any other purpose.\nThe data in Table 3 reflects the low levels of use of computers amongst SMEs. Of the participants, 68.2% of SME\nowners have never used a computer in their business and\n76.5% have never used a computer in any other nonbusiness context. This supports the premise of the paper in\nrespect of the low levels of ICT diffusion in this sector\nthat underlying pre-usage beliefs and attitudes regarding\nICT use therefore need further investigation. This result\nrenders support to the diffusion of innovations as it\naffirms that most SMEs constitute late majority and\nlaggards (Rogers 1971, 2010; Meyoki and Kavindah 2019).\nSMEs owners’ pre-usage beliefs and attitudes of ICTs\nThe\nresults\nfrom\nthe\nfourteen\nitems\nin\nthe\npreusage questionnaire were sub-divided into negative and\npositive beliefs and attitudes which constitute behavioural\nexpectations from ICTs. The results are presented in\nTable 4.\nIn Table 4, missing data was sifted out and the mean\nresults provided are for the responses recorded from 380\nstudy participants. The mean results tending towards one\n(1) reveal a strong disagreement, whereas those towards\nfive (5) reveal a strong agreement. The result indicates\nthat respondents have positive perceptions about most\nconstructs. For instance, they strongly disagree that computer use is a waste of time. However, they do not\nbelieve that most people can learn how to use a computer\nsystem, which tallies with their other belief that they are\nnot confident using the computer system. To establish\nwhat these factors were, a factor analysis was undertaken.\nFactor analysis to examine the pre-usage beliefs and\nattitudes of ICTs use among SMEs\nTo understand the factors that influence ICTs use among\nSMEs in Mukono, Uganda, the items in the tool were subjected to exploratory factor analysis to assess the extent of\ntheir loading. The results are presented in Table 5.\nTable 5 depicts the rotated Eigen values. This indicates\nthat there are six (6) significant factors for this study. The\nresults in Table 5 imply that the fourteen (14) items which\ncomprised in the instrument are categorized into six (6)\nTable 3: Use of ICT in the SME business or for any other purpose.\nHave you ever used a desktop or laptop\ncomputer in your business?\nValid\nNo\n68.2\nYes\n31.8\nTotal\n100.0\nHave you ever used a desktop or laptop\ncomputer for any other purpose other than\nbusiness?\nValid\nNo\n76.5\nYes\n8.2\nTotal\n84.7\nTable 4: Descriptive statistics on the pre-system usability issues.\nNegative\nperception\nPositive\nperception\nMean\nStd.\nDev.\nAnalysis\nN\nI think using system can improve my business\n✓\n3.89\n1.178\nUse of a computer system can improve my well being\n✓\n3.74\n1.057\nComputer use is not a mere wastage of time\n✓\n4.04\n.967\nI think the computer system is not so complex\n✓\n2.71\n1.308\nI think I would like to use a computer system frequently\n✓\n3.50\n1.166\nI think I can gain something from the use of computers\n✓\n3.91\n.977\nI imagine that most people can learn to use the computer\n✓\n4.01\n.981\nI do not feel very confident using the computer system\n✓\n3.46\n1.411\nI think the computer system is not easy to use\n✓\n3.38\n.726\nI need support from another person to use a computer\n✓\n4.00\n1.090\nI need to work with somebody technical before use\n✓\n4.26\n.993\nThere might be too much inconsistencies in a computer\n✓\n1.95\n1.257\nI think the functions of the computer system are not well\nintegrated\n✓\n1.71\n1.158\nI guess the computer system is very cumbersome to use\n✓\n3.21\n1.372", "word_count": 682, "start_char": 20338, "end_char": 24280}
{"chunk_id": "DOC0167__00006", "doc_id": "DOC0167", "chunk_index": 6, "text": "factors. The rotated factor matrix which aids factor\nnaming is presented in Table 6.\nFrom the above factor loadings and matching, the next\nsection provides the rationale of naming of the factors\ntaking into account their context in relation to the reality\nof ICT pre-use expectations.\nFactors that that are associated with the pre-usage\nbeliefs and attitudes of ICTs among SMEs owners\nSome scholars advocate that the naming of factors is more\nof an ‘art’ as there are no rules for naming, except to give\nnames that best represent the variables within the factors\n(Costello and Osborne 2005). Other scholars suggest\nthat naming can come from the from the investigator’s\nprior theoretical understanding of the phenomenon under\nstudy (an a priori approach) as the factors get loaded to\na component (Ryan and Bernard 2003). Following on a\ncombination of such suggestions, the naming of the\nfactors was based on the above factor loadings, labelling\nused in common practice, the research context and\ntheoretical lenses that were used in the background to\nthis\nstudy\nand\njoint\ncombined\nknowledge\nof\nthe\nresearchers.\nFactor 1: Benefit expectation\nThe first factor has three items which relate to an expectation that using computers can improve business that it\ndoes not constitute a wastage of time, and that traders\nwould like to use a computer more frequently.\nThese issues align well with the notion of business\nbenefit expectations. The other issues seem to relate to\npersonal benefit expectations from use of computers,\nwhich include the notion that the use of computers\nwould improve well-being. We therefore cast both these\ninto benefit expectation. However, we note from the communalities table, that well-being expectations were more\nprominent.\nFactor 2: ICT learnability\nThe second set of three items comprising Factor 2, are\nrelated the perceived ability of individuals to learn to use\nTable 5: Total variance explained.\nComponent\nInitial eigenvalues\nExtraction sums of squared loadings\nRotation sums of squared loadings\nTotal\n% of\nTotal\n% of\nTotal\n% of\n3.830\n3.830\n3.239\n23.133\n23.133\n1.764\n12.598\n39.952\n1.764\n12.598\n39.952\n1.508\n10.768\n33.902\n1.284\n9.171\n49.123\n1.284\n9.171\n49.123\n1.440\n10.289\n44.190\n1.173\n8.381\n57.504\n1.173\n8.381\n57.504\n1.405\n10.039\n54.229\n1.118\n7.986\n65.490\n1.118\n7.986\n65.490\n1.349\n9.638\n63.867\n1.071\n7.652\n1.071\n7.652\n1.298\n9.275\n.892\n6.370\n79.512\n.680\n4.855\n84.367\n.617\n4.404\n88.771\n.460\n3.289\n92.060\n.349\n2.492\n94.552\n.307\n2.194\n96.746\n.264\n1.884\n98.630\n.192\n1.370\n100.000\nExtraction method: Principal Component Analysis\nTable 6: Rotated factor matrix\nRotated component matrixa\nComponent\nI think using system can improve my business\n.815\nUse of computer system can improve my well being\n.787\n.322\nComputer use is not a mere wastage of time\n.720\n−.360\nI do not feel very confident using the computer system\n.712\n−.401\nI think I can gain something from the use of computers\n.644\n−.354\nI think the computer system is not easy to use\n.448\n.457\nI think the computer system is not so complex\n.858\nI think I would like to use a computer system frequently\n.464\n.688\nI need support from another person to use a computer system\n.815\nI do need to work with somebody technical before use\n.745\nI imagine that most people can learn to use the computer system\n.826\nThere might be too much inconsistencies in a computer system\n.740\n.318\nI think the functions of the computer system are not well integrated\n.652\n.889\nI guess the computer system is very cumbersome to use\n.860\nExtraction Method: Principal Component Analysis\nRotation method: Varimax with Kaiser Normalization.\na Rotation converged in 8 iterations.", "word_count": 596, "start_char": 24280, "end_char": 27906}
{"chunk_id": "DOC0167__00007", "doc_id": "DOC0167", "chunk_index": 7, "text": "ICT. These are associated with latent variables in respect\nof feeling an aptitude to learn something of value\nthrough ICT use, perceiving computers as not being\ncomplex and the need to use computers frequently.\nFactor 3: ICT support\nFor factor three, we consider two key items since one of\nthe variables loaded highly on to the first factor. These\nare: needing support from another person to use a computer system and not needing somebody technical before use,\nthereby implying any peer who can offer support can\nenhance usability. These are issues related to anticipated\nICT support as an expectation before use.\nFactor 4: Ease-of-use\nThe fourth factor comprised of latent variables in relation\nto the ease of which a trader is able to learn to use computers, and that during use there is an expectation of inconsistencies in the system. These are system design related\nissues, and are therefore labelled as Ease-of-use.\nFactor 5: User-friendliness\nThe latent variables associated with this factor appear to be\nclosely related to Factor 4. These include an expectation of\ninconsistencies in the system (which also loaded in Factor\n4) and the expectation of computer systems to be well integrated. These appear to be premised on notions of usercentred design. The researchers labelled this factor userfriendliness.\nFactor 6: User-confidence\nFinally, the sixth factor relates to a perception that ICT is\ncumbersome to use as revealed with one of the variables\nloading highly with 0.86. This is coupled with a perception of not being easy to use and issues related to lack of\nconfidence. We label this factor as User-confidence.\nCorrelation of identified factors with ICT use\nAfter naming the factors, the underlying constructs that\nwere inherent in each factor were aggregated into an\naverage index measure. For ICT use, the averaged\nmeasures ranged from 1 (low or no use), 1.5 (moderate\nuse) and 2 (high use) of ICTs among the SMEs. The correlation results are shown in Table 7.\nThe above results show that apart from ICT support\n(sig=0.932) and ease-of-use (sig. = 0.169), the other four\nfactors were significantly correlated to the use of ICTs\namong SMEs. The correlation results contradict the\nTAM model which espouses that ease-of-use is a very\nstrong positive significant predictor of actual use. Based\non the correlation results, we reconfigure our model of\nICT use among SMEs as follows (Figure 2).\nRegression results of the pre-usage beliefs and attitudes\nand ICT use\nThe next section presents ordinary least squares regression\nresults to examine the predictive power of the pre-usage\nfactors to ICT use (Table 8).\nTable 7: Factor correlation table and use of ICTs among SMEs.\nCorrelations\nBenefit\nexpectations\nICT\nlearnability\nICT\nsupport\nEase-ofuse\nUsercentredness\nUserconfidence\nActual\nUse\nBenefit\nexpectation\nN\nICT\nLearnability\n.762**\n.000\nN\nICT Support\n.467**\n.104*\n.000\n.042\nN\nEase-of-use\n.425**\n.178**\n−.108*\n.000\n.000\n.036\nN\nUsercentredness\n.636**\n.256**\n.036\n.748**\n.000\n.000\n.479\n.000\nN\nUserconfidence\n.245**\n.118*\n−.130*\n.507**\n.516**\n.000\n.016\n.011\n.000\n.000\nN\nActual use\n−.266**\n−.365**\n.005\n−.075\n−.134*\n−.126*\n.000\n.000\n.932\n.169\n.014\n.018\nN\n** Correlation is significant at the 0.01 level (2-tailed).\n* Correlation is significant at the 0.05 level (2-tailed).", "word_count": 527, "start_char": 27906, "end_char": 31189}
{"chunk_id": "DOC0167__00008", "doc_id": "DOC0167", "chunk_index": 8, "text": "From the model summary in Table 8, the results show\nthat the identified factors significantly predict use of ICTs\namong SMEs. However, the coefficient of determination\nR-squared is only 13%. This implies that actual use of\nICTs among SME owners studied is explained by only\n13% of the six (6) factors. The rest of the usage expectations is explained by 87% of other factors which could\nbe contextual factors. This implies that other methods\nare needed to thoroughly understand SME expectations\nof ICTs. We therefore posit that such factors could be\nrevealed during a participatory design process, which\ninvolves SME users. This is supported by others, such\nas Aleke, Ojiako, and Wainwright (2011) who argue that\nto ensure successful diffusion of an innovation, a\nbalance must be maintained between the amount of\neffort expended in the design of ICT and that of other\nsocial factors.\nAnalysis of variance identified factors and ICT use\namong\nIn this section we probe the identified factors (pre-usage\nbeliefs and attitudes) to ascertain whether there are differences between the two main groups of respondents in the\nstudy, viz., users and non-users of ICT. The results of the\nOne-way ANOVA are given in Table 9.\nFrom the results, there is a statistically significant\ndifference between the two groups in relation to the following factors: Benefit expectations (One-way ANOVA\n(F(2,337) = 13.357,\np = 0.000);\nICT\nlearnability\n(One-way\nANOVA\n(F(2,352) = 27.647,\np = 0.000);\nEase-of-use (One-way ANOVA (F(2,332) = 3.393, p =\n0.035); and User-friendliness (One-way ANOVA (F\n(2,337) = 3.442, p = 0.033). There were no statistically significant differences in respect of the factors related to ICT\nsupport and User-confidence. This reveals that SME\nowners, in the main, are influenced by their use experience\nin terms of their perceptions of ICTs as there were significant differences in respect of four of the six factors. The\ndata here also indicates, that regardless of ICT use experience, SME owners have similar perceptions about the\nlevel of support they need, and also in their own level of\nconfidence to use ICTs.\nTowards a participatory design model to mitigate\nnegative beliefs and attitudes towards ICTs among\nSMEs\nThis study renders support to several other scholars who\nrecommend that there is need for participatory design\nmechanisms in order to influence user acceptance within\napplied contexts (Davis 1993; Aleke, Ojiako, and Wainwright 2011; Gumbi and Mnkandla 2015). For instance,\nthe community informatics literature reveals that with\nthe design of applications, projects and activities within\na community informatics framework that would be most\nsupportive of local ‘effective use’ would be ‘participatory\ndesign’ (Gurstein 2003). Participatory design is a well\ncited recommended strategy (Porter 1991; Qureshil,\nKamal, and Wolcott 2009; Wyche 2015) and several\nfruits have been documented to date in respect of its application. It is a methodological approach that recognizes that\nFigure 2: ICT pre-usage beliefs and attitudes and Actual Use of ICTs.\nTable 8: Regression results\nModel summary\nModel\nR\nR square\nAdjusted R square\nStd. error of the estimate\n.361a\n.130\n.113\n.28956\na Predictors: (Constant), USER_CONFIDENCE, LEANABLE, SUPPORT, EASE_OF_USE, USER_FRIENDLINESS, BENEXP", "word_count": 513, "start_char": 31189, "end_char": 34481}
{"chunk_id": "DOC0167__00009", "doc_id": "DOC0167", "chunk_index": 9, "text": "t is a methodological approach that recognizes that\nFigure 2: ICT pre-usage beliefs and attitudes and Actual Use of ICTs.T\n\nable 8: Regression results\nModel summary\nModel\nR\nR square\nAdjusted R square\nStd. error of the estimate\n.361a\n.130\n.113\n.28956\na Predictors: (Constant), USER_CONFIDENCE, LEANABLE, SUPPORT, EASE_OF_USE, USER_FRIENDLINESS, BENEXP\n\nideas develop slowly over time, can help discover confounding demi-regularities (Lawson 1997; Lee, Olson,\nand Trimi 2012) called contextual factors. It could also\nmitigates pre-usage beliefs and attitudinal expectations\nand helps to clearly understand generative mechanisms\n(Van Aken 2005; Andriessen 2006; Jagosh et al. 2012).\nIn light of the foregoing we recommend the need to\nharness a participatory design paradigm to overcome\nnegative perceptions of ICTs, and at the same time to\nconsolidate positive perceptions which prevail. This\nwould involve, as a first step, the development of a framework that incorporates the pre-usage findings to foster\nan environment for undertaking participatory design of\nICT applications with SMEs. The ultimate goal of undertaking\nparticipatory\ndesign\nwhen\ndeveloping\nICT\nartefacts would be to confirm or disconfirm SMEs’\npre-usage ICT expectations and to reinforce benefits\nand any other determinants for use as presented in the\nfigure below (Figure 3).\nThe results of this study identified several pre-usage\nbeliefs and attitudes, viz., Benefit expectations, Learnability, ICT support, Ease-of-use, User-friendliness, User-confidence and other contextual and social factors. The green\ndiamond implies that during an artifact participatory\ndesign process, the expectations can be confirmed or disconfirmed through collaborative working. It is anticipated\nthat the mental convergence of ICT designers and systems\nusers would lead to improved adoption and better usage\noutcomes.\nThe rationale for participatory design is premised on\nan assumption that there is a need for carefully planned\ninterventions to convince the SME population to infuse\ntechnology in their businesses. The literature indicates\nthat lived experiences such as financial insecurity, social\ninsecurity, unstable future will lead to scepticism and\nphobia of ICT (Gumbi and Mnkandla 2015). Further\nthere is evidence that according to Rogers’ diffusion of\ninnovation theory a combination of external and internal\nTable 9: One-way ANOVA: Assessment of differences among SMEs based on factors.\ndf\nF\nSig.\nBenefit expectations\n13.357\n.000\nTotal\nICT learnability\n27.647\n.000\nTotal\nICT support\n.008\n.992\nTotal\nEase-of-use\n3.393\n.035\nTotal\nUser-friendliness\n3.442\n.033\nTotal\nUser-confidence\n2.811\n.061\nTotal\nFigure 3: Towards ICT pre-usage expectations through participatory design.", "word_count": 391, "start_char": 34131, "end_char": 36862}
{"chunk_id": "DOC0167__00010", "doc_id": "DOC0167", "chunk_index": 10, "text": "enefit expectations\n13.357\n.000\nTotal\nICT learnability\n27.647\n.000\nTotal\nICT support\n.008\n.992\nTotal\nEase-of-use\n3.393\n.035\nTotal\nUser-friendliness\n3.442\n.033\nTotal\nUser-confidence\n2.811\n.061\nTotal\nFigure 3: Towards ICT pre-usage expectations through participatory design.\n\ninfluences of a system much work in a dialectical manner\nin order to influence the diffusion process (Lundvall 1988;\nZenko and Mulej 2011; Cajaiba-Santana 2014). This study\npostulates that to aid effective decision-making of technological acceptance, co-creation can be of potential value of\ncreating such social and behavioural change.\nConclusion\nThis paper, in recognizing the critical role of SMEs in\ndeveloping economies, has responded to the problem of\nthe relatively low levels of uptake of ICTs. This study\nbuilds upon prior findings in the extant literature, which\nhave demonstrated the value proposition of ICT to\nSMEs in terms of improved business operations and efficiencies. The findings provide insight into the attitudes\nof SME owners towards ICTs. The study has shown that\nperceptions of ICTs are both positive and negative.\nFurther the study identified four pre-use factors that are\ncorrelated with ICT use. The pre-usage beliefs which significantly influence decisions to adopt and use ICT include\nBenefit expectation, ICT learnability, User-confidence,\nand User-friendliness. These are found to be key determinants of ICT adoption. ICT support and ease-of-use on the\nother hand were factors that did not correlate with\ndecisions to use ICT.\nHowever, the study also found that other factors such\nas social and contextual factors also affect ICT adoption.\nAs such the study proposes a strategy to mitigate negative\nICT pre-usage beliefs which are responsible for low ICT\nadoption in the sector. Our proposed co-design recommendation responds to scholars of similar thought that have\nargued that ‘there has been a bias to action, not a bias\nto knowledge. We are changing the world without interpreting or understanding it,’ (Heeks 2010, 625). Similarly,\nGomez and Pather (2012) seem to wonder whether evaluators and designers of ICT4D ask the right questions. Based\non the findings of this study, we envisage that participatory\ndesign of ICT applications has the ability to orchestrate\nthis mutual interpretation, ask the right questions, create\nmutual understanding, and ensure improved adoption of\nICTs.\nThrough a co-design process, we envision that the\nnegative factors identified in this study together with\nother myths, beliefs, attitudes and expectations shall be\nmitigated during the process. Once those issues are disconfirmed from a participatory design perspective, we\nanticipate user satisfaction, improved post-usage beliefs\nand attitudes and hence usability and continuance for\nuse of designed systems amongst SMEs.\nIn terms of theoretical implication, this study contributes to the need to integrate demographic antecedents\nwhen planning ICT applications for the SME sector.\nDuring the design of such systems, there is need to understand the inherent variables that are not observable and\nmeasurable through a participatory design process. Other\ntheoretical implications of this study relate to developing\nfurther underlying understandings of the principles that\nmust inform the development of ICT design approaches\nthat are appropriate for the African continent. This paper\ntakes a first step in this regard.\nIn terms of policy, we advocate that public-private\npartnerships must be fostered to catalyze the endeavour\nto produce user centric systems for SMEs. Most governments in the African continent have SME development\nforemost on their development agenda. However, much\nmore needs to be done to ensure that both emergent and\nestablished SMEs benefit from the digital revolution that\nis replete in statements of the African Union and most\nAfrican governments. Such work needs to promote technology diffusion among SMES, and thereby ensure that\nthey are able to access and successfully use ICTs\ntowards improved business outcomes. The results of this\nstudy provide a basis to understand low ICT adoption.\nAs such policy interventions may take these findings\ninto account in the development of interventions to\nsupport the SME sector.\nFinally, future research should entail action research\nthat will entail working dialectically with SMEs sector\nto disconfirm the negative pre-usage beliefs and attitudes\nwhile at the same time consolidating the positive beliefs\ntowards ICTs. To this end the participatory design model\nproposed herein, and which draws primarily upon Kyakulumbye (2020), must be subjected to further testing such\nthat the African continent begins to understand the\nreality of implementing true bottom-up processes to\nensure enhanced technology diffusion into the SME\nsector.\nDisclosure statement\nNo potential conflict of interest was reported by the authors.\nFunding\nThis work was supported by the National Research Foundation\nof South Africa: [Grant Number SFH170624244332].\nORCID\nStephen\nKyakulumbye\nhttp://orcid.org/0000-0002-\n4275-9483\nShaun Pather\nhttp://orcid.org/0000-0002-4667-222X", "word_count": 753, "start_char": 36590, "end_char": 41701}
