{"chunk_id": "DOC0136__00000", "doc_id": "DOC0136", "chunk_index": 0, "text": "THE USE OF A BIO-ENZYME AND PINEAPPLE LEAF FIBER AS A STABILIZER\nIN CLAY BRICKS\n\nMIKE COLLIN OCHOLLA\nS21B32/128\n\nA FINAL YEAR RESEARCH AND DESIGN PROJECT REPORT SUBMITTED TO THE\nFACULTY OF ENGINEERING, DESIGN AND TECHNOLOGY, IN PARTIAL FULFILLMENT\nOF THE REQUIREMENTS FOR THE AWARD OF A DEGREE OF BACHELOR OF SCIENCE\nIN CIVIL AND ENVIRONMENTAL ENGINEERING OF UGANDA CHRISTIAN UNIVERSITY\nApril, 2025\n\ni\n\nABSTRACT\nThis paper investigated the potential of the bio-enzyme and pineapple leaf fiber\ncombination as stabilizers for the clay bricks to decrease the carbon emission firewood\nthe usual material used in the firing process. We present a study covering the\neffectiveness of the hybrid bio-enzyme (Terrazyme) mixtures with Pineapple Leaf Fiber\n(PALF) in clay bricks as a detailed description. The results of the field tests performed\nin Siron clay bricks provided evidence that the use of the new material not only\ndecreases the environmental impact but also improves the strength and water\nabsorption of the brick itself. Which in turn contributes to the construction of the ecofriendly and sustainable building brick.\n\nii\n\nDECLARATION\nI, Ocholla Collin Mike, declare that this research report titled \"Assessing the Use of A\nBio-Enzyme and Pineapple Leaf Fiber as a Stabilizer of Clay Bricks\" is my original work\nand has not been submitted for any other degree or qualification. All sources and\nreferences have been appropriately acknowledged.\n\nSIGNED.................................................\n\nDate: .......................................................\n\nOCHOLLA COLLIN MIKE\nS21B32/128\n\niii\n\nAPPROVAL\nI hereby certify that OCHOALLA COLLIN MIKE, registration number S21B32/128,\nsuccessfully undertook her research project at Uganda Christian University during the\nperiod of September 2024 to April 2025. Therefore, the work that he was able to\ncomplete under my supervision is accurately recorded in this report and is ready for\nsubmission for assessment purposes to the department of engineering and environment\nat Uganda Christian University.\nSigned: ...................................................\n\nDate: ....................................................\nEng. Dr. MORRIS OLENG\n(Academic Supervisor)\n\niv\n\nDEDICATION\nThis work is dedicated to my family for their unwavering support and encouragement\nthroughout my academic journey. It is also dedicated to my Project supervisor, Eng. Dr.\nMorris Oleng for uniquely inspiring me. I dedicate this research to the countless\nindividuals and communities affected by environmental degradation, with the hope\nthat this research contributes to sustainable practices in construction.\n\nv", "word_count": 372, "start_char": 0, "end_char": 2646}
{"chunk_id": "DOC0136__00001", "doc_id": "DOC0136", "chunk_index": 1, "text": "t is also dedicated to my Project supervisor, Eng.D\n\nr.M\n\norris Oleng for uniquely inspiring me.I\n\ndedicate this research to the countless\nindividuals and communities affected by environmental degradation, with the hope\nthat this research contributes to sustainable practices in construction.\n\nv\n\nACKNOWLEDGEMENTS\nI would like to express my deepest gratitude to my supervisor, Eng. Dr. Morris Oleng,\nfor his invaluable guidance and support throughout this research project. I also thank\nmy colleagues at Uganda Christian University for their collaboration and\nencouragement. Special thanks to the local communities in Siron for their participation\nin this study and to the Ministry of Water and Environment for their insights into\ntraditional brick production practices. Finally, I acknowledge the funding and resources\nprovided by my parents that made this research possible.\n\nvi\n\nTABLE OF CONTENTS\nABSTRACT ........................................................................................... i\nDECLARATION ...................................................................................... ii\nAPPROVAL .......................................................................................... iii\nDEDICATION ........................................................................................ iv\nACKNOWLEDGEMENTS ............................................................................. v\nLIST OF ACRONYMS AND ABBREVIATIONS ....................................................... ix\nCHAPTER ONE..................................................................................... 10\n1.1\nINTRODUCTION ....................................................................... 10\n1.2\nBACKGROUND ......................................................................... 11\n1.3\nPROBLEM STATEMENT ............................................................... 13\n1.4\nMAIN OBJECTIVE OF THE STUDY .................................................. 14\n1.5\nSPECIFIC OBJECTIVES ................................................................ 14\n1.6\nRESEARCH QUESTIONS ............................................................... 14\n1.7\nJUSTIFICATION ........................................................................ 14\n1.8\nSCOPE .................................................................................. 15\nCHAPTER TWO: LITERATURE REVIEW .......................................................... 16\n2.1\nCLAY SOILS ............................................................................. 16\n2.2\nPROPERTIES OF SMECITE ............................................................. 16\n2.3\nCLAY BRICKS ............................................................................ 17\n2.4\nSTABILIZATION ......................................................................... 17\n2.4.1\nChemical Stabilization .......................................................... 17\n2.4.2\nMechanical Stabilization ........................................................ 18\n\nvii\n\n2.5\nBIO-ENZYMES........................................................................... 18\n2.6\nTerrazyme as one of the bio enzymes for stabilization.......................... 18\n2.6.1\nMechanism of bio-enzyme stabilization ...................................... 20\n2.6.2\nPromote cation exchange ...................................................... 21\n2.6.3\nReduce plasticity ................................................................ 21\n2.7\nNatural fibers (Pineapple Leaf Fiber) .............................................. 21\nCHAPTER THREE: METHODOLOGY ............................................................. 22\n3.1\nTo determine the soil properties of the clay bric ................................ 22\n3.1.1\nParticle Size Distribution ....................................................... 22\n3.1.2\nAtterberg Limits Test (Plastic Limit, Liquid Limit, and Plasticity Index) 23\n3.1.3\nThe X-ray Fluorescence (XRF) ................................................. 26\n3.1.4\nFree Swell Index (FSI) Test ..................................................... 27\n3.1.5\nCompressive Strength Test BS EN 772-1:2011 ............................... 27\n3.1.6\nWater Absorption Test BS EN 772-11:2011 ................................... 29\n3.2\nDetermining Physical Properties of Pineapple Leaf Fiber ....................... 30\n3.2.1\nTensile Strength Test (ASTM D2256). .......................................... 31\n3.2.2\nFiber Diameter Measurement. ................................................. 32\n3.3\nTo evaluate the engineering properties of stabilized clay bricks and identify\nthe optimal ratio for the mix. ............................................................... 32\n3.3.1\nBio-Enzyme ratios ............................................................... 32\n3.3.2\nPineapple Leaf Fiber (PALF) Proportions ..................................... 33\n3.3.3\n1. Compressive Strength Standard Test. ..................................... 34\n3.3.4\n2. Water Absorption Test Standard. ........................................... 34\nCHAPTER FOUR: RESULTS AND DISCUSSION ................................................... 35\n\nviii", "word_count": 422, "start_char": 2351, "end_char": 7479}
{"chunk_id": "DOC0136__00002", "doc_id": "DOC0136", "chunk_index": 2, "text": "ompressive Strength Standard Test. ..................................... 34\n3.3.4\n2.W\n\nater Absorption Test Standard. ........................................... 34\nCHAPTER FOUR: RESULTS AND DISCUSSION ................................................... 35\n\nviii\n\n4.1\nObjective one: Determining the soil properties of the clay brick. ............ 35\n4.1.1\nParticle Size Distribution ....................................................... 35\n4.1.2\nAtterberg Limits test on the clay soil sample ............................... 36\n4.1.3\nXRF test of the clay soil ........................................................ 40\n4.1.4\nFree Swell Index (FSI) Test (BS 1377-2:1990) ................................ 44\n4.1.5\nThe compressive strength test................................................. 45\n4.1.6\nWater Absorption Test ........................................................... 47\n4.2\nObjective two: To determine the physical properties of pineapple leaf\nfibers. 50\n4.3\nObjective Three: Evaluating the engineering properties of stabilized clay\nbricks and identify the optimal ratio for the mix. ....................................... 54\n4.3.1\n4.3.1 Water Absorption Test .................................................... 60\n4.4\nDESIGN OF STABLIZED BRICK ......................................................... 65\n4.4.1\nDESIGN OF CLAY BRICK AND WOODEN MOULD ............................... 67\nCONCLUSIONS AND RECOMMENDATIONS ....................................................... 68\n5.1\nConclusions ............................................................................ 68\n5.2\nRecommendations ..................................................................... 69\nREFERENCES ...................................................................................... 70\nAPPENDIX .......................................................................................... 75\n\nix\n\nLIST OF ACRONYMS AND ABBREVIATIONS\n•\nCBR: California Bearing Ratio\n•\nCSH: Calcium Silicate Hydrate\n•\nPALF: Pineapple Leaf Fiber\n•\nUCU: Uganda Christian University\n\nCHAPTER ONE\n1.1\nINTRODUCTION\nThe construction sector is an economic stimulant but is no less a source of ecological\ndegradation. The extensive application of firewood in Ugandan bricks is directly\nresponsible for carbon accumulation and deforestation. As demands for green building\nmaterials rise, innovative ways to stabilizing bricks have to do to lessen the effects on\nthe environment by regular bricks.\nClay bricks, in Uganda, omnipresent for their strength and insulating ability, can\ncompletely be exploited by subjecting them to stabilization treatments to convert them\nto mechanically reinforced and environment-safe bricks. Studies in recent decades\nhave revealed extensive opportunities for application of bio-enzyme technology in\nquality improvement of clay bricks. In their natural forms, bio-enzymes, microbially\nproduced catalysts, have revealed opportunities to catalyze reactions to improve\nbonding quality of clay in combinations with traditional stabilizers such as cement and\nlime.\nIn addition, fibers such as natural fibers made of pineapple leaf fibers (PALF) have found\nattention for their ability to strengthen construction materials. PALF is widely available\nin Uganda, and its utilization in clay bricks would be a sustainable alternative to the\nlimitations provided by traditional stabilization techniques. This study seeks to explore\nthe synergetic effects of pineapple leaf fiber and bio-enzyme on the stabilization of\nclay bricks in terms of their mechanical strengths, durability, and eco-sustainability.", "word_count": 403, "start_char": 7217, "end_char": 10808}
{"chunk_id": "DOC0136__00003", "doc_id": "DOC0136", "chunk_index": 3, "text": "ALF is widely available\nin Uganda, and its utilization in clay bricks would be a sustainable alternative to the\nlimitations provided by traditional stabilization techniques.T\n\nhis study seeks to explore\nthe synergetic effects of pineapple leaf fiber and bio-enzyme on the stabilization of\nclay bricks in terms of their mechanical strengths, durability, and eco-sustainability.\n\n1.2\nBACKGROUND\nUganda, like most developing nations, is faced with an acute shortage of housing\nresulting from urbanization and population growth. Clay bricks are among the most\nwidely used construction materials for building in both urban and rural areas because\nthey are readily available and affordable. In regions like Kapchorwa, production of clay\nbricks is normally on a small scale from locally available clay of high plasticity that\nrequires stabilization to enhance strength and durability. Nevertheless, the\nconventional technique of clay brick firing using firewood is not just energy-consuming\nbut also causing serious environmental concerns. The practice is leading to\ndeforestation, which is resulting in biodiversity loss, soil erosion, and carbon dioxide\nemission in the environment. Research indicated that the forest cover in Uganda is\ndiminishing at a rate of 1.8% per year, and the majority of the loss is due to fuelwood\nharvesting for brick kilns (Bodipo-Memba et al., 2022). High plasticity clays, which\noccur in districts like Kapchorwa, pose further problems. These soils, which have a high\nmontmorillonite content, swell when wet and shrink when dry, making structures\nconstructed from them without stabilization vulnerable to instability. While fired\nbricks, by making available better compressive strength, alleviate this challenge, they\nare high in environmental as well as economic kiln cost. Other types of stabilization,\nand especially those minimizing the use of firewood, are thus sorely required.\nPineapple leaf fiber (PALF) is an abundant agricultural residue in Uganda, particularly\nin areas where the cultivation of pineapple is widespread like Kayunga, Luwero and\nMukono.\n\nPineapple leaves are presently disposed of as waste during pruning. Nevertheless, the\nstudy reveals that PALF has superior tensile strength and binding qualities and can be\nutilized as reinforcement material in building construction (Razman et al., 2024). By\nintegrating bio-enzyme stabilization techniques with PALF, the present research seeks\nto investigate an eco-friendly alternative that not only mitigates the issues of plasticity\nin clay soil but also minimizes environmental degradation linked to conventional brickmaking processes.", "word_count": 381, "start_char": 10432, "end_char": 13062}
{"chunk_id": "DOC0136__00004", "doc_id": "DOC0136", "chunk_index": 4, "text": "y\nintegrating bio-enzyme stabilization techniques with PALF, the present research seeks\nto investigate an eco-friendly alternative that not only mitigates the issues of plasticity\nin clay soil but also minimizes environmental degradation linked to conventional brickmaking processes.\n\n1.3 PROBLEM STATEMENT\nThe traditional clay brick production in Uganda relies heavily on firewood, and as such,\nit results in tremendous deforestation and greenhouse emissions. Firewood fuels over\n70% of the energy used in the brick kiln and results in the burning of approximately\n92,000 hectares of forest cover annually (Bodipo-Memba et al., 2022). The process is\nunsustainable and poses a risk to Uganda's natural resources and environmental wellbeing.\nIn eastern Uganda, Budadiri, Chelel, Mutufu, and Siron are also affected by expansive\nsmectite clays (Wasajja-Navoyojo et al., 2016; Mukasa-Tebandeke et al., 2015). The\nclays are highly acidic (0.1-1.85 mol/g) relative to kaolinite clays from central Uganda\n(Mukasa-Tebandeke et al., 2014). The characteristics, such as enormous chemically\nactive surface areas, influence water absorption and liquid flow behavior (Odom, 1984).\nCement and lime are being widely utilized as stabilizers but are energy-intensive, thus\ncausing greenhouse gas emissions. Environmentally friendly alternatives are urgently\nneeded. Bio-enzymes, i.e., Terrazyme, have the potential to enhance compressive\nstrength and reduce permeability via stable clay aggregates formation (Saini &\nVaishnava, 2015). This study suggests mixing bio-enzymes with pineapple leaf fibers for\nthe development of a hybrid stabilization method that reduces the environmental\nimpact of brick manufacturing.\n\n1.4 MAIN OBJECTIVE OF THE STUDY\nTo assess the use of a bio-enzyme and pineapple leaf fibers as a stabilizer in clay bricks.\n1.5 SPECIFIC OBJECTIVES\n1. To determine the soil properties of the clay brick.\n2. To determine the physical properties of pineapple leaf fibers.\n3. To evaluate the engineering properties of stabilized clay bricks and identify the\noptimal ratio for the mix.\n1.6 RESEARCH QUESTIONS\n1. What are the soil properties of the clay brick?\n2. What are the physical properties of pineapple leaf fibers?\n3. What are the engineering properties of a bio-enzyme and pineapple leaf fiberstabilized clay bricks and the optimal ratio for the mix?\n1.7 JUSTIFICATION\nIn Siron Village, located in Kirwoko Parish, Kaptanya Subcounty, Kapchorwa District,\nclay soils primarily consist of Montmorillonite, which has a high cation exchange\ncapacity. This leads to significant swelling as the clay absorbs large amounts of water,\nincreasing its volume.\nBio-enzymes like Terrazyme, an organic and non-toxic formulation derived from the\nfermentation of fruit and vegetable waste, enhance soil engineering properties.\nTerrazyme catalyzes reactions between clay particles and organic cations, reducing\nwater absorption and increasing compaction (Shah, 2017; Suresh, 2017). Studies", "word_count": 427, "start_char": 12779, "end_char": 15754}
{"chunk_id": "DOC0136__00005", "doc_id": "DOC0136", "chunk_index": 5, "text": "his leads to significant swelling as the clay absorbs large amounts of water,\nincreasing its volume.B\n\nio-enzymes like Terrazyme, an organic and non-toxic formulation derived from the\nfermentation of fruit and vegetable waste, enhance soil engineering properties.T\n\nerrazyme catalyzes reactions between clay particles and organic cations, reducing\nwater absorption and increasing compaction (Shah, 2017; Suresh, 2017).S\n\ntudies\n\nindicate improvements in the California Bearing Ratio (CBR) values of treated soil, with\noptimal results typically at 0.5 ml per 100 ml of water (Suresh, 2017; Panchal, 2017).\nThis treatment enhances soil strength and can reduce pavement thickness, potentially\nsaving up to 30% in road construction costs (Suresh, 2017).\nPineapple leaf fibers (PALF) also show promise as reinforcement in clay and earth\nbricks, demonstrating tensile strength ranging from 16.71 MPa to 76.47 MPa, with\noptimal fiber loading (Kasim et al., 2015; Odusote & Kumar, 2016; Susilowati &\nSumardiyanto, 2018).\n\n1.8 SCOPE\nThis research will focus on the clay found in Siron Village, in Kirwoko Parish, Kaptanya\nSubcounty, Kapchorwa District, Uganda. It will focus on assessing the physical\nproperties of the pineapple leaf fibers, determining their optimal mix for brick\nstabilization, and evaluating the resulting bricks' engineering properties. The study will\ninvolve laboratory testing of bricks stabilized with varying ratios of bio-enzyme and\npineapple leaf fiber.\n\nCHAPTER TWO: LITERATURE REVIEW\n2.1 CLAY SOILS\nClay soils comprise fine grains composed of clay minerals whose grain is below 2\nmicrometers. The soils exhibit good plasticity, cation exchange ability (CEC), and\nholding of water and thus their application is vital in agricultural, civil engineering, and\nin environment application in Mukono and in Ugandans' eastern regions.\nClay soils have three classes, such as illite, smectite, and kaolinite. Smectite soils have\ngood swelling and good cation-exchanging property, but good for agricultural moisture\nand bad for building, in case of ground instability. The illite soils have average shrinkshrink and in building, while for low plasticity and strength, kaolinite is valued and\ngood for bricks and for ceramic industry (Belghazdis & Hachem, 2022; Mukasa-\nTebandeke et al., 2022).\n2.2 PROPERTIES OF SMECITE\nSmectite clays have good cation-exchanging capacities, and such capacities are\ndesirable for agricultural application in water scarcity soils (Keren, 2021). Such\ncapacities are desirable for agricultural application in water scarcity. The plasticity is,\nhowever, challenging to handle in construction. The illite clays, however, have average\nplasticity and low shrink-swelling, and such is desirable for application in building, for\nexample, in bricks' manufacture. Kaolinite is desirable for strength and stability under\nhigh-temperature, something desirable in strong bricks' and tiles' manufacture (Dixon,\n2022).", "word_count": 422, "start_char": 15327, "end_char": 18271}
{"chunk_id": "DOC0136__00006", "doc_id": "DOC0136", "chunk_index": 6, "text": "he plasticity is,\nhowever, challenging to handle in construction.T\n\nhe illite clays, however, have average\nplasticity and low shrink-swelling, and such is desirable for application in building, for\nexample, in bricks' manufacture.K\n\naolinite is desirable for strength and stability under\nhigh-temperature, something desirable in strong bricks' and tiles' manufacture (Dixon,\n2022).\n\n2.3 CLAY BRICKS\nClay bricks are materials for construction made through molding clay and subjecting\nthem to kilning. In Uganda, their standard measurement is 200mm in length, 100mm in\nbreadth, and 75mm in thickness. The bricks have various applications, including load\nwalls and foundations. The locally produced clay bricks have been used for housing and\nbuilding on a large scale, and offered an inexpensive and renewable source, in most\nrural societies where there is adequate clay (Ifurueze et al., 2018).\n2.4 STABILIZATION\nStabilization refers to any treatment to improve physical quality of building materials,\nfor instance, soils like clay, to make them resistant and to ensure them to function\nproperly. Stabilization is made up of addition of stabilizers like cement, cement, or bioenzymes, to which stabilizers have to undergo chemical reaction to soils or materials,\nto limit their plasticity, to strengthen them, and to protect them against deformation\nunder impact of such natural components such as water and shrinkage.\n2.4.1 Chemical Stabilization\nChemical stabilization is made possible through stabilizers such as cement and lime in\nclay soils to improve their engineering behavior. Stabilizers cement and cement in\nUganda have been largely employed. Stabilizer's calcium ions bind to clay minerals to\nform cementitious compounds, thus increased compressive strength and durability in\nclay bricks (Riza et al., 2011). Fly ash, combustion residue of coal, is also discovered\nto be used in stabilizing in various regions, posing an available low-impact solution.", "word_count": 289, "start_char": 17890, "end_char": 19850}
{"chunk_id": "DOC0136__00007", "doc_id": "DOC0136", "chunk_index": 7, "text": "tabilizers cement and cement in\nUganda have been largely employed.S\n\ntabilizer's calcium ions bind to clay minerals to\nform cementitious compounds, thus increased compressive strength and durability in\nclay bricks (Riza et al., 2011).F\n\nly ash, combustion residue of coal, is also discovered\nto be used in stabilizing in various regions, posing an available low-impact solution.\n\n2.4.2 Mechanical Stabilization\nMechanical stabilization compresses the mixture of clay to compact void space and to\nensure optimal density. The process strengthens and makes bricks moisture and natural\neffects resistant. Mechanism is oftentimes employed in Ugandan commercial bricks to\nensure standard shapes and dimensions (Firoozi et al., 2017).\n2.5 BIO-ENZYMES\nBio-enzymes are natural, organic compounds produced by fermenting plant materials\nincluding fruit, vegetable, or cane. In their role as stabilizers, bio-enzymes in stabilizing\nsoils modify physical and chemical states of soils, stabilizing, compacting, and\nstrengthening them to sustain load. As an organic, green cement or lime stabilizers'\nsubstitute, bio-enzymes have low carbon footprints and low ecological impact (Sathish\net al., 2021).\n2.6 Terrazyme as one of the bio enzymes for stabilization\nTerrazyme is a commonly used organic liquid enzyme in soil stabilization and soil\nimprovement, made of different vegetable and fruit extracts. Terrazyme positively\nchanges the California Bearing Ratio (CBR) and enhances soil strength while decreasing\nthe Optimum Moisture Content (OMC) and plasticity index (Ikeagwuani, & Nwonu,\n2019).\nAs the water is removed from the soil, the soil particles (mostly clay) have a greater\ncapacity to exchange cations, resulting in increased friction (Agarwal & Kaur, 2018).\nThe Terrazyme coats the clay particles to make them moisture resistant, which\n\nultimately results in a higher long-term stabilizing effect and biodegradability (Jain &\nSharma, 2020).\nTerrazyme is a dark brown liquid that dissolves in water and has a sweet molasses smell.\nIt is not an eye irritant, and personal protective equipment (i.e. masks and gloves) is\nnot required (Kumar et al., 2021).\nTerrazyme must be dosed correctly; under-dosing will have ineffective stabilization,\nand over-dosing is an unwanted expense without added benefit (Onah et al., 2022).\nTerrazyme can be dosed appropriately by performing a California Bearing Ratio (CBR)\ntest with soil samples mixed with varying concentrations of Terrazyme to conclude the\noptimal dosage for stabilization (Ikeagwuani & Nwonu 2019).\n\nProperties of Terrazyme\nTable 1 Terrazyme Properties (Navale et al., n.d.)\nProperty\nValue\nBoiling Point\nSame as water\nSolubility in water\nSame as water\nPH value\n3.50\nAppearance/ odor\nDark Brown, Non-Obnoxious\nTotal Dissolved Solids\n19.7ppm\nCation Exchange Capacity\n3.87\nHazardous Content\nNone\nMelting Point\nLiquid\nReactivity Data\nStable\nMaterials to Avoid\nCaustics and Strong Bases.\nSpecific Gravity\n1.05", "word_count": 430, "start_char": 19472, "end_char": 22423}
{"chunk_id": "DOC0136__00008", "doc_id": "DOC0136", "chunk_index": 8, "text": "roperties of Terrazyme\nTable 1 Terrazyme Properties (Navale et al., n.d.)\nProperty\nValue\nBoiling Point\nSame as water\nSolubility in water\nSame as water\nPH value\n3.50\nAppearance/ odor\nDark Brown, Non-Obnoxious\nTotal Dissolved Solids\n19.7ppm\nCation Exchange Capacity\n3.87\nHazardous Content\nNone\nMelting Point\nLiquid\nReactivity Data\nStable\nMaterials to Avoid\nCaustics and Strong Bases.S\n\npecific Gravity\n1.05\n\n2.6.1 Mechanism of bio-enzyme stabilization\nBio-enzymes can have a positive impact on the stability of soil through the alteration\nin soil grain arrangements. In soils with a high clay content, the enzymes can assist in\nre-aggregation of clay particles from de-aggregation of organic matter, allowing certain\nchemical reactions to occur that facilitate the decomposition of water-clay bonds\n\n(Ikeagwuani & Nwonu, 2019). The outcome of these actions reduces the swellingshrinkage behavior of expansive clays and enhances solidification of the soil (Agarwal\n& Kaur, 2018). The stabilization process includes: Cation exchange reducing clays\nplasticity through the replacement of the absorbable water molecule with stabilizing\nions (Jain & Sharma, 2020).\n2.6.2 Promote cation exchange\nBio-enzymes facilitate cation replacement between clay minerals in such a manner in\nwhich calcium and magnesium ions replace sodium ions in clay structure. The cation\nreplacement lowers electrostatic repellency between clay materials, and thus, forms\ndenser and stable structure in soils (Narain et al., 2020).\n2.6.3 Reduce plasticity\nBio-enzymes significantly constrain plasticity index of the soil, and swelling and waterabsorbing ability is compromised. The consequence is to render the soil impermeable\nto water deterioration and, therefore, wet durability is enhanced (Sathish et al., 2021).\n2.7 Natural fibers (Pineapple Leaf Fiber)\nPineapple leaf fibers consist of plant leaves Ananas comosus. The plant is renewable\nresource and green in accordance to their degradable and renewable property and their\navailable by-product in agricultural industry (Behera et al., 2019). The pine leaf fibers\nhave good extension strength resistance and good strength in building materials, in\ncomposites and earth stabilizers.", "word_count": 315, "start_char": 22019, "end_char": 24223}
{"chunk_id": "DOC0136__00009", "doc_id": "DOC0136", "chunk_index": 9, "text": "he plant is renewable\nresource and green in accordance to their degradable and renewable property and their\navailable by-product in agricultural industry (Behera et al., 2019).T\n\nhe pine leaf fibers\nhave good extension strength resistance and good strength in building materials, in\ncomposites and earth stabilizers.\n\nCHAPTER THREE: METHODOLOGY\n3.1 To determine the soil properties of the clay bric\n3.1.1 Particle Size Distribution\n3.1.1.1 Sieve Analysis\nThis method evaluated soils with particle sizes ranging from gravel to fine sand. The\ndetailed procedure was as follows.\nMaterials required.\n•\nA set of sieves with appropriate aperture sizes, typically ranging from 63 mm to\n63 μm, depending on the soil sample.\n•\nMechanical sieve shaker to facilitate consistent sieving.\n•\nBalance readable to 0.01 g for precise measurements.\n•\nDrying oven capable of maintaining temperatures between 105°C and 110°C.\n•\nMetal trays for handling soil samples.\n•\nSieve brushes for cleaning sieves.\n•\nSieve analysis worksheet for recording data.\nSample Preparation. The soil sample was Placed in a dried to remove moisture. After\ndrying, it was weighed accurately, m0.\nThe sieves were arranged in descending order of aperture size, from largest to smallest,\nensuring each sieve was clean and undamaged. And place the dried soil sample onto\nthe top sieve of 63mm.\n\nSecured the sieve stack in the mechanical sieve shaker and operated it for a standard\nduration, typically 10 to 15 minutes, to ensure thorough separation of particle sizes.\nAfter sieving, carefully removed each sieve, starting from the top, and weighed the soil\nretained on each sieve separately.\nNoted the mass of soil retained on each sieve and calculated the percentage retained\nrelative to the total sample mass.\nDetermined the cumulative percentage passing each sieve size by subtracting the\ncumulative percentage retained from 100%.\nPlotted the cumulative percentage passing against the corresponding sieve sizes on\nsemi-logarithmic graph paper to produce the particle size distribution curve, which aids\nin soil classification and assessment.\n\n3.1.2 Atterberg Limits Test (Plastic Limit, Liquid Limit, and Plasticity Index)\nThe Atterberg Limits (Liquid Limit, Plastic Limit, and Plasticity Index) were determined\nin accordance with British Standard BS 1377-2:1990. These tests classify fine-grained\nsoils based on their consistency and plasticity. ‘\nLiquid Limit (LL) – Cone Penetrometer Method (BS 1377-2:1990, Clause 4.3)\nThis method determined the moisture content at which a soil transitions from a liquid\nto a plastic state.\nMaterials Required:\n• Cone penetrometer (30° cone, 80g ± 0.5g total mass).", "word_count": 404, "start_char": 23907, "end_char": 26567}
{"chunk_id": "DOC0136__00010", "doc_id": "DOC0136", "chunk_index": 10, "text": "hese tests classify fine-grained\nsoils based on their consistency and plasticity. ‘\nLiquid Limit (LL) – Cone Penetrometer Method (BS 1377-2:1990, Clause 4.3)\nThis method determined the moisture content at which a soil transitions from a liquid\nto a plastic state.M\n\naterials Required:\n• Cone penetrometer (30° cone, 80g ± 0.5g total mass).\n\n• Penetration measurement device.\n• Mixing tools (spatula, glass plate).\n• 425 μm sieve.\n• Moisture content containers.\n• Oven and balance (readable to 0.01 g).\n• Distilled water.\nProcedure\nThe soil sample was air-dried and sieved through a 425 μm sieve.\nThe sieved soil was mixed with distilled water to form a smooth, homogeneous paste.\nThe soil paste was placed in the penetrometer cup, and the surface was leveled.\nThe cone was lowered until it just touched the soil surface, and it was then released\nfor 5 seconds.\nThe penetration depth of the cone into the soil was measured.\nThe moisture content of the soil was adjusted, and the process was repeated to obtain\nat least four penetration readings bracketing 20 mm.\nThe penetration depth (mm) was plotted against the moisture content (%) on a graph.\nThe Liquid Limit (LL) was the moisture content corresponding to 20 mm penetration,\ninterpolated from the flow curve.\n\nPlastic Limit (PL) (BS 1377-2:1990, Clause 5.3)\nThis method determined the moisture content at which a soil transitions from a plastic\nto a semi-solid state.\nMaterials Required:\nGlass plate.\n3 mm rolling rods.\n425 μm sieve.\nMoisture content containers.\nOven and balance (readable to 0.01 g).\nDistilled water.\nProcedure\nUse approximately 20 g of soil that had passed through a 425 μm sieve.\nThe soil was mixed with distilled water to form a stiff, plastic paste.\nThe soil paste was rolled into a 3 mm diameter thread on the glass plate.\nIf the thread crumbled at 3 mm diameter, the crumbled soil was collected for moisture\ncontent determination.\nThe process was repeated until consistent crumbling occurred at 3 mm diameter.\nThe moisture content of the crumbled soil was determined.\nThe results of two trials were averaged to obtain the Plastic Limit (PL).\n\nPlasticity index (PI)\nThe difference between the liquid limit and the plastic limit was calculated as the\nplasticity index.\nPI = LL – PL (as a percentage)", "word_count": 377, "start_char": 26228, "end_char": 28503}
{"chunk_id": "DOC0136__00011", "doc_id": "DOC0136", "chunk_index": 11, "text": "he moisture content of the crumbled soil was determined.T\n\nhe results of two trials were averaged to obtain the Plastic Limit (PL).P\n\nlasticity index (PI)\nThe difference between the liquid limit and the plastic limit was calculated as the\nplasticity index.P\n\nI = LL – PL (as a percentage)\n\n3.1.3 The X-ray Fluorescence (XRF)\nThis test was performed to evaluate the chemical composition of clay soil in accordance\nwith ASTM D5381-93 (2021). The clay soil sample was left to air dry, ground to pass\nthrough a 75-micron sieve, and weighed (15g), then placed in a plastic sample cup with\na support film to establish a flat surface for scanning.\nThe sample was compacted and area crushed for homogeneous distribution.\nStandardized reference materials were utilized to calibrate the XRF spectrometer.\nThe sample was placed into the spectrometer, and an X-ray beam was directed at the\nsurface of the sample while the fluorescence emissions were recorded and analyzed.\nThe XRF assessment provided quantitative data on the percent archaeometric\ncompositions of the significant oxides of SiO2, Al2O3, Fe2O3, CaO, MgO, Na2O and K2O\noxides found in the clay soil. The reported values could then be used to evaluate the\nsoil material for engineering purposes.\nThe protocols for preparation were strictly followed so accurate results would be\nobtained. The X-ray fluorescence test will display reliable results for chemical analysis\nof clay soil. Proper sample preparation, calibration, and positioning provided accurate\n\nresults in support of decisions such as: soil stabilization, construction material\nselection, and geotechnical applications.\n\n3.1.4 Free Swell Index (FSI) Test\nThe free swell test, using the USBR (United States Bureau of Reclamation) method,\ndetermined the potential for a soil to swell when exposed to water by measuring the\nincrease in volume of a soil sample after it was immersed in water. This method was\ndeveloped by Holtz and Gibbs (1956) and was used to assess soil expansivity.\nFree swell ratio was defined as the ratio of the equilibrium sediment volume of a 10 g\noven-dried soil sample that had passed through a 425 μm sieve and was placed in a 100\nml graduated measuring jar containing distilled water, to that in kerosene, after an\nequilibration period of a minimum of 24 hours.\nThis test was used to check volume expansion in water in soils, which was crucial in\nidentifying swelling soils. The swelling property was significant in testing stabilization\ntreatments.\n\n3.1.5 Compressive Strength Test BS EN 772-1:2011\nThis test was conducted to determine the maximum compressive load that a masonry\nunit can withstand before failure, crucial for evaluating its structural integrity.\nMaterials and Apparatus Required:", "word_count": 432, "start_char": 28215, "end_char": 30951}
{"chunk_id": "DOC0136__00012", "doc_id": "DOC0136", "chunk_index": 12, "text": "he swelling property was significant in testing stabilization\ntreatments.\n\n3.1.5 Compressive Strength Test BS EN 772-1:2011\nThis test was conducted to determine the maximum compressive load that a masonry\nunit can withstand before failure, crucial for evaluating its structural integrity.M\n\naterials and Apparatus Required:\n\n• Compression testing machine, compliant with BS EN 772-1:2011,\ncapable of applying a controlled compressive load.\n• Measuring devices (e.g., calipers, rulers) for accurate measurement of\nspecimen dimensions.\n• Appropriate packing materials (e.g., plywood or steel plates) to ensure\nuniform load distribution.\n• Test specimens conforming to the dimensions specified in the\nstandard.\nThe test specimens were prepared according to the standard, ensuring that the loading\nsurfaces were flat and parallel.\nThe dimensions of each test specimen were measured and recorded.\nThe specimen was centered between the platens of the compression testing machine.\nIf necessary, packing materials were used to ensure uniform load distribution and to\nprevent premature failure due to uneven surfaces.\nThe compressive load was applied at a controlled rate, as specified in BS EN 772-1:2011.\nThe load was continuously applied until the specimen failed, and the maximum load\nachieved was recorded.\nThe compressive strength was calculated by dividing the maximum load by the crosssectional area of the specimen.\nThe compressive strength and failure mode for each test specimen were recorded.\n\nThe average compressive strength of the tested specimens was calculated.\nThe results were reported in accordance with the standard.\n\n3.1.6 Water Absorption Test BS EN 772-11:2011\nThis test was performed to determine the amount of water absorbed by a masonry unit,\nindicating its resistance to moisture and porosity.\nMaterials and Apparatus Required.\n• Water tank or container of sufficient size to fully immerse the masonry units.\n• Oven capable of maintaining a constant temperature (typically 105°C ± 5°C).\n• Balance, readable to 0.1% of the specimen's mass.\n• Clean, dry cloth.\n• Distilled or deionized water.\nDried the masonry units in an oven at 105°C ± 5°C until a constant mass was achieved.\nAllowed the dried units to cool to room temperature.\nMeasured and recorded the dry mass (Mdry) of each unit.\nImmersed the units completely in water at a specified temperature (typically room\ntemperature).\nSoaked the units for a specified period (e.g., 24 hours), as required by the application\nor standard.", "word_count": 379, "start_char": 30628, "end_char": 33130}
{"chunk_id": "DOC0136__00013", "doc_id": "DOC0136", "chunk_index": 13, "text": "llowed the dried units to cool to room temperature.M\n\neasured and recorded the dry mass (Mdry) of each unit.I\n\nmmersed the units completely in water at a specified temperature (typically room\ntemperature).S\n\noaked the units for a specified period (e.g., 24 hours), as required by the application\nor standard.\n\nRemoved the units from the water and allowed excess water to drain off.\nWiped the surface of each unit with a damp cloth to remove surface water.\nMeasured and recorded the saturated mass (Msat) of each unit.\nCalculated the water absorption (Wa) as a percentage of the dry mass using the\nformula: Wa =\n(Msat − Mdry)\nMdry\n× 100\nRecorded the results for each unit and calculated the average water absorption for the\nsample.\n3.2 Determining Physical Properties of Pineapple Leaf Fiber\nProduction of Pineapple Leaf Fiber (PALF)\nThe production of pineapples fibres was achieved by plucking green leaves of\npineapples, scratching them by blunt knife to expose the fibers.\nThe fibers are then treated in alkaline solution inform of Wood Ash treatment for\nsuitability for a rural setting.\nThe fibres are dried in 24-48 hours in aerated atmosphere until dry. The dry fibres, last,\nkeep in closed, moisture proof packages to maintain them in good quality and free\nmoisture, for testing their physical and chemical characters.\n\nPhysical Properties Evaluation of PPLA\n3.2.1 Tensile Strength Test (ASTM D2256).\nThis test, performed according to ASTM D2256, measured the following properties:\no Breaking Force (gf)\no Elongation (mm)\no Fiber Strength (RKM - breaking length, g/tex)\no Breaking Work (gf*cm)\no Time to Break (s)\n•\nMaterials and Apparatus Required:\no Tenso aster Tester (Tensile Testing Machine / Universal Testing Machine)\no PPLA fiber samples\no ASTM D2256 standard document\n•\nPrepared fiber samples according to the specifications outlined in ASTM D2256.\nMeasured and recorded the initial dimensions of each fiber sample.\nSecurely clamped the fiber sample between the grips of the Tenso Aster Tester.\nApplied a tensile load at a controlled rate, as specified in the standard.\nRecorded the force and elongation during the test.", "word_count": 344, "start_char": 32822, "end_char": 34957}
{"chunk_id": "DOC0136__00014", "doc_id": "DOC0136", "chunk_index": 14, "text": "easured and recorded the initial dimensions of each fiber sample.S\n\necurely clamped the fiber sample between the grips of the Tenso Aster Tester.A\n\npplied a tensile load at a controlled rate, as specified in the standard.R\n\necorded the force and elongation during the test.\n\nContinued applying the load until the fiber broke, recording the breaking force,\nbreaking work, and time to break.\nCalculated the tensile strength, elongation, and fiber strength (RKM).\nRecorded the results for each fiber sample and calculated the average values.\nReported the results in accordance with ASTM D2256.\n3.2.2 Fiber Diameter Measurement.\nTool: Vernier Caliper\nTo accurately measure an object with a Vernier caliper, first ensured clean jaws and\nproper zeroing. Then, gently placed the object between the jaws, gripped it securely,\nand aligned the Vernier scale. Read the whole unit from the main scale and the\nfractional part from the Vernier scale by identifying the aligned lines. Finally, added\nthese values together to obtain the total measurement.\n\n3.3 To evaluate the engineering properties of stabilized clay bricks and identify the\noptimal ratio for the mix.\n3.3.1 Bio-Enzyme ratios\nThe bio-enzyme Terrazyme used in this study was sourced from Nature Plus, Inc., a\nrecognized supplier of soil stabilization products, and obtained through a local\ndistributor Ultra chemis Co. Ltd, plot 45, Mulwana road, Bugolobi industrial area, K'la,\nopposite Uganda Baati. Terrazyme was mixed with water in varying proportions prior to\n\napplication, facilitating an enzymatic reaction upon contact with the soil. The specific\nproperties of Terrazyme utilized in this study are detailed in Chapter 2, Table.\nThe bio-enzyme was mixed in different ratios of 0 ml/m3, 50 ml/m3, 100 ml/m3, and\n150 ml/m3 of soil, with the Terrazyme first diluted in water before being incorporated\ninto the clay-compost mixture.\nThe bio-enzyme was mixed in different ratios of 0 ml/m3, 50 ml/m3, 100 ml/m3, and\n150 ml/m3 of soil, but was first mixed in water.\n3.3.2 Pineapple Leaf Fiber (PALF) Proportions\nPALF ratio used is 0%, 1%, 2% and 3% by weight of soil. and their impact on strength and\nshrink resistance in materials made of clay-compost.\nMix Proportions\nVarious mixtures proportions have to be tried, using bio-enzyme and PALF in ranges\n\nPineapple Leaf Fiber (%)\n0%\n1%\n2%\nBio-Enzyme\n(ml/m3)\n0 ml/m3\n0 ml/m3, 0%\n0 ml/m3, 1%\n0 ml/m3, 2%\n50 ml/m3\n50 ml/m3, 0%\n50 ml/m3, 1%\n50 ml/m3, 2%\n100 ml/m3\n100 ml/m3, 0%\n100 ml/m3, 1%\n100 ml/m3, 2%\n150 ml/m3\n150 ml/m3, 0%\n150 ml/m3, 1%\n150 ml/m3, 2%", "word_count": 416, "start_char": 34684, "end_char": 37238}
{"chunk_id": "DOC0136__00015", "doc_id": "DOC0136", "chunk_index": 15, "text": "Each combination was mixed in their totality in earth to yield an equivalent quantity of\nboth bio-enzyme and PALF.\nConsidering the final test being the strength test and water absorption test, all done in\ntriplicates, the total number of bricks made was 96 clay bricks.\n3.3.3 1.\nCompressive Strength Standard Test.\nStandard: BS EN 772-1:2011 - Test for masonry units. Compressive strength.\nThis was to test stabilized clay load-baring strength. The greater compressive strength\nis evidence for greater stabilization and hence strength.\n3.3.4 2.\nWater Absorption Test Standard.\nStandard: BS EN 772-11:2011 - Test for masonry components. Part 11: Water absorption.\nThis test was to verify volume of water absorbed by the brick in 24 hours under soaking\nin water. Water absorption rate is to be determined by before and after soaking in\nwater. Water absorption values, if low, will illustrate good moisture resistance and\ndurability.\n\nCHAPTER FOUR: RESULTS AND DISCUSSION\nThis chapter discusses and examines the findings from several test results of the\nmaterials tested and compared to the existing requirements. These tests included those\ncarried out on the existing bricks and soils and the stabilized bricks. The tests include;\nstrength test, water absorption test, the Atterberg limits test and the free swell index\ntest.\n\n4.1 Objective one: Determining the soil properties of the clay brick.\nThe soils were analyzed at the Stirling Laboratory in Malaba, Mukono, after being\ncollected from Siron village, Kapchorwa District. The soil was greyish in color and\nseveral tests were carried out on it and these include; particle size distribution,\nAtterberg tests, free swell Index. The strength and water absorption of the site bricks\nwere also tested and these were carried out on both the fired and unfired bricks.\n4.1.1 Particle Size Distribution\n1. Sieve analysis\nSieve Size (mm)\nPassing (%)\n4.750\n99.0\n2.360\n97.0\n1.180\n94.0\n0.425\n90.0\n0.075\n80.0\n\nFigure 1 Particle size Distribution\n\nThe results indicated that the coarser fractions (sand-sized particles) are minimal, with\nonly 1% retained on the 4.75 mm sieve while, a large portion (80%) of the sample is\nfiner than 0.075 mm, which means the sample is mostly fine-grained material and based\non BS 1377-2:1990, soils with a high percentage of fine particles are typically clayey\nsilts or clays. This confirms that the soil is predominantly a fine-grained material, likely\nclayey soil, which aligns with the project’s focus on stabilizing clay bricks.", "word_count": 395, "start_char": 37238, "end_char": 39743}
{"chunk_id": "DOC0136__00016", "doc_id": "DOC0136", "chunk_index": 16, "text": "his confirms that the soil is predominantly a fine-grained material, likely\nclayey soil, which aligns with the project’s focus on stabilizing clay bricks.\n\n4.1.2 Atterberg Limits test on the clay soil sample\nThe Atterberg Limits—Liquid Limit (LL), Plastic Limit (PL), and Plasticity Index (PI)—are\ncritical indicators of the engineering behavior of fine-grained soils, particularly their\nresponse to moisture changes. The results for the clay soil from Siron Village, Uganda,\nare as follows:\n0.01\n0.10\n1.00\n10.00\n% Passing\nDiameter(mm)\n\nLiquid Limit (LL): 57.6%\nPlastic Limit (PL): 27.6%\nPlasticity Index (PI): 30.0%\n\nLiquid Limit (LL)\nThe LL of 57.6% signifies the soil’s high water-holding capacity, characteristic of\nmontmorillonite-rich clays. At this moisture content, the soil transitions from a plastic\nto a liquid state. Such a high LL suggests that the soil is prone to significant volume\nexpansion when saturated, making it unsuitable for construction without stabilization.\nMontmorillonite’s layered structure and high cation exchange capacity (CEC)\nexacerbate this behavior, as water molecules infiltrate the mineral layers, causing\nswelling.\nPlastic Limit (PL):\nThe PL of 27.6% represents the moisture content below which the soil becomes brittle\nand cracks under stress. While this value is moderate compared to highly organic soils,\nit underscores the soil’s sensitivity to drying. During brick production, maintaining\nmoisture slightly above the PL is essential to ensure workability. However, exceeding\nthis threshold risks deformation, while under-drying leads to brittleness.\nPlasticity Index (PI):\nThe PI (LL − PL = 30.0%) categorizes the soil as highly plastic (PI > 25%). According to\nthe Unified Soil Classification System (USCS), this soil falls under CH (high-plasticity\n\nclay). High PI soils exhibit pronounced shrink-swell behavior, expanding when wet and\ncontracting when dry. The PI (30%) aligns with studies on Ugandan montmorillonite\nclays, which report PI values of 25–35% (Mukasa-Tebandeke et al., 2022).\n\nUSCS classification Chart\nThe Unified Soil Classification System (USCS) classifies soils based on their particle size\ndistribution and plasticity characteristics. Based on the results archieved, the soil\nsample can be classified as follows:\n\nFigure 2 USCS classification Chart (California Department of Transportation (Caltrans))\n\nGrain Size Distribution Analysis:\no 80% of the soil passes through the 0.075 mm sieve, indicating that it is a\nfine-grained soil.\no According to the USCS, soils with more than 50% passing through the 0.075\nmm sieve are classified as fine-grained soils (silts or clays).\nPlasticity Analysis:\no Liquid Limit (LL) = 57.6%\no Plasticity Index (PI) = 30.0%\no According to the USCS classification:\n▪\nIf LL > 50%, the soil is classified as high plasticity.\n▪\nA PI of 30% confirms that the soil exhibits high plasticity, meaning\nit undergoes significant volume changes with moisture variation.", "word_count": 439, "start_char": 39589, "end_char": 42543}
{"chunk_id": "DOC0136__00017", "doc_id": "DOC0136", "chunk_index": 17, "text": "lasticity Analysis:\no Liquid Limit (LL) = 57.6%\no Plasticity Index (PI) = 30.0%\no According to the USCS classification:\n▪\nIf LL > 50%, the soil is classified as high plasticity.\n▪\nA PI of 30% confirms that the soil exhibits high plasticity, meaning\nit undergoes significant volume changes with moisture variation.\n\nUSCS Plasticity Chart provided below in fig 2. along with the test results, we can\nvisually and logically confirm the soil classification.\n▪\nLL = 57.6 on the x-axis of the chart.\n▪\nPI = 30.0 on the y-axis.\n▪\nPlotted the point (57.6, 30.0) on the graph.\n\nFigure 3 Plasticity Chart for USCS\nFrom the chart:\n▪ The plotted point lies above the A-line.\n▪ It is located in the CH zone, which stands for Clay of High Plasticity\n4.1.3 XRF test of the clay soil\nThe X-Ray Fluorescence (XRF) analysis provides a chemical composition of Siron clay,\nwhich is compared with Illite and Montmorillonite clay standards. This comparison helps\nin classifying the soil type and understanding its behavior in engineering applications.\n\nTable 2 XRF test Results of siron soil.\nOxide (%)\nSiron Clay\nIllite\nMontmorillonite\nSiO2 (Silicon Dioxide)\n48.27\n50–60\n55–65\nAl2O3 (Aluminum Oxide)\n20.53\n15–25\n20–30\nFe2O3 (Ferric Oxide)\n10.18\n4–8\n2–5\nCaO (Calcium Oxide)\n7.32\n0–3\n1–5\nMgO (Magnesium Oxide)\n4.22\n1–3\n3–10\nK2O (Potassium Oxide)\n3.56\n3–7\n0.5–3\nNa2O (Sodium Oxide)\n2.87\n0.5–2\n1–4\nTiO2 (Titanium Dioxide)\n1.23\n0.5–1.5\n0.2–1\nMnO (Manganese Oxide)\n0.85\n<0.5\n<0.5\nCuO (Copper Oxide)\n0.29\nTrace\nTrace\n\nComparison of Siron Clay (XRF Results) to Illite and Montmorillonite Clay Standards\nTo assess the characteristics of the clay soil from Siron, Kapchorwa District, a\ncomparison on its chemical composition was made to the standard compositions of Illite\nand Montmorillonite clays. This helped determine which category it closely aligns with\nand how it influences the stabilization and engineering behavior of the soil.\nKey Observations & Comparisons\n1. Silica (SiO2) Content\nSiron Clay: 48.27%\nIllite Range: 50–60%\n\nMontmorillonite Range: 55–65%\n▪ Siron clay has slightly lower silica content than Illite and Montmorillonite,\nmeaning it may have lower resistance to shrinkage and expansion.\n2. Aluminum Oxide (Al2O3) Content\nSiron Clay: 20.53%\nIllite Range: 15–25%\nMontmorillonite Range: 20–30%\n▪ Siron clay matches closely with Montmorillonite in Al2O3 content, suggesting it\nhas good plasticity but potential shrink-swell issues.\n3. Iron Oxide (Fe2O3) Content\nSiron Clay: 10.18%\nIllite Range: 4–8%\nMontmorillonite Range: 2–5%\n▪ Siron clay has much higher Fe2O3 than both Illite and Montmorillonite. This\nmeans it will produce reddish bricks when fired but may also be more brittle\nthan Montmorillonite clays.\n4. Calcium Oxide (CaO) Content\nSiron Clay: 7.32%\nIllite Range: 0–3%\nMontmorillonite Range: 1–5%", "word_count": 442, "start_char": 42230, "end_char": 45024}
{"chunk_id": "DOC0136__00018", "doc_id": "DOC0136", "chunk_index": 18, "text": "ron Oxide (Fe2O3) Content\nSiron Clay: 10.18%\nIllite Range: 4–8%\nMontmorillonite Range: 2–5%\n▪ Siron clay has much higher Fe2O3 than both Illite and Montmorillonite.T\n\nhis\nmeans it will produce reddish bricks when fired but may also be more brittle\nthan Montmorillonite clays.\n4.C\n\nalcium Oxide (CaO) Content\nSiron Clay: 7.32%\nIllite Range: 0–3%\nMontmorillonite Range: 1–5%\n\n▪ Siron clay has significantly higher CaO, closer to Montmorillonite, making it\nmore self-stabilizing but prone to lime popping (expansion issues).\n5. Magnesium Oxide (MgO) Content\nSiron Clay: 4.22%\nIllite Range: 1–3%\nMontmorillonite Range: 3–10%\n▪ Siron clay has MgO within the Montmorillonite range, meaning it has some selfhardening properties but not as much as high-MgO Montmorillonite. And also\ncontributes to the swelling potential of the clay.\n6. Potassium Oxide (K2O) Content\nSiron Clay: 3.56%\nIllite Range: 3–7%\nMontmorillonite Range: 0.5–3%\n▪ Siron clay is similar to Illite in K2O content, meaning it may have some\nresistance to chemical weathering and high-temperature durability.\n7. Sodium Oxide (Na2O) Content\nSiron Clay: 2.87%\nIllite Range: 0.5–2%\nMontmorillonite Range: 1–4%\n▪ The Na2O content in Siron clay is greater than that in Montmorillonite,\nmeaning it is responsible for the swelling potential in this clay.\n\n4.1.4 Free Swell Index (FSI) Test (BS 1377-2:1990)\nFSI = 85.41% which was quite high and it occurs due to high presence of sodium ions,\nMagnesium ions primarily. This means the clay soil swells when wet and shrinks when\ndry.\nHow swelling occurs;\n•\nMontmorillonite has weak Van der Waals forces and cation exchange sites (Na+,\nand Mg2+) that attract water molecules, leading to interlayer expansion.\n•\nIllite swells moderately because its interlayers contain K+ ions, which hold the\nstructure but allow slight expansion.\nThus, high FSI values suggest the presence of Montmorillonite, while low values indicate\nKaolinite-dominant soil.\nTable 3 Standard Classification of Swelling Potential (as per IS 1498-1970 & Literature Studies)\nFSI (%)\nSwelling Potential\nReference\n<50%\nLow Swelling\nIS 1498-1970, Seed et al. (1962)\n50-100%\nModerate to High Swelling\nHoltz & Kovacs (1981)\n>100%\nVery High Swelling\nSridharan & Prakash (2000)\n\nThe value of 85.41% is high and could have adverse effects if the caly soil is utilized\nwithout a form of stabilization.\n\n4.1.5 The compressive strength test\nThe compressive strength test evaluates the ability of bricks to withstand axial loads,\nwhich is crucial in determining their structural applicability. The results for the Siron\nclay bricks are compared against the BS EN 772-1:2011 and BS EN 771-1 standards, as\nshown in the table below:\nTable 4 Siron bricks compressive test results.\nBrick Type\nTested Siron brick\nStrength (MPa)\nBS Minimum Standard\n(MPa)\nMeets\nFired Bricks\n3.9\n≥5 MPa\n\n(BS EN 772-1:2011)\nNo\nUnfired\nBricks\n1.7\n≥2 MPa", "word_count": 448, "start_char": 44652, "end_char": 47530}
{"chunk_id": "DOC0136__00019", "doc_id": "DOC0136", "chunk_index": 19, "text": "he results for the Siron\nclay bricks are compared against the BS EN 772-1:2011 and BS EN 771-1 standards, as\nshown in the table below:\nTable 4 Siron bricks compressive test results.B\n\nrick Type\nTested Siron brick\nStrength (MPa)\nBS Minimum Standard\n(MPa)\nMeets\nFired Bricks\n3.9\n≥5 MPa\n\n(BS EN 772-1:2011)\nNo\nUnfired\nBricks\n1.7\n≥2 MPa\n\n(BS EN 771-1)\nNo\n\nFired bricks (3.9 MPa vs. 5 MPa Standard)\nThe fired bricks from the case study had an average compressive strength of 3.9 MPa,\nwhich is considerably lower than the 5MPa compressive strength set as a threshold by\nBS EN 772-1:2011 for loadbearing walls.\nFired bricks from the case study could be appropriate for a non-load bearing application\n(e.g., partition walls), but in other applications for load-bearing mortar with a gross\n\nover-design will raise the safe load-bearing capacities of these bricks, possibly\nrendering them suitable with other allowances of safety values.\nFired bricks that do not structurally qualify as load bearing can be acceptable for walls\nor foundations with reinforcement, but the lack of strength for broader or unlimited\nuse must be established for any particular circumstance.\nThe lower strength may have multiple sources, such as:\n• Clay mineral composition: Higher proportions of smectite or montmorillonite\nmay yield higher shrinkage and cracking when fired too thoroughly.\n• Firing conditions: If the kiln temperature to not achieve a high enough\ntemperature (850 to 1100°C for fired bricks), then the dissipation of heat may\nleave the bricks incompletely sintered with badly weak inter-particle bonding.\n• Pore structure: If the clay is not adequately compacted before firing they may\nhave too much porosity leading to lower strength.\nUnfired bricks (1.7 MPa versus a 2 MPa standard)\nThe unfired bricks registered an average compressive strength of 1.7 MPa which is lower\nthan the 2 MPa minimum required by British Standards, BS EN 771-1, for non-fired loadbearing units, meaning that unfired bricks are structurally weak for any load-bearing\napplications without additional stabilization.\nThe expected low strength of the unfired bricks is due to:\n• Lack of sintering: Unlike fired bricks, unfired bricks are air-dried,\nwhich leads to a higher level of porosity and weak particle cohesion.", "word_count": 362, "start_char": 47198, "end_char": 49476}
{"chunk_id": "DOC0136__00020", "doc_id": "DOC0136", "chunk_index": 20, "text": "he expected low strength of the unfired bricks is due to:\n• Lack of sintering: Unlike fired bricks, unfired bricks are air-dried,\nwhich leads to a higher level of porosity and weak particle cohesion.\n\n• Plasticity of clay: The high plasticity index (30%) indicates that the\nclay has a high shrink-swell potential that is detrimental to strength.\n• No stabilizers: Lime, cement or bio-enzymes could help improve the\ncompressive strength of the unfired bricks. The Siron fired bricks (3.9\nMPa) and unfired bricks (1.7 MPa) tested are not representative of the\nminimum for BS EN 772-1:2011 and BS EN 771-1 (non-fired) standards\nrespectively.\nFurther improvements to firing conditions, stabilization of the clay, and compaction of\nthe bricks are necessary to improve the quality of the material for structural\napplications.\n\n4.1.6 Water Absorption Test\nThe Water Absorption Test is an important measure of the durability, porosity and\nresistance to moisture penetration of a brick. It simply measures the amount of water\na brick can absorb when immersed in water for a period of time (normally 24 hours)\nexpressed as a percentage of its dry weight. Water Absorption Test results against BS\nstandards.\n\nTable 5 Water Absorption Test Results vs. BS Standards\nBrick Type\nTested\nSiron\nBrick\nWater Absorption (%)\nBS Minimum Standard (%) Meets\nFired Bricks\n7.6\n≤15%\n\n(BS EN 772-11:2011)\nYes\nUnfired Bricks\n-14.0\n(Mass loss due to\ndisintegration)\n≤20%\n\n(BS EN 771-1)\nNo\n(Structural\ncollapse)\n\nFired Bricks (7.6) % - Meets BS Standard\nThe fired bricks' water absorption of 7.6% is below the BS EN 772-11:2011 standard\nlimit of ≤15% therefore, these bricks can be classified as suitable and are sufficiently\nresistant to water for construction purposes.\nThe minimal absorption demonstrates a level of sintering took place during the firing\nprocess, which leads to:\n• Reduced porosity due to fusion of clay particles.\n• Stronger interparticle bonding that reduces water absorption. It falls in line with\ncommon Ugandan fired bricks, which usually have a water absorption rate of 8–12%.", "word_count": 330, "start_char": 49277, "end_char": 51348}
{"chunk_id": "DOC0136__00021", "doc_id": "DOC0136", "chunk_index": 21, "text": "he minimal absorption demonstrates a level of sintering took place during the firing\nprocess, which leads to:\n• Reduced porosity due to fusion of clay particles.\n• Stronger interparticle bonding that reduces water absorption.I\n\nt falls in line with\ncommon Ugandan fired bricks, which usually have a water absorption rate of 8–12%.\n\nThe Fired Bricks (7.6% water absorption rate), can meet BS EN 772-11:2011 and are\nconsidered suitable for structural use, however, from a sustainability perspective, we\nneed to consider alternate methods of stabilization, as the firing process raises\nenvironmental concerns:\n• A result of firewood use resulting in deforestation in Uganda (Bodipo-Memba et al.,\n2022).\n• Carbon emissions released from the kiln discharge into the environment, thus\naffecting sustainability.\n• Additional methods of stabilization such as bio-enzyme stabilization or\nimprovements to the industrial kilns could produce a more environmentally friendly\npolicy.\nUnfired Bricks (-14.0%) - Fails BS Standard\nThe negative absorption value (-14.0%) reflects the mass lost from the clay brick due\nto structural collapse as opposed to absorption. The brick suffered mass loss due to:\n• Montmorillonite-rich clay swells upwards of 85% in volume due to absorption\nof water into the interlayer spaces, which caused disintegration of the\ncompact clay brick after 24 hours.\n• High plasticity index (PI = 30%), indicating high sensitivity to moisture.\nUnfired Bricks (-14.0%) failed BS EN 771-1 entirely due to swelling and disintegration.\nThey will require further stabilization with bio-enzymes, lime or cement before they\ncan be used practically.\n\n4.2 Objective two: To determine the physical properties of pineapple leaf fibers.\nThe Pineapple Leaf Fiber (PALF) Tensile Properties Test evaluated the mechanical\nbehavior of the fiber subject to tensile stress. This test examined key properties of the\nfiber, including breaking force, elongation, resistance per kilometer (RKM), breaking\nwork, and breaking time, which will determine suitability of the fiber for reinforcement\nmaterials, composites, and textile uses.\nTable 6 PALF Properties test\nTests\nBreaking\nforce(gf)\nElongation(mm) RKM(g/tex)\nBreaking\nwork(gf*cm)\nTime\nto\nbreak(s)\naverage 169.40\n6.00\n7.95\n52.86\n0.72\n\nTensile Testing\nThe test was conducted utilizing a Tensotester, a precise tensile instrument utilized to\nmeasure tensile strength and elongation of fibers. The system measures important\nparameters during the test, which include maximum force at break (breaking force),\nelongation at break, and energy absorbed (breaking work).\nTable 7 PALF Tensile Properties vs. Natural Fiber Standards\nProperty\nTested PALF\nValue\nTypical Range for Natural\nFibers\nMeets\nBreaking Force (gf)\n169.40\n150 – 500\nYes", "word_count": 407, "start_char": 51018, "end_char": 53782}
