{"chunk_id": "DOC0154__00000", "doc_id": "DOC0154", "chunk_index": 0, "text": "THE COST OF MOTORCYCLE ACCIDENTS IN UGANDA\n\nBy\n\nRichard Sebaggala\nFred Matovu (PhD)\nDan Ayebale (PhD)\nVincent Kisenyi\nMesharck Katusiimeh (PhD)\n\nOctober, 2014\n\nAcknowledgements\nWe are grateful to CrossRoads and UKAID who financially and technically supported this\nresearch effort. Special thanks go to technical team at CrossRoads, reviewers, various\ninstitutions and all persons who supported this work in different capacities.\n\nAbstract\nUnderstanding the cost of the road traffic accidents (RTAs) has been of interest to many\nscholars and policy makers for a long time. In Uganda like many developing countries in\n\nAfrica, injuries due to motorcycle accidents represent a major but often neglected\nemerging public health problem and contribute significantly to the overall road traffic\ninjuries. This research study therefore explored the costs of motorcycle accidents and\nthe pain, grief and sufferings of the motorcycle accident victims using a multi-method\napproach. Unlike many studies on cost of accidents which use the traditional human\ncapital approach, this study in addition to the human capital approach, applied the\nWillingness-to-pay (WTP) approach to estimate the cost of motorcycle accidents. WTP\nmethod was used to estimate the value that boda boda riders would pay for reducing\nthe risk of loss of life based on Contingent Valuation (CV) method. We extend the\nanalysis to also explore the key coping mechanisms adopted by the Boda-boda riders\namidst the challenges the riders face when they suffer motorcycle accidents.\nThe data were obtained from multiple sources, including a survey of 1600 boda boda\ncyclists in Kawempe and Central divisions in Kampala City, interviews with accident\nvictims and their immediate family members, traffic police records, hospitals and\nnational statistics on selected economic aggregates. The results show that motorcycle\naccidents are associated with huge economic and non-economic burden borne by the\naccident victims and the society as a whole. The study established that it costs\napproximately 7 million shillings (or 2800 USD) to treat a boda boda accident victim who\nis severely injured. Based on annual police statistics on motorcycle accidents for 2012;\nthe Ugandan economy losses more than UGX 3 billion (1.2m USD) value of output due\nto days away from productive work as result of severe injuries and death. Likewise, the\ncost of motorcycle repairs amounted to UGX 350 million (140,000 USD).", "word_count": 374, "start_char": 0, "end_char": 2452}
{"chunk_id": "DOC0154__00001", "doc_id": "DOC0154", "chunk_index": 1, "text": "ased on annual police statistics on motorcycle accidents for 2012;\nthe Ugandan economy losses more than UGX 3 billion (1.2m USD) value of output due\nto days away from productive work as result of severe injuries and death.L\n\nikewise, the\ncost of motorcycle repairs amounted to UGX 350 million (140,000 USD).\n\nThe study also estimated the value of preventing motorcycle accidents. The estimates\nshow that on average boda boda riders are willing to pay Ug Shs 222,550 (89 USD) a\nyear for a reduction in mortality risks associated with motorcycle accidents that translate\ninto UGX 4.45 billion (US$1.78m), the value of statistical life (VOSL). Overall, the\ncombined economic burden of the motorycle accidents (repairs, medical costs, lost\noutput and imputed cost of pain grief and suffering) were estimated to be approximately\nUS$ 3.6 million annually. This cost is about 0.02% of Uganda’s GDP in 2013. The key\npolicy implication of the study is that reducing motorcycle causalities and fatalities will\nreduce social and economic sufferings of victims, unlock growth and free resources for\nmore productive use. The findings provide the cost-benefit analysis of any investment in\nareas that will promote the prevention, treatment, care and management of motorcycle\naccidents in Uganda.\n\nIntroduction\nInjuries due to motorcycle accidents represent a major but often neglected emerging\npublic health problem in developing countries and contribute significantly to the overall\nroad traffic injuries (Peden, 2004; Kobusingye, et al, 2001; 2002). Available evidence\nfrom annual crime reports shows that road safety in Uganda is poor and has\ndeteriorated over the last 20 years. The increase in the rate of road accidents is mainly\ndue to the growing number of vehicles and lack of appropriate road safety interventions.\nThe number of people who die due to road traffic accidents has grown from 660 in 1991\nto 2,954 in 2010. According to Annual Crime and Traffic Road Safety Report, 2011, 17.3\npercent of deaths were due to motorcycle accidents. Estimates from the World Health\nOrganization show that by 2020, deaths from traffic accidents are projected to rank\nsecond to HIV/AIDs (WHO, 2005).", "word_count": 345, "start_char": 2145, "end_char": 4328}
{"chunk_id": "DOC0154__00002", "doc_id": "DOC0154", "chunk_index": 2, "text": "ccording to Annual Crime and Traffic Road Safety Report, 2011, 17.3\npercent of deaths were due to motorcycle accidents.E\n\nstimates from the World Health\nOrganization show that by 2020, deaths from traffic accidents are projected to rank\nsecond to HIV/AIDs (WHO, 2005).\n\nThe growth of hired/commercial motorcycles (commonly known as boda boda in\nUganda) as a mode of transportation in Uganda has increased road safety challenges\n(Annual Traffic Report, 2011). Statistics show that Kampala city alone is estimated to\nhave between 50,000-80,000 boda boda cyclists and that two patients die on average\nevery week as a result of boda boda accidents. The national referral hospital (Mulago\nHospital) alone receives between 10 and 20 victims of boda boda accidents daily. Boda\nboda business is a money-making activity involving many players; and given the rate of\nunemployment in Uganda, the number of boda boda motorcyclists is expected to\nincrease so will the motorcycle accidents. Evidence shows that as the number of\nmotorcycles rises, the number of accidents, especially to motorcycle riders, will increase\n(Umar et al, 1995; Widyastuti, 2012). The empirical evidence elsewhere shows that the\nprobability of a motorcyclist being injured in an accident is higher than that for car users\n(see Widyastuti and Bird, 2004). The pain, grief, suffering and loss of life as well as the\neconomic consequences of boda boda accidents can be huge for the individual victims,\ntheir families and the country at large, but are seldom estimated empirically.\nNotwithstanding the above, the continued increase in the number of boda boda\naccidents has created demand for necessary road safety improvements. However,", "word_count": 264, "start_char": 4060, "end_char": 5754}
{"chunk_id": "DOC0154__00003", "doc_id": "DOC0154", "chunk_index": 3, "text": "he pain, grief, suffering and loss of life as well as the\neconomic consequences of boda boda accidents can be huge for the individual victims,\ntheir families and the country at large, but are seldom estimated empirically.N\n\notwithstanding the above, the continued increase in the number of boda boda\naccidents has created demand for necessary road safety improvements.H\n\nowever,\n\ninformation and evidence on the costs of boda boda accidents such as the immediate\nhospitalization and rehabilitation costs and indirect costs to the society (e.g. opportunity\ncost in terms of lost labour and output; lost financial support to the families and relatives\nof the victims; costs in terms of disability and death of victims) have not been fully\nexamined and this explains partly why interventions to prevent the problem are very few\nand largely adhoc in Uganda. There has been little effort to estimate the costs of boda\nboda accidents in Uganda. A recent study conducted by Makerere University College of\nHealth Sciences and the department of Orthopaedics is the only available study on\ncosts of boda boda accidents. The study revealed that at least 62.5% of the budget\nallocated to the directorate of Surgery at Mulago hospital is spent on victims of\naccidents involving boda boda and that the average cost of treating a boda boda victim\nwith head injuries or broken limbs is about UGX 700,359 (or US$280) 1. However, this\nstudy does not provide a full scale and magnitude of the costs of boda boda accidents\nbecause it focuses on costs borne by the health system (Kigera et al, 2010).\nGovernment and other stakeholders need accurate information and evidence\nparticularly on how much saving can be gained by implementing road safety\nimprovements to address boda boda causalities. Anecdotal information and reporting of\naccidents by the media and police traffic department limits our understanding of the\nextent to traffic safety problem to design appropriate policy action. Interventions for\neffective road injury prevention need to be based on data and objective information, not\non anecdotal evidence. Therefore, there was a need for a comprehensive research\nstudy which estimates both direct and indirect costs of boda boda accidents in Uganda.\nThe present study is the first of its kind to provide a comprehensive estimate of the\ncosts of boda boda accidents using the widely used traditional human capital method\nand the willingness-to-Pay method.\n\n1 The average exchange rate at the time of the study was 1US$ = UGX 2500", "word_count": 408, "start_char": 5376, "end_char": 7896}
{"chunk_id": "DOC0154__00004", "doc_id": "DOC0154", "chunk_index": 4, "text": "he present study is the first of its kind to provide a comprehensive estimate of the\ncosts of boda boda accidents using the widely used traditional human capital method\nand the willingness-to-Pay method.\n\n1 The average exchange rate at the time of the study was 1US$ = UGX 2500\n\nStudy aims and objectives\nThe main aim of the research study was to build evidence on the cost of motorcycle\naccidents in Uganda and provide the rationale for investing in national road safety\nprogrammes. The specific objectives of the study were:\n(i) To estimate the direct and indirect costs of motorcycle accidents\n(ii) To establish the pain, grief and suffering of motorcycle accident victims\n(iii) To draw policy recommendations for improving road safety in Uganda\nMethodology\nInterventions to improve road safety require information on the benefits of improved\nsafety based on imputed values or valuation of human life. There are various\ntechniques available to value road casualties and these include: Gross Output method\n(Human Capital Approach), the Net Output method, the Life Insurance approach, the\nCourt Awards approach (the amounts awarded by the Courts for compensation to\nsurvivors or surviving dependants in the case of a fatality), Implicit public sector\nvaluation approach, the friction-cost approach (valuing the cost involved in replacing\nthe killed or injured person to restore the previous production level) and Willingness to\npay method.\n\nThe traditional method of valuation is the human capital method. This method involves\nestimating an ex-post sum of various identifiable costs, such as loss of work income and\nmedical expenses minus the pain and suffering (Abelson, 2008). However, since the\nfundamental premise of welfare economics is that public policy decisions should reflect\nthe preference of those who will be affected by them; willingness-to-pay approach has\nbecome conceptually more satisfactory way of measuring the costs of accidents\n(Abelson, 2008; Maier et al, 1989). According to Widyastuti and Mulley (2005), the use\nof the human capital approach to estimate the cost of accidents alone is inappropriate\nand a combination of human approach and individual willingness to pay is\nrecommended. Therefore, this study established the medical and repair costs and lost\n\noutput as a result of boda boda accidents, and what individuals are willing to pay for\nreduced risk of injury or death due to boda accidents. The use of the two approaches\nprovides more value for estimating human cost.", "word_count": 393, "start_char": 7619, "end_char": 10121}
{"chunk_id": "DOC0154__00005", "doc_id": "DOC0154", "chunk_index": 5, "text": "herefore, this study established the medical and repair costs and lost\n\noutput as a result of boda boda accidents, and what individuals are willing to pay for\nreduced risk of injury or death due to boda accidents.T\n\nhe use of the two approaches\nprovides more value for estimating human cost.\n\nStudies by TRL (1995) and Silcock and TRL (2003) have concluded that human capital\nmethod should be supplemented with some human element which is very subjective.\nThe subjective costs have been valued using the Willingness to Pay (WTP) method.\nThe WTP measures by how much the concerned individuals are ready to pay in order to\nimprove their safety and thus provide information on the extent of the need to promote\nan effective intervention to the affected community.\n\nEconomic reasoning suggests that the missing price information associated with safety\nissues can only be substituted by the amount people are willing to pay for the respective\n“product”. The method evaluates how individuals value safety, rather than react to how\nmuch an accident might have costed them (Widyastuti, 2012). The WTP method is\nconsidered appropriate where there is need to pursue social welfare as a result of\naccident reduction (Jacobs et al., 2000); provides a practical of understanding the value\nthe individuals or community places on road safety (Sakashita, et al, (2012); and a\nconceptually more satisfactory way of addressing the issue of accident loss (Maier et al,\n1989). Estimating the cost of boda boda accidents using the combination of gross\noutput and individual willingness to pay methods provides a better value and offers\npolicy recommendations that justify interventions to reduce road accidents in general\nand boda boda accidents in particular.\n\nHowever, given that the majority of boda boda riders come from poor backgrounds; the\ndirect financial and opportunity costs of accidents are the tip of the iceberg in\ncomparison to the pain, grief and suffering of those involved in boda boda accidents. In\nmost of the studies using the human capital approach, a fixed percentage to the direct\ncost and loss of productivity has always been added to represent the pain, grief and\nsuffering.", "word_count": 352, "start_char": 9830, "end_char": 12009}
{"chunk_id": "DOC0154__00006", "doc_id": "DOC0154", "chunk_index": 6, "text": "n\nmost of the studies using the human capital approach, a fixed percentage to the direct\ncost and loss of productivity has always been added to represent the pain, grief and\nsuffering.\n\nWillingness-To-Pay method (WTP)\nThe value of individual life reflect what people would be willing to pay (or sacrifice) to\nobtain benefits or to avoid costs (Jones-Lee, 1989). This ex-ante approach involves\nsome assessment of risk and the willingness of individuals to commit resources in\nexchange for reducing this risk to an acceptable level. This trade-off between risk and\neconomic resources, measured in terms of the marginal rate of substitution of wealth for\nrisk of death or injury, accords well with the fundamental principle of social cost-benefit\nanalysis that public sector allocative decisions should be based upon the preferences of\nthose who will be affected by the decision concerned.\n\nWTP method was used to estimate the value that individuals would pay to avoid the\nintangible costs that result from injury in a motorcycle accident or death. The\nimplementation of the WTP is through a survey questionnaire and there are two\nmethods of collecting data in order to estimate how much an individual would be willing\nto pay for a reduction in the risk of sustaining an accident. These are: the “Revealed\nPreferences” and the “Stated Preference” approaches. The State Preference technique\nis more appropriately used when the WTP information cannot be verified from the\nmarket and is considered superior because it is possible to ask questions directly about\nthe trade-off between risk and money; and it is also possible to consider a wider and\nmore systematic range of trade-offs than is available in the Revealed Preference\napproach (Widyastuti, 2012).\n\nResearchers implementing the Stated Preference technique have commonly used the\nContingent valuation (CV) approach (Chaturabong, 2010). This approach was adopted\nin this current study. The questionnaire was designed to determine the amount of\nmoney that each motorcycle user would pay to reduce the risk of loss of life from\nmotorcycle accidents. Data gathered on the number of accidents, number of severities\nof motorcyclist per each severity type (fatal, slight and serious) and demographic\ninformation for motorcycle deaths and injuries obtained from police reports were used to\npresent a picture of the probability of casualty involved in the accident. The", "word_count": 379, "start_char": 11825, "end_char": 14238}
{"chunk_id": "DOC0154__00007", "doc_id": "DOC0154", "chunk_index": 7, "text": "ata gathered on the number of accidents, number of severities\nof motorcyclist per each severity type (fatal, slight and serious) and demographic\ninformation for motorcycle deaths and injuries obtained from police reports were used to\npresent a picture of the probability of casualty involved in the accident.T\n\nhe\n\nquestionnaire comprised of questions related to (a) the socioeconomic characteristics\nand household characteristics of motorcyclists; (b) the riding behavior and the risktaking behaviors of motorcycle users such as size of engine, helmet use, experience of\ninvolving in the accident; and (c) the valuation questions which were designed to ask\nthe respondents to provide the estimates of the relevant rates that they are willing to\npay for a reduction in the probability of fatality and injury due to the boda boda\n\nIn the design of CV questions, three scenarios were used to elicit respondents’\nwillingness-to-pay. In each scenario both open-ended and closed-ended questions were\nused. The first scenario is to evaluate the WTP of respondents in their own risk of\ndeath, the second scenario is to evaluate the WTP to reduce the risk of severe injury,\nand the third scenario is to evaluate the WTP of respondents to participate in proposed\nKampala city authority interventions to streamline boda boda industry and reduce\naccidents. According to Chaturabong et al, (2010), for the closed-ended question (also\nreferred to as a “dichotomous choice” or “referendum” question), the respondent is\nasked whether he or she is willing to pay a specified amount of money presented as the\nvalue of the risk reduction. The respondent is expected to answer “yes” or “no.” For the\nopened-ended question, the respondents is asked to state the maximum amount that\nhe or she is willing to pay for the good that is being valued (in this case, accident risk\nreduction).\n\nFirst Scenario: Risk of Fatality\nIn the first scenario, the respondents were told that it is estimated that in Uganda , an\naverage of 10 out of 100,000 people die as result of road accidents in a year. In the\nclosed-ended question, the respondents were asked: “Are you willing to pay a certain\namount of money to reduce the fatality risk from 10 to 5 deaths in every 100,000 people\nor 50% reduction in fatality risk?” The respondent then answered “yes” or no”. In the\nopen-ended question, the respondents were simply asked “How much they are willing to\n\npay to reduce fatality risk from 10 to 5 deaths in every 100,000 people or 50% reduction\nin fatality risk”.", "word_count": 416, "start_char": 13925, "end_char": 16452}
{"chunk_id": "DOC0154__00008", "doc_id": "DOC0154", "chunk_index": 8, "text": "n the\nopen-ended question, the respondents were simply asked “How much they are willing to\n\npay to reduce fatality risk from 10 to 5 deaths in every 100,000 people or 50% reduction\nin fatality risk”.\n\nSecond Scenario: Risk of Severe Injury\nIn the second scenario, the respondents were asked to imagine that they have to wear\nthe helmet while riding motorcycle. The cost of helmet is 50,0002 Uganda shilling per\nhelmet, the probability to have severe injury due to the motorcycle accident is\n10/100,000 each year.\n\nIn the closed-ended question, the respondent were asked: “Are you willing to pay\n50,000 shillings to buy a helmet which can reduce the risk of severe injury from 10 to 3\nsevere injured people in every 100,000 people or reduction in risk of severe injury by\n70%?” The respondent then answered “yes” or no. The second question asked if\nrespondents are willing to pay for the Helmet if the price is increased- over a range of\nprice figures up to the average maximum price derived from the pilot.”\n\nThird Scenario: Boda boda streamlining program by KCCA\nAs earlier pointed out, KCCA has planned to streamline the boda boda industry through\na number of efforts that include registration of boda boda riders in city, training of riders,\nissuing operational permits, supply reflector jackets and helmets, gazzetting stages and\nintroduction of wardens, among others. Out of these proposed interventions, we\nconsidered two options: (i) supply of reflector jackets and helmets and (ii) training. This\nis because these interventions are directly related to reducing accidents. The closed\nended question was: If it costs Uganda shillings 100,0003 (and higher price ranges) to\nget a reflector jacket and helmet (or training) would you be willing to pay this amount to\nreduce by half the number of boda boda accidents and injury each year in Kampala?\nThe second question was: “What is the maximum amount of money would you pay to\n\n2 The average cost of a helmet\n3 The range of actual costs were established from the market and KCCA\n\nget a reflector jacket and helmet (or training) to reduce by half the number of boda boda\naccidents and injury each year in Kampala?", "word_count": 365, "start_char": 16253, "end_char": 18418}
{"chunk_id": "DOC0154__00009", "doc_id": "DOC0154", "chunk_index": 9, "text": "he second question was: “What is the maximum amount of money would you pay to\n\n2 The average cost of a helmet\n3 The range of actual costs were established from the market and KCCA\n\nget a reflector jacket and helmet (or training) to reduce by half the number of boda boda\naccidents and injury each year in Kampala?\n\nAccording to Krupnick et al, (2002), many contingent valuation (CV) studies fail to pass\nthe test of internal and external validity because of three types of problems: (1)\nrrespondents may not understand the risk changes they are asked to value; (2)\nrespondents may not believe that the risk changes apply to themselves; and (3)\nrespondents may lack experience in trading money for quantitative risk changes or lack\nthe realization that they engage in this activity. These pitfalls are challenging because of\nthe low level of education of the respondents, and our approach to dealing with the\nproblem was to explain to respondents using real examples about probabilities and risk\nreductions during contingent valuation survey. Evidence shows that a brief training of\nthe respondents in the survey regarding probability, risk, and risk changes enables the\nrespondents to process risk information better and thus become more elaborate about\ntheir preferences for risk reduction (Mahmud, 2005). This fact was established during\npre-test of the survey instruments and was highly emphasized during data collection.\n\nIn the CV questionnaire, we exposed the concepts of probability of different events\noccurring, risks, and implications of risk changes such as flipping a coin, to determine\nwhich team starts a football match, and buying a lottery ticket as examples to introduce\nthe concept of probabilities to the respondents. Mortality risk was discussed using the\nexample of risk of dying from traffic accidents. The respondents were asked test\nquestions after each example. If the respondent got the answer right, then the\nenumerator would proceed to WTP questions otherwise the process was repeated until\nthe respondent got it right.\n\nComputation of Value of Statistical Life\nThe aim of using the willingness to pay approach described above was to estimate the\nboda boda rider’s marginal rate of substitution (MRS) between money and the reduction\nof risk of being killed in a boda boda accident. Therefore to compute the value of\n\nstatistical life (VOSL) and its covariates, we apply similar approach as Maier et al,\n(1989). If we denote the i-th boda boda rider’s marginal rate of substitution byMRSi .\n\nThen the estimate for MRSi =\n,\n,\n/\nb\nb\ni\ni\n=", "word_count": 420, "start_char": 18105, "end_char": 20668}
{"chunk_id": "DOC0154__00010", "doc_id": "DOC0154", "chunk_index": 10, "text": "herefore to compute the value of\n\nstatistical life (VOSL) and its covariates, we apply similar approach as Maier et al,\n(1989).I\n\nf we denote the i-th boda boda rider’s marginal rate of substitution byMRSi .T\n\nhen the estimate for MRSi =\n,\n,\n/\nb\nb\ni\ni\n=\n\nFor example, in the study, boda boda riders were asked their willingness to pay to\nreduce the fatality risk from 10 to 5 deaths in every 100,000 people or 50% reduction in\nfatality risk and if the answer is bi , then the marginal rate of substitution can be\nestimated. In a population of N boda boda riders, the average of MRS (∑\ni\ni N\nMRS\n1 ) is\ninterpreted as the willingness to pay for a risk reduction which reduces the expected\nnumber of the deaths by 1(5). This is referred to as the Value of Statistical Life (VOSL)\nor the marginal value of safety (MVS). Based on individual evaluations, we examined\nthe influence of socioeconomic characteristics of rider and different attributes (age,\neducation, rider’s experience, marital status, monthly income, motorcycle ownership,\nnumber of dependents, ever experienced an accident). In the estimating the regression\nmodel, we adopted log-linear model (where MVS is in logs) specification over linear\nspecification with the help of the Box-cox test4.\n\nComputation of lost output/ productivity\nLost output/productivity refers to the losses suffered by the country as a result of the\nloss of productive capacity of people affected by motorcycle accidents. The total\naverage lost output for a fatal motorcycle accident is the sum of each future year’s lost\noutput, which was estimated based on the following formula adopted from ( Anh et al,\n2005):\n\n4 Box Cox = N/2*log (RSS\nlargest/RSS\nsmallest) ~ χ\n. If estimated value exceeds critical value (from tables\nChi-squared at 5% level with 1 degree of freedom is 3.84) reject the null hypothesis that the models are\nthe same (ie there is a significantly different in terms of goodness of fit).\n\nLost output (fatality) =\n)\n(\n(\n)\n∑\n=\n+\n+\nN\ni\ni\nr\ni\ng\nW\n\nWhere\nW= average yearly per capita gross domestic product\nr= discount rate\ng= growth rate of the economy\ni= average number of years of lost output per fatal accident", "word_count": 380, "start_char": 20415, "end_char": 22578}
{"chunk_id": "DOC0154__00011", "doc_id": "DOC0154", "chunk_index": 11, "text": "ost output (fatality) =\n)\n(\n(\n)\n∑\n=\n+\n+\nN\ni\ni\nr\ni\ng\nW\n\nWhere\nW= average yearly per capita gross domestic product\nr= discount rate\ng= growth rate of the economy\ni= average number of years of lost output per fatal accident\n\nIn the study, we included both the average and median age of victims in fatal accidents\nfor better information estimated at 35 and 28 years respectively5. The average loss of\nproductive years is computed based on a retirement age of 60 years. Hence, the\naverage number of years foregone by a fatal motorcycle accident is 25 and 32\nrespectively. The average GDP per capita is 1.4 m Uganda shillings ($558) in 2013. The\naverage growth rate of the economy for the last 10 years is 7%. Therefore, the g\nconsidered in this study is 7%. The discount rate (r) considered is 12% based on prime\nInterest rates in Uganda (Central Bank Rate). The N is 571, based on the number\nmotorcyclists who were reported dead by the police in 2011/2012 (Annual Police\nReport, 2012).\n\nThe table 1.1 summarizes the cost components that were computed under the human\ncapital approach/Gross Output Method.\nTable 1.1: Cost components of human capital approach\nComponent of\ncosts\nData requirements\nData sources\nEstimation\nHospital /Medical\ncosts\n-Hospitalization\ndays\n(serious\nand\nslight\ninjuries); daily hospital\ncosts for a serious\n-Hospital\nmedical\nrecords\n(\n) GP\nHC\nDST\nMC\ni\ni\ni\ni\n+\n=\n*\n\nWhere:\nMCi is medical cost of a\nserious or slight injury\n\n5 These figures were obtained from Mulago hospital data base of people who died as a result boda boda accidents.\n\nand slight causalities\nand;\nand\ngeneral\npractitioner costs for\nserious\nand\nslight\ncausalities.\n\ncausality;\nDSTi is duration of stay, (days\nof hospitalization) for injury\ncausality\nHCi is daily hospital costs for\ninjury causality; and GPi is\ngeneral practitioner costs for\ninjury causality.\nLost\noutput/productivity\nFatal causalities and\npermanent\ndisabilities\n-Average age of fatal\ncases\n-Average age of\nretirement\n-Average income\n(monthly earnings)\n-Hospital and\nmedical\nrecords from\nhealth\nfacilities\n-Police traffic\ndepartment\nLost labor output of fatalities\nand\npermanent\ndisabilities\nwere computed over the rest of\ntheir\nexpected\nproductive\nworking life and discounted to\nan equivalent present value.\n\nSerious and slight\ncausality\n-Time lost due to\nserious and slight\ninjury causality\n\nCalculated as the average daily\nwage rate of each person\ninvolved in the crash, multiplied\nby the number of days off work,\nand summing up for all the\npeople involved in the crash.\nMotorcycle\ndamage\n-Motorcycle damage\ncost\n\nCalculated as the average cost\nof motorcycle repairs multiplied\nby the number of motorcycles\ninvolved in the boda boda", "word_count": 445, "start_char": 22358, "end_char": 25047}
{"chunk_id": "DOC0154__00012", "doc_id": "DOC0154", "chunk_index": 12, "text": "otorcycle\ndamage\n-Motorcycle damage\ncost\n\nCalculated as the average cost\nof motorcycle repairs multiplied\nby the number of motorcycles\ninvolved in the boda boda\n\nQualitative data collection\nIn order to establish the pain, grief and suffering of boda boda accident victims, in-depth\ninterviews were conducted. In-depth interviews were conducted with victims of boda\nboda accidents identified through the division chairpersons and where possible from\nMulago hospital which has reasonable number of boda boda accident victims. The indepth interviews elicited rich descriptions of the experiences of the victims. This method\nprovided holistic data that depict systemic influences and effects of these accidents, the\nconstraints and opportunities of the victims and how they think and act towards the\nphenomenon under study. In this study, the common threads were victims of boda boda\naccidents with permanent disabilities and serious injuries. Standard procedures for\nconducting key informant interviews were followed.\n\nData sources\nThe study adopted a multi-approach method to estimate the costs of motorcycle\naccidents. Therefore, data used in estimating the direct and indirect costs of motorcycle\naccidents and the pain, grief and sufferings of the motorcycle accident victims were\nobtained from multiple sources, including a survey of 1600 boda boda cyclists in\nKawempe and Central divisions in Kampala City, traffic police records, hospitals and\nnational statistics on selected economic aggregates. The boda boda cyclists who\nparticipated in the survey were randomly selected from boda boda stages with the help\nof stage boda boda chairpersons. In order to establish the pain, grief and suffering of\nboda boda accident victims, in-depth interviews were also conducted with victims of\nboda boda accidents and their immediate family members.\n\nDescriptive findings\nA total of 1600 respondents were interviewed in this study. The respondents were\nhired/commercial motorcycle users (boda boda riders) who work in Kampala City.\nTables 1.2 show the socio-economic characteristics of boda boda cyclists. Although\nmany people view boda boda business as an extremely odd job and implies that only\nthe less educated and less significant section of the people are the ones engaged in it,\nour survey results reveals that more than 50% of the boda boda riders had received\nsecondary education and higher; 83% married, 79.1 previously employed, 62.8% relying\non boda boda business, nothing else; and 73% own the motorcycles they ride.\nTable 1.2: Socio-economic characteristics boda boda cyclists\nCharacteristics\nFrequency(n=1600)\nPercent\nEducation\nNo education\n5.2\nPrimary education\n44.5\nSecondary education\n47.7\nPost secondary\n2.6\nMarital status\nSingle\n15.7\nMarried\n1,334\n83.4\nDivorced/separated\n0.9\nPrevious employment status\nEmployed\n1,265\n79.1\nAdditional sources of income\nNothing else\n1,004\n62.8\nFarming\n13.4\nsalaried employment\n1.7\nOther\n17.6\nCasual workers (building/driving)\n4.6\nMotorcycle ownership\nself fully paid\n52.4\nself on loan\n20.5\nContracted\n26.6\nOthers\n0.44", "word_count": 449, "start_char": 24887, "end_char": 27948}
{"chunk_id": "DOC0154__00013", "doc_id": "DOC0154", "chunk_index": 13, "text": "The results in table1.3 shows that boda boda riders on average earn more than the\naverage monthly income of a Ugandan from all sources standing at UGX 303,700\naccording to Uganda Bureau of Statistics Household Survey, 2009/2010. For instance\nthe average daily and weekly income of boda boda cyclist in Kampala is 22, 237 and\n131, 574 Uganda shillings respectively. According to estimates of the 2012 statistical\nabstract based on the Household consumption expenditure data of Uganda Bureau of\nstatistics, about 50% of the richest households in Kampala spent at least Shs.\n475,500/= per month on consumption as of financial year 2009/10 (in 2005/06\nconstant prices). Therefore, putting these figures into perspective of the boda boda\nrider’s incomes per month; it implies that the boda boda riders are among the richest\nincome earners in Uganda. What is not clear is whether the boda boda riders know this\nfact because it has bearing on their spending behavior in particular and attitude to road\nsafety in general.\n\nThe table also shows that average age of the boda boda riders is 30 years. This implies\nthat the majority of boda boda riders are the young population of Uganda. In respect to\nthe number of dependants and experience with boda boda business, it is evident in\ntable 4.2 that the average number of dependents per cyclist is 5.5 and rider’s\nexperience of 5.8 years. One can infer from the rider’s experience result and the fact\nthat the majority of riders had been previously employed (79%) and focused on boda\nboda business alone (63%; that boda boda riders are not mainly in the boda boda\noccupation because of economic hardship and high rate of unemployment but rather out\nof their objective choice like other people are in their other occupations. This implies\nthat boda boda riders do appreciate and love their occupation and for purposes of the\nsafety, they will be willing to accept any change that improves their work and welfare.\n\nTable 1.3: Descriptive statistics\nVariable\nObs\nMean\nStd. Dev.\nMin\nMax\nDaily income\n1,600\n22,236.9\n7,701\n5,000\n60,000\nWeekly income\n1,600\n131,573.8\n47,047\n10,000\n420,000\nAge (years)\n1,600\n30.3\n6.1\nNumber of dependents\n1,549\n5.5\n3.2\nRider’s experience\n1,600\n5.8\n3.7\n0.08", "word_count": 369, "start_char": 27948, "end_char": 30167}
{"chunk_id": "DOC0154__00014", "doc_id": "DOC0154", "chunk_index": 14, "text": "able 1.3: Descriptive statistics\nVariable\nObs\nMean\nStd.D\n\nev.M\n\nin\nMax\nDaily income\n1,600\n22,236.9\n7,701\n5,000\n60,000\nWeekly income\n1,600\n131,573.8\n47,047\n10,000\n420,000\nAge (years)\n1,600\n30.3\n6.1\nNumber of dependents\n1,549\n5.5\n3.2\nRider’s experience\n1,600\n5.8\n3.7\n0.08\n\nIncidence and severity of motorcycle accidents\nOut of 1600 motorcycle riders who participated in the survey, 55.1% of boda boda riders\nhad experience at least an accident. Figure 1 shows that 34.2% of the riders had\nexperienced more than one accident in their life time as boda boda riders. The\nrespondents were further asked whether they know any of their friends or associates\nwho have been involved in a motorcycle accident that resulted in an injury. More than\n96% of the respondents responded in the affirmative. These figures indicate that\nmajority of the boda boda riders get involved in motorcycle accidents that results into\ninjury.\n\nSeverity of physcial injuries\nBoda boda riders who reported to have been involved in motorcycle accidents where\nasked to indicate the level of physical injuries sustained and whether the rider was\nwearing a helmet or not. The severity of physical injuries sustained was classfied\nbased on four categories. No injury meant the rider did not visit a health facility; minor\ninjuries for those who visited the health facility but not hospitalised nor had any\nbreakage or scratch; moderate injuries for those who visited healthy facilities and had\nsome breakage or needed aftercare; and serious injuries for those who had been\nhopsitalised at least one day.\n\nThe results presented in figure 3 above show that 44.1% of boda boda riders who had\nexperienced accidents reported that the accidents resulted into serious injuries requiring\nthem to be hospitalised at least one day. In economic sense, this implies that most of\nthe motorcycle accidents have economic repurcusions on the riders in form of medical\nexpenses and days away from work. In the figure 4, the total number of days away from\nwork are presented. Figure 4 shows that on average boda boda riders spend\napproximately one and half months away from work due to injuries sustatined from\n\nHelmet use and severity of injuries\nThe use of the helmets has been established as one of the effective ways of protecting\nmotorcyclist from head injuries and fatalities resulting from motorcycle crashes. It is\ncommon in Uganda, to find motorcyclist with helmets but not using them. Therefore, in\nthis study, riders who reported accidents where asked whether they had used a helmet.\nOut of the 882 boda boda cyclist who had reported involvement in any motorcycle\naccidents, more than 80% had used a helmet at the time of accident (figure 5).", "word_count": 442, "start_char": 29898, "end_char": 32596}
{"chunk_id": "DOC0154__00015", "doc_id": "DOC0154", "chunk_index": 15, "text": "t is\ncommon in Uganda, to find motorcyclist with helmets but not using them.T\n\nherefore, in\nthis study, riders who reported accidents where asked whether they had used a helmet.O\n\nut of the 882 boda boda cyclist who had reported involvement in any motorcycle\naccidents, more than 80% had used a helmet at the time of accident (figure 5).\n\nIn figure 6, we compared the level of severity of physical injuries sustained and helmet\nuse. The results depict that the number of boda boda riders who had helmets reported\nless severe injuries. However, we did not find significant differences in the number days\naway from work as results of severe injuries between the helmet users and non users.\n\nRider’s perception on the causes of motorcycle accidents\nA total of 1600 respondents to the questionnaire listed what they considered to be the\nmain causes of fatal motorcycle accidents. Altogether, their responses led to a list of\nmany causes that were categorized into seven broad categories. These categories are\nalcohol/drug abuse, reckless/bad driving, over speeding, bad roads, overloading and\nothers. Figure 7 below presents the percentage responses. Reckless driving (61.3%)\nand over speeding (13%) were the most common cause of motorcycle accidents given\nby the respondents. This implies that the risky behavior of the boda boda riders is\nreported to be responsible for the majority of fatal motorcycle accidents in Kampala.\nBad roads (slippery surface, pot holes, bends etc) and alcohol/drug abuse were\nmentioned by 12% and 7% of the respondents respectively as one of the major causes\nof fatal motorcycle accidents in Kampala.\n\nRespondents were also asked to indicate the percentage contribution of the various\nfactors in the crashes involving boda boda riders in the last year. The findings are\npresented in figure 8 below. In the figure, it is also evident that the majority of riders put\nblame on the reckless riding and speeding as the major factors responsible for serious\n\nmotorcycle accidents. However, the figure also shows that drink riding, inexperience on\nthe road and poor road conditions on average contributed more than 50% of the serious\ncrashes involving boda boda riders in Kampala. Overloading and rider’s fatigue were\non average blamed for causing 38% and 31% of the serious crashes involving boda\nboda riders.\n\nNonetheless, riders where asked the category of the road users responsible for\nmotorcycle accidents. The following figure 9 depicts who to blame for motorcycle\naccidents in Kampala. The majority of the riders (58.4%) thought that it is themselves\nwho were primarily to blame for accidents involving motorcycles. Commuter taxis, other\nvehicles, and poor roads were also blamed for the significant number of motorcycle", "word_count": 439, "start_char": 32259, "end_char": 35006}
{"chunk_id": "DOC0154__00016", "doc_id": "DOC0154", "chunk_index": 16, "text": "he following figure 9 depicts who to blame for motorcycle\naccidents in Kampala.T\n\nhe majority of the riders (58.4%) thought that it is themselves\nwho were primarily to blame for accidents involving motorcycles.C\n\nommuter taxis, other\nvehicles, and poor roads were also blamed for the significant number of motorcycle\n\nFinally, six types of accidents were listed and the boda boda riders were asked to\nchoose what they thought motorcyclists were most at risk at. The results shown in\nFigure 10 reflect a strong opinion that most motorcyclist are at risk of being hit while\novertaking other road users. This implies that boda boda riders are especially\nvulnerable to collisions when overtaking other roads users . About to 20% of\nrespondents indicated being vulnerable to being hit from behind by other road users and\ncollisions with right-turning vehicles. ,. Approximately 10% of riders regarded collisions\nwith left turners as being a particularly risky manoeuvre. Few boda boda riders regarded\nloss of control and overshooting bends as a major cause of accidents experienced by\nmotorcyclist.\n\nEmpirical findings\nThis part presents the cost components of motorcycle accident in Uganda. The cost\ncomponents are estimated into two groups: tangible costs and intangible costs. The\nstudy computed the cost of treatment (medical expenses), repair costs lost output due\nsevere and fatality, value of statistical life based willingness to pay approach and pain,\ngrief and suffering.\nMedical costs of motorcycle accidents\nAlthough medical costs constitute only a small proportion of the total costs of\nmotorcycle accidents, the medical costs consitute the first and most tangible economic\nburden experienced by the victim and the immediate family members and friends. The\nfigures in table 1.4 presents the total medical cost based on data estimates from the\nsurvey and mulago hospital. The results shows that the medical costs per cyclist who is\n\nseriously injured translate into 7,977135 Uganda Shiilings. If we consider the the data\nfrom Uganda Police department between January-December, 2012 in which 3043\nmotorcyclists were reported to have been seriously injured as a result of motorcycle\naccidents in Uganda, this translates into 24,274,423,022 shilllings, apprpximately 24\nbillion Uganda shillings.\nTable 1.4: Medical cost of boda boda accidents\nComponents\nAmounts/\ndays\nTotal medical\ncost\n(DST*HS)+GP in\nUgshs per cyclist\nDST\n\nDuration of days from work as result of\ninjury/days of hospitalization (obtained\nfrom the survey)\n46.6\n\nHS\n\nHospital cost for injury causality (average\ntreatment cost of injury obtained from\nsurvey)\n156,154\nGP\nGeneral\npractitioner\ncosts\nfor\ninjury\ncausality (obtained from Mulago study and\nrepresent the average cost to maintain a\nboda boda patient\n700,359\nTotal", "word_count": 427, "start_char": 34690, "end_char": 37481}
{"chunk_id": "DOC0154__00017", "doc_id": "DOC0154", "chunk_index": 17, "text": "7,977,135.40\nIf consider the total number persons who were\nseriously injured as a result of motorcycle accidents\nbetween January-December 2012 based on Police\nData\n24,274,423,022\nSource: Survey, Police Traffic Department, and Mulago study\n\nNevertheless, for better information even when we consider slightly lower estimates\nfrom mulago hospital study by Kigera et al (2010) of 56,740 Ug shs and 8.3 days as the\naverage cost of maintaining a patient in wards and hospitalization days respectively,\nmedical cost of motorcycle accidents both to the individual and the country as whole is\nsubstantial as indicated in table 1.5 below.\n\nTable 1.5 Medical cost of boda boda accidents\nComponents\nAmounts/days\nTotal medical\ncost\n(DST*HS)+GP\nin Ugshs per\ncyclist\nDST\nDays of hospitalization\n8.3\n\nHS\nAverage cost of maintaining a patient in\nwards\n56,740\nGP\nGeneral practitioner costs for injury\ncausality (obtained from Mulago study\nand represent the average cost to\nmaintain a boda boda patient\n700,359\nTotal\n\n1,171,301\nIf consider the total number persons who were seriously\ninjured as a result of motorcycle accidents between\nJanuary-December 2012 based on Police Data\n3,534,268,943\nSource: Survey, Police Traffic Department, and Mulago study\n\nLost output/productivity\nAnalysis of the survey data reveals that an estimated 389 boda boda riders were away\nfrom work due to serious injuries from motorcycle accidents, amounting to an average\nof 46.6 lost days of work (Table 1.6). Valuing this missed time at the workers’ actual\ndaily incomes, an estimated 403 million shillings of economic output was lost due to\ntime off from productive activities. Using Police data in 2012 which reported 3,043\nmotorcycle accidents with serious injuries and based on average number days away\nfrom work and average daily income from the survey, it is evident in the Table 3.5 that\nover 3 billion shillings of economic output was lost in 2012.\n\nIn addition, computation of the lost output due to premature death from motorcycle\naccidents was 446,963 per cyclist, translating into 255,216,071 Uganda shillings in\n2012, if we consider the number of persons killed as results of motorcycle accidents in\nJanuary-December 2012 and average of age death at 35. The computation of\neconomic loss based on median age 28 still presents a huge economic loss to the\n\nnation amounting to 185,382,316 Uganda shillings. These findings imply that\nprevention of fatality from motorcycle accidents and disability from severe injuries could\nhave significant economic payoff.\nTable 1.6: Lost output due serious motorcycle accidents and fatality\nLost productivity due to serious motorcycle injury\n\nNumber of days\naway from work\ndue serious injury\nfrom accidents\n(average)\nAverage\ndaily\nincome\nNumber of\npeople\ninvolved\n(Ughs)\nStudy sample\n46.6\n22237\n403,098,994\nPolice data\n46.6\n22237\n3,043\n3,153,291,101\nLost productivity due to fatality motorcycle accidents", "word_count": 446, "start_char": 37481, "end_char": 40392}
{"chunk_id": "DOC0154__00018", "doc_id": "DOC0154", "chunk_index": 18, "text": "able 1.6: Lost output due serious motorcycle accidents and fatality\nLost productivity due to serious motorcycle injury\n\nNumber of days\naway from work\ndue serious injury\nfrom accidents\n(average)\nAverage\ndaily\nincome\nNumber of\npeople\ninvolved\n(Ughs)\nStudy sample\n46.6\n22237\n403,098,994\nPolice data\n46.6\n22237\n3,043\n3,153,291,101\nLost productivity due to fatality motorcycle accidents\n\naverage GDP per\ncapita (W)\n(1+g)i\n(1+r)i\n(Ughs)\nW((1+g)I\n/(1+r)i)\nAverage age\n1,400,000\n(1+0.07)^25\n(1+0.12)^25\n\n446,963\nMedian age\n1,400,000\n(1+0.07)^32\n(1+0.12)^32\n\n324,663\nBased on Police data 2012 where 571 persons died as result of motorcycle\naccidents =N\nAverage age\nLost output=\n)\n(\n(\n)\n∑\n=\n+\n+\nN\ni\ni\nr\ni\ng\nW\n\n255,216,071\nMedian age\n\n185,382,316\nSource: Survey, Police Traffic Department, Mulago Hospital and Ministry of Finance,\nPlanning and Economic Development\n\nRepair costs\nIn the survey we established the cost of repairs for those respondents who experienced\nmotorcycle accidents. Results in table 1.7 shows that on average boda boda riders\nspend three times their daily incomes on motorcycle repairs (79,524 Ugshs). However,\n\nthe average costs for severe injuries were slightly higher (115098 Ugshs) implying that\nthe costs of motorcycle repair rises with severity of the accident. Therefore, a total of 70\nand 44 million shillings on average was incurred as cost of repairs for overall accident\nvictims and those who reported severe physical injuries respectively. Estimating the\nrepairs costs based on 3043 severe motorcycle accidents reported by Police data in\n2012, the country lost approximately 350 million shillings in repair costs.\nTable 1.7: Repair costs due motorcycle accidents\nVariable\nNumber\nMean\nStd Deviation\nRepair\ncosts\n882 accidents\nvictims\n79,524\n129,744.70\n70,140,168\nRepair\ncosts\n389 severe\ninjury victims\n115097.7\n161329.3\n44,773,005\nSource: Survey results\n\nWIllingess to pay (WTP) for fatality reduction\nIn any attempt to value the impact of any policy on society, reserchers measures\npeoples’ strength of preference for safety initiatives using the WTP approach and\ncompute the VOSL. The VOSL should be thought of as convenient way to summarize\nthe value of small reductions in mortality risks. This is what economist refer to as\nmonetary value of reducing mortarity risks, commonly called “value of life”. The\nexpression “value of life” is an unfortunate reduced form of the value of statistical life\n(VOSL). Alternative terms for VOSL are value per ststistical life; value per life saved;\nand value of prevented fatality. The VSL does not measure what an individual is willing\nto pay to avoid death with certainty. It measures the willingness to pay for a very small\nchange in risk. To understand the VOSL concept and our computations, the highlight\nbelow demonstrate the concept and how we arrived at the figures presented in table 3.7\nwith an example:", "word_count": 448, "start_char": 40011, "end_char": 42887}
{"chunk_id": "DOC0154__00019", "doc_id": "DOC0154", "chunk_index": 19, "text": "he VSL does not measure what an individual is willing\nto pay to avoid death with certainty.I\n\nt measures the willingness to pay for a very small\nchange in risk.T\n\no understand the VOSL concept and our computations, the highlight\nbelow demonstrate the concept and how we arrived at the figures presented in table 3.7\nwith an example:\n\nSuppose that in City composed of 100,000 identical individuals (in this case motorcycle\nriders in Kampala), there is an investment project that will make the city's roads safer.\nHowever, it is known based on Police Data that on average 10 motorcyclists die every\nyear on these roads, and the project is expected to reduce from 10 to 5 the number of\nexpected fatalities per year. Ths implies that the annual risk of dying due motorcycle\naccident is 10 in 100,000 and the anticipated project or intervention would reduce this\nnumber from 10 to 5 in 100,000. In statistical sense, this means that the project or any\nsafety intervention would reduce the annual risk of dying from motorcycle accidents by\n0.0005 (5/100,000). In a population of 100,000, any safety intervention is expected, in a\nstatistical sense, to result in 5 fewer death from motorcycle accidents each year.\nSuppose now that each member of the city (in this case a boda rider) is willing to pay\n222550 (average amount we obtained from survey) annually to reduce the risk dying\nfrom motorcycle accidents from 10 to 5 in 100,000 (half the numder of fatalities in\n100,000). Therefore, the value of preventing one fatality in one accident is defined as\nthe aggregate amount that all affected individuals in society are willing to pay for these\nsmall risk reductions. The corresponding VOSL would be Ug Shs 222550/(5/100,000) =\n(222550*100000)/5 = 4,450,000,000 ($1,780,000). This represents the estimated value\nof life.", "word_count": 302, "start_char": 42555, "end_char": 44369}
{"chunk_id": "DOC0154__00020", "doc_id": "DOC0154", "chunk_index": 20, "text": "herefore, the value of preventing one fatality in one accident is defined as\nthe aggregate amount that all affected individuals in society are willing to pay for these\nsmall risk reductions.T\n\nhe corresponding VOSL would be Ug Shs 222550/(5/100,000) =\n(222550*100000)/5 = 4,450,000,000 ($1,780,000).T\n\nhis represents the estimated value\nof life.\n\nIn the study out of the 1600 boda boda riders who participated in the survey, over 96%\nof boda boda riders interviewed were willing to pay for a risk reduction which reduces\nthe expected number of deaths from 10 to 5 out of 100,000. This implies that boda boda\nriders in Kampala are willing to pay price to reduce the risk of fatal motorcycle accident.\nFigure 11 presents the distribution of the willingness to pay values. It is evident in the\nfigure that boda boda riders are willing to pay between 3,000 and 5 millions shillings to\nreduce the number of deaths from motorcycle from 10 to 5 out of 100,000. However, the\nmajority are willing to pay less than 100,000 shillings and between 100,000-500,000\nshillings (49.3%). The avearge amount the riders were willing to pay was 222550,\nimpling that on average boda boda riders are willing to forfeit 222,550 a year in order to\n\nobtain reduction in risk of dying from motorcycle accidents from 10 in 100, 000 to 5 in\n100,000.\n\nTable 1.8 presents the value of statistical life for Ugnada by means of contigent\nvaluation. In th questionnaire results on willingness to pay to reduce fatality from\nmotorcycle accidents indicate that boda boda riders were prepared to pay, on average\n222550 Ug shs for a risk reduction of five chance in 100,000 that they would be killed in\nthe year due to motorcycle accidents. Therefore, the `value of an average life' in this\ninstance would be (222550 x 100,000)/5 =4.45 billion Uganda shillings. This is defined\nas the total amount that boda boda riders selected in Kampala would pay per year to\nsave 5 statistical lives resulting from motorcycle accidents.\n\nTable 1.8: The value of statistical life(VOSL)\n\nAverage of MRS for all\nrespondents give the WTP\nfor a risk reduction which\nreduces expected deaths by\n1(5)\nMarginal rate of\nsubstitution\n(MRSi)\nIncome change due a unit change\nin a risk given by:\n,\n,\n/\nb\nb\ni\ni\n=\n\n\u0001 bi represent the average\namount the boda boda riders\nwere willing to pay\nTotal WTP\nThis value is referred to as the\nvalue of saving statistical life or\nmarginal value of safety\n4,450,000,000 ($1,780,000)", "word_count": 419, "start_char": 44024, "end_char": 46476}
{"chunk_id": "DOC0154__00021", "doc_id": "DOC0154", "chunk_index": 21, "text": "Economic Burden of Motorcycle Accident Costs\nTo estimate the economic burden of motorcycle accidents in Uganda, medical costs of\naccidents, lost output due to severe injury and fatality, repair costs and human costs\n(pain, grief and suffering). The computation of lost output is based on 2012 Police Data\nthat reported the number of persons killed and injured from motorcycle accidents. In\n2012, there were 3043 officially reported severe accidents from motorcycle accidents\nand 571 people who died. These figures exclude the number persons who had minor\ninjuries. In the estimation of medical expenses, the computations are based on results\nobtained from a study in Mulago on the cost of treating a boda boda patient. Pain, grief\nand suffering are calculated as a percentage of lost labour output due injury and fatality.\nThe percentages considered are based Asian Development Bank estimates of 28% and\n50% of the total cost of a fatal and injury accident respectively. Table 1.9 shows the\nestimated economic burden of motorcycle accidents in Uganda is Ug shs 8,\n902,482,162 (approx US$ 3.6 million). Although these figures do not take into account\nthe administrative and funeral costs of motorcycle accidents, the estimates reveal that if\nmotorcycle accidents continue, country’s growth prospects will fall by US$ 3.6 million\n\nannually. Medical expenses and lost output due to severe injury are the biggest\ncomponent of motorcycle costs contributing 40% and 35% respectively.\n\nTable 1.9: Estimates of national motorcycle costs\nItem\n(Ug shs)\n% Contribution\nMedical expenses\n3,534,268,943\n39.7\nLost output due severe injury\n3,153,291,101\n35.4\nLost output due to fatality\n225,216,071\n2.5\nRepair costs\n350,000,000\n3.9\nHuman costs( Pain, grief and suffering)\n1,639,706,050\n18.4\nTotal\n8,902,482,165\n(US$3.6 million)\n100.0\n\nFactors influencing WTP values\nThe relationship between the WTP values (rider’s marginal value of safety) and the\nunderlying influence of socio-economic factors was investigated by means of a\nregression analysis. In this study, the log-linear regression model was applied to\nanalyse the significant factors influencing willingness to pay of respondents. The\nindependent variables considered in the analysis include the age in complete years,\nmotorcycle riding experience, education dummies, marital status, motorcycle ownership\nstatus and dummy if ever experienced an accident. The results of regression analysis\nare presented in the table 1.10 below.\n\nTable 1.10: Regression analysis results\nLnMVS\nCoef.\nRobust Std. Err.\nT\nP-value\nAge\n0.007\n0.006\n1.080\n0.282\nMonthly_income\n0.000\n0.000\n2.270\n0.023*\nRiding experience\n-0.005\n0.010\n-0.460\n0.649\nPrimary\n-0.190\n0.143\n-1.330\n0.182\nSecondary\n-0.159\n0.142\n-1.120\n0.264\nMarried\n-0.150\n0.084\n-1.780\n0.076**\nNumber of_Dependants\n0.001\n0.011\n0.080\n0.936\nEver_Had_Accident\n-0.049\n0.062\n-0.780\n0.436\nOwns_motorcycle\n0.217\n0.071\n3.060\n0.002*\nConstant\n21.289\n0.226\n94.370\n0.000\n“*” statistically significant at 5%; and “**” statistically significant at 10%", "word_count": 445, "start_char": 46476, "end_char": 49488}
{"chunk_id": "DOC0154__00022", "doc_id": "DOC0154", "chunk_index": 22, "text": "The results in the table 1.10 above show that only three variables were statistically\nsignificant. These include income, marital status and motorcycle ownership. From\neconomic point of view, positive significant effect of income concurs with many studies\nthat have found that higher incomes are associated with higher WTP values. As\nexpected riders who own motorcycles significantly and positively influence WTP values.\nSurprisingly however, being married is associated with less WTP values when\ncomparing with unmarried motorcycle riders. In many studies, age has proved to an\nimportant factor explaining willingness to pay for safety. In this study surprisingly, age is\nnot statistically significant although it has the right sign. The other factors that are\ninsignificant are education, number of dependents, riding experience and accident\nexperience. The negative coefficient on education and riding experience suggest that\nthese variables not only being unimportant in rider’s risk evaluation but they are\nassociated with lower MVS.\n\nWTP to reduce the risk of Severe Injury\nIn the survey respondents were asked whether they are willing to pay 20,000 shillings\nfor a helmet which reduces the risk of severe injury from 10 to 3 out of 100,000 people\nor reduction in risk of severe injury by 70%. The results in figure 12 show that over 95%\nof the boda boda riders who participated in the study were willing to pay 20,000 shillings\nto get a helmet which reduce the risk of severe injury by 70%. However, the willingness\nto pay for a helmet reduced more significantly as we varied the cost of helmet from\n20,000 to 140,000 shillings. This implies that although the majority of boda boda riders\nare willing to pay price premiums to acquire helmets that reduce severe injury, their\nwillingness to pay undoubtedly is conditioned by the price of the helmet. For example,\nthe willingness to pay for a helmet dropped to 12% for a price between 80,000 and\n100,000 shillings and subsequently to 5% for prices above 100,000. Therefore, any\nefforts to promote the use of quality helmets which are normally priced above 100,000\nshillings on the domestic market, one should consider price subsidization policy for the\nmajority of the boda boda riders to acquire them.", "word_count": 363, "start_char": 49488, "end_char": 51744}
{"chunk_id": "DOC0154__00023", "doc_id": "DOC0154", "chunk_index": 23, "text": "herefore, any\nefforts to promote the use of quality helmets which are normally priced above 100,000\nshillings on the domestic market, one should consider price subsidization policy for the\nmajority of the boda boda riders to acquire them.\n\nFinally, we explored the willingness to pay 100,000 shillings to obtain a reflector jacket\nand helmet/training to reduce half the number of boda boda accidents and injury in\nKampala. These are some of the interventions KCCA has proposed to implement in the\nefforts to streamline the boda boda industry in Kampala. The results in the figure 13\nbelow shows that 53.46% of the riders interviewed were not willing to pay for these\nactivities. This implies that KCCA will face some challenges in changing the face of\nboda boda industry in Kampala. A well integrated programme that incoorpotates the\nviews of different stakeholder in the boda boda industry is need to have smooth\ntransition from disorganised to organised industry.", "word_count": 156, "start_char": 51506, "end_char": 52471}
{"chunk_id": "DOC0154__00024", "doc_id": "DOC0154", "chunk_index": 24, "text": "his implies that KCCA will face some challenges in changing the face of\nboda boda industry in Kampala.A\n\nwell integrated programme that incoorpotates the\nviews of different stakeholder in the boda boda industry is need to have smooth\ntransition from disorganised to organised industry.\n\nConclusions and recommendations\nThe descriptive analysis from the study show that the incidence and risk of motorcycle\naccident is high and boda boda riders themselves are hugely to blame in most of the\naccidents they get involved in. Therefore, safety initiatives should mostly target the\nbehaviours of motorcycle riders alongside other road users. For instance, public\nawareness campaigns are needed to change the behaviour of motorcycle riders and\nalso in supporting the enforcement of legislative traffic regulations and measures. It is\nperhaps true that most boda boda riders do not understand the health and economic\nimplications associated with their reckless behaviour. The study results provide rich\ninformation that is helpful for fact-based advocacy to change behaviour of boda riders.\nInformation on the cost of accidents to the individual and society as a whole can be\nused by Boda boda associations, Local administrations and authorities and civil society\norganizations to influence behaviour change among boda boda riders. For instance, the\nawareness campaigns from these stakeholders should communicate to the riders the\nhealth and economic consequences of undesirable traffic behaviour and associated\nmotorcycle accidents. The police should intensify the use of the combination of\nenforcement and penalties to prevent the violation of traffic regulations and increase\nroad safety.\nThis study highlights the direct and indirect cost of motorcycle accidents in Uganda\nusing a multi-method approach. The quantitative estimates and descriptions from the\nqualitative interviews have provided both the tangible and intangible costs of motorcycle\naccidents (both for fatality and severe injuries) and estimates are considered to be huge\nfor a poor developing country. This information should serve to provide a momentum for\nsafety improvement of motorcycle industry in Kampala and the rest of the country.\nIn the first part of cost estimation of motorcycle accidents, the study provides estimates\nof intangible costs (such as medical expenses, lost output/productivity due injury and\ndeath and repair costs). The estimates show that motorcycle accidents are associated\nwith huge burdens borne by the accident victims and their families and friends, as well a\nsociety as a whole. The estimation and presentation of these costs highlights the need", "word_count": 395, "start_char": 52186, "end_char": 54828}
{"chunk_id": "DOC0154__00025", "doc_id": "DOC0154", "chunk_index": 25, "text": "he estimates show that motorcycle accidents are associated\nwith huge burdens borne by the accident victims and their families and friends, as well a\nsociety as a whole.T\n\nhe estimation and presentation of these costs highlights the need\n\nfor every member of society to recognize and be aware of the importance of road\nsafety. Clearly, the results show that it costs approximately 7 million shillings to treat a\nboda boda accident victim who is severely injured; and more 3 billion Uganda shillings\nwas lost due to lost days away from productive work as result of severe injuries and\ndeath. The motorcycle repair costs accumulated to 350 million Uganda shillings based\non 2012 police data on motorcycle accidents.\n\nThe study also provides estimates of the value of preventing motorcycle accidents\nbased on the willingness-to-pay method using a contingent evaluation. The estimates\nshow that on average boda boda riders are willing to sacrifice Ug shs 222,550 a year\nfor reduction in mortality risks associated with motorcycle accidents that translate into\n4.45 billion shillings ($1 1,780,000), the value of statistical life (VOSL). This implyies\nthat boda boda riders are willing to trade 4.45 billion shillings per year for a risk\nreduction which reduces the expected number of motorcycle fatalities from 10 to 5 lives.\nThis represents the monetary value of increased safety and shows that boda boda\nriders are concerned about traffic safety and willing to trade a sizeable amount of\nmoney for improved safety. The estimates are quite comparable to those from other\ndeveloping countries. Regression analysis results of the factors influencing marginal\nvalue of safety (MVS) reveal that income, marital status and ownership of motorcycles\nsignificantly influences rider’s evaluation of safety. The results on the effects of\nmotorcycle ownership on MVS should of interest to government and boda boda\nassociations in efforts to streamline boda boda industry. The efforts that enable the\nriders to own the motorcycles seem to affect safety evaluations.\n\nIn the summary, the economic burden motorcycle costs were approximately US$ 3.6\nmillion. Although these figures do not take into account the administrative and funeral\ncosts of motorcycle accidents, the estimates reveal that if motorcycle accidents\ncontinue, the country’s growth prospects will fall by US$ 3.6 million annually. Medical\nexpenses and lost output due to severe injury are the biggest component of motorcycle\n\ncosts contributing 40% and 35% respectively. The fact that the current initiatives and\nlevel of investment are inadequate to halt or reverse the rising motorcycle fatalities and\ninjuries, the political will and funding levels in the sector should be commensurate with\nthe scale of accidents and associated economic costs.", "word_count": 433, "start_char": 54592, "end_char": 57388}
{"chunk_id": "DOC0154__00026", "doc_id": "DOC0154", "chunk_index": 26, "text": "he fact that the current initiatives and\nlevel of investment are inadequate to halt or reverse the rising motorcycle fatalities and\ninjuries, the political will and funding levels in the sector should be commensurate with\nthe scale of accidents and associated economic costs.\n\nThe qualitative part of the study reveals that the effect of pain, grief, and suffering when\nthe Boda-boda rider gets an accident goes beyond the individual life of the rider and\naffects the work, health and the family life of the rider. Therefore in seeking to design\nintervention programs to help the riders involved in motorcycle accidents, it is important\nfor such programs to adopt a holistic approach to be effective. In addition, there is need\nfor intervention programs at both family-and-work level which can help the riders and\ntheir families to quickly recover from the pain, grief and suffering they face. What is\nclearly demonstrated in the study is that the family and the work place are the key areas\nof support for the rider to deal with the demise of the motorcycle accidents yet there was\nno report of any systematic intervention program in our interviews which is utilizing\nthese institutions to help the riders overcome the cost of pain, grief and suffering caused\nby motorcycle accidents. Therefore, the existing boda boda associations and leadership\nstructure at boda boda stage level should be empowered to have organized\nwelfare/health care systems that can assist members when they face accidents.\nIt is also demonstrated in the study that coping by Boda-boda accident victims is\ncomplicated by lack of professional support. The provision of professional support\ntailored to the unique conditions faced by the Boda-boda RTA victims should be a\ncritical focus for effective policy intervention. We suggest the strategy of working with\nthe family of the riders and the Boda-boda leadership stage structures to effectively\nextend such services. The study also offers some key insights into the necessary reform\nin the health system geared towards effectively meeting the needs of motorcycle\naccidents victims in the Boda-boda sector. Specifically, we recommend the need to\npromote health insurance tailored for the Boda-boda riders for them to afford\npersonalized health care in the event of the RTA, and programs that geared at changing", "word_count": 373, "start_char": 57113, "end_char": 59448}
{"chunk_id": "DOC0154__00027", "doc_id": "DOC0154", "chunk_index": 27, "text": "pecifically, we recommend the need to\npromote health insurance tailored for the Boda-boda riders for them to afford\npersonalized health care in the event of the RTA, and programs that geared at changing\n\nthe perception health workers towards boda boda accident victims. This can go a long\nway in addressing the cost of pain, grief and suffering they endure.\nPolicy implications\nThe paper presents the monetary value of increased safety from motorcycle accidents\nin Uganda and more specifically, the study presents both social and economic rationale\nfor safety investments and interventions to improve the road traffic safety for\nmotorcyclists. The key policy implication of the study is that reducing motorcycle\ncausalities and fatalities will reduce social and economic sufferings of victims, unlock\ngrowth and free resources for more productive use. The findings provide the costbenefit analysis of any investment in areas that will promote the prevention, treatment,\ncare and management of motorcycle accidents in Uganda.", "word_count": 155, "start_char": 59246, "end_char": 60270}
